[{"id":3275019,"name":"Vintage Airplane Boarding Ticket Design Printable","permalink":"vintage-airplane-boarding-ticket-design-printable","position":1,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/vintage-airplane-boarding-ticket-design-printable","status":"active","on_sale":false,"created_at":"2011-02-12T07:30:58.000Z","description":"This listing is for a printable file that can be customized as a birthday, shower, or save-the-date invitation. T\r\n\r\nhe non-editable PDF file prints out one 4 x 9 size card on 8.25 x 11 size sheets (thickest card stock that your printer can handle is recommended). Cut along the crop marks and you're done! The invitation fits a standard #10 business envelope.\r\n\r\nAdobe Acrobat Reader is needed to open this PDF file. Download the free software program at http://get.adobe.com/reader.\r\n\r\nPRINTS:\r\nIf you prefer to have the cards printed by a professional print company, please convo me for more details.\r\n\r\nWhen purchasing this listing, submit the following information in the “Note to Flipawoo” message box:\r\n\r\n1. Choose from one of the styles seen in the thumbnail images above:\r\n\r\na. Color - Vintage Blue or Beige (you can choose your own colors as well)\r\nb. Text - Full name, party date, time, location, and RSVP details.\r\n\r\nPHOTOS:\r\nIf you are planning to submit a photo, please upload your high resolution photo (300 DPI) to https://www.yousendit.com/dropbox?dropbox=FLIPAWOO\r\nI can convert photos to black and white for you at no additional charge.\r\n\r\nPlease keep in mind that colors you see on computer monitors may not look exactly the same in prints. If the colors seem off to you in your test prints (proof), please let me know so that I can change them to your satisfaction.\r\n\r\nPROOF:\r\nA file proof will be sent to the e-mail address on your Etsy account for your approval within 24 hours (usually much sooner) after the above requested information is submitted. Be sure to check for any errors before approving. FLIPAWOO will not be responsible for any errors found in the prints after the file proof has been approved.\r\n\r\nFINALIZED FILE:\r\nOnce the file proof has been approved, the finalized file will be e-mailed within the next 24 hours (usually much sooner).\r\n\r\nPARTY DECORATIONS:\r\nI will be adding labels, tags, thank you cards, and banner designs to coordinate with this listing. Visit again!\r\n\r\nCUSTOM ORDERS:\r\nDid you have something else in mind that you do not see in the shop? Please contact me at flipawoo [!at] gmail.com and send me your details.\r\n\r\nTERMS: All files and designs from FLIPAWOO are for personal-use only and should not be distributed and shared. Resale of the files as a digital and printed document in any form for any digital and printed medium are strictly prohibited.\r\n\r\nThis purchase is non-refundable due to the nature of this order. ","options":[{"id":11131007,"name":"Default","price":16.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31778689/-/blueairplane_etsyupload.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31778689/-/blueairplane_etsyupload.jpg","width":725,"height":417}],"artists":[],"categories":[{"id":1886439,"name":"Printable Files","permalink":"printable-files","url":"/category/printable-files"}]},{"id":3274991,"name":"Plaid Designed Shower or Birthday Party Invitation","permalink":"plaid-designed-shower-or-birthday-party-invitation","position":2,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/plaid-designed-shower-or-birthday-party-invitation","status":"active","on_sale":false,"created_at":"2011-02-12T07:22:27.000Z","description":"This listing is for a printable design that can be customized as a birthday or shower invitation. The file is formatted to print 5 x 7 prints (unless you request for 4 x 7) and allows unlimited number of prints. No printed items will be shipped.\r\n\r\nWhen purchasing this listing, submit the following information in the “Note to Flipawoo” message box (Colors and fonts can be changed):\r\n\r\n1. Choose from one of the styles seen in the above thumbnail images.\r\n\r\na. Available graphic elements you can choose from is either the airplane, tricycle, rocking horse or you can use the photo option.\r\n\r\n2. File Type:\r\n\r\na. JPEG File – This file can be used at a local photo lab or through one of the many websites that provide photo printing services (can cost as low as $.09/e!).\r\n\r\nOR\r\n\r\nb. PDF File – This file can be printed with a home printer or at a local print shop on white cardstock paper. There are two cards in this file (unless you request for 1 card). Adobe Acrobat Reader is needed to open this PDF file. Download the free software program at http://get.adobe.com/reader.\r\n\r\n3. Exact invitation wording that you want included such as time, date, name, RSVP details, etc.\r\n\r\nPHOTOS:\r\nIf using the photo option, please upload your high resolution photo (300 DPI) to https://www.yousendit.com/dropbox?dropbox=FLIPAWOO\r\nI can convert photos to black and white for you at no additional charge.\r\n\r\nCHANGES:\r\nYou can choose other colors not seen in the thumbnail images for the invitation design and select another font for no additional charge.\r\n\r\nPlease keep in mind that colors you see on computer monitors may not look exactly the same in prints. If the colors seem off to you in your test prints (proof), please let me know so that I can change them to your satisfaction.\r\n\r\nPROOF:\r\nA file proof will be sent to the e-mail address on your Etsy account for your approval within 24 hours (usually much sooner) after the above requested information is submitted. Be sure to check for any errors before approving. FLIPAWOO will not be responsible for any errors found in the prints after the file proof has been approved.\r\n\r\nFINALIZED FILE:\r\nOnce the file proof has been approved, the finalized file will be e-mailed within the next 24 hours (usually much sooner).\r\n\r\nPARTY DECORATIONS:\r\nPlease convo me if you need coordinating label, tag, thank you card, and banner designs.\r\n\r\nCUSTOM ORDERS:\r\nDo you have your own design in mind that you would like for me to put together? Please contact me at flipawoo [!at] gmail.com and send me your details.\r\n\r\nTERMS: All files and designs from FLIPAWOO are for personal-use only and should not be distributed and shared. Resale of the files as a digital and printed document in any form for any digital and printed medium are strictly prohibited.\r\n\r\nThis purchase is non-refundable due to the nature of this order. ","options":[{"id":11130929,"name":"Default","price":16.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31778393/-/photo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31778393/-/photo.jpg","width":565,"height":448}],"artists":[],"categories":[{"id":1886439,"name":"Printable Files","permalink":"printable-files","url":"/category/printable-files"}]},{"id":3138429,"name":"Paris Passport Invitation Prints","permalink":"paris-passport-invitation-prints-passport-to-paris-collection","position":3,"price":48.75,"default_price":48.75,"tax":0.0,"url":"/product/paris-passport-invitation-prints-passport-to-paris-collection","status":"active","on_sale":false,"created_at":"2011-01-15T02:30:12.000Z","description":"This adorable passport invitation will definitely set the tone for your Paris-themed birthday party, shower, Sweet 16 party or even for a wedding. The invitation allows you to use up to 5 photos.\r\n\r\nPassport invitations require a 50 minimum print order.\r\n\r\nRequests for other quantities are welcome.\r\n\r\n**At the moment, we are only shipping within the U.S.\r\n\r\nInvitations will arrive professionally printed on 100lb. matte cover stock and each are sized 4.25\" x 6\" (when folded). They will also be scored and folded, in addition to having rounded corners. White pink or black envelopes are included.\r\n\r\nAlong with your order information, submit the following information by clicking on the \"Contact\" button located on the lower right-hand side of the page:\r\n\r\n1. First and Last Name\r\n2. Age (if this is for a shower, skip this)\r\n3. Birthday or Wedding Date\r\n4. Date and Time of Party\r\n5. Event Location (Address)\r\n6. RSVP Information\r\n7. Wording for the circle text design seen on the cover\r\n8. Name for the \"Authorized Signature\" line that is in\r\nthe inside cover of the invitation\r\n9. Misc. Information - City the person was born or location\r\nof wedding.\r\n\r\nPHOTOS:\r\nUp to five photos can be used in this invitation. Please upload your high resolution photos (300 DPI) via this link https://www.yousendit.com/dropbox?dropbox=FLIPAWOO.\r\n\r\nFLIPAWOO is not responsible for any poor quality photos.\r\n\r\nCOLORS:\r\nColors can be changed (up to two) without any additional charge. Please keep in mind that colors you see on computer monitors may not look exactly the same in prints. If the colors seem off to you in your test prints (proof), please let me know so that I can change them to your satisfaction.\r\n\r\nPROOF:\r\nA low resolution file proof will be sent to the e-mail address on your Etsy account within 24-48 hours after the above requested information is submitted. Be sure to check for any errors before approving. FLIPAWOO will not be responsible for any errors after the file proof has been approved.\r\n\r\nPRINTED INVITATIONS:\r\nPlease allow up to 10-12 business days after approving the digital proof for the order to arrive. If ordering with rounded corners, wait up to 5 extra business days for arrival.\r\n\r\nTERMS: All files from FLIPAWOO are for personal-use only and should not be distributed and shared. Resale of the files as a digital and printed document in any form for any digital and printed medium are strictly prohibited.\r\n\r\nDue to the nature of this order, no refunds will be made.\r\n\r\nPhoto is courtesy of Min Mi Photography (www.minmiphotography.com). ","options":[{"id":10728077,"name":"Default","price":48.75,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30433133/-/Madeline_Park_bpa_143.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30433133/-/Madeline_Park_bpa_143.JPG","width":432,"height":648}],"artists":[],"categories":[{"id":1886441,"name":"Printed Orders","permalink":"printed-orders","url":"/category/printed-orders"}]}]