[{"id":2754391,"name":"Double Flannel Travel Wipes- Set of 6 ","permalink":"bloom-print-double-flannel-travel-wipes-set-of-6","position":1,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/bloom-print-double-flannel-travel-wipes-set-of-6","status":"active","on_sale":true,"created_at":"2010-09-16T22:39:00.000Z","description":"Double-sided cloth wipes, perfect for wiping little noses or bums! \r\nCloth wipes are a sustainable alternative to disposables, and a frugal alternative to boxes of tissues.\r\n\r\nThis set of six wipes (approximately 6\"x4\") features a fun print flannel fabric on one side, and light blue or chocolate brown flannel on the other (your choice). \r\n\r\nSmaller than our regular baby wipes, they stack to fit neatly in a typical travel wipes container (not included) without folding (so you can carry more!).\r\n\r\nThese small size wipes are perfect for cleaning little ones' sticky hands & faces in restaurants, on picnics, or road trips, as well as quick diaper changes on-the-go. \r\n\r\nPack them wet or dry (either moisten with water or your favorite homemade wipes solution). \r\n\r\nPamper those little noses during a bout of the the flu and make diaper changes a bit more pleasant for your wee one.\r\n\r\nCloth wipes also make potty training a bit tidier, since toddlers aren't quite proficient in toilet paper usage!\r\n\r\n(Note- New mamas have reported using these wipes for themselves as well during that sensitive \"postpartum mama\" stage instead of that rough toilet paper!)\r\n\r\n<div class=\"more\">\r\nClick the photos to zoom in for a larger view.\r\n\r\nPerfect for tucking into a baby shower gift or stocking your own nursery supply stash! Each order comes tied with a coordinating ribbon & Frugal Granola's signature unbleached, raw edge tag, and wrapped in a handmade recycled paper envelope- presented to you as a joyful gift.\r\n\r\n100% Cotton \r\n\r\nWash with Cloth Diapers (Hot Wash, Two Cold Rinses) for sanitation,\r\nOR\r\nWash Warm with Regular Laundry\r\nTumble Dry Low\r\nNon-Chlorine Bleach\r\nWarm Iron, if needed\r\n</div>","options":[{"id":10182679,"name":"Trucks/Blue","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/28522135/-/300-2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/28522135/-/300-2.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":1606358,"name":"Cloth Wipes","permalink":"cloth-wipes","url":"/category/cloth-wipes"}]}]