[{"id":3402002,"name":"Red Electric Rainbow - Reptile Brain (c30 Split)","permalink":"red-electric-rainbow-reptile-brain-c30-split","position":1,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/red-electric-rainbow-reptile-brain-c30-split","status":"active","on_sale":false,"created_at":"2011-03-10T01:04:28.000Z","description":"NEW!  Nearly 30 minutes of that fingersmith action!  Chicago's 21st century facemelter Neon Blossom main 'the man', Dan Smith, meets Dublins 18th century fancy boy Dandrew Dogarty.  \r\n\r\nProduped, c30s - sound samples right here: \r\n\r\n<object height=\"225\" width=\"100%\"> <param name=\"movie\" value=\"http://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F634383\"></param> <param name=\"allowscriptaccess\" value=\"always\"></param> <embed allowscriptaccess=\"always\" height=\"225\" src=\"http://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F634383\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed> </object>  <span><a href=\"http://soundcloud.com/munitionsfamily/sets/red-electric-rainbow-reptile\">Red Electric Rainbow / Reptile Brain C30 Split</a> by <a href=\"http://soundcloud.com/munitionsfamily\">munitionsfamily</a></span> \r\n\r\nMore: <a href=\"http://redelectricrainbow.tumblr.com\">http://redelectricrainbow.tumblr.com/</a> // <a href=\"http://redelectricrainbow.bandcamp.com/\r\n\">http://redelectricrainbow.bandcamp.com/</a>\r\n\r\nI'll spare you d'jibberish - here's some reviews:\r\n\r\n*********\r\n<a href=\"http://alteredzones.com/posts/983/red-electric-rainbow-ferris-wheel/\">Red Electric Rainbow on Altered Zones</a>::\r\n<i>Daniel D. Smith, aka Red Electric Rainbow, has an extensive catalog that spans dozens of cassettes, CD-Rs, and digital releases. Thankfully, Aguirre Records is on the verge of releasing a proper vinyl debut. Recorded using mostly a Nord Lead 2; the album bubbles with textures that lend themselves easily to fans of Oneohtrix, Mist, Outer Space, and the current crop of cosmic travelers traversing the analog plain. Tipped with a bit of loneliness, Dark Days slips into a bittersweet euphoria that's both blissful and yet paralyzingly solitary. Daniel, a fixture in the Chicago/Midwest experimental set, is organized last year's Neon Marshmallow Festival along with Matt Kimmel of Acid Marshmallow  video blog. As with the Sean McCann LP, this one will be available soon from Aguirre themselves and stateside shortly from Tomentosa, Aquarius and Mimaroglu. --Andy French, Raven Sings The Blues</i>\r\n**********\r\n**********\r\n<a href=\"http://www.brainwashed.com/index.php?option=com_content&view=article&id=8201:reptile-brain-qdinosaurq&catid=50:sound-bytes&Itemid=140\">Repetile Brain - Dinosaur review on Brainwashed.com</a>:\r\n<i>The two pieces on the cassette both investigate the variety of tones that can be wrought from analogue synthesizers. The bubbling and racing sounds Fogarty extracts from his synths on side A gives a feeling of traveling at speed through a kaleidoscope. Some of Fogarty’s style is instantly recognizable from his work in Boys of Summer but he expands his palette significantly throughout this and the subsequent piece. Ray guns, radiation, tractor beams, force fields and teleporters: these are the kind of images that come to mind listening to Dinosaur.\r\n\r\nSide B is an altogether warmer piece as dozens of balmy loops and layered melodies compete with each other; the mix boiling like a primordial soup during a storm. Suddenly the chaos gives way to a wet, pulsing noise which steadily increases in its intensity. The piece eventually returns to a similar kind of kosmische-influenced sound-scape like on side A.\r\n\r\nWhile Dinosaur does not shift Boys of Summer from the top of my favorite Fogarty-related projects, it does pack enough punch to be a serious contender. Both sides of the tape show enough variation and tonal development to place Reptile Brain beyond the categorization of simple noise. There is more in common here with music from the BBC’s Radiophonic Workshop than with the contemporary noise scene; granted this is not that unusual but Fogarty does it with a lot of class.</i>","options":[{"id":11484278,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":1.0,"country":{"id":21,"name":"Ireland","code":"IE"}},{"amount_alone":2.0,"amount_with_others":1.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/33015478/-/red-electric-rainbow-reptile-brain-bigcartel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/33015478/-/red-electric-rainbow-reptile-brain-bigcartel.jpg","width":1000,"height":471}],"artists":[{"id":55218,"name":"Red Electric Rainbow / Reptile Brain","permalink":"red-electric-rainbow-reptile-brain","url":"/artist/red-electric-rainbow-reptile-brain"}],"categories":[{"id":1444661,"name":"Cassette","permalink":"cassette","url":"/category/cassette"}]},{"id":3402102,"name":"Paul Vogel - Godwit Songs","permalink":"paul-vogel-godwit-songs","position":2,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/paul-vogel-godwit-songs","status":"active","on_sale":false,"created_at":"2011-03-10T01:30:16.000Z","description":"You may know him from euroboys, Chipshopmusic or 2009's Phil Durrant, Lee Patterson, Paul Vogel - Buoy  but if you don't, let me introduce Dublin's monster of microsound, the lord of lowercase, PAUL VOGEL!   (crowd  goes wild)\r\n\r\nMaking his munfam debut with some Messaienic songs about the GODWIT!  Poo-tee-weet?  Poo-tee-weet?\r\n\r\nPaul Vogel is an improviser based in Ireland. His original instruments were piano and clarinet, but in recent years, he has incorporated electronics into his set up. He was a member of the Bristol Musicians Co-op in the late seventies and is currently co-curator (with David Lacey) of i-and-e, an organisation which promotes improvised and\r\ncontemporary music in Dublin. He has composed music for radio and contemporary dance groups and has worked with Phil Durrant, Angharad Davies, Lee Patterson, Keith Rowe, David Lacey, Toshi Nakamura and Mark Wastell, amongst others. He has released recordings on Cathnor, Confront and Homefront. \r\n\r\nC30 - Produped tapes as always - here goes the samples:\r\n\r\n<object height=\"225\" width=\"100%\"> <param name=\"movie\" value=\"http://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F634421\"></param> <param name=\"allowscriptaccess\" value=\"always\"></param> <embed allowscriptaccess=\"always\" height=\"225\" src=\"http://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F634421\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed> </object>  <span><a href=\"http://soundcloud.com/munitionsfamily/sets/paul-vogel-godwit-songs\">Paul Vogel - Godwit Songs</a> by <a href=\"http://soundcloud.com/munitionsfamily\">munitionsfamily</a></span> \r\n\r\nPoo-tee-weet?  Poo-tee-weet?","options":[{"id":11484610,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":1.0,"country":{"id":21,"name":"Ireland","code":"IE"}},{"amount_alone":2.0,"amount_with_others":1.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/33016570/-/paul-vogel-bigcartel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/33016570/-/paul-vogel-bigcartel.jpg","width":1000,"height":471}],"artists":[{"id":55220,"name":"Paul Vogel","permalink":"paul-vogel","url":"/artist/paul-vogel"}],"categories":[{"id":1444661,"name":"Cassette","permalink":"cassette","url":"/category/cassette"}]},{"id":507471,"name":"Toymonger - The Night Vision","permalink":"the-night-vision","position":3,"price":11.0,"default_price":11.0,"tax":0.0,"url":"/product/the-night-vision","status":"active","on_sale":false,"created_at":"2009-11-05T23:03:56.000Z","description":"Debut Toymonger LP from 2007 - The Night Vision - Ireland's first and only noise lp!?  Limited Copies Available\r\n\r\nReviews: \r\n\r\n<a href=\"http://brainwashed.com/index.php?option=com_content&view=article&id=8192:toymonger-qthe-night-visionq&catid=50:sound-bytes&Itemid=96\">Brainwashed.com\r\n</a>\r\n\r\nPurported to be Ireland’s first noise 12” (send any refutations on a postcard to anyone but me), this EP is at least going to be one of the best even if it is not the only one. The duo of Gavin Prior and Andrew Fogarty conjure up four stellar pieces, each one covering a different aspect of noise as an expansive genre without resorting to just pushing up all the dials and leaving the microphones recording. \r\n\r\nAlthough I am not sure which side is A or B (even the matrix codes give no clue), the four pieces that make up The Night Vision all sound superb. (What I think is) “Salt Mists” begins quietly, some discordant sounds like something broken being bowed eventually building up into a harsher mass of sound. Spooky, whistle-like loops emerge in the background before the piece dips into a lower register which gives the impression of a hellish ferry into hell sounding its infernal foghorn.\r\n\r\nAssuming the other side is the B side, “Taking Hold” is based around a beautiful organ while rusty detritus scraps and squeaks all over it. Then on “Burned Clean,” Fogarty (one half of Toymonger) brings some of his textural experience from one of his other musical ventures, Boys of Summer, to help create a dense cloud of fuggy noise. This fantastic piece provides an exhilarating finish to a top notch EP.\r\n\r\n---\r\n\r\n<a href-\"http://www.digitalisindustries.com/foxyd/reviews.php?which=3012\">Digitalis</a> \r\n9/10\r\n\r\nSlow-birthed from the inspired minds of Gavin Pryor and Andrew Fogarty, Toymonger create some seriously sick concussion-laden hypnotic hallucinatory jammers. This may be their debut LP, but these dudes didn?t just come out of nowhere. Readers of Foxy Digitalis are probably familiar with Gavin Pryor who in addition to running Deserted Village has been putting out a steady stream of solid releases for the last few years with a revolving cast of musicians under the moniker, United Bible Studies. They are probably less familiar though with guitarist Andrew Fogarty who himself is no slacker with a long list of limited-edition releases performing with Tremors, Bullets, and a host of other Dublin-based bands. Together the pair have been playing as Toymonger since 2004 touring with notables such as Chris Corsano, Talibam!, and Birds of Delay. With their impressive backgrounds, one could only hope that their first proper recording would deliver and it does. \"The Nightvision\" proffers up four anxiety-ridden, dread-fueled creepers of scraping metal, white noise, and dripping feedback; the amplified creaking of attics, basements, vacant warehouses, and every other haunt that harbors ghosts and phantom monsters. The ultimate party-killer sure to send everyone home pissed off and in a bad mood; the definition of no fun for those who love having no fun. Not to imply that this is the first record of its kind, to the contrary, but in an environment saturated with doom/noise-droners, this record rises to the top. The music is heavy, even harsh at moments, but restrained and constantly shifting with ecstatic momentum. This is music that like a Richard Serra sculpture is subtle in shape and contour yet imposing in its oppressive tonnage and immensity of scale. Excellent packaging complete with hand stenciled foldout cover. A Deserted Village/Munitions Family split release aka Munitions Village. Extremely limited edition. Get one if you can. 9/10 -- Todd Brooks (19 December, 2007)\r\n\r\n---------------------------\r\n\r\nThe nightvision is this two pieces debut album with having only one cassette release before and it’s a highly effective and eerier shot of drone craft, dingy sometimes aggravated electronics and guitar scapes bringing to mind the same sort of dread filled and doomed soaked grim looping and building atmospherics of the like of Skull Defekts and Wolf Eyes at their more claustrophobic and grim soundtrack like.\r\n\r\nEach of the four tracks falls around about ten minute mark with each starting off slow, sinister and darkly compelling like a stranger beckoning you down strange dark corridor, but as they progress the pair of Gavin Prior (United Bible studies) and Andrew Fogarty (Bullets, Tremors) build and tighten the atmospheres to such an tense and at times quite freaky level. Giving a great feeling of apprehension, fear and atmosphere you could al most cut with a cut throat razor. They seem to using a mix of guitar, electronics, organ/ synth tones, voice tones and effects peddles to create their sound which while is very sinister and doomy is also quite darkly harmonic with swirling and drifting melodies ghostly slipping through all of the tracks. The tracks for the most part remain clean of percussive and rhythmic matter with only the last track showing only slight learning’s. Though you can hear connections with in their sound to the likes of Wolf Eyes, Skull Defekts and grim sound tracking, this very much has it’s own twisted and sinister personality which at times links into the feeling of abounded fairgrounds, murderess clowns and broken sinister look lines of old toys that of course ties in nicely to the projects name.\r\n\r\nA fine, sinister and blackened debut album that really does worm its way under your skin with its oily harmonic dread and building tension/ grim atmospherics. If you enjoy any creepy and doom based electronics or blacked drone smothering you’ve got to check out ToyMonger.\r\n\r\n---------------------------\r\n\r\n<a href=\"http://www.normanrecords.com/records/94149\">Norman Records </a>\r\n\r\nI think Toymonger is an alias of Birds Of Delay who had a side on one of the Not Not Fun Splits. 'The Nightvision' is some scary shit. It'll give you the fear good and proper. It reminds me of that lovely messed up horror soundtrack stuff that Wolf Eyes do. Comes in hand screened sleeves. Wicked.\r\n\r\n-----------------------------------------------------------\r\n\r\n<a href=\"http://still-single.tumblr.com/post/91457220/toymonger-the-nightvision-lp-deserted\">Doug Mosurock</a>\r\n\r\nHeavy drone/improv outfit from Ireland, flexing their collective muscles on LP for the first time. I only tolerate the darker stuff that plays like true horror and not some dreamy, smoothed-out reinterpretation of same; you can sound cold, sure, but you have to find ways to distinguish yourself from, say, the ambient sounds of processing plants or the amplified sound of cars passing along a freeway. There is little evidence of such field recordery here, nothing more than a couple of guys who create a rotting, ominous sound borne of the cheap crap they shove into it; a recycling effort of sorts that gives out exactly what’s put into a jumble of guitars set to hum, scrap metal, contact mics, and hotrodded electronics. Made to hurt, and it does; very effective bad mood music for a dark time. Wrapped in a silkscreened poster sleeve. Not for the squeamish; dark ambient from a very desperate-sounding state of mind. ","options":[{"id":1985041,"name":"Default","price":11.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":3.0,"country":{"id":21,"name":"Ireland","code":"IE"}},{"amount_alone":5.0,"amount_with_others":2.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/4368061/-/toymong-cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/4368061/-/toymong-cover.jpg","width":300,"height":300}],"artists":[{"id":10741,"name":"Toymonger","permalink":"toymonger","url":"/artist/toymonger"}],"categories":[{"id":376131,"name":"LPs","permalink":"lps","url":"/category/lps"}]}]