[{"id":7545377,"name":"Strawberry Crochet Pattern PDF from WonkyGiraffe","permalink":"strawberry-crochet-pattern-pdf-from-wonkygiraffe","position":1,"price":2.0,"default_price":2.0,"tax":0.0,"url":"/product/strawberry-crochet-pattern-pdf-from-wonkygiraffe","status":"active","on_sale":true,"created_at":"2012-10-14T19:00:41.000Z","description":"Here is a pattern for a little “top (stalk) down” crochet strawberry. \r\n\r\nInspired by the knitted ones around – but I like to crochet. I also like to “integrate solutions” and hate sewing up, so the green bit is crocheted as one with the red bit, a kind of crochet intarsia.\r\nQuick, and not difficult to do, once you get the hang of it, as there are step by step photo instructions as well as full written ones.\r\n\r\nDouble knitting (DK, worsted) wool and size 9 (uk) , 5 (US) gives a strawberry about the size of a ping pong ball; but there is no reason why you could not use different threads (embroidery to chunky) for different sizes.\r\n\r\nThere is a separate pattern for the strawberry earbud cosy nest pod.\r\n\r\nIf you would like a strawberry or cosy made, and cannot see a listing for one, just ask and I will make one to order.\r\n\r\nThis listing is for one emailed PDF of a pattern for a crochet “strawberry! Five full colour pages plus a quick print version with no pictures to have to hand.\r\n\r\nSorry any real strawberries in the photos have been eaten! You will have to get your own! Any other props not included.\r\n","options":[{"id":23840607,"name":"Default","price":2.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/74057377/-/WonkyGiraffe_B_Strawberry_Crochet_Pattern_DSCN5132.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/74057377/-/WonkyGiraffe_B_Strawberry_Crochet_Pattern_DSCN5132.JPG","width":1000,"height":750}],"artists":[],"categories":[{"id":355661,"name":"Patterns","permalink":"patterns","url":"/category/patterns"}]},{"id":472171,"name":"Earbud EarPhones Cozy Cosy Storage Pouch - PDF Pattern from WonkyGiraffe","permalink":"earbud-cosy-pouch-pattern-pdf","position":2,"price":2.0,"default_price":2.0,"tax":0.0,"url":"/product/earbud-cosy-pouch-pattern-pdf","status":"active","on_sale":true,"created_at":"2009-11-02T21:22:06.000Z","description":"A Dinky crochet pouch, to keep those pesky earbuds tamed when they’re stored or in your bag.\r\n\r\nSave yourself all the experimenting that we have done - this just works...  OR I can make one for you, just CONTACT ME...\r\n\r\nThis ‘beret shaped’ pouch makes it easy and quick to stow your earbuds preventing them from roaming about your bag or pocket ..... whatever; with a 'coil and flip' action. No more re-winding to fit inside something.\r\n\r\nThere are more pictures on flickr.com/wonkygiraffe ; showing how it flips inside out around your cable coil and earbuds to stow them away in seconds.\r\n\r\nCan also be used for hands-free headsets and other small cables.\r\n\r\nThis is a 3page colour PDF with instructions and photographs for making the basic shape and variations eg CupCake, Fried Egg, Doughnut and Car Tyre etc.\r\n\r\n","options":[{"id":1866761,"name":"Default","price":2.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3987601/-/WonkyGiraffe_earbud_beret_DSCN3377a.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3987601/-/WonkyGiraffe_earbud_beret_DSCN3377a.jpg","width":1000,"height":898}],"artists":[],"categories":[{"id":355661,"name":"Patterns","permalink":"patterns","url":"/category/patterns"}]},{"id":332156,"name":"PegBag, ClothesPin Bag : WonkyGiraffe","permalink":"pegbag-clothespin-bag-flower","position":3,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/pegbag-clothespin-bag-flower","status":"active","on_sale":false,"created_at":"2009-06-28T16:24:30.000Z","description":"This Flower PegBag is actually one of our original WonkyGiraffe Pegbags, a new twist on the traditional peg bag (clothespin bag).\r\nIt doesn’t matter whichever way they twist or turn on the line; you can easily reach an opening, because there are two of them!\r\n\r\nTheir two faces/openings make them twice as user friendly, and may just make you grin while you peg your clothes onto the line, or when they are hanging out about the house between washdays.\r\n\r\nIf you don’t want to use them for pegs, why not hang one up anyway, there must be something else you could store in them. ;) [Kids love them and they could help with tidy up time too.]\r\n\r\nBeing green needn't be boring, with these eco friendly funky guys to help out on washday. Laundry smells naturally fresh dried outside. As a bonus your ironing is reduced, with the wind blowing creases away for free, saving you lots of effort and electricity.\r\n\r\nOverall, dimensions of the bag are approx 11ish inches wide by 15 inches high; the opening is 5 inches wide to the corners and 2 inches max height at centre. All the seams are double stitched. (the bottom one treble!) \r\n\r\n\r\nIt has a removable (for washing) recycled wooden clothes hanger, with rotatable metal hook.\r\n","options":[{"id":1364756,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25416640/-/WonkyGiraffe_aLBCN1702ab.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25416640/-/WonkyGiraffe_aLBCN1702ab.jpg","width":963,"height":1000}],"artists":[],"categories":[{"id":274062,"name":"PegBags","permalink":"pegbags","url":"/category/pegbags"}]},{"id":482201,"name":"Mini Matchbox Myriorama, Art Activity - Make Me","permalink":"make-me-mini-matchbox-myriorama-art-activity","position":4,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/make-me-mini-matchbox-myriorama-art-activity","status":"active","on_sale":false,"created_at":"2009-11-03T16:52:14.000Z","description":"“Make Me” Mini Matchbox Myriorama.\r\n\r\nI love making these!\r\nThis little matchbox contains a set of tiny cards marked with lines ready for your own artwork.\r\nOnce completed- or even as they are- they put together into a bigger picture; landscape or abstract, your call.\r\nThe big bonus with these little guys is that one picture is not all they make, no sir! Arrange and rearrange them as much as you like, there are thousands of different ways they go together to make picture after picture (40,320 to be exact!).\r\n\r\nCarry them around to play with; great for entertaining the kids; or give them away if you can bear to - but not before enjoying them for a while!\r\n\r\nThis Matchbox is covered in Vintage 1960s “Tana Lawn” fine cotton fabric. More on the way soon!\r\n\r\nI’ve decorated the cards in the picture as an idea. Yours will just have two wavy lines on each card (unless you want similar little drawings - no problem) and 8 more blank cards to play with.\r\n\r\nI can make them with artworked vintage matchbox look paper covers too – convo me if you’d prefer one with this type of finish or a kit of bits to make one from scratch.\r\n","options":[{"id":1898681,"name":"Default","price":4.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/4083141/-/wonkygiraffe_DSCN2345a.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/4083141/-/wonkygiraffe_DSCN2345a.jpg","width":1000,"height":750}],"artists":[],"categories":[{"id":274063,"name":"PaperStuff","permalink":"paperstuff","url":"/category/paperstuff"}]}]