[{"id":5040849,"name":"OMR002 | Gabriel Bruce - Sleep Paralysis (Book with incorporated 7\")","permalink":"omr002-gabriel-bruce-sleep-paralysis-book-with-incorporated-7","position":1,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/omr002-gabriel-bruce-sleep-paralysis-book-with-incorporated-7","status":"active","on_sale":false,"created_at":"2011-12-09T03:14:40.000Z","description":"Gabriel bruce's first solo single, 'Sleep paralysis' is the sound of the ex-loverman vocalist finding a new voice, with that band's primal energies being recalibrated into an impassioned sweeping synthesizer symphony. The track recalls leonard cohen's late 80s synth production on 'i'm your man', yet is altogether murkier and more foreboding, interested in depth of darkness rather than surface glimmer. B-side 'no love lost' draws the cohen connection deeper, primarily through bruce's deep vocal range, though tonally bruce reaches something smoother and more versatile than cohen did, and the track has shades of nick cave's possessive obsessions and fascinations in subject matter. \r\n\r\nBruce's debut 7” is incorporated into a 50 page illustrated book which looks into the phenomenon of sleep paralysis, featuring cuttings and ephemera of people’s recollections of the sensation. Printed by Ditto Press the book features three different paper stocks, colour photos, a variety of different printing effects, a card cover and facsimile of rare writings on Sleep Paralysis. The cover is hugged by a bellyband, available in scarlet, royal blue, sapphire or mandarin. \r\n\r\nSleep Paralysis is a limited edition release with 300 copies purchasable solely in physical format. Written by Gabriel and edited and designed by Off Modern the release of Sleep Paralysis signals the end of months of close collaboration between artist and label.\r\n","options":[{"id":16370927,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.5,"amount_with_others":2.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":4.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/49490515/-/GB_OM_2exp.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/49490515/-/GB_OM_2exp.jpg","width":640,"height":448}],"artists":[],"categories":[{"id":209085,"name":"Records","permalink":"records","url":"/category/records"},{"id":209088,"name":"Publications","permalink":"publications","url":"/category/publications"}]}]