[{"id":15057507,"name":"NEW! Backcountry Chillout Vol. 1 mixtape","permalink":"backcountry-chillout-vol-1-mixtape","position":1,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/backcountry-chillout-vol-1-mixtape","status":"active","on_sale":false,"created_at":"2013-11-23T23:32:36.000Z","description":"Inter-Dimensional Music\r\n\r\npresents\r\n\r\nBackcountry Chillout Volume 1 \r\n\r\nThere’s a good reason that Inter-Dimensional Music is the number one New Age radio broadcast in the Big Bend region of Far West Texas: Since we first started transmitting on Marfa Public Radio back in the spring of 2010, each song we’ve played has been selected with the goal of offering all the souls passing through the Chihuahuan Desert a soundtrack worthy of our luminescent high country vistas. \r\n\r\nSo whether you’re waiting in line at the Sierra Blanca Border Patrol checkpoint; watching the lights of Boquillas from the South Rim of the Chisos; channeling the spirit of curandera Jewel Babb deep in the Quitman Mountains; decoding starlight vibrations at the McDonald Observatory; vibing on the sky island rhythms of the Davis Mountains Preserve; documenting rock art sites off Casa Piedra Road; or if you’re just another lonely backpacker waiting for your man down by the Rio Grande, we’re here to score your time under the radiant heavens of the Trans-Pecos with a soundtrack of expansive ambience and transcendent psychedelic drone. \r\n\r\nThus, in collaboration with our old friends at Arthur Magazine, ID Music presents this first edition of Backcountry Chillout, a collection of contemporary New Age music hand-picked for arid wilderness viewing stations …\r\n\r\nHere is the music featured on “Backcountry Chillout Vol. 1″:\r\n\r\n1. Matthewdavid – “Sneaky Marfa” (previously unreleased)\r\n\r\n2. Sean McCann – “Aerial Sapphire Show” (from The Capital)\r\n\r\n3. $3.33 – ” ) ) )-)-)-)-)-)-)-)-)-)-)-) ) ) )-)-)-)-)” (from – - – – — — — – – – -)\r\n\r\n4. Ashan – “Forest Hair” (from Ancient Forever)\r\n\r\n5. Sun Araw Band IX – “Canopy” (from Two From The Desert: Yucca Valley 2012)\r\n\r\n6. Stag Hare – “Song for Justine” (previously unreleased)\r\n\r\n7. Thoughts On Air – “A Psoft Psun Reflective” (from\r\nBlack Eagle Child/Thoughts On Air)\r\n\r\n8. Matthewdavid – “Sneaky Marfa Slow” (previously unreleased) \r\n\r\nLiner notes and cover artwork by DANIEL CHAMBLERIN.\r\nEngineered by BOBBY TAMKIN at The Sound Ranch.\r\n\r\nA link to download the “Backcountry Chillout Vol. 1” zip file (142mb — includes digital music file [320kpbs mp3], artwork, liner notes) will be emailed to you upon payment.\r\n\r\nAll proceeds help Arthur Magazine to embrace new possibilities.","options":[{"id":48889413,"name":"Default","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128114190/-/BackcountryWeb.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128114190/-/BackcountryWeb.jpg","width":560,"height":796}],"artists":[],"categories":[{"id":1651551,"name":"Music Download","permalink":"music-download","url":"/category/music-download"}]},{"id":12658305,"name":"Arthur No. 35 (August 2013)","permalink":"arthur-no-35-august-2013","position":2,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-no-35-august-2013","status":"active","on_sale":false,"created_at":"2013-07-29T23:47:40.000Z","description":"Broadsheet newspaper in 3 sections, 24 15\" x 22.75\" pages (16 color, 8 b/w)\r\n\r\nPublished: Aug. 19, 2013\r\n\r\nCover by Kevin Hooyman\r\n\r\nContents:\r\n\r\nON THE TRAIL OF THE LONESOME SNOCK\r\nWily folkplayer MICHAEL HURLEY (aka Elwood Snock) has charmed hip audiences for over fifty years now with his timeless surrealist tunes and sweetly weird comics, all the while maintaining a certain ornery, outsider mystique. Longtime Snockhead/Arthur Senior Writer BYRON COLEY investigates this Wild American treasure in an enormous 11,000-word, 8-PAGE feature replete with rare photos, artwork, comics... and a giant color portrait by Liz Devine. Snock attack!\r\n\r\nCHEW THE LEAVES, GET IN THE TANK\r\nInside Baltimore’s T HILL, new kinds of experiments with salvia divinorum are going on. Journalist/photographer Rjyan Kidwell visits Twig Harper, Carly Ptak...and the Wild Shepherdess.\r\n\r\nBURIED ALIVE BY THE SUFIS\r\nSwap-O-Rama Rama founder WENDY TREMAYNE wanted to understand what motivated her life-long anti-consumerism. She found the answer underground.  Illustration by Kira Mardikes\r\n\r\nGASH, CRASH, ASH\r\nNobody rides for free. DAVE REEVES on the price motorcyclists pay for being better than you. Illustration by Lale Westvind.\r\n\r\nTHE BIOPHONIC MAN\r\nGuitarist, composer and analog synthesizer pioneer BERNIE KRAUSE left the recording studio to find that really wild sound. What he discovered was far more profound. Interview by Jay Babcock. Illustrations by Kevin Hooyman.\r\n\r\nGIANT STEPS FOR MANKIND\r\nStewart Voegtlin on JOHN COLTRANE’s startling 1960s ascension from space bebop to universe symphonies. Dual astral/material plane illustration by Beaver.\r\n\r\nFLOWERS, LEAVES, ANARCHISM\r\nMatthew Erickson on the J.L. Hudson Ethnobotanical Catalog of Seeds\r\n\r\nPlus...\r\n\r\n* Arthur’s new regular column “Come On In My Garden” debuts. This issue, Camilla Padgitt-Coles visits Enumclaw’s Norm Fetter at his family’s Pennsylvania mushroom farm. They’re medicinal!\r\n\r\n* The Center for Tactical Magic on demons and drones...\r\n\r\n* New full-page full-color comics: “Forgiveness” by Julia Gfrörer and Part 2 of Will Sweeney’s  “Inspector Homunculus” serial. \r\n\r\n* And, of course, the “Bull Tongue” exhaustive survey of underground cultural output by your intrepid hosts Byron Coley and Thurston Moore... \r\n\r\n","options":[{"id":40275525,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.5,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.5,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.0,"amount_with_others":6.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122018664/-/a35cvrstore.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122018664/-/a35cvrstore.png","width":500,"height":759}],"artists":[],"categories":[{"id":4009146,"name":"New Issue","permalink":"new-issue","url":"/category/new-issue"}]},{"id":10674130,"name":"Thoughtless Grin mixtape","permalink":"thoughtless-grin-mixtape","position":3,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/thoughtless-grin-mixtape","status":"active","on_sale":false,"created_at":"2013-04-20T23:22:45.000Z","description":"An Arthur mixtape compiled by Jay Babcock\r\n\r\nThis new mixtape is now available direct from Arthur to your internet connection as a $3.00 digital download. It’s a collection of songs from recent releases that we’ve been digging lately, sequenced with care for the sensitive mind/ear.\r\n\r\nAs an added bonus, each download comes with extended liner notes by long-lost Arthur “critics”/village fools C & D, and a large-size image file of the cover artwork by Lale Westvind.\r\n\r\nHere are the songs featured on “Thoughtless Grin”:\r\n\r\n1. DANIEL BACHMAN – “Sun Over Old Rag”\r\n2. FEEDING PEOPLE – “Other Side”\r\n3. ENDLESS BOOGIE – “Taking Out the Trash”\r\n4. BOMBINO – “Aman”\r\n5. RADAR BROTHERS – “Disappearer”\r\n6. GAP DREAM – “58th St. Fingers”\r\n7. SONNY & THE SUNSETS – “Pretend You Love Me”\r\n8. DEVENDRA BANHART – “Won’t You Come Home”\r\n9. MV & EE – “Turbine”\r\n10. HERBCRAFT – “Full Circle (Eternally)”\r\n11. ARBOURETUM – “Coming Out of the Fog”\r\n\r\nEngineered by BOBBY TAMKIN at The Sound Ranch.\r\nCover artwork by LALE WESTVIND.\r\nLiner notes by C & D.\r\n\r\nA link containing the “Thoughtless Grin” zip file (digital music file [192kpbs mp3], artwork, credits sheet, liner notes by C & D) will be emailed to you upon payment.\r\n\r\nAll proceeds help Arthur Magazine to resist economic pressures.","options":[{"id":33463186,"name":"Default","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/104939308/-/ThoughtlessGrinCvrWeb.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/104939308/-/ThoughtlessGrinCvrWeb.jpg","width":560,"height":560}],"artists":[],"categories":[{"id":1651551,"name":"Music Download","permalink":"music-download","url":"/category/music-download"}]},{"id":9582033,"name":"SOLD OUT - Arthur No. 34 (April 2013)","permalink":"arthur-no-34-april-2013","position":4,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/arthur-no-34-april-2013","status":"sold-out","on_sale":false,"created_at":"2013-02-21T18:21:19.000Z","description":"Twenty-four 15\" x 22.75\" pages (16 color, 8 b/w)\r\nPublished: March 5, 2013\r\n\r\nNow with 50% more pages, Arthur continues its comeback in the bold new broadsheet newspaper format that's turning heads and drawing critical acclaim. \r\n\r\nIn this issue...\r\n\r\nAfter 20-plus years navigating strange, inspiring trips across myriad underground psychedelic terrains with a host of fellow free folk, righteous musician/head MATT VALENTINE (MV & EE, Tower Recordings, etc) finally spills all possible beans in an unprecedented, career-summarizing, ridiculously footnoted epic interview by BYRON COLEY.  Plus: Deep archival photo finds from the MV vaults, a sidebar wander through some important MV listening experiences with your guide Dan Ireton, and a gorgeous cover painting by ARIK ROPER of MV & EE at peace in the cosmic wild. Delicious! \r\n\r\nAlso in this issue: \r\n\r\nOrange County, California psych rockers FEEDING PEOPLE left the church, entered the void, lost band members and returned to our reality to sing their tale in glorious reverb. Chris Ziegler investigates, with photography by Ward Robinson...\r\n\r\nEveryone needs someone to love, and AROMATIC APHRODISIACS are here to help that lovin’ along (sans wack pharma side effects). From truffles to borrachero, authors CHRISTIAN RATSCH and CLAUDIA MULLER-EBELING get in on the action. Illustrations by Kira Mardikes...\r\n\r\nGabe Soria chats with author AUSTIN GROSSMAN (Soon I Will Be Invincible) about the basic weirdness of playing (and making) VIDEO GAMES, with art by Ron Rege, Jr....\r\n\r\nAll-new full-color comics by Lale Westvind, Will Sweeney, Vanessa Davis and Jonny Negron...\r\n\r\nIs there a way to examine the nature of existence at its very foundation? Esoteric mapmaker DAVID CHAIM SMITH say yes—but there’s a price.  Interview by Jay Babcock...\r\n\r\nStewart Voegtlin on what (or: who) made MELVINS’ 1992 beercrusher \"Lysol\" the most unlikely religious record ever built, with art by Stewart's Chips N Beer mag compatriot Beaver...\r\n\r\n\"Weedeater\" columnist Nance Klehm on BETTER HOME BREWING...\r\n\r\nThe Center for Tactical Magic on ANARCHO-OCCULTISM...\r\n\r\nByron Coley and Thurston Moore's essential underground review column, Bull Tongue, now expanded to two giant pages. Covered in this issue: New York Art Quartet, Don Cauble, Douglas Blazek, Rick Myers, Desmadrados, Century Plants, Richard Aldrich, Robbie Basho, Steffen Basho-Junghans, Bed Wettin' Bad Boys, Michael Zacchilli, Pat Murano, Tom Carter, Les Conversions, Hobo Sunn, Decimus, Saifyya, Jeff Keen, Inspector 22, Yves/Son/Ace, Pink Priest, Smegma, Nouvelle Impressions D'Afrique, K. Johnson Blair, Major Stars, Endless Boogie, David Novick, Joe Carducci, Scam, Erick Lyle, Phantom Horse, Failing Lights, Tomuntonttu, The Lost Domain, George Laughead jr., Xochi, Sublime Frequencies, Barbara Rubin, Red Rippers, Linda King, Cuntz, My Cat Is An Alien, Bird Build Nests Underground, Pestrepeller, Painting Petals on Planet Ghost, Peter Stampfel, Joshua Burkett, Michael Chapman, L'Oie de Cravan Press, Genvieve Desrosiers, The Residents, Dawn McCarthy, Bonnie Prince Billy, Ensemble Pearl, Azita, Woo, Galactic Zoo Dossier, Mad Music Inc., White Limo, Excusamwa, Little Black Egg, Dump, Jarrett Kobek, Felix Kubin, The Army, Bruce Russell, and Gate...\r\n\r\nAnd more stuff too hot to divulge online!\r\n\r\nPlease keep in mind... Arthur is no longer distributed for free anywhere. Those days are (sadly) long gone. Now you gotta buy Arthur or you won't see it. Our price: Five bucks—not so bad!\r\n","options":[{"id":29974087,"name":"Default","price":10.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.5,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.5,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.0,"amount_with_others":6.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/94181475/-/A34coversml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/94181475/-/A34coversml.jpg","width":420,"height":637},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/95108943/-/spoonscovera34sml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/95108943/-/spoonscovera34sml.jpg","width":560,"height":418},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/95108983/-/spoonsa34comixsml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/95108983/-/spoonsa34comixsml.jpg","width":480,"height":359},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/95109039/-/arthur34bwsmall.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/95109039/-/arthur34bwsmall.jpg","width":560,"height":418},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/95108975/-/a34bwspreadsml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/95108975/-/a34bwspreadsml.jpg","width":560,"height":418}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":8002797,"name":"SOLD OUT - Arthur Issue No. 33 (Jan 2013)","permalink":"arthur-no-33-january-2013","position":5,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-no-33-january-2013","status":"sold-out","on_sale":false,"created_at":"2012-11-14T23:52:12.000Z","description":"Broadsheet newspaper\r\nSixteen 15\" x 22.75\" pages (8 color, 8 b/w)\r\nPublished: Dec. 22, 2012\r\n\r\n\"The new oversized print-only issue of Arthur Magazine is even more gorgeous and satisfying than expected. Like a Sunday supplement for heads.\" — <em>Jesse Jarnow, author of Big Day Coming: Yo La Tengo and the Rise of Indie Rock</em>\r\n\r\n\"Beautiful\" — <em>Chris Richards, <a href=\"http://www.washingtonpost.com/lifestyle/style/arthur-magazine-a-counterculture-favorite-returns-to-print/2012/12/25/881179dc-4df2-11e2-950a-7863a013264b_story.html\" target=\"_blank\">The Washington Post</a></em>\r\n\r\n\"A coffee-table newspaper, printed on 16 immense pages of newsprint with minimal ads, and almost every inch covered with words or pictures... The cover, a gigantic piece by surreal comics artist Rick Veitch, is gorgeous, and the crispness and clarity of the print is perhaps the best I've seen in a newspaper. Everything in the new [issue] is worth absorbing... Opening the mammoth pages of the new Arthur feels much like unfolding a road map, one that points to strange, unfamiliar worlds.\" — <em>Ned Lannamann, <a href=\"http://www.portlandmercury.com/portland/a-coffee-table-newspaper/Content?oid=7960754\" target=\"_blank\">The Portland Mercury</a></em>\r\n\r\nAfter a four-year sabbatical, beloved revolutionary sweetheart Arthur returns to print, renewed, refreshed, reinvigorated and in a bold new format: pages as tall and wide as a daily newspaper on compostable newsprint, with ads only on the back cover(s). Amazing!\r\n\r\nIn partnership with Portland, Oregon's Floating World Comics, Arthur's gang of idiots, know-it-alls and village explainers are back, edited by ol' fool Jay Babcock and art directed by Yasmin Khan. \r\n\r\nThis issue’s contents include…\r\n\r\nDream a Deeper Dream: A how-to conversation with cartoonist ROARIN’ RICK VEITCH by Jay Babcock. Plus “Cartographer of the American Dreamtime,” an appreciation of Rick Veitch and his work by Mr. Alan Moore. Mr. Veitch’s “Self-Portrait in Six Dimensions” graces our cover.\r\n\r\nJACK ROSE: the definitive, career-spanning interview with this late great America guitarist, conducted by Brian Rademaekers just months before his death three years ago. Plus: Jack Rose discography compiled by Byron Coley, and an illustration of a classic Jack Rose pose by Plastic Crimewave.\r\n\r\nAn illuminating/endarkening conversation with sparkling Luciferian artist FRANK HAINES by Eliza Swann\r\n\r\nStewart Voegtlin on WAYLON JENNINGS’ dark dream, with an illustration by Beaver\r\n\r\nColumnist DAVE REEVES on Burroughs, bath salts and border guards, with an illustration by Arik Roper\r\n\r\nColumnist NANCE KLEHM on new modes of exchange—and homemade smokes, with an illustration by Kira Mardikes\r\n\r\nCartoonist GABBY SCHULZ explores our interstate nightmare\r\n\r\nThe Center for Tactical Magic on “The Magic(k) of Money” — and how YOU can win $1000 for planning a BANK ROBBERY!\r\n\r\n“Bull Tongue” columnists BYRON COLEY & THURSTON MOORE survey happenings in underground culture, paying special attention to new and archival releases from Claude Pelieu; Spectre Folk; United Waters; Devin, Gary & Ross; Jess Franco; Mick Farren; Chris D.; Donna Lethal; Crystal Siphon; Mad River; Horace; Erewhon Calling by Bruce Russell; Toy Love; The Clean; David Kilgour; The Heavy Eights; Chris Corsano; Joe McPhee; Rangda; Ben Chasny; Sir Richard Bishop; David Oliphant; Brothers Unconnected; 200 Years; Six Organs of Admittance; Gary Panter; Marcia Bassett & Samara Lubelski; Cheater Slicks; Ron House; Above Ground; Vacuum; Max Block; Dead C; Axemen; Hamish Kilgour; Circle Pit; Kitchen’s Floor; Bits of Shit; and Boomgates. Plus a special report on The Ex 33 festival at Cafe Oto in East London, featuring The Ex, John Butcher, Zea + Charles, Jackadaw With Crowbar, Mats Gustafsson, Ken Vandermark, Trash Kit, Steve Beresford, Wolter Weirbos, Valentina Campora, Gabriella Maiorino, Andy Moor, Yannis Kyriakides, Anne-James Chaton, Ad Baars, Jorge Vega, Ian Saboya, Enrique Vega, Tony Buck and Roy Paci.\r\nand the proverbial much much more\r\n\r\nPlease keep in mind... Arthur is no longer distributed for free anywhere. Those days are (sadly) long gone. Now you gotta buy Arthur or you won't see it. Our price: Five bucks pretty cheap!\r\n","options":[{"id":25261563,"name":"Default","price":5.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/83313777/-/ArthurCvr33Pre.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/83313777/-/ArthurCvr33Pre.jpg","width":640,"height":971}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":298758,"name":"\"So Much Fire to Roast Human Flesh\" anti-military recruiting benefit cd curated by Josephine Foster","permalink":"josephine-foster-so-much-fire-to-roast-human-flesh","position":6,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/josephine-foster-so-much-fire-to-roast-human-flesh","status":"active","on_sale":false,"created_at":"2009-05-14T08:33:38.000Z","description":"<big>\r\n<p><b>Josephine Foster</b><br /> <b>\"So Much Fire to Roast Human Flesh\"</b><br /> <i>a benefit album curated by Josephine Foster, released August 2006</i></p>\r\n<p>Cover artwork by <b>Fred Tomaselli</b></p>\r\n\r\n<p>The title is a line from a poem by the great Apollinaire, who died from wounds he sustained while serving in World War I.</p>\r\n\r\n<p><i>\"All profits from sales of this compilation will be distributed to specific counter-military recruitment and pacifist organizations and programs. We hope to assist them in their efforts promoting peace and non-militarism in the United States.</i></p> <i> </i> <p><i>\"All of the musicians represented here are US citizens. Our voices join with many others across this land that freely question and openly oppose war.\"</i>  --Josephine Foster</p>\r\n\r\n<p>Track listing:</p>\r\n\r\n<p> <b>THE CHERRY BLOSSOMS</b> - \"Dragonfly\" (live)<br /> <b>FEATHERS</b> - \"Dust\"<br /> <b>MICHAEL HURLEY</b> - \"A Little Bit of Love for You\"<br /> <b>MEG BAIRD</b> - \"Western Red Lily (Nunavut Diamond Dream)\"<br /> <b>ANDREW BAR</b> -  \"Don't Trust That Man\"<br /> <b>GOATGIRL</b> - \"President Combed His Hair\"<br /> <b>DEVENDRA BANHART</b> - \"I Know Some Souls\" (demo)<br /> <b>KATH BLOOM</b> - \"Baby Let It Come Down On Me\"<br /> <b>CHARLIE NOTHING</b> - \"Fuck You and Your Stupid Wars\"<br /> <b>DIANE CLUCK</b> - \"A Phoenix and Doves\"<br /> <b>JOHN ALLINGHAM &amp; ANN TILEY</b> - \"Big War\"<br /> <b>JOSEPHINE FOSTER</b> - \"Would You Pave the Road?\"<br /> <b>ANGELS OF LIGHT</b> - \"Destroyer\"<br /> <b>RACHEL MASON</b> - \"The War Clerk's Lament\"<br /> <b>PAJO</b> - \"War Is Dead\"<br /> <b>MVEE</b> - \"Powderfinger\"<br /> <b>KATHLEEN BAIRD</b> - \"Prayer for Silence\"<br /> <b>LAY ALL OVER IT</b> - \"A Place\" </p>\r\n\r\n</big>","options":[{"id":1243407,"name":"Default","price":12.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2272861/-/bast0009.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2272861/-/bast0009.jpg","width":252,"height":338}],"artists":[],"categories":[{"id":249569,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":298733,"name":"“Transmissions From Sinai,” curated by Al Cisneros (2009)","permalink":"new-arthur-cd-“transmissions-from-sinai-”-curated-by-al-cisneros-om-sleep","position":7,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/new-arthur-cd-“transmissions-from-sinai-”-curated-by-al-cisneros-om-sleep","status":"active","on_sale":true,"created_at":"2009-05-14T07:54:20.000Z","description":"<big>\r\n<b>TRANSMISSIONS FROM SINAI</b>\r\n(Arthur 0005)\r\n<p>\r\nCurated, sequenced and produced by <b>Al Cisneros</b><br>\r\nCover artwork by <b>Arik Roper</b><br>\r\nCompact disc edition of 1000<br>\r\n</big>\r\n<p>\r\n<big>\r\nTrack listing:<br>\r\n1. <b>Lichens</b> - &#8220;Kopernik Trip Note&#8221; (previously unreleased)<br />\r\n2. <b>Linval Thompson</b> - &#8220;Wicked Babylon&#8221;<br />\r\n3. <b>Grouper</b> - &#8220;Everyone in Turn&#8221;<br />\r\n4. <b>Current 93</b> - &#8220;Mockingbird&#8221;<br />\r\n5. <b>Scott Kelly</b> - &#8220;The Ladder In My Blood&#8221;<br />\r\n6. <b>Quix*o*tic</b> - &#8220;The Breeze&#8221;<br />\r\n7. <b>Hush Arbors</b> - &#8220;The Valley&#8221;<br />\r\n8. <b>Mia Doi Todd</b> - &#8220;Night of a Thousand Kisses&#8221;<br />\r\n9. <b>Six Organs of Admittance</b> - &#8220;Bar-Nasha&#8221; (previously unreleased)<br />\r\n10. <b>Holy Sons</b> - &#8220;Drifter&#8217;s Sympathy&#8221;<br />\r\n11. <b>Pantaleimon</b> - &#8220;At Dawn&#8221;<br />\r\n12. <b>Grails</b> - &#8220;Acid Rain&#8221;<br />\r\n13. <b>Sir Richard Bishop</b> - &#8220;Almeria&#8221; (previously unreleased)<br />\r\n14. <b>J. Mascis</b> - &#8220;War&#8221; (previously unreleased)<br />\r\n15. <b>Wino</b> - &#8220;Silver Lining&#8221;<br />\r\n16. <b>Alpha &#038; Omega</b> - &#8220;David and Goliath&#8221;\r\n</big>","options":[{"id":1243342,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2272685/-/sinai.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2272685/-/sinai.jpg","width":600,"height":582}],"artists":[],"categories":[{"id":249569,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":298744,"name":"SOLD OUT - “Golden Apples of the Sun” cd curated by Devendra Banhart (2004)","permalink":"back-in-print-“golden-apples-of-the-sun-”-curated-and-designed-by-devendra-banhart","position":8,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/back-in-print-“golden-apples-of-the-sun-”-curated-and-designed-by-devendra-banhart","status":"sold-out","on_sale":false,"created_at":"2009-05-14T08:08:07.000Z","description":"We are sold out of this CD. The distributor Secretly Canadian may still have copies in stock. <a href=\"http://www.scdistribution.com/release.html?catalog=SAINTARTH004&class=title\">Visit them here</a>.\r\n\r\n\r\n\r\n\r\n<big>\r\n\"THE GOLDEN APPLES OF THE SUN\"</b><br /> <i>curated and designed by DEVENDRA BANHART</i><br /> (Arthur 0004) </p> <p> The acclaimed 2004 compilation of current underground folk music, as selected by Devendra Banhart. </p> <p>This is more than a compilation--it's expertly sequenced and paced, like one long, slow flow of a particularly rich vibe. Liner notes are by the artists themselves, paying tribute to each other, all handlettered by Devendra, who also provides artwork on cover, back cover, sleeve, tray and the disk itself. </p> <p> \"Essential.\" -- Mojo, September 2004 </p> <p> \"Sparkling.\" -- The Wire, July 2004 </p> <p> \"8.6 (out of 10): [Its] sprawling landscape presents a persuasive case for the depth of a scene that seemingly sprung up (like mushrooms) overnight.\" -- Pitchfork, July 8, 2004 </p> <p> Track listing: </p> <p> 1. <b>Vetiver (with Hope Sandoval)</b> - \"Angel's Share\" (from the \"Vetiver\" LP)<br /> 2. <b>Joanna Newsom</b> - \"Bridges and Balloons\" (from \"The Milk-Eyed Mender\" LP)<br /> 3. <b>Six Organs of Admittance</b> - \"Hazy SF\" (previously unreleased)<br />\r\n4. <b>Viking Moses</b> - \"Crosses\" (from \"Crosses\")<br /> 5. <b>Josephine Foster</b> - \"Little Life\" (prev. unreleased home recording)<br /> 6. <b>Espers</b> - \"Byss &amp; Abyss\" (from \"Espers\" LP)<br /> 7. <b>Vashti Bunyan &amp; Devendra Banhart</b> - \"Rejoicing in the Hands\" (from the \"Rejoicing in the Hands of the Golden Empress\" LP)<br />\r\n8. <b>Jana Hunter</b> - \"Farm, CA\" (prev. unreleased)<br /> 9. <b>Currituck Co.</b> - \"The Tropics of Cancer\" (from \"Ghost Man on First\")<br /> 10. <b>White Magic</b> - \"Don't Need\" (from the Drag City EP)<br /> 11. <b>Iron and Wine</b> - \"Fever Dream\" (from \"Our Endless Numbered Days\" LP)<br />\r\n12. <b>Diane Cluck</b> - \" Heat From Every Corner\" (from \"Macy's Day Bird\")<br /> 13. <b>Matt Valentine</b> - \"Mountains of Yaffa\" (prev. unreleased)<br /> 14. <b>Entrance</b> - \"You Must Turn\" (prev. unreleased home recording)<br /> 15. <b>Jack Rose</b> - \"White Mule\" (from \"Red Horse, White Mule\")<br />\r\n16. <b>Little Wings</b> - \"Look at What the Light Did Now\" (from \"Light Green Leaves\")<br /> 17. <b>Scout Niblett</b> - \"Wet Road\" (from \"Sweet Heart Fever\")<br /> 18. <b>Troll</b> - \"Mexicana\" (from \"Pathless Lord\")<br /> 19. <b>CocoRosie</b> - \"Good Friday\" (from \"La Maison de Mon Reve\")<br />\r\n20. <b>Antony</b> - \"The Lake\" (from \"Live at Saint Olaye's With Current 93\") </p> <p> \r\n</big>","options":[{"id":1243403,"name":"Default","price":8.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2272797/-/goldenreissue.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2272797/-/goldenreissue.jpg","width":375,"height":375}],"artists":[],"categories":[{"id":249569,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":297581,"name":"Arthur Issue #1 (Oct. 2002)","permalink":"arthur-issue-1","position":9,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-1","status":"active","on_sale":false,"created_at":"2009-05-12T21:57:53.000Z","description":"<big>\r\nArthur No. 1 (Oct. 2002)\r\n\r\nColor/black and white, 56 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\nAn exclusive chapter-length excerpt from <em>The Ride of My Life</em>, BMX madman <strong>MAT HOFFMAN</strong>'s new autobiography written with Mark Lewman. Photos  by Spike Jonze, Steve Giberson and Mike Castillo.\r\n\r\nThe crotchtastic electro-dynamo <strong>PEACHES</strong>, interviewed by indie-rock  godstar <strong>IAN SVENONIUS</strong>. Portrait photos by Pat Graham and Shawn Mortensen.\r\n\r\nAn interview with shamanic psychonaut/journalist <strong>DANIEL PINCHBECK</strong>,  author of the just-released <em>Breaking Open the Head.</em> Artwork by Alan  Moore.\r\n\r\nA rendezvous with <strong>ARTHUR C. CLARKE</strong> in his Sri Lankan technoasis, by Paul Moody.<strong>Illustration by Geoff McFetridge. </strong> \r\n\r\nA frightful fairtytale in prose by <strong>DAME DARCY</strong>. Illustrated by the Dame herself. Excerpted from her new book.\r\n\r\nWriter <strong>EDDIE DEAN</strong> remembers driving an ICE CREAM TRUCK route in mid-'80s summers through the Blue Ridge Mountains. With stunning photos by Dave Brooks.\r\n\r\nAn essay by the legendary <strong>JOE CARDUCCI</strong> (author, <i>Rock and the Pop Narcotic</i>) against the sorry state of contemporary culture. <strong>With a painting by Camille Rose Garcia.</strong> \r\n\r\nOne-panel comics by <strong>DAVID BERMAN</strong> (Silver Jews, poet), including the  now-legendary series \"Scenes From the First Yes Tour.\"\r\n\r\nA profile of <strong>LIFT TO EXPERIENCE</strong>, the most important art-rock band since Sigur Ros. By Jay Babcock with photos by Jason Amos.\r\n\r\nAn appreciation of <strong>Eagle Pennell</strong>, the late Texan filmmaking maverick  whose work inspired the Sundance Festival. By Paul Cullum. \r\n\r\n<strong>ASK NEIL HAMBURGER</strong>: America's funnyman offers his considered counsel.\r\n\r\nUnderground culture, as surveyed at lengthy by the dynamic duo of <strong>Byron  Coley</strong> & <strong>Thurston Moore</strong>.\r\n</big>","options":[{"id":1239226,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261781/-/a1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261781/-/a1.jpg","width":150,"height":200}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297576,"name":"Arthur Issue #2 (Dec 2002)","permalink":"arthur-issue-2","position":10,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-2","status":"sold-out","on_sale":true,"created_at":"2009-05-12T21:53:49.000Z","description":"Arthur No. 2 (December 2002)\r\nColor/black and white, 48 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n\r\n<big>\r\n\r\nThe West Coast premiere of the Velvet Underground and the Exploding Plastic Inevitable, in 1966? Lenny Bruce and Anita O'Day waiting to score? James Baldwin, Marlon Brando, the Black Panther Party and other good-souled political activists doing what needed to be done? <strong>CHARLES BRITTIN</strong> was there, and these are his never-before-published photographs, as curated for Arthur's readers by KRISTINE MCKENNA.\r\n\r\nHe plays guitar and he writes/sings songs like you've never heard. He's also 21 and has got a certain elfish charm. Ladies and germs, <strong>DEVENDRA BANHART</strong>, as witnessed by scribe GABE SORIA and shutterbug SHAWN MORTENSEN.\r\n\r\nDepressed? Hair falling out at age 23? Having sex with your cousin? \"I know all about that stuff!\" says Arthur's new advice columnist, 78-year-old bluesperson <strong>T-MODEL FORD</strong>.\r\n\r\nLanguage as incantation, the art of the cut-up, larval culture, neural re-wiring  and what does it feel like to live in a post-authorship world: all in a Sunday  afternoon's teatime with visionary artist-provocateur-human <strong>GENESIS P-ORRIDGE</strong> and hotshit media theorist <strong>DOUGLAS RUSHKOFF</strong>. Photos by SHAWN MORTENSEN.\r\n\r\nIn an exclusive excerpt from his new autobiography, legendary Brazilian musician <strong>CAETANO VELOSO</strong> takes us to the political, cultural and hallucinogenic  frontlines of authoritarian Brazil, 1968. It's all here: tanks, ayahuasca,  street protests, witchcraft cults, and of course, Veloso's fellow  Tropicalistas, the musicians Gilberto Gil, Gal Costa and Os Mutantes.\r\n\r\nSelf-described  desk-bound journalist <strong>SUE CARPENTER</strong> finds out firsthand and feet-first how women are transforming the <strong>21st-century circus</strong>. With photographs by LAUREN KLAIN. \r\n\r\n<strong>\r\nPlus:</strong> Comics by Kevin Huizenga, Jordan Crane, Anders Nilsen and  James Kochalka, and a drawing by Sammy Harkham.\r\n\r\nBritwit-novelist <strong>STEVE  AYLETT</strong> revisits the legend of pulp fictionist/\"rogue maniac\" <strong>Jeff Lint</strong>, author of <em>One Less Bastard</em> and  creator of The Caterer<strong>\r\n\r\nByron Coley &amp; Thurston Moore</strong> sort the pepper from the bugpoop in underground recordings, performance, poetry and text; \r\n\r\n<strong>Peter \"Piper\" Relic</strong> remembers <strong>JAM MASTER JAY</strong>.\r\n\r\n</big>","options":[{"id":1239210,"name":"Default","price":5.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261725/-/a2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261725/-/a2.jpg","width":150,"height":222}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297571,"name":"Arthur Issue #3","permalink":"arthur-issue-3","position":11,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-3","status":"sold-out","on_sale":false,"created_at":"2009-05-12T21:50:39.000Z","description":"<big>\r\n<strong>JOE STRUMMER, 1952-2002</strong> Arthur holds a wake in print for a man who mattered. In addition to stunning photographs by<strong>Ann Summa</strong> and excerpts of  back-in-the-day Clash coverage from Slash magazine, we present reflections on Joe by <strong>Kristine McKenna</strong>; a lengthy, poignant interview with Joe from 2001 by McKenna; a consideration by <strong>Carter Van Pelt</strong> of the Clash's embrace of reggae, featuring insights from Clash collaborator <strong>Mikey Dread</strong>;   and a brief on Joe's legacy—a forest in the Isle of Skye.  \r\n\r\nThe intrepid <strong>Gabe Soria</strong> connects with every single member of <strong>THE  POLYPHONIC SPREE</strong>, the cheeriest 24-person pop symphony on the planet,  in addition to chatting at length with Spree leader Tim DeLaughter  about the ãcä word, the SpreeÎs next move, and the sadness  that remains. Portrait by <strong>Paul Pope.</strong> \r\n\r\nAt the height of both his popularity and his artistic powers, <strong>JOHN COLTRANE</strong> went for something deeper. An exclusive, chapter-length  excerpt from <em>A  Love Supreme: The Story of John Coltraneâs Signature  Album</em> by <strong>Ashley  Kahn</strong>.  \r\n\r\n<strong>ASK JOHN LURIE </strong>-- he may be in self-described ãhermit  modeä but this longtime Lounge Lizard is eager to lend a helping hand  to his fellow man. And woman too.\r\n\r\nIn the work of artist <strong>SHIRLEY TSE</strong>, plastic aspires to more than Pop. <strong>Mimi Zeiger </strong>reports.\r\n\r\n<strong>COMICS</strong> by Sammy Harkham, Jordan Crane, Johnny Ryan, Sam Henderson,  Marc Bell and Ron Rege Jr. \r\n\r\n<b>Byron Coley &amp; Thurston Moore</b> review underground music,  film and texts.\r\n</big>","options":[{"id":1239206,"name":"Default","price":5.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261697/-/a3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261697/-/a3.jpg","width":150,"height":224}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297566,"name":"SOLD OUT Arthur Issue #4","permalink":"arthur-issue-4","position":12,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/arthur-issue-4","status":"sold-out","on_sale":false,"created_at":"2009-05-12T21:46:48.000Z","description":"<big>\r\n\r\n<strong>AN EXTRAORDINARY CONVERSATION </strong> <strong>WITH ALAN MOORE</strong> Between <em>Lord of the Rings, Star Wars, Harry Potter, Everquest </em>and <em>Buffy,</em> the pop arts are full up with mystical and magical ideas. But is there a deeper connection between the arts and the occult/mysticism? Celebrated comics author <strong>ALAN MOORE,</strong> whose <em>League of Extraordinary Gentleman</em> comic makes it to the big-screen this summer as a $100-million film starring Sean Connery (!!!), gives Arthur a historical-theoretical-autobiographical earful on the subject of magic and art. Extra-long feature convo with Jay Babcock, with a portrait by <strong>John Coulthart </strong>and photos by <strong>Jose Villarrubia</strong>. Check out that finger armor! <strong>\r\n\r\nON THE ROAD WITH THE BLACK KEYS and SLEATER-KINNEY</strong> Gentleman-journalist-poet<strong>Peter   Relic</strong> rolls out for a week on tour with Akron, Ohio heavy blues superduo <strong>THE BLACK KEYS </strong>as they open a string of West Coast dates for  thee mighty <strong>SLEATER-KINNEY</strong>. Hereâs what happened, best as Pete  can remember. Photographs by <strong>Melanie Pullen</strong> and Pete; jokes by the  Black Keys; chuckles by you the reader.\r\n\r\n<strong>HOW CORPORATE MARKETERS TARGET KIDS</strong> In  this exclusive, chapter-length excerpt from her new book <em>Branded: The Buying and Selling of Teenagers</em>, author <strong>ALISSA QUART</strong> examines how corporations and marketers scheme to take advantage of six-year-olds. \r\n\r\n<strong>  JOHN COULTHART </strong>updates the US dollar bill to reflect the current climate.  Yeow! This one stings. Note the legal disclaimer, please,  if your name is  \"Clear Channel\" or \"Halliburton.\" Use the First Amendment  or lose it.\r\n\r\n79-year-old bluesfella<strong> T-MODEL FORD</strong> has got all the answers. This issue he lets ARTHUR know where Bin Laden is probably hiding,  what to do about a bad temper, how old you should be when you get married  and why some women have mustaches. That's true, now!\r\n\r\nKarin Bolender remembers the late <strong>Othar Turner and Bernice Pratcher</strong>,  the risen stars of the Mississippi fife-and-drum tradition. With photographs  by Christian Patterson and Yancey Allison.\r\n\r\nComics by <strong>Martin Cendreda, Renee French, Luster Kaboom, Steven Weissman,  Johnny Ryan, Jordan Crane </strong>and<strong> Sammy Harkham</strong>.\r\n\r\nAnd, in their regular \"Bull Tongue\" column, <strong>Byron Coley &amp; Thurston  Moore</strong> once again sift through the voids of all known undergrounds to bring you the good stuff in recordings, text and card decks (!).\r\n</big>","options":[{"id":1239198,"name":"Default","price":6.0,"sold_out":true,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261657/-/a4.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261657/-/a4.jpg","width":150,"height":224}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297563,"name":"SOLD OUT Arthur Issue #5","permalink":"arthur-issue-5","position":13,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/arthur-issue-5","status":"sold-out","on_sale":false,"created_at":"2009-05-12T21:45:09.000Z","description":"<big>\r\n\r\n<strong>ARTHUR AGAINST EMPIRE!</strong>\r\nPhotographer Lauren Klain captures DAVID CROSS on his way to a Clear Channel war rally... \r\n\r\nJonathan Shainin speaks with CHRIS HEDGES about the truths not being told about war...\r\n\r\nALAN MOORE comments on what the US and UK governments have been up to lately....\r\n\r\nThe fabulous GLAMericans are spotlit by Steffie Nelson... \r\n\r\nDAVID BYRNE writes about his life during wartime...\r\n\r\nKristine McKenna on the Tower of Protest, a Vietnam-era action on Sunset Blvd by celebrated artists. With photos by Charles Brittin... \r\n\r\nRighteous poetry by MICHAEL BROWNSTEIN, CHARLES POTTS and AMY TRUSSELL... \r\n\r\nArt and comics by Steve Andersen, Tauno Blisted &amp; Mac McGill, Robbie Conal, John Coulthart, Godspeed You! Black Emperor, Bill Griffith, Megan Kelso with Ron Rege, Peter Kuper, David Lasky, Sharon Rudahl, Patti Smith &amp; Jem Cohen, art spiegelman and Carol Swain\r\n\r\nMICHAEL MOORCOCK on the fate of empires...\r\n\r\nDANIEL PINCHBECK on why he's glad George Bush is president...\r\n\r\nNew Arthur film columnist Paul Cullum asks \"Is George Bush addicted to cocaine?\" as he examines \"Horns and Halos,\" \"Journeys with George,\" \"Uncle Saddam,\" \"What I've Learned About U.S. Foreign Policy: The War Against the Third World\" and \"Unpredented: The 2000 Presidential Election.\" \r\n\r\nAsk DICK VALENTINE of the Electric Six\r\n\r\n\"Keeping Two: Part Four\" by Jordan Crane \r\n\r\nPaige La Grone Babcock remembers June Carter Cash\r\n\r\nByron Coley &amp; Thurston Moore do their review column bit \r\n\r\nJeff Brown, Martin Cendreda and Johnny Ryan gift us with comics throughout the mag. </big>","options":[{"id":1239194,"name":"Default","price":6.0,"sold_out":true,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261621/-/a5.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261621/-/a5.jpg","width":150,"height":223}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297556,"name":"Arthur Issue #6 (Sept. 2003)","permalink":"arthur-issue-6","position":14,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-6","status":"active","on_sale":false,"created_at":"2009-05-12T21:41:18.000Z","description":"Arthur No. 6 (September 2003)\r\nColor/black and white, 48 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n\r\n<big>\r\n<p>\r\n\r\n<strong>THE RETURN OF IGGY AND THE STOOGES</strong> \r\n\r\n* Photographs by Peter Whitfield from their stunning live comeback at Coachella \r\n* Author-journalist Kristine McKenna talks with IGGY POP...\r\nRON & SCOTT ASHETON discuss their past, present and future with Jay Babcock.... \r\n* How bassist MIKE WATT ended up onstage with Iggy &amp; the Stooges, in his own words.... \r\n* DON FLEMING on the lost Wylde Ratttz sessions that have led to so much more\r\n\r\nFor years, the L.A. Cacophony Society was a haven for creative misfits with a sense of humor. Then tragedy struck, and everything changed. By Christopher Noxon, with photography by Jack Gould and Michael Perrin. \r\n\r\nThis fall, American national treasure JOHN SINCLAIR says farewell to the USA for good. Jay Babcock conducts an exit interview with the poet, scholar and former manager of the MC5. Introduction by Byron Coley. \r\n\r\nFull-page comics by JORDAN CRANE, MEGAN KELSO and SOUTHER SALAZAR.\r\n\r\nMatt Leum interviews documentary filmmaker SAM GREEN about his new film on the Weather Underground, '60s student radicals who wanted to take down The Man by bringing the Vietnam War home.\r\n\r\nThey were young would-be terrorists in love. Or were they? (In love, that is.) An exclusive excerpt from artist ERIN COSGROVE's new romance novel <i>The Baader-Meinhof Affair</i>. \r\n\r\nHOLLY GOLIGHTLY cheerfully answers questions about pathetic aspects of your lives. \r\n\r\nT-MODEL FORD talks about disciplining troublesome children in his new column, \"T-Model Ford Knows Better.\"\r\n\r\nThe debut of \"Astrology by Arthur,\" as written by IAN SVENONIUS (Gemini, Weird War, Nation of Ulysses). \r\n\r\nJAMES PARKER on Shemane Nugent's <em>Married To A Rock Star</em>\r\n\r\nPAUL CULLUM on film and DVDs in \"Camera Obscura\" \r\n\r\nReviewage of recently released subcultural musical/textual/visual artifacts by BYRON COLEY &amp; THURSTON MOORE in their \"Bull Tongue\" column\r\n\r\nReviews in the margins by the C &amp; D team\r\n\r\n</big>","options":[{"id":1239184,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261589/-/a6.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261589/-/a6.jpg","width":150,"height":224}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297553,"name":"Arthur Issue #7 (Nov. 2003)","permalink":"arthur-issue-7","position":15,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-7","status":"active","on_sale":false,"created_at":"2009-05-12T21:36:21.000Z","description":"Arthur No. 7 (Nov. 2003)\r\nColor/black and white, 56 pages, 11.5 x 14 newsprint\r\n\r\n<big>\r\nCover by John Coulthart with W.T. Nelson.\r\n\r\nMy Bloody Valentine's fluff-on-the-needle sound changed rock music forever. Then they disappeared. Ten years later, MBV's Kevin Shields explains almost everything. Text and photos by Hua Hsu. \r\n\r\nPaul Cullum considers jazz genius/Afro-futurist Sun Ra's landmark feature film <em>Space Is the Place</em> on the occasion of its Director's Cut DVD release.\r\n\r\nThis summer, underground psych bands Sunburned Hand of the Man, Comets On Fire and Six Organs of Admittance ventured across the continent in a traveling caravan of mindblowers. Tony Rettman reports live from the scene. Photos by Don Harney, Mike Galinsky and others. \r\n\r\nIn an exclusive excerpt from <i>Chapel of Extreme Experience: A Short History of Stroboscopic Light, Flicker and the Dream Machine</i>, author John Geiger explains the role of the legendary Dream Machine in the consciousness exploration of the '60s by folks like Brion Gysin, William S. Burroughs, Timothy Leary, Aldous Huxley and Allen Ginsberg. \r\n\r\n\"Never Mind SARS\": Two entries from the just-published <i>The Thackery T. Lambshead Pocket Guide to Eccentric &amp; Discredited Diseases</i>, by authors Steve Aylett and Brian Evenson.\r\n\r\n\"I was at home but I didn't have anybody teach me nothin'.\" Infamous 78-year-old Mississippi bluesman T-MODEL FORD weighs in on the home schooling debate. \r\n\r\nControversial provocatuerix Peaches (wo)manhandles the problems that Arthur readers find themselves saddled with. \r\n\r\n'SEX $75': Photography and text from turn-of-the-century Los Angeles by Susannah Breslin. \"Sex was everywhere, every time I turned my head. Nobody else appeared to notice.\"\r\n\r\nCharles Bronson, Dark Buddha: An appreciation of a life, by author Joe Carducci (<i>Rock &amp; the Pop Narcotic</i>).\r\n\r\nComics by Sammy Harkham (\"The Golem Will Never Die\"), Gary Panter (\"Smoke Wagon\") and Jordan Crane (\"Keeping Two, Part 6\").\r\n\r\nReviewage of recently released subcultural musical/textual/visual artifacts by Byron Coley &amp; Thurston Moore. Including: Raymond Dijkstra and Timo van Luyk, Charlemagne Palestine, Tony Conrad, Steve MacKay, The Radon Ensemble, Bastard Noise, Smegma, Solid Eye, Afri Rampo, Richard Meltzer, Ed Pinsent, Tetuzi Akiyama, Splendor Mystic Solis, Tuck Tuck Tuck, Irving Stettner, Mineshaft zine, Wildflowers zine, Andy Clausen, Barbara Manning, Glands of External Secretion and Decaer Pinga, Fast Forward, Valerie Webber, Mouvement Lent (Slow Movement), Steven Heller's new book on avant-gardemagazine design, Paper Rodeo paper, T.L.Kryss, Peter Brotzmann and Walter Perkins and Japanther. \r\n\r\nA horoscope by Ian Svenonius (Make-Up, Scene Creamers/Weird War). \r\n\r\nCantankerous duo C &amp; D comment on new records by The Hidden Hand, The Raveonettes, Ween, Terry Hall &amp; Mushtaq, Brant Bjork, PFFR, The Rapture, Erase Errata, PrettyGirls Make Graves, High Llamas, <em>Festival in the Desert</em>, House of Low Culture, The Dirtbombs, Dufus, James Blood Ulmer, Robert Wyatt.</big>","options":[{"id":1239172,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261505/-/a7.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261505/-/a7.jpg","width":150,"height":225}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297547,"name":"Arthur Issue #8 (Jan. 2004)","permalink":"arthur-issue-8","position":16,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-8","status":"sold-out","on_sale":true,"created_at":"2009-05-12T21:31:54.000Z","description":"<big>\r\n\r\nColor/black and white, 48 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n<p>\r\n\r\n\"SILLY BEASTS IN SACRED PLACES\": Karin Bolender on the secret truths that DOLLYWOOD reveals. Plus, an extensive review of DOLLY PARTON's music by Paige La Grone Babcock. Illustrations by Emily Ryan.\r\n\r\nRootsy or folk? Post-punk or blues futura? The answer is: Yes. THE FIERY FURNACES might be all over the map, but Margaret Wappler finds out one thing's dead certain: No one else is gettin' in the band. \r\n\r\n\"ENCOUNTER WITH MAXIMON\": While investigating Guatemala's folk-magic patron saint of thieves and whores, James Marriott made a serious mistake. With an illustration by John Coulthart.\r\n\r\nHallucinogens, Ukrainian Catholicism, Nascar town alienation, the Tao De Ching and the Beatles helped make BROTHER JT the homegrown musical genius he is. Jay Babcock interviews America's least-known national treasure. Plus, David Katznelson guides us thru JT's vast and beguiling career. \r\n\r\nArthur regular T-MODEL FORD talks about crack, in-town cars and underage sex. HOLLY GOLIGHTLY invites us into her kitchen. \r\n\r\n\"R.I.P. SUV\": a poem by Charles Potts. \r\n\r\nComics by Gary Panter and Lauren R. Weinstein.\r\n\r\nSteve Aylett on the whole Matrix bollocks, and Paul Cullum considers the new DVDs by Spike Jonze, Michel Gondry and Chris Cunningham in his ãCamera Obscuraä column. \r\n\r\nByron Coley & Thurston Moore review the De Stijl/Freedom From Festival in their \"Bull Tongue\" column, with wonderful photos by Seth Tisue. Discussed in this column: Hair Police, The Dream/Aktion Unit, MIchael Yonkers, Aaron Dilloway, Metalux, Wooden Wand & the Vanishing Voice, Emil Beausoleil, Bridget St. John, Fursaxa, Nmperign, The MVEE Medicine Show, The Wayne Rogers Unit, Borbetomagus, Tony Conrad, Neon Hunk, Burning Star Core, Arthur Doyle, Dead Machines, Jack Rose, Angelblood, Noxagt, Jackie-O Motherfucker, No Neck Blues Band, Trad Gras Och Stenar, Dwight Frizzell and Matt St. Germain.\r\n\r\nCantankerous duo C &amp; D check out new releases from Unicorns, Eugene McDaniels, The Starvations, 22-20s, Sun Kil Moon, Jolie Holland, Mark Lanegan Band, Califone, Book of Lies-the Disinformation Guide to Magick and the Occult, Bobby Conn and the Glass Gyspies, US Maple, Skullflower, Pelt, Audra Kubat, Polmo Polpo and Double Leopards. \r\n\r\nPlus! Art by Evah Fan and a photograph by David Ellis, a  horoscope by Weird War singer Ian Svenonius (Gemini) and oodles of doodles by Ed Ruscha, Jr. \r\n</big>","options":[{"id":1239167,"name":"Default","price":5.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261473/-/a8.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261473/-/a8.jpg","width":150,"height":230}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297537,"name":"SOLD OUT - Arthur Issue #9 (March 2004)","permalink":"arthur-issue-9","position":17,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-9","status":"sold-out","on_sale":false,"created_at":"2009-05-12T21:26:21.000Z","description":"Arthur No. 9 (March 2004)\r\nColor/black and white, 56 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n\r\n<big>\r\n\r\nLegendary doom metal/stoner rock lifer <strong>WINO</strong> (St. Vitus, The Obsessed, Spirit Caravan,The Hidden Hand, Probot) isn't finished yet--not with these new war pigs in the White House to dispose of. Text by <strong>Joshua Sindell</strong>, with photos by <strong>Brian Liu</strong>.\r\n\r\nDetroit's visionary <strong>MC5</strong> played like gods, lived like pigs and freed everyone they touched. <strong>Steffie Nelson</strong> interviews the filmmakers of the astonishing forthcoming <em>MC5 A True Testimonial </em>documentary; <strong>James Parker, Ian Svenonius</strong> and <strong>The Seth Man</strong> walk us through the 5's recordings; and Wayne Kramer, John Sinclair and Ted Nugent talk about the 5's raw volume. With artwork by <strong>Plastic Crimewave</strong>, archival photos by <strong>Leni Sinclair </a></strong>and vintage posters by <strong>Gary Grimshaw</a></strong>. \r\n\r\n<strong>Sue Carpenter</strong> ran <strong>pirate radio station</strong> KBLT out of her Silver Lake apartment for three years. Now she's written a book about the experience: <strong><em>40 Watts From Nowhere</em></strong> </a>(Scribners). Here's six things she learned. \r\n\r\nHippies with too much time on their hands, or people who have their priorities straight? Journalist (and photographer) <strong>Daniel Chamberlin</strong> investigates <strong>the Great Arcata-to-Ferndale Kinetic Sculpture Race</strong>. \r\n\r\nNew Arthur columnist <strong>Daniel Pinchbeck</strong> on the accelerated evolution of human consciousness now underway. \r\n\r\n<strong>LIARS</strong>' Angus Andrews talks about misguided angst and paranoia through the ages with Jay Babcock. \r\n\r\n<strong>How to help keep kids from joining the military</strong>: a public service announcement from Arthur and the American Friends Service Committee. \r\n\r\nArthur regular <strong>T-Model Ford</strong> talks about what to do when someone's dragging your name through mud. \r\n\r\n<strong>Dave Catching</strong> (guitarist with Desert Sessions, Mondo Generator, earthlings?, Yellow Number Five) invites us into his kitchen and shows us how to make New Orleans Soul Red Beans, Rice and Corn Bread. \r\n\r\nArtwork by <strong>Seldon Hunt, Leif Goldberg, Ivan Brunetti, John Hankiewicz, Tom Hart, Ben Katchor </strong>and <strong>Eddie Ruscha, Jr.</strong> \r\n\r\n<strong>Byron Coley and Thurston Moore</strong> review tons of stuff in their regular \"Bull Tongue\" column. \r\n\r\nAnd <strong>C &amp; D</strong> bicker about loads of new music, much of it shockingly good. \r\n\r\nPlus: A horoscope by Weird War vocalist/Gemini <strong>Ian Svenonius</strong>.\r\n</big>","options":[{"id":1239126,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261397/-/a9.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261397/-/a9.jpg","width":150,"height":224}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297527,"name":"Arthur Issue #10 (May 2004)","permalink":"arthur-issue-10","position":18,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-10","status":"active","on_sale":false,"created_at":"2009-05-12T21:13:59.000Z","description":"Arthur No. 10 (May 2004)\r\nColor/black and white, 56 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n\r\n\r\n<big>\r\n<strong>DEVENDRA BANHART</strong> is here and he plays folk music. Trinie  Dalton finds out where he’s coming from. Photos by Melanie Pullen.\r\n\r\nHarp-playing folksinger <strong>JOANNA NEWSOM</strong> talks history, theory and inspiration with Jay Babcock. Visions of Joanna by Melanie Pullen.\r\n\r\nThe two sisters who are <strong>COCO ROSIE</strong> have made an astonishing, haunting debut album. Trinie Dalton finds out how they did it. Photos by Melanie Pullen.\r\n\r\nOliver Hall raps with radical traditionalists <strong>FAUN  FABLES</strong>. Photos by Melanie Pullen.\r\n\r\nDirector <strong>GUY MADDIN</strong> (\"The Saddest Music in the World\") is highly resentful, terribly romantic and prone to melancholy. He also makes wondrous, utterly unique films. Kristine McKenna asks him some leading questions.\r\n\r\nA slightly testy <strong>GODZILLA</strong> reflects on his long career in an exclusive interview with Dave Tompkins. Illustration by Brian Ralph.\r\n\r\nMerrick explains how cell phones, Playstations and PCs are connected to ecological, human and animal destruction in Africa. Illustration by Ben Jones.\r\n\r\nComics by Marc Bell (a two-page spread!), Ben Katchor, Amy  Lockhart and John Porcellino. Plus new doodleisms by Eddie Ruscha, Jr.\r\n\r\nWords of advice from <strong>T-MODEL FORD</strong>, correspondence from our readers, commentary by <strong>SHARON RUDAHL</strong> and notes on our contributors. <strong>WILL OLDHAM</strong> on pie and God.\r\n\r\nArthur columnist <strong>DANIEL PINCHBECK</strong> talks about the real passion of Christ.\r\n\r\nJames Parker on the autobiography of <strong>LEMMY</strong>. Illustration by Dustin Amery Hostetler.\r\n\r\n\"Camera Obscura\" columnist <strong>PAUL CULLUM</strong> on Richard Nixon and Robert Altman.\r\n\r\nThe “Bull Tongue” review column by <strong>BYRON COLEY &amp; THURSTON MOORE</strong> examines Sun City Girls videos, Anit Strot, Leif Goldberg's National Waste zine and calendar, Georganne Deen, Dreamlogic, Vampire Belt, Ptolemaic Terrascope,  Dream Magazine, Young People, The Pirates &amp; the Mouse by Bob Levin, Black Dice &amp; Wolf Eyes, The Ponys, Excepter, Rhys Chatham, Wooden Wand &amp; the Vanishing Voice, Lisa Jarnot, Jeff Fucckillo, Shattered Wig Review, the Residents, Effing Press, Niagara, Kevin Davies, Six Organs of Admittance and The Guitars Project.\r\n\r\nC &amp; D bicker and enthuse about new records by Eagles of Death Metal,  Pink Grease, John Wilkes Booze, The Thermals, Mission of Burma, the Icarus Line, the Secret Machines, the Veils, White Magic, Espers, Acid Mothers Temple, Merzbow, Loren Connors, Thee Silver Mountain Reveries, Craig Taborn, Vetiver, Blanche, Los Lobos and Toots &amp; the Maytalls.\r\n\r\nAnd a new horoscope by <strong>IAN SVENONIUS</strong>...\r\n\r\n</big>","options":[{"id":1239101,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261313/-/a10.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261313/-/a10.jpg","width":150,"height":224}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297522,"name":"Arthur Issue #11 (July 2004)","permalink":"arthur-issue-11","position":19,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-11","status":"active","on_sale":false,"created_at":"2009-05-12T21:10:43.000Z","description":"Arthur No. 11 (July 2004)\r\nColor/black and white, 48 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n\r\n\r\n<big>\r\nOliver Hall conducts a wide-ranging and comprehensive conversation with Sonic Youth’s KIM GORDON, one of our era's great iconoclasts. Photography by Emily Wilson with additional photos by Susan Moore Erdman, Kevin Estrada and Richard Kern.\r\n\r\nMark Pilkington reports from London on the Thelema convention coinciding with the centenary of the \"transmission\" of the Book of the Law to infamous occultist and” Great Beast” ALEISTER CROWLEY. With an illustration by John Coulthart and photos by Pilkington.\r\n\r\nLate-blooming artist NOAH PURIFOY built massive sculptures from garbage on the desert floor of Joshua Tree, California. Arthur pays tribute to Noah, who died recently, with an appreciation/vintage interview by Kristine McKenna and new photos of Noah's work by Bill Nelson.\r\n\r\nNotes on the strange pleasures and pains of being a closet GRATEFUL DEAD fan by Daniel Chamberlin. With comics by D. C. Berman.\r\n\r\nAre we in the midst of the Kali Yuga? And what is that anyway? Arthur columnist DANIEL PINCHBECK explains.\r\n\r\nNew artwork by Lounge Lizards founder JOHN LURIE.\r\n\r\nWords of advice from T-MODEL FORD, a recipe from THE REIGNING SOUND's Greg Cartwright, a poetry-comic by KENNETH KOCH, a full-page comic by KEVIN HUIZINGA, comics by BEN JONES and BEN KATCHOR, and new drawings by EVAH FAN and BRENDAN MONROE.\r\n\r\nPaul Cullum on LARS VON TRIER's more obscure work from the last six years.\r\n\r\nJames Parker on the new documentary dvd, RISE: THE STORY OF RAVE OUTLAW DONNIE DISCO.\r\n\r\n“Bull Tongue” by Byron Coley &amp; Thurston Moore features reviewage of work by Karen Constance, Jack Goldstein, Blood on the Wall, Icewater Scandal, Painting Soldiers, S. Isabella, Matt Wascovich, John Fahey, Stanley Brothers, John Weise, Cherry Point, Wavelength, \"Captain Milkshake\" DVD, Arek Gulbenkoglu &amp; Adam Sussman, The Lost Domain, Simon Wickham-Smith, Julian Williams and other Rhizomne releases, Leprechaun, \"Super Scratch\" book, Gang Wizard, Algebrassiere, Clorox Girls, Excepter and Babyhead.\r\n\r\nC &amp; D bicker and enthuse about new records by Fiery Furnaces, Comets On Fire, The Reigning Sound, The Concretes, Martina Topley-Bird, The Obsessed, \"High Volume: The Stoner Rock Collection,\" Wolf Eyes, The Fall, Black Dice, M83, Legendary Pink Dots, SUNN O))) and \"Eccentric Soul: The Capsoul Label.\"\r\n\r\n</big>","options":[{"id":1239096,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261281/-/a11.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261281/-/a11.jpg","width":150,"height":224}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297517,"name":"Arthur Issue #12 (Sept. 2004)","permalink":"arthur-issue-12","position":20,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/arthur-issue-12","status":"active","on_sale":false,"created_at":"2009-05-12T21:08:20.000Z","description":"Arthur No. 12 (September 2004)\r\nColor/black and white, 64 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n<big>\r\nComics author <strong>Grant Morrison</strong> is the cover subject of Arthur's biggest issue (64 action-packed broadsheet-sized pages!) yet. Magic works, says Morrison, and he would know—he's been exploring it for 25 years. He talks with Jay Babcock about what he's experienced, and What It (Maybe) All Means in this extensive interview that could change your life. Cover portrait of Mr. Morrison by \"Seaguy\" artist Cameron Stewart.\r\n\r\nIn an exclusive, extensive excerpt from his forthcoming book, Michael Streissguth explains why <strong>Johnny Cash</strong> went to Folsom Prison to make a live record. With stunning photography by Jim Marshall.\r\n\r\nRoyal Trux are gone, but <strong>RTX</strong> lives on. <strong>Jennifer Herrema</strong> talks with Trinie Dalton about chasing that airtight classic rock sound.\r\n\r\n\"Camera Obscura\" columnist Paul Cullum goes in search of <strong>Bush's brain</strong>--and finds it, in a new documentary film.\r\n\r\nAnswerman <strong>T-Model Ford</strong> on breastfeeding, the \"sugar tittie,\" what to eat on a first date and how come there aren't more women playing the blues.\r\n\r\nYou gotta hear this woman sing: <strong> Josephine Foster</strong> of Born Heller and the Children's Hour talks about her new acid-rock project The Supposed with Margaret Wappler. With a portrait by Plastic Crimewave. \r\n\r\n<strong>Flaming Lips' Wayne Coyne</strong> discusses the virtues of decaf.\r\n\r\nColumnist <strong>Daniel Pinchbeck</strong> on why <strong>crop circles</strong> have something to teach us with an illustration by Arik Moonhawk Roper .\r\n\r\nNever mind Metallica's therapy film: James Parker reviews the new, strangely good Brian Jonestown Massacre Vs. Dandy Warhols documentary, <strong>Dig!</strong> \r\n\r\nBritgenius author <strong>Steve Aylett</strong>, provides a horoscope, with zodiac designs by Arik Moonhawk Roper.\r\n\r\nNew comics by <strong>Ben Katchor, Gabrielle Bell, Tom Hart and Kurt Wolfgang.</strong> \"Bull Tongue\" columnists <strong>Byron Coley &amp; Thurston Moore</strong> review Metal Urbain, Metal Boys, Dr. Mix and the Remix, Billy Childish, Tower Recordings, <em>Smallflowers Press</em>, Arthur Doyle, Hiroshi Higashi, <em>Sound Projector</em>, <em>Push My Buttons</em>, Deerhoof, Prurient, Kites, Gang Gang Dance, Tuck Tuck Tuck, Kaz and The Anaksimandros.\r\n\r\nBickering mysterions <strong>C &amp; D</strong> comment on new recordings by The Gris-Gris, the Black Keys, The Faint, Mouse on Mars, Twilight Singers, Thalia Zedek, Mike Watt, Paul Westerberg, Rich Robinson, Whirlwind Heat, Col. Claypool's Bucket of Bernie Brains, Antibalas, Melvins/Lustmord, \"Lucifer Rising\" soundtrack, Wolf Eyes, Hope of the States, Signer, the Delgados, Thee Shams, Crime, the Libertines, Mushroom and the \"Festival in the Desert\" DVD.\r\n</big>","options":[{"id":1239089,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261253/-/arthur12.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261253/-/arthur12.jpg","width":150,"height":224}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297512,"name":"SOLD OUT - Arthur Issue #13 (Nov. 2004)","permalink":"arthur-issue-13","position":21,"price":50.0,"default_price":50.0,"tax":0.0,"url":"/product/arthur-issue-13","status":"sold-out","on_sale":false,"created_at":"2009-05-12T21:05:06.000Z","description":"Arthur No. 13 (Nov. 2004(\r\nColor/black and white, 64 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n<big>\r\nThe cover feature is a MEGA oral history of <strong>the 1967 exorcism/levitation of the Pentagon and the birth of Yippie!</strong>. This piece was painstakingly compiled from old and new interviews with <strong>Abbie Hoffman, Allen Ginsberg, Ed Sanders, Kenneth Anger, Paul Krassner, Bob Fass, Norman Mailer, Tuli Kupferberg, Anita Hoffman, Jerry Rubin, Peter Coyote</strong> and many many others. Also: stunning photographs by <strong>Robert Altman and Roz Payne</strong>, Ed Sanders' original magical rite program, a page from <em>The Oracle</em> (San Francisco's mid-'60s psychedelic newspaper), event buttons and cover artwork by <strong>John Coulthart</strong>.\r\n\r\n\"Camera Obscura\" columnist Paul Cullum on the inspiration of <strong>Haskell Wexler's \"Medium Cool.\"</strong> \r\n\r\n\"If Little Bush Wins...\": <strong>DAVID CROSS and EUGENE MIRMAN</strong> smash their funny bones on the bully pulpit.\r\n\r\n<strong>GENESIS P-ORRIDGE</strong>'s ten favorite psychedelic folk songs.\r\n\r\nErik R. Bluhm investigates California's nascent New Energy Movement  and the communal folkish leanings of <strong>LITTLE WINGS</strong>' Kaisle Feeled. Get the scoop on the movement's collaboration with noted New York minimalist Ferg DeWitt, their taste in abstract paper clothing, and the current state of West Coast Naturmenschen. Illustrated with beautiful color photos by Jamison Carter.\r\n\r\nWhy Daniel Pinchbeck went to <strong>Burning Man</strong> again. Illustrated by Arik Roper.\r\n\r\nComics by Jason Miles, David Lasky, Vanessa Davis, Tom Gauld, Ben Katchor and Howard Cruse.\r\n\r\nA recipe for Matzoh Ball soup from <strong>THE BLACK KEYS</strong>' Dan Auerbach. \r\n\r\nOliver Hall talks utopian pop and practical politics with feminist electro-dance bullhorn radicals <strong>LE TIGRE</strong>.\r\n\r\n\"Bull Tongue\" columnists <strong>Byron Coley &amp; Thurston Moore</strong> on new work from many of the known undergrounds.including Ben Watson's DEREK BAILEY book, plus new stuff from FAT WORM OF ERROR, kuupuu, WITCYST,THE DEMARS, BARDO POND, TOM CARTER, PRAIRIE DOG FLESH, 500mg, PAIVANSADE, JOE + N, MIKE SHIFLET, CARLOS GIFFONI AND LASSE MARHAUG, ERIC ERLANDSON, DYLAN NYOUKIS, BLOOD STEREO, PENGO, JUSTIN BRADLEY, RICHARD RAMIREZ, REYNOLS, CRANK STURGEON, \"PRETEND I AM SOMONE ELSE,\" SIGHTINGS/TOM SMITH, XEX, BRAN (...)POS, 'IN THE MIRROR OF MAYA DEREN,\" \"BRAKHAGE,\" MAT BRINKMAN, GENEVIEVE CASTREE, GIGI PERRON, JOCKO WEYLAND, CHARLES POTTS, THE EVENS, DANIEL HIGGS, ET AT IT, DON ZIENTARA, FOXY DIGITALIS, PETER WRIGHT, MUSTI LAITON, HUSH ARBORS, AFRI RAMPO, \"No W...NOW! A MUSICIAL PETITION AGAINST GEORGE BUSH\" (featuring GLENN BRANCA, WHITE OUT, JACK WRIGHT, LOREN CONNORS, PAULIVE OLIVEROS and ERIC DROOKER), LOREN CONNORS, CHRISTINA CARTER, VIBRACATHEDRAL ORCHESTRA, VOLCANO THE BEAR, AVARUS, EYE, THREE FORKS and DEVILLOCK.\r\n\r\nC &amp; D wax polemic about the \"PICK A WINNER\" DVD and new albums by TOM WAITS, THE CRAMPS, THE HIDDEN HAND, BLUES EXPLOSION, FELA KUTI MIXED BY CHIEF XCEL, AFRIKA BAMBAATAA, TIM HECKER, CAMPER VAN BEETHOVEN, THE FUTUREHEADS, THE VERVE, PATTY WATERS, HANDSOME BOY MODELING SCHOOL, MARISSA NADLER, ENTRANCE, WILLY MASON, NICK CAVE &amp; THE BAD SEEDS, BROTHER JT, NAGISA NI TE, and GROWING.\r\n</big>","options":[{"id":1239083,"name":"Default","price":50.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261237/-/A13cvr_150.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261237/-/A13cvr_150.jpg","width":150,"height":225},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25457115/-/art13p12.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25457115/-/art13p12.jpg","width":266,"height":400}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297509,"name":"Arthur Issue #14 (Jan. 2005)","permalink":"arthur-issue-14","position":22,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-14","status":"active","on_sale":false,"created_at":"2009-05-12T21:01:51.000Z","description":"Arthur No. 14 (January 2005)\r\nColor/black and white, 48 pages, newsprint, 11.5 x 14, quarterfold\r\n\r\n<big>\r\n\r\n<strong>God Bless Jello Biafra</strong>: The former Dead Kennedy and veteran firebrand has returned to musicmaking with a car bomb of a new album, recorded with the Melvins. Sorina Diaconescu talks with Mr. Biafra in the direct aftermath of the Nov. 2 election about freedom, surveillance, pranks and selling out. Photography by W. T. Nelson. \r\n\r\nThrough a curious legal twist, <strong>magic mushrooms</strong> are openly available for sale in Great Britain. Mark Pilkington reports back from a trip to the shops. With illustrations by Matthew Greene.\r\n\r\nPhotographer Ryan Beshara has been visiting <strong>the bingo halls of America</strong>. Here are some of the people she has encountered there.\r\n\r\nThe daring Danish art collective/company <strong>Superflex</strong> is changing the world by challenging multinational corporations at their own game. Text by Jay Babcock, photography by W.T. Nelson. \r\n\r\n<strong>Oh, Canada</strong>: One year ago, Mdme X exited New York City for the cooler climes of Quebec. \"So, how's it going?\" asked Arthur. Here's what she told us, with an illustration by Tom Devlin.\r\n\r\n\"Here and Now\" columnist <strong>Daniel Pinchbeck travels to Hopiland</strong> and finds a way of life threatened with extinction. Illustrated by Arik Moonhawk Roper.\r\n\r\nComics by <strong>David Lasky</strong>, <strong>Dan  Zettwoch</strong> and <strong>Ben Katchor</strong>, plus artwork by <strong>Seldon Hunt</strong>. \r\n\r\n<strong>T-Model Ford</strong> tells us what he wants for Christmas. \r\n\r\n<strong>MF Doom</strong> gives us his recipe for \"Villainous Mac &amp; Cheese.\"\r\n\r\nJames Parker on <strong>Mike Watt</strong> and <strong>Richard Meltzer</strong>'s autumnal works.\r\n\r\n\"Camera Obscura\" columnist Paul Cullum is stark raving livid about the election results. Fortunately, he has the work of satirist <strong>Bill Hicks</strong> and an unreleased Woody Allen film to help him get through it.\r\n\r\n\"Bull Tongue\" columnists <strong>Byron Coley &amp; Thurston Moore</strong> on underground music, poetry, prose, film and art, including work from Matthew Wascovich's Slow Toe Publications (Elisa Ambrogio, Pete Nolan, Tyondia Braxton, Dylan Nyoukis, Bruce Russell, Christina Carter, Valerie Webber, Real Knife Head), Criminal IQ label (Manhandlers, Functional Blackouts), Rachel Levitsky and Erica Kaufman's Belladonna Books (Anne Waldman, Eileen Myles, Nada Gordon, Lynne Tillman, Lisa Jarnot, Rosemarie Waldrop), Kaufman's Boku Books (Kaufman, Chris Martin), Social Registry label (the Electroputas, Hall of Fame), Shiv Mirabito's Shivastan Press (Ed Sanders, Louise Landes Levi, Janine Pommy Vega, Andy Clausen, Ira Cohen), Bill Cassidy, Aa, The Weavers mag (Heather Leigh, David Keenan), Zdrastvootie, xochi23, Fursaxa, Vibracathedral Orchestra, Sylvester Pollet's \"Backwoods Broadsides\" series (Rochelle Owens, Bern Porter, Jackson Mac Low, Dick Higgins, Amiri Baraka, Diane di Prima, Aram Saroyan), Carson Arnold, Briana, Deserted Village label (Murmansk, Job, The Magickal Folk of the Faraway Tree, The Cosmic Nanou, Wrecking Ball), Phylum Press (Susan Briante, Kristen Prevallet, Charles North, Trevor Winkfield), Double Leopards, Strange Attractor Journal, Tamio Shirashi and Sean Meehan, \"Prisoner's Inventions\" by Angelo and The Spectral Light &amp; Moonshine Firefly Snakeoil Jamboree.\r\n\r\n</big>","options":[{"id":1239080,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261177/-/a14coversml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261177/-/a14coversml.jpg","width":150,"height":225}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297507,"name":"Arthur Issue #15 (Mar 2005)","permalink":"arthur-issue-15","position":23,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-15","status":"active","on_sale":false,"created_at":"2009-05-12T20:59:24.000Z","description":"<big>\r\n\r\nA close encounter with the enigmatic psychedelic folk adventurer BEN CHASNY of Six Organs of Admittance and Comets On Fire.\r\n\r\n\r\nControversial novelist and visionary J.G. BALLARD wonders if something fundamental has gone awry in America. Interview by RE/Search's V. Vale, with an introduction by author Michael Moorcock.\r\n\r\nMEDITATION as a subversive activity, by Michael Brownstein. Illustrated by John Coulthart.\r\n\r\nFilmmaker Jessica Yu talks with Trinie Dalton about exploring the life and work of the mysterious artist HENRY DARGER in her innovative new documentary, Into the Realm of the Unknown.\r\n\r\nFrom Sharron Kraus and Albert Ayler to Lindsay Lohan and Savage Pencil, \"Bull Tongue\" columnists BYRON COLEY &amp; THURSTON MOORE reflect on \"80 Goddamn Good Things of 2004.\"\r\n\r\nJames Parker on heavier metal by HIGH ON FIRE, DEAD MEADOW, JESU and OM.\r\n\r\n\"Hotel &amp; Farm\" by BEN KATCHOR, \"What Is Wrong With This Picture #3\" by JOHN LURIE and \"Peace Comics\" by BECKY STARK &amp; RON REGE.\r\n\r\nBRENDAN BENSON explains how a proper cup of tea is brewed.\r\n\r\nA special feature on making art in troubled times, featuring new comics by Chris Wright, Brian Ralph, Dan Zettwoch, Megan Kelso, Ben Jones, Paul Lyons, David Lasky, Tom Hart, Vanessa Davis, Greg Cook, Marc Bell, Amy Lockhart and John Hankiewicz. Edited by Tom Devlin.\r\n\r\nNew Arthur columnist DOUGLAS RUSHKOFF on re-inventing the collective for the 21st century. Illustration by Jack Pollock.\r\n\r\nWeird War vocalist IAN SVENONIUS has a conversation with the Secret Service.\r\n\r\nPlus: answerman T-MODEL FORD, a horoscope by BECKY STARK and the return of bickering review crew C &amp; D, who this time round give their takes on new releases or reissues from Nina Simone, Antony &amp; the Johnsons, The Kills, M. Ward, Fiery Furnaces, Louis XIV, Kings of Leon, Wolfmother, Parchman Farm, Heartless Bastards, Sunday Nights: The Songs of Junior Kimbrough, Love's a Real Thing: The Funky Fuzzy Sounds of West Africa, The Chemical Brothers, Ian Brown, Kasabian, Coyote, Mirrors, Jennifer Gentle and The Bird Show...\r\n\r\n</big>","options":[{"id":1239071,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261153/-/a15coversml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261153/-/a15coversml.jpg","width":150,"height":179}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297505,"name":"Arthur Issue #16 (May 2005)","permalink":"arthur-issue-16","position":24,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-16","status":"active","on_sale":true,"created_at":"2009-05-12T20:56:59.000Z","description":"<big>\r\nRaised in Sri Lanka and London, rising star <strong>M.I.A.</strong>'s pop instincts, radical consciousness and proudly pan-ghetto sound have no easy origin. <strong>Piotr Orlov</strong> interviews the defiant singer/MC in depth and at length (seriously! the Q &amp; A alone is 5,500 words!). With photography by <strong>W.T. Nelson</strong>.\r\n\r\nAuthor/scholar/poet <strong>Peter Lamborn Wilson</strong> (<em>Avant Gardening: Ecological Struggle n City and World, Drunken Universe: An Anthology of Persian Sufi Poetry, Atlantis Manifesto</em>) on something better than political activism and other forms of contemporary 'futilitarianism': U.S. seccessionist movements. \r\n\r\n<em>Techgnosis</em> author <strong>Erik Davis</strong> investigates spiritual hedonism, artistic communion and shared bohemian poverty in two of Northern California's legendary Marin County enclaves. With photography by <strong>Michael Rauner</strong> and <strong>Stephen Frisch</strong>. Plus, a look at Zen teacher/poet/Druid Heights resident <strong>Alan Watts</strong>' recently reissued recordings.\r\n\r\nA visit with <strong>today's Scandinavian black metalists</strong> by <strong>Stacy Kranitz</strong>, with an introduction by <em>Sound of the Beast: The Complete Headbanging History of Heavy Metal</em> author <strong>Ian Christe</strong>. Featuring King ov Hell and Gaal of Gorgoroth, Satyr and Frost of Satyricon, Fenriz of Darkthrone, Frode Glesnes of Einherjer, Nattefrost of Carpathian Forest, Hymr and Lindheim of Helheim, Jyri Vahvanen of Battlelore, Nebelhexe of Hagalaz Runedance, Mortiis, and Blasphemer of Mayhem. \r\n\r\n<strong>John Payne</strong> on the season's prog by <strong>MAGMA</strong> and <strong>THE MARS VOLTA</strong> \r\n\r\n\"Sigil Logo\" artwork by <strong>Sam Ott</strong> Comics by <strong>Ben Katchor, David Lasky, Vanessa Davis, Josh Miles, Chris Wright and Becky Stark &amp; Ron Rege</strong> \r\n\r\n<strong>PLUS</strong> columnist <strong>DOUGLAS RUSHKOFF</strong>, columnist <strong>DANIEL PINCHBECK</strong>, answerman <strong>T-MODEL FORD</strong>, and, in the kitchen, guest chef <strong>MIKE PATTON</strong>.\r\n\r\nColumnists <strong>Byron Coley &amp; Thurston Moore</strong> appreciate the latest mindzaps from the deep underground, including work by <strong>Electrophilia, Burmese, Sighting, Michael Yonkers, Jack Rose, Sun City Girls, Paivansade, Hevoset, Edward Ka-Sepl and Martijn de Kleer of Legendary Pink Dots, Songs of Norway, Christus &amp; the Cosmonaughts, Daniel Menche, Dreamcatcher, JMSTWGHRPR, Lee Ranaldo, Ira Cohen, <em>Spacemen 3 &amp; the Birth of Spiritualized</em> by Erik Morse, Jonas Mekas, Dame Darcy, Miss Satanica, The Lamps, Volt, Weirdo Begeirdo, Foot Village, My Sexual Dad, <em>Blab</em>, Peter Bagge, <em>Prague Literary Review</em>, <em>This Magazine Should Be Read Loud</em>, <em>Fish Piss</em>, Ron Lessard at RRRecords, <em>Ugly Things</em>, The Misunderstood, The Loons, Sword Heaven, 16 Bitch Pile-up, Simon Joyner, Dennis Callaci, Hototogisu, Sexy Prison, Glass Candy, Hive Mind, Chinaboise</strong> and <strong>Mt. Gigantic</strong>.\r\n\r\nC &amp; D get their faces melted by the new <strong>SLEATER-KINNEY</strong> album...and also check out new stuff from <strong>Oneida, Angels of Light, Boredoms, Brain Donor, Turbonegro </strong> DVD documentary (!), <strong>BBQ, Radar Bros., Lee Perry, Ariel Pink's Haunted Graffiti, Animal Collective and Vashti Bunyan, Colleen, The Geto Boys, Neil Hamburger, Yellow Pills, The Ponys, Spoon, Death in Vegas</strong> and <strong>Josephine Foster</strong>.\r\n\r\n</big>","options":[{"id":1239068,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261145/-/a16coversml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261145/-/a16coversml.jpg","width":150,"height":179}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297502,"name":"Arthur Issue #17 (July 2005)","permalink":"arthur-issue-17","position":25,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-17","status":"active","on_sale":false,"created_at":"2009-05-12T20:53:34.000Z","description":"<big>\r\n\r\n<strong>Kristine McKenna</strong> interviews <strong>BRIAN ENO</strong> on the eve of the release of his first solo album featuring vocals in decades. Illustration by <strong>John Coulthart</strong>. Plus, a celebration of the great domed one by <strong>Alan Moore</strong>. \r\n\r\n<strong>Dave Reeves</strong> explains <strong>how to siphon gasoline out of an S.U.V.</strong>. With an illustration by Greg Cook.\r\n\r\nColumnist <strong>Douglas Rushkoff</strong> on gurus. Illustration by <strong>Jeff Garcia</strong>.\r\n\r\nColumnist <strong>Daniel Pinchbeck</strong> on the approaching end of day-to-day life as we know it. Illustration by <strong>Arik Moonhawk Roper</strong>. \r\n\r\n<strong>Paul Smart</strong> journeys to <strong>a squatters' village on the wild side of Maui</strong>. Photography by <strong>Fawn Potash</strong>.\r\n\r\nTwo pages from one of the strangest comic books ever published, courtesy of Jeff Lint biographer <strong>Steve Aylett</strong>.\r\n\r\nPhotographs by <strong>Jamel Shabazz</strong> from his new book, <em><strong>A Time Before Crack</strong></em>. \r\n\r\n<strong>New comics</strong> by <strong>Marc Bell</strong> and <strong>Jason Miles</strong>.\r\n\r\nMaster of Reality/Goon Moonie <strong>Chris Goss</strong> reveals the history of his garlic-less Italian pork sauce recipe. \r\n\r\n<strong>C &amp; D</strong> on the new <strong>Kool Keith</strong> DVD and new records from <strong>Little Freddie King, Blowfly, A Band of Bees, HAL, Teenage Fanclub, Orange Juice, Vetiver, Gary Higgins, Judee Sill, Diana Cluck, Marissa Nadler, Debashish Bhattacharya, Gang Gang Dance, Boris, The Psychic Paramount, Residual Echoes, Growing/M. Evan Burden, Jane</strong> and <strong>The Juan Maclean</strong>.\r\n\r\nReviewed in <strong>Peter Relic's Book Corner</strong>: <strong><em>Rat Scabies and the Holy Grail</em></strong> by <strong>Christopher Dawes</strong>.\r\n\r\n\"Bull Tongue\" columnists <strong>Byron Coley &amp; Thurston Moore</strong> on <strong>Jessica Delfino, Walter Ullbricht, Die Stadt, Dietrich von Euler-Donnersperg, Marci Denesiuk, Impractical Cockpit, Nuclear Family, Justin Clifford Rhody, Little Wings, Wooden Wand &amp; Satya Sai Baba, My Cat Is an Alien, Crank Sturgeon, Gastric Female Reflex, Chris Corsano &amp; Paul Flaherty, Steve Baczkowski, Cold Bleak Heat</strong>, <strong><em>By the Fruits You Know the Roots\"</em></strong> compilation, <strong>X.O.4, Skaters, <em>Toilet Paper</em></strong>, a tribute to <strong>Philip Whalen, Martz Matz, Joe McPhee, Maggie Nelson, Gown, Jaqueline Waters, Giant Haystacks, The Punks, Wolf Eyes, Ground Monkeys, Mouthus, Dosdedos, Tas Fuck, California Lightening</strong> and <strong>Sic Alps</strong>, plus a Top 10 from <strong>Michael Bernstein</strong> (Double Leopards, Workbench, White Rock).\r\n</big>","options":[{"id":1239060,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261141/-/a17coversml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261141/-/a17coversml.jpg","width":150,"height":179}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297499,"name":"SOLD OUT - Arthur Issue #18 (Sept. 2005)","permalink":"arthur-issue-18","position":26,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/arthur-issue-18","status":"sold-out","on_sale":false,"created_at":"2009-05-12T20:52:02.000Z","description":"<big>\r\nCover illustration and lettering by <strong>PAUL POPE</strong>.\r\n\r\nJohn Payne visits with a true master: <strong>JON HASSELL</strong>, composer, trumpeter and visionary theorist-enacter of a sensual new kind of music. Plus, a beginner's guide to Hassell by John Adamian, and a provocative new essay by Hassell himself. Photography by W. T. Nelson.\r\n\r\nStricken by skin cancer, David Reeves journeyed to <strong>IQUITOS, PERU</strong>. There, he found witchdoctors, ayahuasca, deluded gringos, fears of American 'facepeelers,' the legacy of the CIA, the boat from Werner Herzog's <em>Fitzcarraldo</em>, a shantytown built on water and more. Photography by Simon Lund.\r\n\r\nCould it be that <strong>SERIAL MONOGAMY</strong> is at the root of all of our civilization's problems? Columnist DANIEL PINCHBECK is on the case.\r\n\r\nSwedish psych-pop wunderperson <strong>DUNGEN</strong> and Earth's finest living crooner <strong>RICHARD HAWLEY</strong> get to work in their respective kitchens. \r\n\r\n<em>Arthur</em> assembles its knights for a Round Table discussion on the gems worth checking out in <strong>THE GRATEFUL DEAD</strong>'s vast catalog. Up for the task are members of <strong>Animal Collective, Comets On Fire, Brightblack Morning Light</strong> and the <strong>Duna Records</strong> braintrust as well as <strong>Barry Smolin, Erik Davis, Michael Simmons, The Seth Man</strong> and <strong>Daniel Chamberlin</strong>. \r\n\r\n<strong>ALAN BISHOP of Sun City Girls</strong> speaks with Brandon Stosuy about terrorism, travel, clueless Americans and curating the cut-up world music collages of his <strong>Sublime Frequencies</strong> label.\r\n\r\nOliver Hall encounters <strong>AFRIRAMPO</strong>, Osaka's number one freedom paradise rock duo in downtown Los Angeles. Photography by W.T. Nelson.\r\n\r\nNew full-page comics by <strong>Keith Jones</strong> (\"Bacter-Area\"), <strong>Vanessa Davis</strong> (\"Preparation Information\"), <strong>Chris Wright</strong> (\"Letter to Rachel\") and <strong>David Lasky</strong> (\"Diary of a Bread Delivery Man\").\r\n\r\nNew artwork by <strong>John Lurie</strong>, <strong>Able Brown</strong> and <strong>Dennis Culver</strong>.\r\n\r\nAfter a controversial sabbatical, 85-year-old bluesman <strong>T-MODEL FORD</strong> returns to the counselor's desk.\r\n\r\nColumnist <strong>DOUGLAS RUSHKOFF</strong> wonders if some <strong>techniques of persuasion</strong> are so inherently wrong that they should never be used, no matter how noble the purpose.\r\n\r\n\"Bull Tongue\" columnists <strong>BYRON COLEY &amp; THURSTON MOORE</strong> review the latest emanations from the underground, including new stuff from Picks &amp; Lighters, Zaika, The Friday Group, Christina Carter/Andrew MacGregor, My Cat Is an Alien, <em>Sun Ra: The Immeasurable Equation</em> book, Richard Youngs, Andrew Paine, Alexander Neilson, Trinie Dalton, Vee Dee, Karate Party, Human Eye, Klyd Watkins, Charles Potts, Ex-Cocaine, Wayne Rogers, Marco Fursinato, Paul Metzger, <em>Paper Rodeo</em> mag, <em>Roktop</em> mag, <em>Modern Arf</em> mag, Kim Gordon, Thurston Moore, Leprechaun Gathering, Whysp, <em>French Sex Murders</em> dvd, <em>Dangerous Seductress</em> dvd, <em>Lady Terminator</em> dvd, Samara Lubelski, Bummer Road, Nemo Bidstrup, <em>Dream Magazine</em>,  zine, <em>Prague Literary Review</em>, La Societe des Timides a la Parade des Oiseaux, Legendary Pink Dots, Ka-Spel, Current 93, Kemialliset Ystavat, Maniacs Dream and Paul Flaherty/Chris Corsano.\r\n\r\nC &amp; D come to important understandings about new audio and video recordings, including new makings from Ween, Shel Silverstein, Devendra Banhart, Silver Jews, Sinead O'Connor, Terry Reid, The 88, Flamin Groovies, The Time Flys, Black Rebel Motorcycle Club, Chris Cunningham, Bjork, Birds (feat. Cotton Casino, ex-Acid Mothers Temple), August Born, Coco Rosie, Modey Lemon, Sonny Sharrock and Earthless, plus a quick look at the Dick Cavett <em>Rock Icons</em> DVD set featuring Sly &amp; the Family Stone, David Bowie and Janis Joplin.\r\n</big>","options":[{"id":1239051,"name":"Default","price":8.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261109/-/18coversmall.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261109/-/18coversmall.jpg","width":182,"height":220},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25329210/-/Peru11.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25329210/-/Peru11.jpg","width":480,"height":320}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297494,"name":"Arthur Issue #19 (Nov. 2005)","permalink":"arthur-issue-19","position":27,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-19","status":"active","on_sale":false,"created_at":"2009-05-12T20:49:11.000Z","description":"<big>\r\n\r\n<strong>Trinie Dalton</strong> finds out how blurry psych-art-rock <strong>ANIMAL COLLECTIVE</strong> make such beautiful, beguiling sounds. Photography by <strong>Susanna Howe</strong>. Plus: Deakin and Geologist on the \"best drug ever\": scuba diving.\r\n\r\n\"Dr. Moustache and the Egyptian Gentleman\": American journalist/photographer <strong>Daniel Chamberlin</strong> spent three weeks traveling through <strong>EGYPT, LEBANON and SYRIA</strong> this summer. Here's what happened, from the Cities of the Dead to the Hezbollah's gift shop.\r\n\r\nReviewer <strong>Gabe Soria</strong> says <strong>SHADOW OF THE COLOSSUS</strong> feels more like an epic-length stoner rock record than a video game. \r\n\r\n<strong>Eddie Dean</strong> remembers <strong>R.L. BURNSIDE</strong>.\r\n\r\nWhat our reaction to <strong>SUICIDE BOMBINGS</strong> tells us about ourselves, by columnist <strong>Douglas Rushkoff</strong>. Illustration by <strong>Dylan Martorell</strong>.\r\n\r\nFaced with death and destruction, there was only one choice: life. A complete story from cartoonist <strong>JAMES KOCHALKA</strong>'s new collection, <em>The Cute Manifesto</em>.\r\n\r\n\"There are a lot of ghosts and good avocado trees in Echo Park...\": A short story by <strong>Trinie Dalton</strong> from her new book <em>Wide Eyed</em>, with an illustration by Ian Holman. \r\n\r\n<strong>David Reeves</strong> on the secret powers of <strong>GINSENG</strong>..\r\n\r\nNew comics by <strong>Greg Cook</strong>, <strong>Kiersh</strong> and <strong>PShaw</strong>.\r\n\r\nNew artwork by <strong>Able Brown</strong>, <strong>Ernest Eugene Gibson</strong>, <strong>Nathaniel Russell</strong> and <strong>K-Fai Steele</strong>.\r\n\r\n\"Bull Tongue\" columnists <strong>Byron Coley &amp; Thurston Moore</strong> on Sunburned Hand of the Man, Jessica Rylan, Can't, The MVEE Medicine Show, PG Six, Charles Potts, the Loosers, Fag Tapes, Death Kcomm, Hair Police, Dead Machines, Virgin Insanity, Magik Markers, Sun City Girls, Eyes and Arms of Smoke, The Time Flys, Sean Meehan, Glass Organ, Sewer Election, Impregnable, Mahogany Brain, Chris Trouchon, John Wilkes Booze, Maniacs Dream, Fricara Pacchu, <em>Re-Visiting \"Father\" and the Source Family</em>,  Jack Rose, Paper Rad Collective, Leslie Keffer, The Assemble Head, 400 Blows, D Yellow Swans, Wooden Wand &amp; the Vanishing Voice, <em>The Recluse</em>, <em>Easter Everywhere</em>, <em>All Yesterdays' Parties The Velvet Underground in Print 1966-1971</em> and Ed Sanders. \r\n\r\n<strong>C &amp; D</strong> comment on new recordings from Vashti Bunyan, Jana Hunter, M.O.T.O., <em>Cult Cargo: Belize City Boil Up</em>, <em>Choubi Choubi! Folk &amp; Pop Sounds From Iraq</em>, <em>Radio Pyonggyang: Commie Funk and Agit Pop from the Hermit Kingdom</em>, Residual Echoes, Lightning Bolt, We Are Wolves, Boards of Canada, MF Doom &amp; Dangermouse, Fiery Furnaces, Van der Graaf Generator reissues, Unknown Instructors and Delia Gonzalez &amp; Gavin Russom.\r\n\r\n</big>","options":[{"id":1239046,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2261053/-/a19sml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2261053/-/a19sml.jpg","width":182,"height":217}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297407,"name":"Arthur Issue #20 (Jan. 2006)","permalink":"arthur-20","position":28,"price":50.0,"default_price":50.0,"tax":0.0,"url":"/product/arthur-20","status":"active","on_sale":true,"created_at":"2009-05-12T19:32:27.000Z","description":"<big>\r\nHow do the drone-metal bands <strong>EARTH</strong> and <strong>SUNN O)))</strong> get something out of nothingness? By <strong>Brian Evenson</strong>, with photography by W. T. Nelson. \r\n\r\n<strong>DAVID LYNCH</strong> talks about Transcendental Meditation with <strong>Kristine McKenna</strong>.\r\n\r\nSomewhere amidst the music-box plinkings, plangent strings and percolating drones of <strong>COLLEEN</strong>'s music is the Parisian Cecele Schott. <strong>John Adamian</strong> finds her.\r\n\r\nAmerican journalist/photographer <strong>Daniel Chamberlin</strong> concludes his travels in the Middle East with a journey through <strong>SYRIA</strong> and a return visit to <strong>EGYPT</strong>. \r\n\r\n<strong>NEW ORLEANS</strong> filmmaker <strong>Henry Griffin</strong> returns to the Ninth Ward. Illustrated by <strong>Arik Moonhawk Roper</strong>.\r\n\r\nMusician <strong>Alan Bishop</strong> listens to <strong>THE BUDDHA MACHINE</strong>.\r\n\r\nMaking money should really just be a happy result of contributing to the world what you do best, says columnist <strong>DOUGLAS RUSHKOFF</strong>.\r\n\r\nComics by <strong>Tom Hart, Jason Miles and David Lasky</strong>.\r\n\r\nBull Tongue columnists <strong>Byron Coley &amp; Thurston Moore</strong> review the latest emanations from the deep underground, including new jams from August Born, Ben Chasny &amp; Noel Von Harmonson, Telepathe, Child Abuse, D Yellow Swans, Inca Ore, Family Underground, <em>Mirage #4</em>, <em>Industrial Sabotage</em>, <em>The Recluse</em>, Calvin Johnson, Old Time Relijun, Selten-Ubel, Jeff Ladouceur, Nadia Moss, Lauren Naylor, Nate Young, King Brothers, Dirty Dynamite Gang, John Olson, Guam River, Dennis Tyfuss, Times New Viking, Double Leopards, White Rock, Jana Hunter/Devendra Banhart, Shackamaxon, Feathers and Kent Johnson. \r\n\r\n<strong>C &amp; D</strong> reason together about a bounty of new audio and video recordings from Tv on the Radio, Cast King, Nina Simone, Hisham Mayet, OOIOO, Pearls and Brass, The Fall, Tarantula A.D., Mi and L'au, Bjorn Olsson, Biff Rose and Lavender Diamond.\r\n</big>","options":[{"id":1238889,"name":"Default","price":50.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2260209/-/a20coversml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2260209/-/a20coversml.jpg","width":150,"height":178}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297399,"name":"Arthur Issue #21 (March 2006)","permalink":"arthur-issue-21","position":29,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-21","status":"active","on_sale":false,"created_at":"2009-05-12T19:28:42.000Z","description":"<big>\r\nAuthor <strong>Trinie Dalton</strong> catches up with the glamourous new age/punk artist/musician duo <strong>DELIA & GAVIN </strong> in Berlin. Photography by Hadley Hudson.\r\n\r\nBelief in <strong>RELIGION</strong> is a public health crisis, says columnist <strong>Douglas Rushkoff</strong>.\r\n\r\n <strong>David Reeves</strong> says it's not late to <strong>JOIN THE MILITARY</strong> before we come in for the big win in the end in Iraq. With an illustration by The Pizz.\r\n\r\nTwenty years ago, a German enthusiast traveled with rock 'n' roll legend <strong>TAV FALCO and his Unapproachable Panther Burns</strong> through an American South on the verge of vanishing. Text and photography by <strong>Richard A. Pleuger</strong>.\r\n\r\nHow blues rock thunder chooglers <strong>PEARLS &  BRASS</strong> found their sound in rural Nazareth, Pennsylvania. By <strong>Brian J. Barr</strong>. Photography by <strong>Maria Tessa Sciarrino</strong>.\r\n\r\nThe Center for Tactical Magic inaugurates a new column on <strong>APPLIED MAGIC</strong> with easy-to-do exercises in magical thinking, activating hidden forces and making presidents disappear. \r\n\r\n<em>If You See Something, Say Something</em>, a new poem by <strong>Michael Brownstein</strong> \r\n\r\n<em>Effigies of George</em> a new poem by <strong>Charles Potts</strong> \r\n\r\n<strong>Four pages of new comics by BEN JONES</strong>\r\n\r\n\"Rendition\" by <strong>Sharon Rudahl</strong> \r\n\r\n\"Strings: comics by <strong>PShaw</strong>.\r\n\r\n\"Bull Tongue\" columnists <strong>Byron Coley & Thurston Moore</strong> review 80 plus one significant emanations from the deep underground in 2005.\r\n\r\nAnd <strong>C &amp; D</strong> riff on new music by Mountains, Citay, The Duke Spirit, Isobel Campbell & Mark Lanegan, Beth Orton, Belle and Sebastian, and Sparks.\r\n</big>","options":[{"id":1238885,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2260161/-/a21cvr_small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2260161/-/a21cvr_small.jpg","width":150,"height":179}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297394,"name":"Arthur Issue #22 (May 2006)","permalink":"arthur-issue-22","position":30,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-22","status":"active","on_sale":false,"created_at":"2009-05-12T19:25:51.000Z","description":"<big>\r\n\r\nHow nature droners <strong>GROWING</strong> found their flow. By Peter Relic. Photography by Eden Batki.\r\n\r\nSwiss anthropologist-author <strong>JEREMY NARBY</strong> talks with Jay Babcock about what hallucinogens like LSD and the Amazonian drink ayahuasca have to teach us in the 21st century. Introduction by author Erik Davis, with a full-color illustration by Arik Moonhawk Roper.\r\n\r\nHow columnist <strong>DOUGLAS RUSHKOFF</strong> learned to stop worrying about current events.\r\n\r\nWhy power duo Al Cisneros and Chris Haikus reunited to make the meditation-suitable heavy metal sound of <strong>OM</strong>.\r\n\r\n\"Do the Math\" columnist <strong>David Reeves</strong> on the main reason why the USA should seal its border with Mexico.\r\n\r\nThe life, work and astounding impact of North Indian vocalist <strong>PANDIT PRAN NATH</strong>, guru to Western minimalists La Monte Young and Terry Riley. By Peter Lavezzoli.\r\n\r\n\"New Herbalist\" columnist Molly Frances on Lord Byron's secret elixir and the Prophet Muhammed's top condiment: <strong>VINEGAR</strong>.\r\n\r\nHow to recognize--and use--<strong>OCCULT FORCES</strong>, by the Center for Tactical Magic.\r\n\r\nNotes from <strong>Mardi Gras in New Orleans, 2006</strong> by the intrepid Gabe Soria.\r\n\r\nComics by Vanessa Davis, Chris Wright and PShaw.\r\n\r\nScenes from <strong>ArthurBall 2006</strong>, featuring Joanna Newsom, The 5:15ers (Joshua Homme &amp; Chris Goss) and Moris Tepper and Polly Harvey.\r\n\r\nBull Tongue columnists <strong>BYRON COLEY &amp; THURSTON MOORE</strong> review Richard Youngs, Pink Mountaintops, Parts &amp; Labor, Oneida/Plastic Crimewave, Ex Models, Mouthus, The Bummer Road, Idea Fire Company, Taurpis Tula, Spykes, <em>Ong Ong</em>, Carson Cistulli, Starbird, 2673, Ladderwoe, Tovah Olson, Pan Dolphinic Dawn, Gastric Female Reflex, <em>ANP Quarterly</em>, Matt Chambers, <em>The Colonial</em>, <em>Mineshaft</em>, Little Claw, Black Lips, Zaat, <em>Mystical Footprints of Asia</em>, Whysp, The Story, Skarerkauradio, Jerusalem &amp; the Starbaskets, Noise Nomads, <em>The Nightjar Review</em>, Shannon Ketch, Jeremy Rendina, <em>Carousel</em>, <em>Quantum Noise</em>, Lambsbread, Carlos Batts, Trenton Doyle Hancock, S.M.S.R., Tchernoblyad, Narrowmind, Sudanstrain, Blod, Sharon's Last Part, Mnem, Edwidge, The Rita, Mania, Ashtray Navigations, Evenings, Septic Sores, Bottom Dweller, Paul Metzger, Tombi and Glass organ. \r\n\r\n<strong>C &amp; D</strong> riff into the dawn on Marvin Gaye's <em>The Real Thing: In Performance, 1964-1981</em> dvd plus new albums from Gnarls Barkley, Rufus Harley, The Black Keys, The Raconteurs, Eagles of Death Metal, The Cuts, Future Pigeon, The Aggrolites, The Fiery Furnaces, Espers, Josephine Foster, Scott Walker, Fred Neil, Belong, Boris and Howlin Rain. \r\n\r\nPlus: <strong>Peter Relic's Book Corner</strong> spotlights new poetry collections by Alex Mitchell and John Tottenham.\r\n\r\n</bit>","options":[{"id":1238878,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2260117/-/a22cover-small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2260117/-/a22cover-small.jpg","width":150,"height":178}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297391,"name":"Arthur Issue #23 (May 2006)","permalink":"arthur-issue-23","position":31,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/arthur-issue-23","status":"active","on_sale":true,"created_at":"2009-05-12T19:22:38.000Z","description":"<i>(Just found a handful of fresh copies of this ish, previously thought to be sold out. — Jay)</i>\r\n\r\n<big>\r\n\r\nWho are <strong>BRIGHTBLACK MORNING LIGHT</strong> and how did they make one of the most beautiful albums of our time? Daniel Chamberlin catches up with the nomadic quiet-souls under a full moon in Joshua Tree. Photography by Eden Batki. \r\n\r\n<em>Arthur</em> asked <strong>GODSMACK</strong> singer Sully Erna to explain his pro-war statements and his No. 1 million-selling pop-rock band's involvement in military recruiting campaigns. Then things got stupid.\r\n\r\nGood riddance to bad rubbish: why <strong>DERRICK JENSEN</strong> wants civilization to end--now. Interview by Jay Babcock. Photography by Shayla Hason. \r\n\r\nAuthor Ed Halter on <strong>protesting inside online video games</strong>; plus a brief history of the heavy crossover between <strong>video game makers and the Pentagon</strong>. With illustrations by Geoff McFetridge.\r\n\r\nNew Herbalist columnist Molly Frances on the wonders of <strong>MINT</strong>. \r\n\r\n<strong>DOUGLAS RUSHKOFF</strong> on why he's not moving to Canada.\r\n\r\nComics by <strong>J.T. MILES</strong>.\r\n\r\nJohn Patterson on the little-seen, oft-suppressed work of dissident filmmaker <strong>PETER WATKINS</strong>.\r\n\r\nNew earfuzz tones and drones from New Orleans: Gabe Soria interviews the <strong>BELONG</strong> dudes. Arik Moonhawk Roper paints a picture. \r\n\r\n<strong>SIGILS, LOGOS & LUCKY CHARMS</strong>: how to recognize them and use them. By the Center for Tactical Magic. \r\n\r\n<strong>Survivalism for Hipsters 101</strong> by Dave Reeves \r\n\r\n\"Bull Tongue\" columnists Byron Coley & Thurston Moore review the latest emanations from the deep underground. \r\n\r\nC & D take multiple infusions of Comets on Fire, Vetiver, Awesome Color, <em>Zizek!, Beavis and Butthead Vol. 2, Phi Ta Khon: Ghosts of Isan, A Visit to Ali Farka Toure</em>, Tony Allen, <em>Eccentric Soul: The Big Mack Label</em>, James Hunter, Ramblin' Jack Elliot, Loren Connors, Charalambides and <em>The Golding Institute Presents Final Relaxation</em>.\r\n\r\n</big>","options":[{"id":1238871,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2260094/-/a23cover-small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2260094/-/a23cover-small.jpg","width":150,"height":180},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/57359533/-/arthur23mag.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/57359533/-/arthur23mag.png","width":529,"height":634}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297386,"name":"Arthur Issue #24 (Oct 2006)","permalink":"arthur-issue-24","position":32,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-24","status":"active","on_sale":false,"created_at":"2009-05-12T19:19:15.000Z","description":"<big>\r\nHow Comets on Fire and Howlin' Rain singer-guitarist <strong>ETHAN MILLER</strong> got his cosmic California yawp. By Trinie Dalton, with photography by Eden Batki. \r\n\r\nA History of <strong>ALL-AGES</strong>, Part 1: a chat with MC5 manager <strong>John Sinclair</strong>. By Jay Babcock, with artwork by Geoff McFetridge. \r\n\r\n<strong>DOUGLAS RUSHKOFF</strong>: The propaganda state attempted in 1930s Europe has finally reached fruition here in the US.A. Now what do we do?\r\n\r\nMaking clothes for fall from new <strong>BUILT BY WENDY</strong> patterns. Photography by Glynnis McDaris, modeling by Nicole Lombardi.\r\n\r\nChris Ziegler meets Los Angeles' fabulous liberation rockers <strong>SHARP EASE</strong>, with photography by Molly Frances. \r\n\r\n<strong>DAVE REEVES</strong>: Getting into it with Iran will be twice as fun as the party in Iraq! Just ask the British.\r\n\r\nScenes from a <strong>1967 LOVE-IN AT LOS ANGELES' GRIFFITH PARK</strong>, photographed by Seymour Rosen. Text by Kristine McKenna. \r\n\r\n<strong>COMICS</strong>: \"Mulberry Season\" by John Hankiewicz, \"Strings\" (now in full color) by Pshaw.\r\n\r\nThe Center for Tactical Magic on <strong>CELL PHONES, BLUETOOTHS AND MAGIC SPELLS</strong>. \r\n\r\nNew Herbalist Molly Frances goes cuckoo for the ultimate natural brain food: <strong>NUTS</strong> \r\n\r\n<strong>Byron Coley &amp; Thurston Moore</strong> on dozens of new excitements from the planetary underground, including work by Upset the Rhythm, Leopard Leg, T.I.T.S., Marcia Bassett &amp; Matthew Bower, Michael Bowman, Hello Trudi, Garry Davis, Dinosaurs, Baseball &amp; Hopscotch, Glen or Glenda, <em>Kapital Ink, Dumb Angel, Dream</em>, Genders, the Mall, <em>Sonic Transmission: Television, Tom Verlaine, Richard Hell</em>, Astral Blessing, Vanishing Voice, Outlaw Con Bandana, Eric Amling, Trash Ritual, Government Alpha, Genius Females, Circuit Wound, Emily Maguire, Impractical Cockpit, Fat Worm of Error, Ian Svenonius, Chris Kraus, Suicide, New York Dolls, <em>Patter</em>, Robert Amft, C.M. von Hasswolff, Aritoma Nishihara, Galaxie 500, Damon &amp; Naomi, <em>Lifespan</em>, <em>The Devil's Sword, So Wrong They're Right, Sonic Outlaws, Golden Digest</em> and <em>Trash Talking</em>. \r\n\r\n<strong>C &amp; D</strong> think as hard as they can about records by Akron/Family, Beach House, Mick Barr &amp; Zach Hill, The Horrors, Primal Scream, The USA Is a Monster, Wolf Eyes, The Thermals, Trainwreck Riders, The Black Keys, Buffalo Killers and Graham Coxon, as well as a new Blind Faith dvd, a new Byrds box set, the Numero Group's <em>Good God!: A Gospel Funk Hymnal</em> compilation and of course <em>Ed Rosenthal's Big Buds Calendar</em>. <em>...and much more</em>\r\n\r\n</big>","options":[{"id":1238866,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2260053/-/a24cover_small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2260053/-/a24cover_small.jpg","width":150,"height":180}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297383,"name":"SOLD OUT Arthur Issue #25","permalink":"arthur-issue-25","position":33,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/arthur-issue-25","status":"sold-out","on_sale":false,"created_at":"2009-05-12T19:16:07.000Z","description":"<big>\r\nAn epic-length profile of California harper <strong>Joanna Newsom</strong> by author Erik Davis, with exclusive photos of her geniushood by Eden Batki.\r\n\r\n<strong>\"Bog Venus vs. Nazi Cock-Ring: Some Thoughts Concerning Pornography\" by Alan Moore</strong>: a landmark eight-page essay/manifesto, with illustrations.\r\n\r\nChuck Dukowski (Black Flag, Chuck Dukowski Sextet) on the deeper, civilizational issues surrounding <strong>all-ages shows</strong>, illustrated by Geoff McFetridge</a> \r\n\r\nKyp Malone of TV on the Radio talks with Jay Babcock about <strong>directly confronting USA militarism</strong>.\r\n\r\n<strong>\"New Herbalist\" columnist Molly Frances</strong> on the roots of Christmas\r\n\r\n<strong>\"Do the Math\" columnist Dave Reeves</strong> on guns \r\n\r\nDouglas Rushkoff on visionary thinker <strong>Robert Anton Wilson</strong>...\r\n\r\nLisa Anne Auerbach's knitted sweaters photographed by Justine Kurland on the occasion of her show at White Columns\r\n\r\nNabob Shineywater (of Brightblack Morning Light) on musicians <strong>Sandy Bull</strong> and <strong>Hamza al-Din</strong>... \r\n\r\n<strong>Chris Ziegler</strong> on new albums by <strong>White Magic</strong> and <strong>Sunn O))) &amp; Boris</strong>... \r\n\r\n<strong>Byron Coley &amp; Thurston Moore</strong> on oodles of underground culture forms from Kommissar Hjuler &amp; Mama Bar, Silvester Anfang, R.O.T., Sammy Harkham's <em>Kramers Ergot</em>, <em>Private Stash</em>, <em>Comic Art</em>, <em>Arf Museum</em>, Drawing Hand, Alex Nielson, Alastair Gabraith &amp; Richard Youngs, Oren Ambarchi, Scott Horscroft, Hado Ho, Henry Kaiser, Noxagt, Ultralyd, S. Clay Wilson, Crown Now, Bone Rattle, Dreamhouse, the Halflings, M.O.A.C., Coco &amp; Fiend Friend Mononoke, Hello Trudi, Dave Newman, <em>Shuffleboil</em> edited by David Meltzer and Steve Dickinson, <em>Ong Ong</em>, Macronympha, C. Spencer Yeh, Jim O'Rourke, Two Dead Sluts One Good Fuck, Helios Creed, Outtakes, Sub City Girls, Trockeneis, Harrius, WZT Hearts, Michael Layne Heath, Wesley Eisold &amp; Charles Rowland, Carol Lewis &amp; Regine Polenz, Haunted George, Demon's Claws, The Golden Boys, Evil, Enema Syringe, Commando Laarz, Drap En Hund, Ports Bishop, Hurray, Timo van Luyk &amp; Kris Vanderstraeten, Sarah Becan, Jerusalem and the Starbaskets, Skarekraouradio, Child Pornography, Quem Quaeritis, Copper/Yellow, Mudsuckers, and Paul Flaherty/Chris Corsano/C. Spencer Yeh. \r\n\r\nA full-color page of \"Strings\" comics by PShaw... \r\n\r\n</big>","options":[{"id":1238858,"name":"Default","price":6.0,"sold_out":true,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2259985/-/A25cover_sm.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2259985/-/A25cover_sm.jpg","width":150,"height":180}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297375,"name":"Arthur Issue #26 (Sept. 2007)","permalink":"arthur-issue-26","position":34,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-26","status":"active","on_sale":false,"created_at":"2009-05-12T19:11:19.000Z","description":"<big>\r\n\r\nOld folks cry, young lovers smile and cynical hipsters get confused when she's onstage. What is <b>Lavender Diamond</b>'s peace-love-and-ecology frontlady BECKY STARK up to? \r\n\r\nThurston Moore & Byron Coley have an audience with <b>YOKO ONO</b>. Discussed: the Peace industry, Fluxus, Sarah Lawrence and her life/art before Lennon. Plus: \"Yoko Tanka,\" a review of Ono's recordings in <em>tanka</em> form. With photography by Eden Batki and a selection of vintage Ono photos. \r\n\r\nEver been harassed by a cop? Then you know <strong>how suicide bombers get made</strong>, says DAVE REEVES. \r\n\r\nColumnist DOUGLAS RUSHKOFF says <strong>9/11 CONSPIRACY THEORISTS</strong> are distracting many of our brightest minds from the ongoing horror show in plain view. \r\n\r\nJournalist Joel Rose visits 80-year-old Zen humorist/media innovator <strong>HENRY JACOBS</strong>. Plus, an appreciation of Jacobs' radio and TV work by filmmaker Mike Mills. \r\n\r\n<strong>DEERHOOF</strong> dude Greg Saunier spiels on the joy of all-ages gigs. Plus photos of <strong>DC's early punk scene</strong>, from by photographer Susie J. Horgan's <em>Punk Love</em> book. \r\n\r\nFashion!!! Fringe knitter <strong>TINA MARRIN</strong> works off the grid in her cozy, color wonderland. \r\n\r\nByron Coley remembers the <strong>SUN CITY GIRLS</strong>. \r\n\r\nColumnist <strong>MOLLY FRANCES</strong> hops on Miranda July's time machine to visit a land of seeded fruit. \r\n\r\nSoon the State will have Hummers with cannons that can heat up people's skin half a kilometer away. The Center for Tactical Magic has some more evolved ideas about mobilizing vehicles for change. Plus: <strong>what to do when cops really want to search your car</strong>. \r\n\r\nNew \"People Are Talking\" columnist Brian J. Davis on what <strong>SIMON COWELL</strong>, Secretary of Defense <strong>ROBERT GATES</strong> and <strong>KELLY CLARKSON</strong> have (respectively) been up to this summer. \r\n\r\nPShaw's \"Strings\": full-page comics in full color. \r\n\r\n\"Bull Tongue\" columnists Byron Coley &amp; Thurston Moore review the latest emanations from the deep underground. \r\n\r\nC & D drink beers and check out new records by Alan Vega, Magik Markers, Blues Control, Celebration, White Rainbow, Devendra Banhart, Daniel A.I.U. Higgs, Angels of Light, Wolves in the Throne Room and Marie Sioux. They also share their feelings about the <em>Faust IV</em> reissue and <em>The Source: The Untold Story of Father Yod, Ya Ho Wa 13 and The Source Family</em> book.\r\n\r\n</big>\r\n","options":[{"id":1238844,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2259953/-/cover_final26_sm.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2259953/-/cover_final26_sm.jpg","width":120,"height":150}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297368,"name":"Arthur Issue #27 (Dec 2007)","permalink":"arthur-issue-27","position":35,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-27","status":"active","on_sale":false,"created_at":"2009-05-12T19:08:05.000Z","description":"<big>\r\n\r\nI.F. \"Ian\" Svenonius</strong> files a field report on Baltimore psychedelic soul rock 'n' roll band <strong>CELEBRATION</strong>. Photography by Stacy Kranitz. \r\n\r\nPhotographer <strong>Abby Banks</strong> drove across America, visiting spaces occupied by groups of youngish refuseniks who've left behind America's grey gridlife. An exclusive excerpt from her new book, <strong><em>PUNK HOUSE</em></strong>.\r\n\r\nThe Sodfather, the Compost King, the Guru of Doo-Doo: <strong>Daniel Chamberlin</strong> talks shit with California's rhyming sultan of sod, <strong>TIM DUNDON</strong>. Photography by <strong>Eden Batki</strong>. \r\n\r\nBen can truly call him \"Al\": <strong>Six Organs of Admittance</strong>'s BEN CHASNY and <strong>Om</strong>'s AL CISNEROS manifest music, vibration and camaraderie in a conversation between the two. Visual interpretations by <strong>Arik Moonhawk Roper</strong>. \r\n\r\n<strong>Erik Davis</strong> catches up with <strong>SIR RICHARD BISHOP</strong>: gypsy picatrix, ex-Sun City Girl and guitarist extraordinaire. Illustration by <strong>John Coulthart</strong>. \r\n\r\nColumnist <strong>DOUGLAS RUSHKOFF</strong> wonders if an unplugged parenthood is still possible. Illustrated by <strong>Jack Pollock</strong>. \r\n\r\n<strong>RED SCARE!</strong> A glance back at early 20th century radicals <strong>Louise Bryant and John Reed</strong>: an essay with clothes. Styling by <strong>Jaclyn Hodes</strong>, photography by <strong>Annabel Mehrain</strong>. \r\n\r\nColumnist <strong>MOLLY FRANCES</strong> on cleaning house, clothes and body--without toxic chemicals. \r\n\r\nIf you're going to <strong>PROTEST</strong> something, do it right. <strong>The Center for Tactical Magic</strong> lights the way in their \"Applied Magic(k)\" column. \r\n\r\n<strong>SONNY HOPSON (\"The Mighty Burner\")</strong> (!) tells <strong>Peter Relic</strong> about <strong>JAMES BROWN</strong>. \r\n\r\n<strong>Nurse Periwinkle</strong> takes health questions from the crowd.\r\n\r\nAan update on what people are <em>really</em> talking about by columnist <strong>Brian J. Davis</strong>. \r\n\r\n\"I Get to Ask One Question\": new poem by <strong>MICHAEL BROWNSTEIN</strong> \r\n\r\nPShaw's \"Strings\": full-page comics in full color. \r\n\r\n<strong>PLASTIC CRIMEWAVE</strong> on three new histories from Process Media: <em>Eye Mind: The Saga of the 13th Floor Elevators, the Pioneers of Psychedelic Sound</em> by Paul Drummond, <em>Moondog: The Viking of 6th Avenue</em> by Robert Scotto and <em>The Source: The Untold Story of Father Yod, Ya Ho Wa 13 and The Source Family</em> by Isis Aquarian. \r\n\r\n\"Bull Tongue\" columnists <strong>BYRON COLEY &amp; THURSTON MOORE</strong> review the latest emanations from the deep underground. \r\n\r\nC &amp;D drink kratom smoothies and beer, run the fog machine and check out the <strong>\"ULTIMATE REALITY\" dvd by DAN DEACON &amp; JIMMY JOE ROCHE</strong>, the \"MANUFACTURED LANDSCAPES\" dvd, AC/DC's live/TV triple-dvd, an unearthed goodie by KAREN DALTON, and new records by WITCHCRAFT, BABYSHAMBLES, SOULSAVERS, TENDER FOREVER, MICHAEL HURLEY, PHOSPHENE RIVER, WOODEN SHJIPS, DRAGONS OF ZYNTH, YELLOW SWANS, EXPO '70, EXTRA GOLDEN, BRAD LANER and HEADDRESS. With artwork by Beth Hoeckel. \r\n\r\n</big>","options":[{"id":1238834,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0},{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2259913/-/a27cover_sm.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2259913/-/a27cover_sm.jpg","width":125,"height":150}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297364,"name":"Arthur Issue #28 (March 2008)","permalink":"arthur-issue-28","position":36,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-28","status":"active","on_sale":false,"created_at":"2009-05-12T19:01:08.000Z","description":"<big>\r\n\r\n\"The Woman Who Knows Too Much\": For over two decades, she has terrified and enraptured audiences with plague masses, homicidal love songs and sensational vocal and piano acrobatics. Meet <strong>DIAMANDA GALAS</strong>: avenging queen of the damned, obvious musical genius and the only person alive who's a fan of both Doris Day and Vlad the Impaler. By John Payne, with photography by Susanna Howe.\r\n\r\n\"Guerrilla Warfare\": What happens when bands play live where they're not supposed to? Paul Moody dissects the London <strong>GUERRILLA GIG</strong> scene of the early '00s spawned by <strong>the Libertines</strong>. Plus: <strong>No Age</strong>'s recent daylight guerrilla gig by the L.A. River, with photos by Joshua Pressman.\r\n\r\n\"Reign of Blood\": Erik Morse tells the amazing-but-true, blood-drenched story of how fictional pulp criminal <strong>FANTOMAS</strong> begat numerous classics of early cinema and inspired the most revolutionary art movements of the 20th Century.\r\n\r\n\"The Girls Who Fell To Earth\": Clothes make the alien. Photography and styling by Molly Frances and Mark Frohman.\r\n\r\n\"Do the Math\": When the Man went after Dave Reeves, Dave took notes. Here's <b>what you should know about LA County Men's Jail</b>: how to get in there, what to do while you're in, and so on...\r\n\r\n\"Applied Magic(k)\": <strong>How to use a magic wand</strong>, by The Center for Tactical Magic. \r\n\r\n<strong>Zodiac by Molly Frances</strong>: 2008 is a '1 year' in numerology. Time to draw up those blueprints for the future of you.\r\n\r\n\"The Analog Life\": The debut of a new column by <strong>ERIK DAVIS</strong> exploring cultural life outside the ascendant empire of the digital.\r\n\r\n\"21 Recently Discovered Delights\": <strong>Farmer Dave Scher</strong> waxes enthusiastic about aging, elliptical machines, using your left hand and more.\r\n\r\n\"Where'd You Get That Name 'Arthur' From?\": If you don't know, now you do. Art by <strong>Joseph Remnant</strong>. \r\n\r\n<strong>Plastic Crimewave</strong> salutes the late <strong>CHARLIE NOTHING</strong> \r\n\r\n\"Strings\" by <strong>PShaw</strong>: the final episode\r\n\r\n\"People Are Talking About\" by Brian J. Davis\r\n\r\n\"Bull Tongue\": Columnists <strong>Byron Coley &amp; Thurston Moore</strong> review the latest burps and gurgles from the deep underground.\r\n\r\nC &amp; D: Two pseudonymous know-it-alls get their comeuppance while still having the last word on new records by The Carbonas, Beach House, Cloudland Canyon, Clark, Earth, Dead Meadow, Graveyard, Monade, The Dirtbombs and a live one by Harmonia. <strong>Stephen Malkmus</strong> makes a cameo, discussing the meaning of golf.\r\n\r\n</big>","options":[{"id":1238813,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2259841/-/a28cover_sm.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2259841/-/a28cover_sm.jpg","width":125,"height":150}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297356,"name":"Arthur Issue #29 (May 2008)","permalink":"arthur-issue-29","position":37,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-29","status":"active","on_sale":false,"created_at":"2009-05-12T18:54:31.000Z","description":"<big>\r\n\r\n<strong>Chris Ziegler and Kevin Ferguson</strong> visit veteran sui generis pop duo <strong>SPARKS</strong> in L.A. as they prepare to perform their entire 20-album, 240-song oeuvre in a single three-week London engagement in May. “We’re actually better than we thought,” reveal the brothers Mael. Plus: an appropriately outsized Listener’s Guide to Sparks by <strong>Ned Raggett</strong>. With photography by <strong>Jeaneen Lund</strong>. \r\n\r\n<strong>ENDARKENMENT MANIFESTO</strong>: “The last agreeable year for us was 1941, the ideal is about 10,000 BC, but we’re not purists. We might be willing to accept steam power or hydraulics.” Arthur proudly presents poet/scholar <strong>Peter Lamborn Wilson</strong>’s half-serious proposal for a political movement to uphold and propagate the ideals of Green Hermeticism–the “coherent spiritual movement that constitutes the only imaginable alternative to unending degradation of Earth and humanity.” Wilson, using the pen name <strong>Hakim Bey</strong>, is the author of the <strong>Temporary Autonomous Zone</strong> concept, introduced in 1990… \r\n\r\nThe debut of “Advanced Standing,” a new column by <strong>Greg Shewchuk</strong> which asks, What if we thought of <strong>SKATEBOARDING</strong> as a mind-body practice? Illustration by <strong>Joseph Remnant</strong>. \r\n\r\n<strong>Joe O’Brien</strong> has a drink with <strong>RUDY WURLITZER</strong>, the legendary author (Nog, Quake, Flats), screenwriter (Two Lane Blacktop, Walker) and aimless wanderer. \r\n\r\nNew columnist <strong>NANCE KLEHM</strong> explains how to make <strong>dandelion wine</strong> and what to do with <strong>human pee</strong>. Illustration by <strong>Aiyana Udessen</strong>. \r\n\r\n<strong>DAVE REEVES</strong> on <strong>why we can’t let the President kill himself</strong>, with an illustration by <strong>Sharon Rudahl</strong>. \r\n\r\n<strong>TWO PAGES OF FULL-COLOR ARTHUR COMICS</strong>, edited by Buenaventura Press, featuring new comics by Anna Sommer, Matt Furie, Kevin Huizenga, Jeffrey Brown, Anders Nilsen, Al Columbia, Tim Hensley, C.F., Ted May, Souther Salazar, Tom Gauld, Jonathan Bennett, Helge Reumann, Lisa Hanawalt, Dan Zettwoch, P.W.E. and Simon Evans. \r\n\r\n“The Day Is Long”: <strong>SPRING FASHION</strong> on a Los Angeles afternoon, with photography and styling by <strong>Molly Frances</strong> and <strong>Mark Frohman</strong>. \r\n\r\nWhy you’ve always wanted to <strong>TALK TO PLANTS</strong>, and some of the best ways to do it, according to <strong>the Center for Tactical Magic</strong>. \r\n\r\nArtist <strong>Arik Roper</strong> on the art and inspiration of animator <strong>RALPH BAKSHI.</strong> \r\n\r\n“Bull Tongue” columnists <strong>BYRON COLEY &amp; THURSTON MOORE</strong> review choice finds from the deep underground including work by Jackie O Motherfucker, Cookie, Times New Viking, “Guitar Army” by John Sinclair, “Eye Mind: The Sage of Roky Erickson” by Paul Drummond, “Moondog: The Viking of 6th Avenue” by Robert Scotto, Uneven Universe, Mors Ontologica, Hall of Fame, Egypt Is the Magick #, Baretta, Log and Toilet, Toylit, Bill Nace, Daniel Higgs, Mouthus, Hive Mind, Aaron Dilloway, Psychatrone Rhonedakk, WFMU’s “The Best of LCD,” Ashtray Navigations, Slurp Dogs, Wally Shoup/Nels Cline/Greg Campbell, Wally Shoup/Chris Corsano/Paul Flaherty, Ghidra, “Ugly Things” No. 26, “Like, Misunderstood” by Rick Brown and Mike Stax, Sunburned Circle, Testicle Hazard, Trash Ritual, Chrome, “Duplex Planet” No. 180, San Francisco Water Cooler, Jorge Boerhringer/Core of the Coalman, Take Up Serpents, Usputuspud, Henry Kuntz, Opeye, “People Take Warning!” comp, Robert Martin and Bobb Trimble reissues. \r\n\r\nThe Magik Markers’ <strong>ELISA AMBROGIO</strong> waxes enthusiastic about Blake Bailey’s Richard Yates bio, Alex Nielson &amp; Richard Youngs, <em>Evolution of a Cromagnon</em> by John Joseph, Joshua Burkett, the Center for Constitutional Rights, Spectre Folk, Joan Acocella, VizUSA, Donovan Quinn, Luc Sante, Mick Turner, Colossal Yes, Mick Barr (Ocrilim), Buckingham/Nicks, Tony Rettman, Jason Wambsgans, Joe Carducci, Mick Flower, and Falk, California. Plus other stuff. \r\n\r\nThe fake economy’s parasitical relationship with the real economy isn’t going to last much longer, says columnist <strong>DOUGLAS RUSHKOFF</strong>. Illustration by <strong>M. Wartella</strong>. \r\n\r\nThe government is obsoleting analog television in February, 2009. <strong>ERIK DAVIS</strong> examines what we are losing. Illustration by <strong>Chris Rubino</strong>. \r\n\r\nNoisician/author <strong>Gabe Soria</strong> reports from New Orleans.\r\n\r\nSinger-songwriter-bandleader <strong>Stephen Malkmus</strong> updates us on <strong>OLIGARCHY ‘08</strong>.\r\n\r\n<strong>Plastic Crimewave</strong> memorializes the late great <strong>KLAUS DINGER</strong>. \r\n\r\n</big>","options":[{"id":1238771,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2259717/-/a29coversm.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2259717/-/a29coversm.jpg","width":125,"height":150}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297349,"name":"Arthur Issue #30 (July 2008)","permalink":"arthur-issue-30","position":38,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-30","status":"active","on_sale":false,"created_at":"2009-05-12T18:44:54.000Z","description":"<big>\r\n\r\nHow a brush with death, a haunted guitar and filmmaker Harmony Korine helped Spiritualized’s JASON (SPACEMAN) PIERCE wrestle a new album of narcotic gospel music into being. By Jay Babcock, with photography by Stacy Kranitz.\r\n\r\nIn an exclusive excerpt from his new book, legendary film director/author/poet ALEJANDRO JODOROWSKY (El Topo, Holy Mountain) reflects on his encounters with Zen teacher EJO TAKATA and Surrealist master LEONORA CARRINGTON in late-Sixties Mexico City.\r\n\r\nNANCE KLEHM salutes weeds—in particular, Artemesia vulgaris, aka mugwort.\r\n\r\nThe Center for Tactical Magic tells us HOW TO THROW A HEX—and why.\r\n\r\nGREG SHEWCHUK on how the continuous prospect of eating shit on a skateboard can keep you humble—and awake.\r\n\r\nERIK DAVIS takes a stand against Cory Doctorow-style iPodiphilia and other data processing-marketed-as-pleasure.\r\n\r\nA howl for America’s long-gone liberal media, by DAVE REEVES.\r\n\r\nNew work by poet MICHAEL BROWNSTEIN.\r\n\r\nPsychonaut lookers Guy Blakeslee, Paz Lenchantin and Derek James are THE ENTRANCE BAND. Salubriously styled by the singular ALIA PENNER.\r\n\r\nWriter-scholar EDDIE DEAN waxes lovingly about Argentinian bandoneon master Chango Spasiuk, American rock n roll band Howlin Rain, the Maryland Redbud Tree, the Olympic Hi-Fi Stereo Console and other stuff rubbing him right lately.\r\n\r\nComics artist Joseph Remnant on author Patrick Rosenkrantz’s gorgeous book of underground comix history.\r\n\r\nBull Tongue columnists BYRON COLEY &amp; THURSTON MOORE review choice finds from the deep underground.\r\n\r\nJULIAN COPE on an extraordinary art statement of cavernous Detroit Psychedelic soul.\r\n\r\nThe Melvins’ BUZZ “KING BUZZO” OSBORNE joins C &amp; D as they examine stuff by Endless Boogie, Al Green, Dennis Wilson, King Darves, Buffalo Killers, Hercules and Love Affair, Free Kitten, Arp, Awesome Color, Seun Kuti and Jex Thoth.  \r\n\r\nHEY BO DIDDLEY!: In Memorium by Plastic Crimewave.\r\n\r\n</big>","options":[{"id":1238748,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2259601/-/Untitled-1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2259601/-/Untitled-1.jpg","width":125,"height":150}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":297324,"name":"Arthur Issue #31 (Oct 2008)","permalink":"arthur-issue-31","position":39,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-issue-31","status":"active","on_sale":false,"created_at":"2009-05-12T18:30:31.000Z","description":"<big>\r\n\r\n<em>Cover photography by Lisa Law, design by Alia Penner</em> \r\n\r\nAuthor <strong>Trinie Dalton</strong> traveled into the wilds of New Mexico to live with psychedelic earthers <strong>BRIGHTBLACK MORNING LIGHT</strong> for two days. Sublimity ensued. Here's what happened. With photography by <strong>Lisa Law</strong>. \r\n\r\n<strong>Douglas Rushkoff</strong>: The mortgage and <strong>credit crisis</strong> wasn't merely predictable; it was predicted. And not by a market bear or conspiracy theorist, but by the people and institutions responsible. Illustration by Arik Moonhawk Roper. \r\n\r\n<strong>Dave Reeves</strong>: Having doubts about Iraq? <strong>America's Victory Is Infinite</strong>. Just look at Vietnam... \r\n\r\n<strong>Molly Frances</strong> on all sorts of delights in, from, or about <strong>Los Angeles</strong>--from Wallace Berman, Velaslavasay Panorama and Lily Tomlin in The Late Show to Show Cave, Nite Jewel and the new Flying Lotus album. Plus other, non-geographically specific stuff.\r\n\r\nOn May 10, 1968 <strong>SLY &amp; THE FAMILY STONE</strong> opened two shows for <strong>THE JIMI HENDRIX EXPERIENCE</strong> at the Fillmore East in New York City. Artist/scholar <strong>Plastic Crimewave</strong> reports on this extraordinary, little-known moment in American countercultural history. \r\n\r\n<strong>Greg Shewchuk</strong>: What is it about <strong>skateboarding</strong> that makes kids willing to break laws in order to do it? Illustration by Joseph Remnant. \r\n\r\n<strong>Nance Klehm</strong>: What to do with the nuts, seeds and berries you can find while <strong>foraging</strong> in the urban jungle. Illustration by Makeswell. \r\n\r\n<strong>The Center for Tactical Magic</strong>: Do the ends ever justify the <strong>magic(k)</strong>? Illustration by Cassandra Chae. \r\n\r\n<strong>Erik Davis</strong>: Is the \"planetary consciousness\" of neotribal <strong>psytrance gatherings</strong> like Portugal's Boom festival just window dressing for the same old hedonism and escapism--or could it actually be what it says it is?\r\n\r\nA centerfold of new <strong>ARTHUR COMICS</strong> by Jeffrey Brown, Charles Burns, Al Columbia, P.W.E., Simon Evans, Matt Furie, Tom Gauld, Lisa Hanawalt, Joseph Hanks, Tim Hensley, Ted May, Anders Nilsen, Laura Park, Helge Reumann, Souther Salazar, Julia Wertz and Dan Zettwoch. Edited by Buenaventura Press. \r\n\r\n<strong>STYLE</strong>: Annakim Violette, glampire vamp, tells an arachnid tale from a rainbow's underbelly. Styled by Miss KK, with photography and design by Alia Penner. \r\n\r\n<strong>BYRON COLEY &amp; THURSTON MOORE</strong> review choice finds from the deep underground.\r\n\r\nC and D let it rip about the <em>Fela!</em> musical plus new albums by Hacienda, Megapuss, Little Joy, Kasai All-Stars, Grouper, Natacha Atlas, Matt Baldwin, Mercury Rev, Desolation Wilderness, Gang Gang Dance, Raglani, Jonas Reinhardt, Apse and Eagles of Death Metal.\r\n\r\n</big>","options":[{"id":1238696,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2259421/-/A31cover2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2259421/-/A31cover2.jpg","width":125,"height":150}],"artists":[],"categories":[{"id":251755,"name":"Back Issues","permalink":"back-issues","url":"/category/back-issues"}]},{"id":299845,"name":"Arthur T–Shirt, designed by Maya Hayuk","permalink":"arthur-t–shirt-designed-by-maya-hayuk","position":40,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/arthur-t–shirt-designed-by-maya-hayuk","status":"sold-out","on_sale":true,"created_at":"2009-05-15T19:10:50.000Z","description":"<p><em>T&#8211;Shirt designed by <a href=\"http://www.mayahayuk.com\">Maya Hayuk </a></em><a href=\"http://www.mayahayuk.com\"> </a></p>\r\n\r\n<p>\"Mallard's-head-and-reindeer-pummel on a rainbow dagger\"</p>\r\n\r\n<p>Printed on Asphalt Gray American Apparel Shirt.</p>","options":[{"id":1246525,"name":"XS","price":18.0,"sold_out":true,"has_custom_price":false},{"id":1246551,"name":"L","price":18.0,"sold_out":true,"has_custom_price":false},{"id":9056331,"name":"Small","price":18.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2284237/-/ArthurMaya.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2284237/-/ArthurMaya.jpg","width":800,"height":716}],"artists":[],"categories":[{"id":249572,"name":"T-Shirts","permalink":"t-shirts","url":"/category/t-shirts"}]},{"id":298765,"name":"\"No Magic Man\" cd by Sunburned Hand of the Man (2nd printing)","permalink":"sunburned-hand-of-the-man-no-magic-man","position":41,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/sunburned-hand-of-the-man-no-magic-man","status":"active","on_sale":false,"created_at":"2009-05-14T08:46:52.000Z","description":"<big>\r\nSunburned Hand of the Man\r\n\"No Magic Man\"\r\n(ARTHUR 002)\r\n\r\n\"We've got the closest thing to a high fidelity release  here from the   confirmed kings of the under-the-counter-culture, Sunburned Hand Of  The  Man. No Magic Man comes courtesy  of Arthur magazine's new audio imprint  and it bundles a  selection of some of Sunburned's most punishingly rhythmic   heart-punches to date. There are pieces  here that sound like Pete Cosey-era   Miles cut up with  Lhasa street song and stand-up stonerskits, while others   make out like the logical Heavy Metal  extension of Tony Williams' experiments   with electricity  as part of Lifetime alongside guitarist  John McLaughlin    and organist Larry Young. Guitarist Marc Orleans can generate kandy korn cartwheels as well as The Magic Band's  Jeff Cotton and combined with Rob Thomas's bass, the  two provide a steam-rolling backline that various  drummers  -- John Moloney, Phil Franklin -- work to bolster and undermine. Much of   No Magic Man is possessed of  a uniquely squelchy analog bottom end and between   tracks there are some wowing cut-ups from various  found sources that add  a beautiful veneer of mystic shit  to the already precariously dosed proceedings.\"   -- David Keenan, <b>The Wire</b> (May 2005)  </font>\r\n\r\n\r\n<p><b></b><b></b><b></b><b> <font face=\"Helvetica, Arial, sans-serif\">\"Finally   they give us what we want... Essential to those interested in the band...    Wicked funk grooves and trancey  drone-outs... No Magic Man  is a fitting   rival for 'Jaybird,' 'Wild Animal,'  and 'Headdress'  as best Sunburned Hand   of the Man release. Rating: 12/12\"  -- Jim Steed, <b>fakejazz.com</b> </font></b></p> <b> </b><b></b><b>   </b><b>                                      </b>  \r\n\r\n\r\n\r\n<p><b></b><b></b><b></b><b> <font face=\"Helvetica, Arial, sans-serif\">A collection   of all-new, all-weather nighttime     sounds from one of the greatest tellin'-it-like-it-is, <i>Apocalypse   Later!</i>    bands around right now. \"No Magic Man\" is specifically designed   for those     with chronic cases of peek-a-boo, long eye and post-election   stress disorder.     12 reports from the never-ending ritual running just   under an hour, this    is the next page in the Book of Sunburned, and it's   yours!<br /> <br /> \r\n\r\nTrack listing for \"No Magic    Man\":<br /> <br /> 1. every direction<br /> 2. the 1st Degree<br /> 3. Flying Colours<br /> 4. the air itself<br /> 5. NO MAGIC MAN<br /> 6. Stoneboat<br /> 7. Yer Own Eyes &amp; the   Number    None<br /> 8. Nile High<br /> 9. Serpent's wish<br /> 10. The Twin Gates<br /> 11. Gather 'Round</font><br /> <br /> \r\n\r\nCover  artwork by Robert Thomas of Sunburned.<br /> \r\n\r\nSecond printing of 1000.<br />\r\n\r\n","options":[{"id":1243445,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2272893/-/bastet0004.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2272893/-/bastet0004.jpg","width":250,"height":251}],"artists":[],"categories":[{"id":249569,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2581344,"name":"\"Two Million Tongues\" curated by Plastic Crimewave (2005)","permalink":"sold-out-two-million-tongues-curated-by-plastic-crimewave","position":42,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/sold-out-two-million-tongues-curated-by-plastic-crimewave","status":"active","on_sale":false,"created_at":"2010-05-20T08:06:58.000Z","description":"43 copies left and then they're all gone, freaks...\r\n\r\nTrack listing:\r\n\r\n1. MOUNTAINS - \"Speaking\"\r\n2. NO NECK BLUES BAND - \"Pulse\"\r\n3. MIMINOKOTO - \"Tokedasu\"\r\n4. TIM KINSELLA & AMY CARGILL - \"Song for Josh\"\r\n5. MICHAEL CHAPMAN - \"The Northern Lights\"\r\n6. JOSEPHINE FOSTER - \"Wondrous Love\"\r\n7. CHRIS CONNELLY - \"Pray'r\"\r\n8. PEARLS AND BRASS - \"Waterfall\"\r\n9. TRAVELING BELL - \"Apparitions\"\r\n10. THE SINGLEMAN AFFAIR - \"Good to Be With You Again\"\r\n11. JACK ROSE - \"Hey Fuck You Rag\"\r\n12. TAR PET - \"Takeit Heri\"\r\n13. BIRDSHOW - \"Pilz\"\r\n14. TONY CONRAD - \"Bowstring 1\"\r\n15. HOTOTOGISU - \"Blues for Steve K\"\r\n16. HAPTIC - \"Indifference -> Building On Fire\"\r\n17. LUX - \"Need Fade In + Out\"\r\n18. HARDSCRABBLE - \"Sail It Away\"\r\n\r\nCommemorates the second annual Plastic Crimewave-curated, Galactic Zoo Dossier/Arthur-presented Million Tongues festival at the Empty Bottle in Chicago, November 3-6, 2005. \r\nTrack selection, art and lettering by Plastic Crimewave.\r\nLimited edition of 1,000 copies in jewelcase, released through Arthur's \"Bastet\" imprint. \r\n","options":[{"id":9146987,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24857843/-/Bastet006.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24857843/-/Bastet006.jpg","width":350,"height":347},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24894457/-/miltonguescdbk.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24894457/-/miltonguescdbk.jpg","width":480,"height":421}],"artists":[],"categories":[{"id":249569,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2581346,"name":"\"Bread, Beard and Bear's Prayers\" curated by Ethan Miller (2006)","permalink":"sold-out-beards-bears-and-prayers-curated-by-ethan-miller","position":43,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/sold-out-beards-bears-and-prayers-curated-by-ethan-miller","status":"active","on_sale":false,"created_at":"2010-05-20T08:08:34.000Z","description":"Thirteen gnarly tunes gathered from high and low by ETHAN MILLER of COMETS ON FIRE and HOWLIN RAIN back in 2006. \"For lovers of bloody nose street folk, dangerous shit rock, drunken cosmic slop and those wandering down the outer and under paths alone.\"\r\n\r\nTrack listing:\r\n\r\n1  \tAlbert Ayler   -    Truth Is Marching In  \t \t\r\n2 \tMonoshock  -  \tCrypto-Zoological Disaster \t\t\r\n3 \tThe Colossal Yes  -  \tThe Honey Creeper Smiles \t\t\r\n4 \tGhost  -  \tPiper \t\t\r\n5 \tElectric Six Organs Of Admittance  -  Close To The Sky \t\t\r\n6 \tMichael Yonkers  -  \tSwamp Of Love \t\t\r\n7 \tShit Spangled Banner  -  \tCuntshine \t\t\r\n8 \tBrother JT  -  Country Blues/Be With Us (live) \t\t\r\n9 \tJoshua  -  Look Floating \t\t\r\n10 \t7 Year Rabbit Cycle  -  Meditation \t\t\r\n11 \tAugust Born [Six Organs and L collaboration]  - Providence \t\t\r\n12 \tDark Inside The Sun  -  Truly Cursed \t\t\r\n13 \tComets On Fire  -  Death Squad \r\n\r\nCover artwork by Rob Fisk.","options":[{"id":9146992,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24857871/-/bastet0005.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24857871/-/bastet0005.jpg","width":252,"height":221}],"artists":[],"categories":[{"id":249569,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2553095,"name":"SOLD OUT \"Tuff Wizard\" T-shirt by Arik Moonhawk Roper","permalink":"blue-tuff-wizard-t-shirt-by-arik-moonhawk-roper","position":44,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/blue-tuff-wizard-t-shirt-by-arik-moonhawk-roper","status":"sold-out","on_sale":true,"created_at":"2010-04-29T23:00:14.000Z","description":"Design by Arik Moonhawk Roper. Dark (forest) green ink on light (cactus) green (980 Anvil 4.5 oz. Ringspun Cotton Fashion Fit). These shirts run a little small so be generous when guessing what size you want. Also, they're thicker than most T-shirts these days. Built to last, buddy.","options":[{"id":9093942,"name":"Small -  Dark (forest) green ink on light (cactus) green (980 Anvil 4.5 oz. Ringspun Cotton Fashion Fit)","price":18.0,"sold_out":true,"has_custom_price":false},{"id":9085532,"name":"Medium - Dark (forest) green ink on light (cactus) green (980 Anvil 4.5 oz. Ringspun Cotton Fashion Fit)","price":18.0,"sold_out":true,"has_custom_price":false},{"id":9085535,"name":"Large - Dark (forest) green ink on light (cactus) green (980 Anvil 4.5 oz. Ringspun Cotton Fashion Fit)","price":18.0,"sold_out":true,"has_custom_price":false},{"id":9093941,"name":"XL -  Dark (forest) green ink on light (cactus) green (980 Anvil 4.5 oz. Ringspun Cotton Fashion Fit)","price":18.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.0,"amount_with_others":3.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24697352/-/greenwiz.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24697352/-/greenwiz.jpg","width":400,"height":494}],"artists":[],"categories":[{"id":249572,"name":"T-Shirts","permalink":"t-shirts","url":"/category/t-shirts"}]},{"id":2581341,"name":"SOLD OUT - \"Million Tongues\" curated by Plastic Crimewave (2004)","permalink":"sold-out-million-tongues-curated-by-plastic-crimewave","position":45,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/sold-out-million-tongues-curated-by-plastic-crimewave","status":"sold-out","on_sale":false,"created_at":"2010-05-20T08:06:03.000Z","description":"","options":[{"id":9146983,"name":"Default","price":12.0,"sold_out":true,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24857811/-/millionton.gif","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24857811/-/millionton.gif","width":280,"height":264}],"artists":[],"categories":[{"id":249569,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2581339,"name":"SOLD OUT - \"The Libations of Samhain\" by SUNN O)))  (2004)","permalink":"sold-out-the-libations-of-samhain-by-sunn-o","position":46,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/sold-out-the-libations-of-samhain-by-sunn-o","status":"sold-out","on_sale":false,"created_at":"2010-05-20T08:03:27.000Z","description":"The second release on the Bastet (now Arthur) label was a Sunn o))) live recording in an edition of 500 entitled “The Libations of Samhain” with a cover by Savage Pencil, specially pressed by the genius W.T. Nelson, released in 2004. The Libations of Samhain is a live album released by Sunn O))). The first track is a live performance in London, on Halloween  2003 and the second is an interview by Savage Pencil and Sharon Gal, originally broadcast on London's Resonance FM 104. \r\n\r\nTrack listing:\r\n1. \t\"The Libations of Samhain\"   \t49:00\r\n2. \t\"Sunn O))) vs Diggers\"   \t16:05","options":[{"id":9146962,"name":"Default","price":12.0,"sold_out":true,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24857711/-/bastet0002.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24857711/-/bastet0002.jpg","width":300,"height":298}],"artists":[],"categories":[{"id":249569,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":300328,"name":"SOLD OUT \"The Invasion of Thunderbolt Pagoda\" by Ira Cohen & Angus Maclise dvd","permalink":"i","position":47,"price":29.95,"default_price":29.95,"tax":0.0,"url":"/product/i","status":"sold-out","on_sale":false,"created_at":"2009-05-16T05:01:09.000Z","description":"IRA COHEN\r\nTHE INVASION OF THUNDERBOLT PAGODA DVD\r\n\r\nSOLD OUT!!\r\n\r\n<a href=\"http://www.youtube.com/watch?v=xOWWhPzkwL8\">Youtube preview</a>\r\n\r\n<p> Celebrated internationally for more than 35 years, Ira Cohen&#8217;s legendary 1968 film <i>The Invasion of Thunderbolt Pagoda</i> is brought to you by ARTHUR as a fully restored director&#8217;s cut DVD. Featuring more than two hours of ritual hallucination and primordial sounds, <i>Invasion</i> is a psychedelic bullet to your third eye, made possible by Arthur Magazine in collaboration with The Ira Cohen Akashic Project and UNIVERSAL MUTANT.</p>\r\n\r\n<p> Ira Cohen says: &#8220;It was in 1968, the year before Woodstock, between the giant bottle of liquid mercury Tony Conrad found in a doorway on 42nd St. and the Mylar chamber, we experienced a shared voyage conceived in three parts: The Opium Dream, Shaman and Heavenly Blue Mylar Pavilions, an alchemical journey born of out common consciousness &#8212; culminating in the akashic bindu drop swirling in the sky&#8217;s reflected azure. No minimalism here, but a maximalist adventure . . .&#8221; </p>\r\n<p> <center><b>DVD FEATURES</b></center> </p>\r\n<p> * High-quality transfer from the original 16mm film, with color correction supervised by the director </p>\r\n<p> * The legendary soundtrack, newly remastered by Tim Barnes, featuring The Universal Mutant Repertory Company (Loren Standlee, Ziska Baum, Angus MacLise, Hetty MacLise, Raja Samayana, Tony Conrad, Henry Flynt and Jackson MacLow) </p>\r\n\r\n<p> * Two new, never-before-released alternative soundtracks to &#8220;Invasion&#8221; by Sunburned Hand of the Man and Acid Mothers Temple SWR (Tsuyama Altsushi, Yoshida Tatsuya and Kawabata Makoto) </p>\r\n<p> * 16-page commemorative booklet featuring mylar photography and poetry by Ira Cohen and Angus MacLise, and critical texts by Ian Macfadyen and Allan Graubard </p>\r\n<p> * &#8220;Brain Damage,&#8221; a new film directed by Ira Cohen and produced by Saturnalia created from never-before-seen original 16mm outtakes, featuring a new soundtrack composed by Will Swofford with the Expanded Instrument System</p>\r\n<p> * &#8220;From The Mylar Chamber,&#8221; an original slideshow of 60 mylar photographs with soundtrack by Angus MacLise and original poetry by Ira Cohen. </p>\r\n\r\n<p> * Director&#8217;s Commentary track by Ira Cohen </p>\r\n<p> <center><b>ABOUT &#8220;INVASION&#8221;&#8230;</b></center> </p>\r\n<p> &#8220;Long, Strange Trip for a Hypnotic Film&#8221;: <b><a href=\"http://www.arthurmag.com/magpie/?p=1420\" onclick=\"\">New York Times</a></b> on the making of the film and DVD </p>\r\n<p> &#8220;Underground film maker, poet, photographer and multimedia shaman Ira Cohen has finally realised his 1968 masterpiece on DVD.&#8221;&#8211;Edwin Pouncey in <b><a href=\"http://www.thewire.co.uk/current/cross.php\" onclick=\"javascript:pageTracker._trackPageview('/outbound/article/www.thewire.co.uk');\">The Wire (Sept. 2006)</a></b> </p>\r\n\r\n<p><b>J. Hoberman in the Mar. 16, 2006 Village Voice</b>: &#8220;Part &#8216;Dr. Strange,&#8217; part &#8216;Inauguration of the Pleasure Dome,&#8217; ['The Invasion of Thunderbolt Pagoda' is] so High &#8217;60s that you emerge from its 20-minute vision perched full-lotus on a cloud of incense, chatting with a white rabbit and smoking a banana&#8230;. &#8216;Invasion&#8217; is a languidly opiated costume ball in which an assortment of masked and painted bohos, some sporting outsize elf ears, loll about a candlelit, Mylar-lined set, blowing soap bubbles and nibbling majoon. &#8230;In lieu of action, Cohen uses all manner of superimposition and prismatic image-splitting; his big effect, however, is the deliquescent Mylar reflection. What saves &#8216;Invasion&#8217; from preciosity is the vague menace of Angus MacLise&#8217;s improvised pan-piping, tabla-tapping, creature-yipping score. Although this masterpiece of Tibetan-Moroccan-Druidic trance music was reissued on CD several years ago, it truly blossoms in conjunction with the exotic smorgasbord served at Cohen&#8217;s psychedelicatessen.&#8221; </p>\r\n\r\n<p> <br />\r\n","options":[{"id":1248822,"name":"Default","price":29.95,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":10.0,"amount_with_others":10.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2298685/-/invasion.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2298685/-/invasion.jpg","width":240,"height":336},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2298701/-/InvPagodaDVD08.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2298701/-/InvPagodaDVD08.jpg","width":164,"height":132},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2298709/-/InvPagodaDVD02.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2298709/-/InvPagodaDVD02.jpg","width":164,"height":132},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2298721/-/InvPagodaDVD05.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2298721/-/InvPagodaDVD05.jpg","width":164,"height":132},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2298705/-/InvPagodaDVD09.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2298705/-/InvPagodaDVD09.jpg","width":164,"height":131}],"artists":[],"categories":[{"id":251756,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]},{"id":301356,"name":"SOLD OUT \"Paradise Now: The Living Theatre in Amerika\" DVD","permalink":"paradise-now","position":48,"price":22.95,"default_price":22.95,"tax":0.0,"url":"/product/paradise-now","status":"sold-out","on_sale":false,"created_at":"2009-05-18T01:19:40.000Z","description":"<a href=\"http://www.scdistribution.com/release.html?catalog=SAINTARTH003&class=title\">Note: We are sold out of this DVD, but you can still order it from Secretly Canadian Distribution. Click here for info!</a>\r\n\r\n<big>\r\nPARADISE NOW: The Living Theatre in Amerika DVD   \r\nIn 1968 The Living Theatre, an anarcho-communalist troupe led by Julian Beck and Judith Malina, returned to America from years of self-imposed exile in Europe with what would become their best-known production: “Paradise Now,” a play that sought to completely dissolve the boundaries of human interactions through a practice of live collective creation, forging a revolutionary harmony between actors and audience. “The purpose of the play is to lead to a state of being in which non-violent revolutionary action is possible,\" wrote Julian, and he meant it. What happened each night onstage—and offstage, and then out into the streets—was a series of purposefully provocative and interventionist actions, from marijuana smoking and full-body group nudity to screamed declamations, intense arguments and (yes) orgies, often involving audience members. This dvd and accompanying booklet featuring rare films and documents from this period in the Living Theatre's history. \r\n\r\n“PARADISE NOW” (b/w, 49 min, 1969)\r\nA film by Marty Topp, produced by Ira Cohen\r\nFilmmaker Marty Topp followed the Living Theater as they outraged and inspired their way across America; his intense film collages and distills their performances into a poetic documentary that mirrors the radicality and sheer full-onness of the Living Theatre's rites of outrage, liberation and communion. With music by Jilala, MC5 and others. \r\n\r\n“EMERGENCY: THE LIVING THEATRE” (color, 34 min, 1968)\r\nThis little-seen documentary film by filmmaker Gwen Brown combines footage of Living Theatre productions Mysteries, Paradise Now, and Frankenstein with interviews with Living Theatre members and behind-the-scenes production footage. See the LT interact with the press, build scenes and stages, and practice being free.\r\n \r\n36-PAGE FULL-COLOR MAGAZINE BOOKLET including texts by Antonin Artaud, Allan Graubard, Julian Beck, Judith Malina, Ira Cohen, Don Snyder, photographs, stills from the films, ephemera and much more \r\n\r\nTWO DOUBLE-SIDED 14x19 POSTERS: THE MAP OF PARADISE (as drawn by Julian Beck) and AN INFRARED ODYSSEY (photographs by Don Snyder from \"Paradise Now\" at Brooklyn Academy of Music, 1968)   \r\n\r\nVIDEO INTERVIEWS with directors Julian Beck, Judith Malina, Hanon Reznikov, company member Steve Ben Israel, and producer Ira Cohen\r\n\r\n \"LOVE & POLITICS\": an introduction to the themes and personalities at the heart of the work of The Living Theatre, including scenes from The Living Theatre's repertory and poems and texts by Malina, Reznikov and Julian Beck. With an introduction by Ira Cohen.   \r\n\r\nFULL THEATRICAL SCRIPT SLIDESHOW of Paradise Now, as written down by Julian Beck and Judith Malina, documenting more than 100 performances of “Paradise Now” \r\n\r\nMYSTIC FIRE GALLERY: excerpts from Living Theatre documentaries including Sheldon Rochlin's \"Signal Through the Flame\"  \r\n\r\n\"THE SPINNING WHEEL\" by Steve Ben Israel: a soundtrack to EMERGENCY sourced from agit-prop radio broadcasts \r\n\r\n\"THE PERMANENT REVOLUTION: CHANGE!\" (color, 19 min, 2007) a film by Will Swofford and Georg Gatsas. In August 2007, The Living Theatre restaged “Paradise Now” in New York's Union Square to mark the 80th anniversary of the execution of anarchists Sacco and Vanzetti wrongly convicted for murder. This film documents the event.\r\n\r\n  CRITICAL PRAISE FOR THIS DVD\r\n\"A riveting return to a revolutionary moment in art and life. Powerful and inspiring. A real gift to us all.\" —Gene Youngblood, author of Expanded Cinema, Co-editor, Los Angeles Free Press, 1967-70 \r\n\r\nCRITICAL PRAISE FOR THE FILM “PARADISE NOW”\r\n“Like an astonishing portion of the country's popular music, the spectacles of The Living Theater proved to be in content and form outside the social system--not structured by it nor, except as outlet, implementing it: liberated territory.”\r\n—Stefan Brecht, The Drama Review number 43: Spring 1969 \r\n\r\n“Joyous, brutal, exploding with the kinetic energies of psychic catharsis…Marty Topp's PARADISE NOW has captured the essence of this extraordinary theatrical experiment. It is unquestionably one of the finest artistic documentaries to come out of the United States cinema. Its heartfelt sincerity should be sheer inspiration to the many young people throughout the country who are struggling to make meaningful and influential work.  It is the reverberation of a crucially important message that must not be neglected, for the consequences are too terrible to endure. Marty Topp's achievement is not just in the making of a great film, but in making us remember again, Paradise as a reality.”\r\n—Don Snyder, July 1970, East Village Other  \r\n\r\n PRAISE FOR “EMERGENCY!”\r\n“The fusion of Brown's freewheeling direct cinema and the Living Theatre's performance for revolutionary change (amidst the heydays of both) unite as a dynamic concoction of the era, yielding for the viewer a shifting terrain of both critical insight and ecstatic zeal, not as a vacant nostalgia for a pre-commodified radicality, but as tactical inspiration for future days.” —Andrew Wilson of Artist's Access Television \r\n\r\n</big>","options":[{"id":1252402,"name":"Default","price":22.95,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":10.0,"amount_with_others":7.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2298793/-/paradvd_sm.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2298793/-/paradvd_sm.jpg","width":550,"height":762},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/28544927/-/paradisenownewhaven.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/28544927/-/paradisenownewhaven.jpg","width":350,"height":291},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2298817/-/miniposter.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2298817/-/miniposter.jpg","width":1000,"height":832},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2298805/-/living_theatre.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2298805/-/living_theatre.jpg","width":391,"height":310}],"artists":[],"categories":[{"id":251756,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]},{"id":299850,"name":"SOLD OUT Arthur Benefit Party 2007 Poster, by Alia Penner","permalink":"arthur-benefit-party-2007-poster-by-alia-penner","position":49,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/arthur-benefit-party-2007-poster-by-alia-penner","status":"sold-out","on_sale":false,"created_at":"2009-05-15T19:16:35.000Z","description":"<p><b> Arthur Benefit Party 2007 by <a href=\"http://www.aliapenner.com\">Alia Penner</a></b></p> </center>\r\n\r\n\r\n<p>\t Printed on 18x24 in 100 lb poster stock. Mailed in a sturdy tube. <br /> Edition of 100.<br /> </p>\r\n\r\n","options":[{"id":1246562,"name":"Default","price":5.0,"sold_out":true,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.0,"amount_with_others":4.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":7.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2284281/-/arthur_benefit_party_2007-1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2284281/-/arthur_benefit_party_2007-1.jpg","width":352,"height":621}],"artists":[],"categories":[{"id":249571,"name":"Posters","permalink":"posters","url":"/category/posters"}]}]