[{"id":121293,"name":"Issue # 2-Re-Defining Girl-","permalink":"issue-2-re-defining-girl","position":1,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/issue-2-re-defining-girl","status":"active","on_sale":false,"created_at":"2008-07-03T05:49:02.000Z","description":"This issue ranks in at 50 pages, hosting multiple contributors (featuring zine queens, DIY business-woman heroines, and lovely grrrls-and boy- from around the world). Originally, Re-Defining Girl was never meant to get past 20 pages, and here we are a month later with more than 2x that! Because of the extra work (and trees) that went into producing this chunky little zine, I had to hike the price up to $3. This issue is worth it though, with a book review of Bitches, Bimbos and Ballbreakers: An Illustrated Guide to Female Stereotypes, an open-ended question on pro-or-con chivalry, 'i am a cliche' test, 'boy, the poster girl' a short fiction, D.I.Why?, some cute, sick little pictures drawn by Ms. Kt, and interview with Nicole Klein of 'The Hourglass', and more that you'll have to get an issue to find out about!","options":[{"id":582034,"name":"Default","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/647077/-/2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/647077/-/2.jpg","width":430,"height":658}],"artists":[],"categories":[{"id":121913,"name":"'zines","permalink":"zines","url":"/category/zines"}]},{"id":121295,"name":"Issue # 3-My Body's Image-","permalink":"issue-3-my-bodys-image","position":2,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/issue-3-my-bodys-image","status":"active","on_sale":false,"created_at":"2008-07-03T05:50:14.000Z","description":"Sorry for the delay, darlings; strange how 9 months into a year can be considered a \"fresh start\"... Well a lot of things are changing around these parts: Issue 3 of Danger! hole, for example has gained a little weight since the last issue, and remains the same price! This time around we have 66 pages, and still host a fabulous array of contributors. Some names may look familiar to active zinesters, and there are the new ones as well. As with Issue 2, because of the extra work + rainforests that went into producing My Body's Image, the price will stay at $3. The issue features a double-book review of Cunt and The Vagina Monologues, a word search, resource links, 'Girl Dumb' short fiction, articles on pro-ED websites, the Dove Real Beauty campaign, and 'Girl-Lovin Yr body-- without losing yr mind'. Of course, there are a few secrets to my zine-baby that you'll have to buy her to find out about! Now when you get yr dirty, little hands on Danger! hole, you get the gift of stickers! What else could anyone want?","options":[{"id":582036,"name":"Default","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/647085/-/3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/647085/-/3.jpg","width":430,"height":664}],"artists":[],"categories":[{"id":121913,"name":"'zines","permalink":"zines","url":"/category/zines"}]},{"id":121296,"name":"Issue # 4-When 'No' Means 'Yes'-","permalink":"issue-4-when-no-means-yes","position":3,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/issue-4-when-no-means-yes","status":"active","on_sale":false,"created_at":"2008-07-03T05:51:25.000Z","description":"Remember when I thought 66 pages was chunky? This time, for our sexual harassment issue, our little baby is growing up + its morbid obesity is something no one is concerned about. We barely scraped by finishing this issue on time (4 hours before the end of the month, to be exact) but boasting a healthy 84 pages, we aren't complaining! And at $3, you won't be complaining either! We've got features like how to say \"NO\" in any language, an article on what YOU need to know about Date Rape Drugs, lyrics from the Dresden Dolls and Ms. Julie Ruin, 'How To: Kick A$$ Like You Mean It', 'Reality Show Rapists-in-Training' on The Pick-Up Artist, a piece from the lovely Ms. Lucy Gruesome, contributions from various kids on their own sexual harassment situations, a few fun games to pass the time, as always: a prose piece, a bit from the editor on Sexist humor, and more more more that you'll need to find out about on your own!","options":[{"id":582037,"name":"Default","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/647093/-/4.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/647093/-/4.jpg","width":430,"height":664}],"artists":[],"categories":[{"id":121913,"name":"'zines","permalink":"zines","url":"/category/zines"}]},{"id":121297,"name":"Issue # 5-Cross My Legs & Hope to Die pt. 1-","permalink":"issue-5-cross-my-legs-hope-to-die-pt-1","position":4,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/issue-5-cross-my-legs-hope-to-die-pt-1","status":"active","on_sale":false,"created_at":"2008-07-03T05:52:32.000Z","description":"At 62 pages, Issue # 5 is certainly more lean than our previous issue; but that's not to say this zine-child isn't dense as hell! In first grade, your darling Editor Liouxsie (who went by Daffodil Doyle at the time) brought in a fully illustrated parents-to-child guide for 'the Birds n Bees Talk' to my class... and the phone calls home began! Apparently, my affinity for stirring up a bit of trouble with my comfort relating to sexuality and sexual health hasn't lessened over the years. This time, perhaps, no one will tell on me? Issue # 5 features the True and Untrue versions to the 10 steps (for putting on a condom), an article on electro-slut Peaches, a female-friendly sex store, the not-so-friendly catfight between pro-sex and anti-porn feminists, news of one Presidential candidate's controversial sex education in schools plan, several accounts of our contributors' sex ed in schools experiences, information on birth control and the latest rage in preventing girls from accessing birth control, a few interactive pieces, an interview with Sam of CODEWORD: Cereal, and more. I gave away too much already, and now you've gotta get a peak at this issue!","options":[{"id":582038,"name":"Default","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/647101/-/5.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/647101/-/5.jpg","width":430,"height":656}],"artists":[],"categories":[{"id":121913,"name":"'zines","permalink":"zines","url":"/category/zines"}]},{"id":121298,"name":"Issue # 6-when the girl rioted-","permalink":"issue-6-when-the-girl-rioted","position":5,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/issue-6-when-the-girl-rioted","status":"active","on_sale":false,"created_at":"2008-07-03T05:53:38.000Z","description":"Typically, an issue of D!HZ eats up approximately a month to a month and a half of your precious editor's youth. Yet for seam-splitting Issue 6, three times that period was swallowed whole. And if I do say so myself, the time and work really shows. At a daunting 122 pages holding just short of 30 pieces, this issue is a mixed package of DIY cut'n'paste style articles and the girth of a magazine done by someone with... a lotta time on her hands. A few of the titles hosted include \"The Unrequited Tsunami: manifestas through the decades\", a collection and critique of the infamous media-on-grrrl critiques AS WELL AS a previously unpublished riot grrrl response, \"Dirty Girl Germs\" a contributor piece, an interview with and review of Kerri Koch and her documentary \"Don't Need You: the Herstory of Riot Grrrl\", interview and review of Queer Control records & the bands they are convinced will blow your mind and your speakers, a few words with JD Glass- the young author of Punk Like Me, articles on groupies, the Spice Girls, punk chicks, a history of women in music, Rolling Stone magazine, and so much more my head's spinning. This issue, if you aren't sold yet!, comes with the choice of a cassette tape (free of charge) or CD (for an additional $1). This issue really is a riot of its own. $4 (US), $5.50 (International).\r\nCONTACT liouxsie TO REQUEST THE CASSETTE OR CD","options":[{"id":582039,"name":"Default","price":4.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/647109/-/6.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/647109/-/6.jpg","width":430,"height":674}],"artists":[],"categories":[{"id":121913,"name":"'zines","permalink":"zines","url":"/category/zines"},{"id":121921,"name":"compact disc mix","permalink":"compact-disc-mix","url":"/category/compact-disc-mix"}]}]