[{"id":14704449,"name":"Leg Locks Seminar","permalink":"leg-locks-seminar","position":1,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/leg-locks-seminar","status":"active","on_sale":false,"created_at":"2013-11-08T06:43:56.000Z","description":"My ninjas we will be hosting a Sunday Seminar December 8th all about Leg Locks!!!!! From noon to 3pm i'll be going over all leg locks including toe holds, ankle locks, heel hooks, calf slicers, knots, and more. Everyone is welcome to join us on the mats its an event open to everyone!\r\n\r\n","options":[{"id":47640840,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127210104/-/leglocks.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127210104/-/leglocks.jpg","width":500,"height":500}],"artists":[],"categories":[]},{"id":14218452,"name":"Alpha Brain","permalink":"alpha-brain","position":2,"price":34.95,"default_price":34.95,"tax":0.0,"url":"/product/alpha-brain","status":"active","on_sale":false,"created_at":"2013-10-16T16:47:43.000Z","description":"Complete balanced nootropic\r\n30 Pill Bottle.\r\nThe idea behind Alpha BRAIN was to create a fully-balanced nootropic. Our Alpha GPC and Huperzia Serrata contain nutrients that help your body turn up acetylcholine levels full throttle while other ingredients assist in elevating neurological components vital to remaining calm, focused, and mentally driven. Our Vinpocetine can help the body deliver oxygen and nutrients to the brain, and the combination of neuro-specific antioxidants, led by our proprietary AC-11®, assists your system in clearing away mental fog and free radicals. The result for our thousands of satisfied customers is an extraordinary combination of lucid dreams, mental drive, focus, and mental acuity.✝\r\n\r\nFor more complete info on alpha brain click here: \r\nhttps://www.onnit.com/alphabrain/ \r\n\r\nOrder here to get your 18% Discount. ","options":[{"id":45927951,"name":"Default","price":34.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125963376/-/alphabrain.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125963376/-/alphabrain.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14219088,"name":"Bulletproof Upgraded MCT Oil","permalink":"bulletproof-upgraded-mct-oil","position":3,"price":29.95,"default_price":29.95,"tax":0.0,"url":"/product/bulletproof-upgraded-mct-oil","status":"active","on_sale":false,"created_at":"2013-10-16T17:16:46.000Z","description":"Bulletproof Upgraded MCT Oil - 6x Stronger than Coconut Oil\r\nMedium-chain triglycerides (MCTs) work directly in cells to give you an extra boost to maximize your performance. Very little MCT oil is stored as fat because it is used for energy so quickly!\r\nTired of constantly craving caffeine? Want a thermogenic immune boost with your energy? Say goodbye to coconut oil and hello to energy 6x stronger.\r\n\r\nUpgraded MCT Oil benefits\r\nFast Energy - Upgraded MCT oil converts into energy faster than other oils ✝\r\nBetter Blood Chemistry - Helps the body maintain healthy cholesterol levels ✝\r\nNutrient Absorption - Improves the body’s absorption and use of vitamin E, calcium, and magnesium ✝\r\nImmune Protection - Helps the body deal with immune challenges ✝\r\nHealthy Cell Membranes - Serves as stable building block of cell membranes ✝\r\nEasy Storage - No refrigeration required and liquid at room temperature\r\nMake meals more Bulletproof - Flavorless and easy to add into diet. Mix into any smoothie, soup, sushi, coffee or most recipes\r\n\r\nMore info on Onnit.com ","options":[{"id":45930327,"name":"Default","price":29.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964957/-/bulletproof-upgraded-mct-oil.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964957/-/bulletproof-upgraded-mct-oil.jpg","width":221,"height":380}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14219064,"name":"Bulletproof Coffee Coffee for mission critical performance.","permalink":"bulletproof-coffee-coffee-for-mission-critical-performance","position":4,"price":19.95,"default_price":19.95,"tax":0.0,"url":"/product/bulletproof-coffee-coffee-for-mission-critical-performance","status":"active","on_sale":false,"created_at":"2013-10-16T17:15:11.000Z","description":"Upgraded Coffee = Bulletproof Performance\r\nUpgraded Coffee is the result of an obsessive pursuit to find the absolute highest performance coffee beans on earth. It's taken me more than 10 years to identify every step of performance-robbing toxin formation in coffee and to find a reliable, perfect source of beans that always make me feel great — even though \"normal\" coffee gives me a headache and jitters and makes me cranky. This coffee makes you feel noticeably better than anything else you'll find. You'll never go back to Starbucks again. These beans are meant for drinking black or best of all, for making Bulletproof Coffee with coconut oil. \r\n\r\nDave Asprey, Bulletproof Exec\r\n\r\nUpgraded Coffee Is Unlike Anything You've Tried (and why it's good for you)\r\nIt is carefully produced and tested with new and old methods to target the lowest toxin content vs. normal coffee, so you get all the benefits of coffee without the negative health effects. The beans are harvested from a single family-owned estate in Guatemala located 1250 meters above sea level, high enough to produce great coffee.\r\nThe estate is Passive Organic and the family that owns it does not allow chemicals (herbicides, pesticides, etc.) It is not economical for Central American boutique coffee estates to become certified organic. They are hand picked by experienced coffee harvesters — skilled people who know how to pick only perfectly ripe berries.\r\nMost coffee beans are processed by either leaving them in the sun and elements to wither and dry, or by pressing them and letting them ferment (spoil) to remove the outer layer of the bean. Both of these techniques are known to produce significant levels of mycotoxins as they enhance flavor. Upgraded Coffee beans are mechanically processed right after picking using only clean cold water. This more expensive process is safer because it dramatically reduces harmful molds or bacteria from impacting your health.\r\nThe beans are roasted in small batches by the #1 ranked roaster in United States under the strictest conditions. Roasting the beans enhances their antioxidant capacity and flavor to provide you with a healthier, tastier cup of coffee.\r\nUpgraded Coffee beans are cultivated by a grower who is Rainforest Alliance certified to be sustainable. Take that, Starbucks!\r\n\r\nMore info on onnit.com","options":[{"id":45930267,"name":"Default","price":19.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964873/-/159.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964873/-/159.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14219004,"name":"Coconut Oil Premium, extra-virgin, organic","permalink":"coconut-oil-premium-extra-virgin-organic","position":5,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/coconut-oil-premium-extra-virgin-organic","status":"active","on_sale":false,"created_at":"2013-10-16T17:13:04.000Z","description":"Coconut Oil - The Oil To Rule Them All\r\nOf the many oils available on the market, there are none that can compare to the versatility and health benefits of Onnit Organic Extra Virgin Coconut Oil. Coconut oil contains a high percentage of MCTs (Medium Chain Triglycerides), which the body burns as a pure energy source far more efficiently than proteins, starches, or sugars. Contrary to what is intuitive about a creamy, delicious oil, coconut oil and its MCTs have even been shown to have benefits in helping individuals as part of a healthy weight loss program.\r\nMore info on onnit.com ","options":[{"id":45929958,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964756/-/oil.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964756/-/oil.jpg","width":439,"height":597}],"artists":[],"categories":[]},{"id":14218947,"name":"Hemp FORCE™ BOX of 12 bars","permalink":"hemp-forcetm-box-of-12-bars","position":6,"price":34.95,"default_price":34.95,"tax":0.0,"url":"/product/hemp-forcetm-box-of-12-bars","status":"active","on_sale":false,"created_at":"2013-10-16T17:10:51.000Z","description":"The Reason\r\nBars generally fall into two categories: Way too high in sugar, or packed with chalky protein that’s hard to digest. Those two options are unacceptable for peak performance, and so the Hemp FORCE™ Bar was born. Take a look at the ingredients. What you are going to see there is a big list of real food, and nothing else. Earth grown nutrients with a broad spectrum of healthy fats, minerals, fiber and protein pressed into a shape that is perfect for on the go, and just right for the human mouth. That’s what your body wants, and so that is the bar we made.\r\nThe Taste\r\nAs any good chef will tell you, if you use great ingredients, there isn’t a whole lot you need to do for the taste. The Hemp FORCE™ bar allows the flavor of the coconut, almonds, and oats to come through, swirling with some sweet natural vanilla and kicked off with a hint of sea salt. Unlike those artificial flavors you get sick of half way through, this tastes like an indulgent food.\r\n\r\nMore info on onnit.com ","options":[{"id":45929673,"name":"Default","price":34.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964639/-/onnit-hemp-force-bar-1-pieces.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964639/-/onnit-hemp-force-bar-1-pieces.jpg","width":682,"height":1024},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964645/-/258.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964645/-/258.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218881,"name":"Hemp FORCE™  Cocoa, Maca, and Hemp Protein","permalink":"hemp-forcetm-cocoa-maca-and-hemp-protein","position":7,"price":49.95,"default_price":49.95,"tax":0.0,"url":"/product/hemp-forcetm-cocoa-maca-and-hemp-protein","status":"active","on_sale":false,"created_at":"2013-10-16T17:08:13.000Z","description":"Cocoa, Maca, and Hemp Protein\r\n\r\nHemp FORCE utilizes a rich and complete protein isolated from organic hemp seeds. Containing all of the essential amino acids, all three branched chain amino acids (BCAAs), and both essential fatty acids (Omega-3 and Omega-6), the protein profile of hemp seeds makes them one of the most nutritious sources in the plant kingdom. Cocoa and maca root not only enhance the natural flavor of the hemp, but also contain several antioxidant and bioactive compounds beneficial for peak performance. With a touch of stevia, a natural zero calorie sweetener with its own health benefits, Hemp FORCE supplies the body with an all-natural, easily digestible protein supplement with a nutrition profile unlike any other protein food available.\r\n\r\nmore info on onnit.com \r\n\r\n\r\n","options":[{"id":45929487,"name":"Default","price":49.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964471/-/hempforce.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964471/-/hempforce.jpg","width":439,"height":597},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964474/-/no-thc-2013.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964474/-/no-thc-2013.png","width":559,"height":50}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218758,"name":"Krill Oil","permalink":"krill-oil","position":8,"price":21.95,"default_price":21.95,"tax":0.0,"url":"/product/krill-oil","status":"active","on_sale":false,"created_at":"2013-10-16T17:02:25.000Z","description":"Krill Oil\r\nOnnit's krill oil is sustainably harvested from pristine Antarctic waters, and is tested to be free of toxic heavy metals that are becoming an increasing problem in other seafood based food and supplementation. To learn more about the collection methods from our supplier, click the video below. Krill Oil also has several benefits over fish oil that make it a superior choice in supplementation. Click the Research tab to learn more about the benefits of krill oil.\r\nMore info on onnit.com ","options":[{"id":45929127,"name":"Default","price":21.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964237/-/322.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964237/-/322.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218716,"name":"Spirulina & Chlorella","permalink":"spirulina-chlorella","position":9,"price":9.95,"default_price":9.95,"tax":0.0,"url":"/product/spirulina-chlorella","status":"active","on_sale":false,"created_at":"2013-10-16T17:00:18.000Z","description":"Super Greens for Super Humans\r\n\r\nGreens. The proclaimed enemy of many a child, greens are one of the most important parts of any well-rounded and nutrient-rich diet. Unfortunately, it is difficult to ingest adequate amounts of these nutrient-rich greens for several reasons. Salads, now ubiquitous, are often not much more than a bit of cellulose (fiber) and some water, making them a pleasant vehicle for the delicious toppings, but offering very little in terms of the important alkaline-forming vitamins and minerals. Vegetables, once canned, frozen, or cooked also lose a great percentage of their nutritional value. Both spirulina and chlorella are forms of algae which provides an extremely potent and well-balanced nutrient profile. Excellent for helping the body detoxify, assisting with a strong immune system, and rounding out a well-balanced diet, these easily absorbed tablets also alleviate the strong taste that comes with most powdered or liquified green food supplements.\r\n\r\nMore info on onnit.com ","options":[{"id":45928983,"name":"Default","price":9.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964126/-/veggies.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964126/-/veggies.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218695,"name":"Melatonin 5 with Lemon Balm","permalink":"melatonin-5-with-lemon-balm","position":10,"price":9.49,"default_price":9.49,"tax":0.0,"url":"/product/melatonin-5-with-lemon-balm","status":"active","on_sale":false,"created_at":"2013-10-16T16:59:21.000Z","description":"The \"On-Demand\" Sleep Hormone Supplement\r\nLet's face it, we humans rarely abide by the Earth's natural day/night sleep cycles. Electricity has created artificial light (not to mention television!) to allow all manners of work and play to exist deep into the dead of night, and most sleeping quarters provide blinds or curtains to block out the arousing rays of the morning sun. The result is that some of the mechanisms that have evolved inside us to assist with the sleep process have been thrown askew. One of these mechanisms involves the hormone melatonin. In a normal, pre-electricity scenario the pineal gland would release melatonin at the onset of darkness to help induce a desire to sleep. However, artificial light, especially high frequency blue light from visual electronics has been known to shift the release of melatonin, which can perturb sleeping patterns [source].\r\nIngesting supplemental melatonin can help the body signify to you, in a chewable ‘on demand' manner, when it is time for your body to sleep. In assisting the body's natural desire to rest, the melatonin can help the body to enjoy a more restful sleep experience. By placing the melatonin in a unique chewable tablet, with the traditional relaxation herb lemon balm, cloaked in the breath friendly flavor of peppermint you have a fast and simple delivery system for this vital sleep hormone.\r\n\r\nMore info on onnit.com ","options":[{"id":45928797,"name":"Default","price":9.49,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964093/-/meletonin.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964093/-/meletonin.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218680,"name":"Vitamin C & L-Lysine","permalink":"vitamin-c-l-lysine","position":11,"price":8.95,"default_price":8.95,"tax":0.0,"url":"/product/vitamin-c-l-lysine","status":"active","on_sale":false,"created_at":"2013-10-16T16:58:30.000Z","description":"A staple supplement for seasonal health.\r\n\r\nVitamin C is one of the first vitamins people think of when interested in the topic, and for good reason. A staple antioxidant, Vitamin C is very valuable for helping the body to neutralize free radicals that contribute to oxidative stress. Lysine is similarly prized for its ability to help the body balance excess arginine. Too much arginine can negatively impact your body's immune reaction. While these supplements are available from food in a healthy diet, they are well supported in higher quantities and can help play a part in sustained, optimum health.✝\r\nMore info on onnit.com ","options":[{"id":45928743,"name":"Default","price":8.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125964057/-/vitamin_c.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125964057/-/vitamin_c.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218647,"name":"Stron BONE™ & Joint","permalink":"stron-bonetm-joint","position":12,"price":39.95,"default_price":39.95,"tax":0.0,"url":"/product/stron-bonetm-joint","status":"active","on_sale":false,"created_at":"2013-10-16T16:57:14.000Z","description":"Stron BONE™ for Bone and Joint Support\r\nStrontium is a key mineral which naturally occurs in the bones, but only recently has its amazing benefits in helping the body promote strong, healthy bones been documented. Stron BONE™ contains the same amount of elemental strontium as shown effective in recent research.1,2 In addition, a balanced blend of supportive bone-development nutrients are included along with glucosamine, MSM, and hyaluronic acid to provide the body with supplementary assistance to healthy joints.†\r\n\r\nmore info on onnit.com","options":[{"id":45928647,"name":"Default","price":39.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125963958/-/stronbone.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125963958/-/stronbone.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218638,"name":"T+ Natural Testosterone Booster","permalink":"t-natural-testosterone-booster","position":13,"price":59.95,"default_price":59.95,"tax":0.0,"url":"/product/t-natural-testosterone-booster","status":"active","on_sale":false,"created_at":"2013-10-16T16:56:05.000Z","description":"Improve athletic performance and libido\r\n\r\nWhy Do I Want Extra Testosterone?\r\nTestosterone is one of the most important hormones produced by the body, particularly for males. Not only is it vital to maintaining proper musculature and masculine appearance, it has myriad psychological benefits as well. Lastly, strong, healthy levels of testosterone are important to maintaining optimal libido, including both sex drive and performance. T+™, when combined with an athletic regimen that preferably includes an anabolic component (like squats!) is designed to assist the body with naturally elevating testosterone levels.†","options":[{"id":45928581,"name":"Default","price":59.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125963883/-/Tplus.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125963883/-/Tplus.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218605,"name":"Shroom TECH™ Immune","permalink":"shroom-techtm-immune","position":14,"price":19.95,"default_price":19.95,"tax":0.0,"url":"/product/shroom-techtm-immune","status":"active","on_sale":false,"created_at":"2013-10-16T16:54:31.000Z","description":"Stimulating the Immune System Directly\r\n\r\nShroom TECH Immune is a revolutionary formula designed to directly influence the body's ability to maintain a healthy immune system. At the heart of the formula is a combination of some of the most potent nutritional mushrooms in the world, rich with bio-active fungal polysaccharides and beta glucans believed to help the body to stimulate the production of killer T- and B-cells directly. Rounding out this powerful combination are the immune essential minerals selenium and zinc, along with the most popular immune stimulating herb in the world, echinacea purpurea. While nothing can guarantee a lifetime of good health, Shroom TECH Immune may help to stack the odds in your favor.†\r\n\r\nMore info on onnit.com ","options":[{"id":45928530,"name":"Default","price":19.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125963814/-/immune.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125963814/-/immune.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218584,"name":"New MOOD","permalink":"new-mood","position":15,"price":29.95,"default_price":29.95,"tax":0.0,"url":"/product/new-mood","status":"active","on_sale":false,"created_at":"2013-10-16T16:53:30.000Z","description":"Boost your Mood with 5-HTP and Serotonin\r\n\r\nSerotonin has been shown to be a key neurotransmitter linked to mood, happiness, and positive outlook. Combining the two raw building blocks of serotonin, L-tryptophan and 5-HTP, with a converting catalyst, Vitamin B6, New MOOD provides the nutrients to help the body become a serotonin-boosting powerhouse. Adding to the naturally relaxing effects of L-Tryptophan are a host of traditional anti-stress herbs designed to bring you into a state of peaceful calm. Magnesium is an essential mineral vital for muscle relaxation and Vitamin D3 which is increasingly deficient in our diets, has further been linked to positive mood benefits. Ideal for when you are under stress, anxious, or exhausted, New MOOD is also optimal for daily use.†\r\n\r\nmore info on onnit.com ","options":[{"id":45928428,"name":"Default","price":29.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125963754/-/newmood.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125963754/-/newmood.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":14218551,"name":"Shroom Tech Sport","permalink":"shroom-tech-sport","position":16,"price":24.95,"default_price":24.95,"tax":0.0,"url":"/product/shroom-tech-sport","status":"active","on_sale":false,"created_at":"2013-10-16T16:51:26.000Z","description":"ADVANCED ATP ENERGY with Cordyceps Sinensis\r\n\r\nClean ATP energy. Better oxygen utilization. Faster recovery\r\n\r\nThe idea behind Shroom TECH Sport was to create a supplement that real athletes could take safely every day — even the day of competition. We wanted clean energy, ingredients with a history of use in high-level competition, and general health benefits; we believe we have found it in our exclusive combination of cordyceps sinensis mushroom, adaptogens, antioxidants, and methyl B-12. Shroom TECH Sport battles fatigue with a strategy unlike any other supplement on the market, providing cellular energy through the production of ATP rather than stimulant-based energy, and helping the body to improve oxygen utilization so you can go longer, recover faster, and set a new personal best.†","options":[{"id":45928350,"name":"Default","price":24.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125963631/-/shroomsport.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125963631/-/shroomsport.jpg","width":439,"height":597}],"artists":[],"categories":[{"id":6400941,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]}]