[{"id":7901883,"name":"nüvi 2580TV","permalink":"nuvi-2580tv","position":1,"price":400.0,"default_price":400.0,"tax":0.0,"url":"/product/nuvi-2580tv","status":"active","on_sale":true,"created_at":"2012-11-09T01:42:05.000Z","description":" Hasta 6 cuotas sin interés pagando en cualquiera de nuestras sucursales.\r\n \r\nLa unidad multifuncional nüvi 2580TV combina lo mejor de ambos mundos - la navegación avanzada y el entretenimiento: televisión todo en un dispositivo fino con una pantalla táctil grande y portátil de 5\" (12,7 cm).\r\n \r\nConduce cuando lo necesites\r\n\r\nLa unidad nüvi 2580TV incorpora el motor de navegación Guidance 2.0, el cual proporciona una interfaz de usuario más rápida e intuitiva para mejorar la velocidad y precisión de las búsquedas y las rutas.\r\nObserva cuando lo desees\r\n\r\nLa unidad nüvi 2580TV incorpora funciones de entretenimiento, para que no te pierdas nada mientras te desplazas. Ahora puedes llevar tus programas de televisión, eventos deportivos. La unidad nüvi 2580TV te permite grabar los números de canales antes de establecer tu destino, a través de Scan. Puedes ver la televisión en directo, para estar siempre informado. Su potente receptor DVB-T MPEG2/H.264 y las antenas te proporcionan la mejor visualización y cobertura posibles, incluso en el extranjero.\r\nRealiza y contesta llamadas con manos libres a través de la conectividad Bluetooth®.\r\nMás allá de la navegación\r\n\r\nTe recuerda dónde has aparcado cuando retiras la unidad nüvi 2580TV del soporte, para que puedas volver al coche.\r\nEl localizador de emergencia \"¿Dónde estoy?\" proporciona las coordenadas exactas de latitud y longitud, la dirección y cruce más cercanos, así como los hospitales y las comisarías de policía más próximos. ","options":[{"id":24950475,"name":"Default","price":400.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":12.0,"country":{"id":2,"name":"Argentina","code":"AR"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/77636928/-/2580.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/77636928/-/2580.jpg","width":495,"height":354}],"artists":[],"categories":[{"id":3969513,"name":"Automotor","permalink":"automotor","url":"/category/automotor"}]},{"id":7902939,"name":"Forerunner 10","permalink":"forerunner-10","position":2,"price":260.0,"default_price":260.0,"tax":0.0,"url":"/product/forerunner-10","status":"active","on_sale":true,"created_at":"2012-11-09T02:45:15.000Z","description":"Cada kilómetro cuenta. Captúralos todos gracias al nuevo Forerunner 10, el reloj de running con GPS más sencillo de Garmin. Realiza un seguimiento preciso de tu velocidad, la distancia que recorres y las calorías que quemas. Además, te ayuda a motivarte ya que identifica tus registros personales y compara el ritmo actual a aquel que deseas alcanzar gracias a la función Virtual Pacer™. Cuando hayas finalizado la carrera, cárgala al sitio Garmin Connect™ y podrás verla en un mapa, obtener más detalles de cada kilómetro y compartirla con tus amigos, todo de forma gratuita. La carrera de hoy es la motivación del mañana.\r\nListo para correr\r\n\r\nForerunner 10 es tan fácil de usar que podrás comenzar a correr con solo pulsar un botón. Al correr, puedes ver cómo se muestran claramente el tiempo y la distancia en una pantalla, y las calorías y el ritmo en otra. También puedes personalizar la configuración para que el ritmo y la distancia se muestren en la misma pantalla.\r\nAjustable\r\n\r\nEs nuestro reloj más ligero y cómodo, y está disponible en un deportivo color verde, rosa o negro con detalles en rojo. El modelo negro y rojo tiene una pantalla un poco más grande y una correa más ancha. Todos los modelos se pueden utilizar como reloj convencional, para que tu compañero de running siempre esté cerca.\r\nDatos que motivan\r\n\r\nCuando corres, Forerunner 10 emite un pitido al finalizar un kilómetro y hace que la pantalla donde se muestra el tiempo de ese kilómetro parpadee. Cuando finalices y guardes la carrera, podrás ver un resumen de la misma en el que se incluirá el tiempo total, la distancia, el ritmo medio y las calorías. El reloj también te indicará si alcanzas un récord personal, como por ejemplo el km más rápido o la carrera más larga conseguida por el momento.\r\nUtilidades de entrenamiento\r\n\r\nPara los corredores que quieran un poco más, Forerunner 10 dispone de dos funciones de entrenamiento sencillas, una de ellas es Virtual Pacer™, que compara tu ritmo actual de running a aquel que deseas alcanzar. Por otro lado, también dispone de una función de carrera/caminar que resulta muy útil si solo estás empezando o si tu plan de running incluye descansos de caminar.\r\nAlmacena y comparte\r\nA través de una sencilla conexión a tu Mac o PC, podrás cargar tus carreras a Garmin Connect™ para verlas en un mapa, obtener más detalles de cada kilómetro y compartirlas con tus amigos, todo de forma gratuita. Estarás aún más motivado cuando veas cómo mejoran tus kilómetros en Garmin Connect y podrás retroceder y consultar tu progreso durante la última semana, el último mes o el último año.","options":[{"id":24953844,"name":"Default","price":260.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":12.0,"country":{"id":2,"name":"Argentina","code":"AR"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/77646180/-/forerunner-hero.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/77646180/-/forerunner-hero.png","width":644,"height":598}],"artists":[],"categories":[{"id":3969840,"name":"Fitness","permalink":"fitness","url":"/category/fitness"}]},{"id":7903023,"name":"eTrex 20","permalink":"etrex-20","position":3,"price":385.0,"default_price":385.0,"tax":0.0,"url":"/product/etrex-20","status":"active","on_sale":true,"created_at":"2012-11-09T02:50:13.000Z","description":"La unidad eTrex 20 supone una mejora de uno de los dispositivos GPS de mano más fiables y conocidos. Con una ergonomía rediseñada, una interfaz fácil de usar, geocaching \"sin papeles\" y funciones de mapas ampliadas, añade importantes mejoras a un dispositivo de mano GPS ya legendario. La unidad eTrex 20 es versátil. Es resistente. Y está diseñada para enfrentarse a todo lo que la Madre Naturaleza le ponga por delante, y más.\r\nMinisitio de eTrex\r\nVisualiza el camino\r\nLa unidad eTrex 20 tiene una pantalla brillante mejorada de 2,2 y 65.000 colores, que puede leerse con la luz del sol. Duradera y resistente al agua, la unidad eTrex 20 está diseñada para soportar las inclemencias meteorológicas. Dispone una interfaz mejorada, pero conserva la resistencia legendaria diseñada para enfrentarse a los elementos, ya sea polvo, suciedad, humedad o agua. Nada de esto será un obstáculo para este célebre navegador.\r\n \r\nhttp://gpsmundo.com/imagenes/etrex%20series.jpg\r\nVe a cualquier parte\r\n\r\nAl contar con una amplia gama de soportes compatibles, podrás usar la unidad eTrex 20 en todoterrenos, bicicletas, barcos o utilizarla como tu dispositivo de mano o el navegador personal de tu coche. Utiliza la función de montaje en automóvil y los mapas City Navigator NT® para recibir indicaciones de conducción giro a giro. La unidad eTrex tiene todos los mapas y soportes necesarios para llevarte a cualquier sitio\r\nSé global\r\n\r\nLa nueva serie eTrex dispone del primer receptor para consumidores que puede rastrear satélites GPS y GLONASS de forma simultánea. GLONASS es un sistema desarrollado por la Federación Rusa que estará totalmente operativo en 2012. Al usar satélites GLONASS, el tiempo que tarda el receptor en “fijar” la posición es (de media) aproximadamente un 20 por ciento más rápido que al usar GPS. Y si utiliza GPS y GLONASS, el receptor tiene la capacidad de fijar la posición con 24 satélites más que con sólo GPS.\r\nObtén los mapas que quieras\r\n\r\nGracias a la ranura para tarjeta microSD™ y a sus 1,7 GB de memoria interna, la unidad eTrex 20 te permite cargar todo tipo de mapas Garmin TOPO y ponerte en marcha, conectar tarjetas BlueChart® g2 preinstaladas para pasar un día estupendo en el agua o datos de mapas de City Navigator NT® para obtener rutas giro a giro en carreteras (consulta la ficha de mapas para ver los mapas compatibles). La unidad eTrex 20 también es compatible con Imágenes por satélite de BirdsEye (es necesaria una suscripción), que permite descargar imágenes por satélite al dispositivo e integrarlas con los mapas.\r\nSeguridad ante todo\r\n\r\nCon receptor GPS con WAAS de alta sensibilidad y predicción por satélite HotFix®, la unidad eTrex localiza tu posición de forma rápida y precisa, y mantiene la ubicación GPS incluso en bosques espesos y en cañones de gran profundidad.\r\nDescubre la diversión\r\nLa unidad eTrex 20 admite archivos GPX de geocaching para descargar geocachés y otros datos directamente en la unidad. Visita OpenCaching.com para empezar tu aventura de geocaching. Al no utilizar papel, no sólo estás ayudando al medio ambiente, si no que hace tu geocaching más divertido. La unidad eTrex 20 almacena y muestra toda la información que necesitas, incluidas la ubicación, el terreno, la dificultad, sugerencias y descripciones, por lo que ya no tendrás que introducir coordenadas manualmente ni llevar impresiones en papel. Basta con subir el archivo a la unidad y salir a buscar cachés..","options":[{"id":24954000,"name":"Default","price":385.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":12.0,"country":{"id":2,"name":"Argentina","code":"AR"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/77647080/-/e20.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/77647080/-/e20.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":3969903,"name":"Aire Libre / Aventura","permalink":"aire-libre-aventura","url":"/category/aire-libre-aventura"}]},{"id":7902975,"name":"SPOT Localizador Satelital","permalink":"spot-localizador-satelital","position":4,"price":215.0,"default_price":215.0,"tax":0.0,"url":"/product/spot-localizador-satelital","status":"active","on_sale":true,"created_at":"2012-11-09T02:47:41.000Z","description":"\r\n \r\nhttp://es-es.facebook.com/note.php?note_id=136885986347460\r\n \r\n\r\nEl Primer Mensajero Satelital del mundo. Con el Mensajero Satelital SPOT, usted y sus seres queridos se sentirán tranquilos al saber que la ayuda está siempre en camino. SPOT es el único dispositivo de su clase que utiliza la red de satélites GPS para obtener sus coordenadas y luego envia su localización (con un enlace a Google Maps™ ) y un mensaje pre-programado a través de una red de satélite comercial. Y, a diferencia de localizadores personales, SPOT hace más que simplemente llamar para pedir ayuda. Sigue su progreso, comprueba con sus seres queridos y le propociona asistencia, todo eso con tan sólo pulsar un botón. Puesto que utiliza tecnología satélite 100%, SPOT funciona en todo el\r\nmundo, incluso donde los teléfonos móviles no lo hacen.\r\n \r\n\r\nhttp://la.findmespot.com/sp/images/ov_hed_spot2.gif\r\n \r\nCOMO TRABAJA SPOT\r\n\r\n \r\n\r\nLos satélites GPS proporcionan señales y el chip GPS del mensajero SPOT determina su ubicación GPS y envía su localización y mensaje pre-seleccionado a los satélites de comunicación. Los satélites de comunicación retransmiten su mensaje a las antenas satelitales alrededor del mundo. Las antenas satelitales y la red global dirige su ubicación y mensaje a la red apropiada. Su ubicación y mensajes se entregan de acuerdo a sus instrucciones vía email, mensaje de texto, o notificación de emergencia al Centro de Coordinación de Rescate de GEOS. Activado por Google MapsTM Cuando el SPOT envía un texto o un correo electrónico a uno de sus contactos o al Centro de Coordinación de Rescate GEOS, incluye sus coordenadas GPS y un enlace de Web para ver su ubicación utilizando Google MapsTM.\r\n\r\n  http://la.findmespot.com/sp/images/ov_hed_howworks.gif\r\n \r\nSPOT le proporciona una vía indispensable de comunicación con amigos y familiares cuando quiera, así como asistencia de emergencia cuando y donde la necesite. Y, puesto que utiliza tecnología satélite 100%, SPOT funciona en todo el mundo, incluso donde los teléfonos móviles no lo hacen.\r\n \r\n\r\niconSOS: Utilice esta función en caso de situación de peligro o cualquier otra emergencia para informar a los servicios de emergencia sobre su localización exacta y la necesidad de asistencia. El Centro de Respuestas de Emergencias GEOS alertará a las agencias apropiadas en todo el mundo. Por ejemplo, contactará con los receptores del 9-1-1 en Norte América y con los receptores del 1-1-2 en Europa.\r\n \r\niconAyuda : En el caso de situaciones que no amenacen su seguridad, puede usar esta función para notificar a sus contactos personales que necesita ayuda. El servicio de Asistencia Adicional de SPOT puede adquirirse y programarse en su botón de Ayuda. Cuando active este servicio, el botón de Ayuda notificará a los organismos profesionales ya sea en tierra o en agua. SPOT está asociada con proveedores nacionales de servicios para ofrecer asistencia en situaciones no potencialmente peligrosas.\r\n \r\n\r\niconConfirmación : Esta función permite a sus amigos y familiares saber que todo va bien y conocer su localización GPS a través de un mensaje programado. Tan solo pulsando un botón se envía un mensaje de texto o un email hasta a 10 contactos predeterminados, y su punto de ruta queda almacenado en su cuenta SPOT para futuras consultas. Estos puntos de referencia pueden integrarse fácilmente a la Página Compartida de SPOT o a la cuenta de SPOT Adventure.\r\n\r\niconMensaje Personalizado : Esta función hace que sus amigos y familiares reciban un mensaje de confirmación con su localización tan solo con pulsar un botón. Use esta función como un mensaje secundario de confirmación o transfiera su alerta personal a esta función de mensaje si está usando el servicio de Asistencia SPOT en el botón de Ayuda.\r\n\r\niconSeguimiento : Comience y pare el rastreo en cualquier momento a través de su dispositivo SPOT. (Se requiere servicio adicional). También puede marcar un punto de referencia o enviar mensajes Check-in/OK desde ubicaciones especificas mientras se mantiene en modo de seguimiento “Track Progress”.\r\n\r\nEncendido : Para encender el SPOT simplemente presione y mantenga el botón ON/OFF hasta que el indicador luminoso este verde. El SPOT realiza una prueba auto diagnóstica. Cuando el equipo está ENCENDIDO el indicador luminoso parpadeará verde cada 3 segundos. Esto es útil para hacer el SPOT visible en la oscuridad. Para apagar el SPOT, mantenga presionado el botón ON / OFF hasta que la luz deje de parpadear.\r\n\r\nAuto Prueba : SPOT realizará una auto prueba cuando inicialmente encienda su equipo. Si todas las luces visibles destellan rojo, el auto examen del SPOT ha encontrado un error, y el SPOT no enviará el mensaje. Si las luces de ON / OFF, del GPS y Enviando Mensaje centellan rojo, el SPOT tiene un error de GPS, pero el SPOT puede todavía transmitir un mensaje de SOS o AYUDA sin su ubicación GPS.\r\nSPOT Mensaje Programado : El SPOT está diseñado para proporcionar calidad y confiabilidad excepcionales. Con una vista perfecta del cielo, el mensajero SPOT está diseñado para transmitir virtualmente cada mensaje. En condiciones diarias, la vista al cielo es a menudo bloqueada por las colinas, edificios, u otras obstrucciones, así que es normal que algunos mensajes sean bloqueados. Es por esto que el mensajero SPOT envía automáticamente mensajes múltiples en cada modo, brindándole una confiabilidad total excelente. En algunos modos esto significa intentos múltiples para enviar el mismo mensaje, mientras que en otros modos significa regularmente actualizar las coordenadas GPS y enviar un nuevo mensaje. La colocación de su unidad SPOT puede hacer la diferencia. Experimente con la colocación hasta que se familiarice con la confiabilidad de su ambiente operativo.\r\nhttp://la.findmespot.com/sp/images/spot2_satellite_network.png\r\nCARACTERÍSTICAS\r\n\r\nLa siguiente generación de mensajería personal por satélite y comunicación de emergencia supera al GPS en rendimiento, tamaño y peso.\r\n\r\n \r\n\r\nPEQUEÑO Y LIGERO\r\n\r\nDimensiones: 9.4 cm x 6.6 cm x 2.5 cm\r\nPeso aproximado: 209 gramos\r\n \r\n\r\nDURACIÓN DE LA BATERIA\r\n\r\nIncluye dos baterías AA de Litio de 1.5 V; en condiciones normales de uso, una pila totalmente cargada debería durar lo siguiente:\r\n\r\n• Encendido, sin utilizar: Apróx. 1 año\r\n\r\n• En modo rastreo SPOTcasting: Apróx. 14 días\r\n\r\n• En modo 9-1-1: Más de 7 días seguidos\r\n\r\n• Mensajes de verificación SPOT: 1900 mensajes\r\n\r\n \r\n\r\nCERTIFICACIONES\r\n\r\n• Sumiso ROHS y WEEE.\r\n\r\n• Certificado de emisiones por la Comisión Federal de Comunicaciones (FCC) y la Iglesia de Inglaterra (CE), normas de inmunidad y seguridad.\r\n• Presenta las normas del apartado 25 de la FCC, la aprobación tipo de Canadá, la Publicación 22 de CISPR (1985 1ª Edición), la Directiva de RTTE (1999/EC), la normativa de seguridad IEC 60950, y la Directiva europea EMC 89/336/EEC. \r\n \r\n\r\nCREADO PARA CONDICIONES EXTREMAS\r\n\r\nSPOT funciona en todo el mundo, prácticamente en cualquier lugar.\r\n\r\n• Temperaturas de funcionamiento: -40ºC a +85ºC (-40°F a +185°F)\r\n\r\n• Altitud de funcionamiento: -91 m a +6,492 m (-300 ft a +21,000 ft)\r\n\r\n• Flota en el agua\r\n\r\n• Resistente al agua. Sumergido a una profundidad de 1 metro, dura más de 30 minutos\r\n\r\n• Prueba de humedad: » MIL-STD-810E Método 507.3, del 95% al 100% condensado\r\n\r\n• Prueba de niebla salina: » Per MIL-STD-810E Método 509.3, 5% NaCl, 95% agua destilada\r\n\r\n• Vibración » Per SAE J1455 » Aleatorio, 20 Hz a 2000 Hz, 0.04g2/Hz, una hora por ejemplo\r\n\r\n• Lanzamiento » Lanzado dos veces sobre sus seis lados desde una altura de un metro contra una superficie dura.","options":[{"id":24953934,"name":"Default","price":215.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":12.0,"country":{"id":2,"name":"Argentina","code":"AR"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/77646444/-/transparent_spot3.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/77646444/-/transparent_spot3.png","width":288,"height":341}],"artists":[],"categories":[{"id":3969858,"name":"Rastreo","permalink":"rastreo","url":"/category/rastreo"}]},{"id":7903056,"name":"echo 300c","permalink":"echo-300c","position":5,"price":410.0,"default_price":410.0,"tax":0.0,"url":"/product/echo-300c","status":"active","on_sale":true,"created_at":"2012-11-09T02:52:02.000Z","description":"\r\n\r\nEl echo 300c es la única sonda de doble haz a color del mercado a este precio, lo que la convierte en la primera opción de sonda para los aficionados a la pesca con un presupuesto limitado.\r\nLo que el agua esconde\r\n\r\nEl echo 300c está diseñado para que la pesca sea pan comido. Así de sencillo. Su pantalla que puede leerse a la luz del sol de 3,5 pulgadas y su exclusiva tecnología HD-ID™ de rastreo de objetivos de Garmin te permitirá ver a través del agua como nunca antes. Además, una sonda de 300 vatios (RMS) ofrece un ángulo de visión de hasta 120 grados y detalles del fondo de hasta 1.500 pies.\r\nInstálalo y listo\r\n\r\nDiseñado primando la simplicidad, el echo 300c es una de las sondas más intuitivas del mercado. Su instalación sólo lleva unos minutos gracias al soporte inclinable de desmontaje rápido y al versátil transductor de montaje en espejo de popa que se incluyen en la caja.","options":[{"id":24954084,"name":"Default","price":410.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":12.0,"country":{"id":2,"name":"Argentina","code":"AR"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/77647464/-/echo300c.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/77647464/-/echo300c.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":3969921,"name":"Náutica","permalink":"nautica","url":"/category/nautica"}]}]