[{"id":267816,"name":"WAG Don't-Wannabe - The Smart Girl's Guide to Footballers - SIGNED","permalink":"wag-dont-wannabe-the-smart-girls-guide-to-footballers-signed","position":1,"price":5.5,"default_price":5.5,"tax":0.0,"url":"/product/wag-dont-wannabe-the-smart-girls-guide-to-footballers-signed","status":"active","on_sale":true,"created_at":"2009-03-31T20:00:20.000Z","description":"AS SEEN ON 'WAGS TO RICHES' ON BBC!!!!\r\n\r\nThis book was infamously released in November 2008 and has been causing a stir ever since.  This is the ideal gift for a fake-tan loving, high heel wearing girl in your life and a great opportunity to purchase a signed copy.  \r\n\r\nThe author and this book have appeared in too many newspapers, magazines and TV shows to mention with people so interested in this book.  So read all about it...\r\n\r\n‘WAG Don't Wannabe - The Smart Girl's Guide to Footballers’ is Francesca Amber Sawyer's first book and is available at bookshops nationwide from November 2008. \r\n\r\nFrancesca Amber Sawyer is now duly acknowledged as the authority on all things footballer-shaped and is intent on exposing the truth.  But is she just a glorified kiss and tell girl?  Hell no, she famously never reveals identities and believes there’s a much bigger story to be told than simply naming and shaming yet ANOTHER cheating footballer.\r\n\r\nWAG Don't-Wannabe is a must-have bible for 21st century party girls and covers everything you need to know about getting caught up in Britain's obsession for everything footballer, WAG and tabloid-related. She's a girl that knows everything that's worth knowing and isn't afraid to tell it like it is. She's made all the mistakes so you don't have to. So put on your Gina heels and go forth!\r\n\r\n\"Francesca works the footballer scene to her advantage.\"\r\n- Now magazine\r\n\r\n\"Francesca is the Germaine Greer of our age, the Emmeline Pankhurst of the post Spice Girl era and I for one would like to see her chained to some railings.\"\r\n\r\n- Russell Brand\r\n\r\nYou cannot get this anywhere else on the web (except www.francescaamber.com), you will get a personally signed copy, with whatever message you want.  The PERFECT gift for party-loving girls out there.  You will recieve your book with your message in the title page in either pink or black ink.  You will also recive a special 'signed by the author' sticker on the front of the book.  \r\n","options":[{"id":1129462,"name":"Default","price":5.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1980973/-/launch4.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1980973/-/launch4.jpg","width":344,"height":500}],"artists":[],"categories":[]}]