[{"id":6977737,"name":"DIY Smudge","permalink":"diy-smudge","position":1,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/diy-smudge","status":"active","on_sale":true,"created_at":"2012-08-16T02:17:25.000Z","description":"Here is a little teaser on the new blank white DIY Smudge!  On 8-20-12 more photos will be revealed, including sweet customizations by many familiar faces to the art world, including illustrators, toy designers, puppeteers and more!  At only 3 inches tall, these itty bitty hand stitched plush forms make the perfect platform for a myriad of designs.  Use markers, paint, permanent pens, fabric, glue, and more!  The sky is the limit. All of the DIY Smudges are handmade in the USA by Paisley herself!\r\n\r\nThese are available for pre-order now. Plush will ship on or before 8-30-12.\r\n\r\n*For international orders (outside the US) please send email to: paisleyfawn@gmail.com for shipping prices.\r\n\r\n*Price increases to $25 on September 1, 2012. \r\n\r\n*Sales Tax Included \r\n\r\nWhat is a Smudge?\r\nSmudges are itty bitty artistic muses that like to hang out wherever people are.  Smudges survive solely on minuscule morsels of pocket lint and cobwebs.  Since Smudges are docile creatures, they get along very well in the human world.  Next time it feels like there is a little being in the room, take a look under the throw pillows, behind the computer, and those old shoes in the corner.  Surely enough, a Smudge will be there!\r\n","options":[{"id":22106371,"name":"Default","price":18.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/68465987/-/PaisleyFawn_DIYsmudge.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/68465987/-/PaisleyFawn_DIYsmudge.jpg","width":954,"height":420}],"artists":[],"categories":[{"id":1994864,"name":"Plush","permalink":"plush","url":"/category/plush"}]},{"id":6872711,"name":"Rusty Red Panda Smudge: Art Plush","permalink":"rusty-red-panda-smudge","position":2,"price":34.0,"default_price":34.0,"tax":0.0,"url":"/product/rusty-red-panda-smudge","status":"active","on_sale":false,"created_at":"2012-08-03T21:17:28.000Z","description":"These hand stitched adorably cuddly rusty red panda smudges were recently spotted running amok outside the studio! They've gotten loose and won't come back until adopted by their forever family. They love exploring, sharing Smudge secrets, and sweet corn! All are hand-crafted from felt and fleece, and sport cute button eyes, and hand-stitched ears, tail, nose, and facial features. No two are exactly the same. Now available for adoption!\r\n\r\n* For More Photos of these little guys visit:\r\nhttp://www.behance.net/gallery/Rusty-Red-Panda-Smudge-Art-Plush/4613535\r\n\r\n* This listing is For ONE smudge.\r\n*********************************\r\n\r\nWhat is a Smudge, you ask? Simply put, each Smudge is a one-of-a-kind hand made collectible artist toy. These cute whimsical hand sized creatures come in an endless variety of breeds, colors and textures. No two are exactly the same, although sometimes they are born into litters and may share the same tummy/body color selections with their brothers and sisters. Each smudge is created with care and love by me in my studio. I personally hand-select the fabric and thread colors, and cut out unique shapes and designs to bring them to life.\r\n*Size: about 3 inches tall by 4 inches long.\r\n\r\n*********************************\r\n*Each and every one of my plush creations has a hand-sewn tag on it's back side and comes packaged with a handmade hang-tag secured with a twine bow.\r\n*********************************\r\n\r\n*This product IS NOT INTENDED FOR SMALL KIDS OR BABIES. While the eyes are sewn on securely, smudges are not designed to withstand the chewing and rough housing that small humans often do to their toys.\r\n\r\nTo see more of my art visit:\r\nwww.paisleyfawn.com ","options":[{"id":21797607,"name":"Default","price":34.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/67459941/-/Etsy_PaisleyFawn_RustyPanda_03.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/67459941/-/Etsy_PaisleyFawn_RustyPanda_03.jpg","width":570,"height":399}],"artists":[],"categories":[{"id":1994864,"name":"Plush","permalink":"plush","url":"/category/plush"}]},{"id":4604711,"name":"Twelve 05","permalink":"twelve-05","position":3,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/twelve-05","status":"active","on_sale":false,"created_at":"2011-10-10T22:57:58.000Z","description":"Watch out! Your favorite cute lovable mogwai is on the loose, it’s after midnight, and it looks like he’s eaten. Freddy and Jason were no match for him. Are your doors locked? The windows shut? Better go check, it’s going to be a long night!\r\n\r\n**For more detailed images please visit: http://paisleyfawn.com/gizmo/\r\n\r\n8\" x 10\" artist print of original acrylic painting on wood.\r\n\r\n*Purchased prints will not have the \"paisley fawn\" watermark printed on them!\r\n\r\n*Size/Paper Details: Total Size = 8\" x 10\" Has a white border around the artwork so it can be framed in any standard 8x10 frame. This print series is printed professionally on coated semi-gloss #100 enamel paper.\r\n\r\nAll prints are signed in permanent pink ink and shipped in a clear plastic cello sleeve with a heavy cardboard insert inside of a sturdy flat mailer to prevent bending/creasing. Parcel will be marked FRAGILE DO NOT BEND\r\n\r\n*Please be aware that the actual print colors may vary slightly from the computer screen, as all monitors are different. ","options":[{"id":15074165,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/45102837/-/Gizmo_PaisleyFawn_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/45102837/-/Gizmo_PaisleyFawn_1.jpg","width":432,"height":573}],"artists":[],"categories":[{"id":1994862,"name":"Prints","permalink":"prints","url":"/category/prints"}]}]