[{"id":7609659,"name":"About Bella Shade Baby","permalink":"about-bella-shade-baby","position":1,"price":0.01,"default_price":0.01,"tax":0.0,"url":"/product/about-bella-shade-baby","status":"sold-out","on_sale":false,"created_at":"2012-10-20T19:58:36.000Z","description":"Hi Everyone! Thank you for shopping with Bella Shade Baby! I started sewing again when my oldest daughter (the Bella in Bella Shade!) was little and I wanted to make some fabulous and unique clothes for her to wear. She is growing up fast but she still loves to be the one to get my sample sets :) I am a stay at home mom of two young daughters, so I do not have as much time as I would like for sewing and getting things loaded here, but I do my best to get new outfits loaded once a month. Visit my Facebook page for sneak peeks of what's to come at www.facebook.com/BellaShadeBaby! \r\n\r\n\r\n\r\n\r\nSewing Techniques and Quality\r\n \r\nI use high quality cotton fabric, thread, and elastic. All of my seams are french seams, meaning that each seam is sewn twice and all the raw edges are enclosed. Hems are double turned under, so no raw edges there either! I do not own a serger, and I actually prefer the look of my french seams, even though they take twice the time. Knits are sewn with a double needle, so there are two lines of stitching and it looks similar to the overlock stitch used on commercial tee shirts. Some seams between knit and cotton may be covered with binding when french seams are not appropriate.\r\n \r\n\r\nOrdering a Custom Made Outfit\r\n \r\nI am happy to work with you to fulfill your vision! If I do not have the fabric you have in mind, I can usually order it. I have WAY more fabric and patterns than what are posted in my albums, so please contact me if you are looking for something, or even if you just had an idea and you need someone to make it come to life! I can modify sizing and patterns to fit your needs.To purchase something you see on my page, comment with your PayPal linked email address and the size needed. I will contact you for more details and post a listing or send an invoice within 48 hours. I love doing custom orders, so don't hesistate to contact me! I am currently trying to do more ready to ship items, so custom spots are limited.\r\n \r\n\r\nSizing\r\n \r\nFor custom orders, I am happy to use the general sizing provided by the pattern designers that I use frequently, or to go by your child's measurements!  You can measure your child, but it is actually better in most cases to measure a garment that fits your child correctly.  If you are unable to measure that is absolutely fine!  Here are some measurements that are helpful to have when ordering:\r\n-Tops and Dresses -\r\nChest : across from armpit to armpit, or all the way around the chest if measuring your child\r\nLength: from shoulder to hem, or from armpit to hem for my halter styles or knot tops\r\n-Pants, Bloomers, or Shorts -\r\nWaist: across while the bottoms are laid flat, or around if you are measuring your child\r\nLength: from top of waistband to hem, and from top of inseam to hem. Inseam is especially important for pants, to make sure they are the correct length!\r\n\r\nIf you have a question about the measurements of a ready to ship item, please feel free to ask me!\r\n \r\n\r\nShipping\r\n \r\nShipping is not included in my prices on my website, and it is to the buyer's benefit. When I add shipping in to my prices, the price of everything goes up by $2-5. When I do not add the shipping cost into my prices, I can offer combined shipping. When you add an item to your cart, shipping of $2-4 (depending on weight and bulk of items) will be added to your total. When you add multiple items, the shipping on subsequent items is discounted to $1-2 per item added. I ship most items USPS first class mail in poly mailers. I always purchase delivery confirmation! If you need priority shipping services please contact me for a quote. I do not ship international at this time, unless the buyer is willing to pay for FedEx or UPS delivery service.\r\n \r\n\r\nTurnaround Time\r\n \r\nMy turnaround time for customs is usually 2-4 weeks. I do have two young children, so I am not always fully on top of things, but I will always do my best to ship within my time frame and communicate with my customers! If something has happened and we are getting close to your 45 day mark, I am happy to refund you and send a new invoice, to start the 45 days back at the beginning and keep your paypal protection going longer!\r\n \r\n\r\nExchange Policy\r\n \r\nIf you are unhappy with the fit of your item, you may return it to me in its original, unwashed and unworn condition within 14 days of the item being received by you. I will exchange anything that is my mistake! You must ship back to me with delivery confirmation, and if after looking over the outfit, I determine that it was my mistake in sizing, I will refund your shipping costs as well as exchanging or altering your item(s). I only offer refunds in extreme circumstances, but they will be offered when necessary. For a full refund, the item must be returned to me within 14 days of it being received by you.\r\n ","options":[{"id":24027157,"name":"Default","price":0.01,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/74696839/-/BSB_etsy_avi.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/74696839/-/BSB_etsy_avi.jpg","width":76,"height":76}],"artists":[],"categories":[{"id":3610437,"name":"Fabric Destash","permalink":"fabric-destash","url":"/category/fabric-destash"}]},{"id":7028943,"name":"Custom Hobo Bag","permalink":"london-hobo-bag","position":2,"price":56.0,"default_price":56.0,"tax":0.0,"url":"/product/london-hobo-bag","status":"active","on_sale":false,"created_at":"2012-08-22T07:23:18.000Z","description":"This gorgeous slouchy bag is made from up to 8 different fabrics and is reversible! Two pockets on each side are great for storing the essentials you need to find easily, and add cute decorative details. The knot straps can be tied multiple ways for versatile wear. This bag is made from 100% cotton fabrics and is machine washable. After laundering in cold water on the delicate cycle, reshape and dry flat, and press with a warm iron.\r\n\r\nYou choose up to 8 different fabrics. I will work with you on any custom theme or color scheme. Turnaround time is 2-4 weeks. ","options":[{"id":22260297,"name":"Default","price":56.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/68960099/-/IMG_0202.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/68960099/-/IMG_0202.JPG","width":574,"height":1000}],"artists":[],"categories":[{"id":3603405,"name":"Bags","permalink":"bags","url":"/category/bags"}]},{"id":9136028,"name":"Custom Order Spots","permalink":"custom-order-spots","position":3,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/custom-order-spots","status":"sold-out","on_sale":false,"created_at":"2013-01-25T17:57:22.000Z","description":"","options":[{"id":28621001,"name":"Default","price":45.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/89773106/-/621506_10151307073293523_1189736385_o.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/89773106/-/621506_10151307073293523_1189736385_o.jpg","width":1000,"height":772}],"artists":[],"categories":[{"id":3602041,"name":"Tees","permalink":"tees","url":"/category/tees"},{"id":3603371,"name":"Dresses","permalink":"dresses","url":"/category/dresses"},{"id":3603373,"name":"Skirts","permalink":"skirts","url":"/category/skirts"},{"id":3603375,"name":"Pants","permalink":"pants","url":"/category/pants"},{"id":3603377,"name":"Two Piece Sets","permalink":"two-piece-sets","url":"/category/two-piece-sets"},{"id":3603405,"name":"Bags","permalink":"bags","url":"/category/bags"},{"id":3644423,"name":"Tops","permalink":"tops","url":"/category/tops"}]},{"id":7122993,"name":"Peasant Tops","permalink":"peasant-tops","position":4,"price":28.0,"default_price":28.0,"tax":0.0,"url":"/product/peasant-tops","status":"sold-out","on_sale":false,"created_at":"2012-09-01T07:54:29.000Z","description":"Lots of different options in this listing! Please check sizes and prints carefully, there is only one each of most items, in various sizes.","options":[{"id":22541627,"name":"12-18m Yellow Elephant","price":28.0,"sold_out":false,"has_custom_price":false},{"id":22541629,"name":"12-18m Chicken & Egg","price":28.0,"sold_out":false,"has_custom_price":false},{"id":22541631,"name":"2/3 Pet Deer","price":28.0,"sold_out":false,"has_custom_price":false},{"id":22541633,"name":"3/4 Corduroy Birds","price":28.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":1.5,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/70011743/-/IMG_0360.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/70011743/-/IMG_0360.JPG","width":756,"height":1000}],"artists":[],"categories":[{"id":3644423,"name":"Tops","permalink":"tops","url":"/category/tops"}]},{"id":7126593,"name":"Infant Handknit Sweater Set","permalink":"infant-handknit-sweater-set","position":5,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/infant-handknit-sweater-set","status":"active","on_sale":false,"created_at":"2012-09-01T21:31:48.000Z","description":"This sweet paisley tank dress will look amazing on any baby girl. Lavender and aqua make it feminine without being overly girly, and it coordinates perfectly with the matching shades of purple and teal in the shrug and headband. The kanasazi flower is a cute accent to the headband, making sure no one mistakes your little miss for a mr. :)\r\n\r\nThe adorable little shrug compliments the tank dress perfectly, or can be used with any outfit. Made from a lightweight super wash merino wool this shrug is great for casual wear or those cool summer nights when your little girl needs just a little bit extra warmth.\r\n\r\nHeadband and shrug knit by Brandy of brittle heart design - http://hyenacart.com/stores/brittleheartdesign/\r\n\r\n\r\nsize 0-6 months\r\n\r\nyarn info:\r\nsuperwash merino from Lickety Stitch in \"Lily\"\r\n\r\npattern info:\r\nSomething Beautiful Shrug by Nicole Ratliff \r\n","options":[{"id":22556975,"name":"Infant 0-6m","price":45.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.5,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/69933681/-/collablily.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/69933681/-/collablily.jpg","width":600,"height":406}],"artists":[],"categories":[{"id":3603371,"name":"Dresses","permalink":"dresses","url":"/category/dresses"},{"id":3603377,"name":"Two Piece Sets","permalink":"two-piece-sets","url":"/category/two-piece-sets"}]}]