[{"id":10809117,"name":"Moroccan Tea Butter","permalink":"moroccan-tea-butter","position":1,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/moroccan-tea-butter","status":"active","on_sale":false,"created_at":"2013-04-27T18:08:22.000Z","description":"Love butters for hair, face and body? \r\nWell meet the Creme de la Creme of body nourishment in one jar. Our  Moroccan Tea butter is a superfood rich combination of organic shea butter + argan oil + macha green tea. \r\n\r\nOther ingredients used in this lovely butter are Coconut Oil,  Jojoba Seed Oil, and Olive Oil to name a few. Organic and natural oils and butters that can be used from head to toe. As always...no cheap fillers, only the best ingredients that heal and nourish.  www.beijaflornaturals.com\r\n2oz\r\n\r\n","options":[{"id":33922521,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.5,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.1,"amount_with_others":3.9,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":2.9,"amount_with_others":1.75,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.98,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106297353/-/BEYA_FLOR-195.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106297353/-/BEYA_FLOR-195.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106297401/-/BEYA_FLOR-193.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106297401/-/BEYA_FLOR-193.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"}]},{"id":10808073,"name":"100% Pure Moroccan Argan Oil","permalink":"100-pure-moroccan-argan-oil","position":2,"price":22.0,"default_price":22.0,"tax":0.0,"url":"/product/100-pure-moroccan-argan-oil","status":"active","on_sale":false,"created_at":"2013-04-27T16:56:30.000Z","description":"Another dual use product from Beija-Flor Naturals! Argan oil is the riches and most luxurious oil on the market. Our 100% Moroccan Argan Oil can be used on face, hair and body to repair and tone skin while reducing fine lines and blemishes or on hair to soften, moisturize and  improve elasticity. \r\n\r\nArgan Oil is 80% unsaturated essential fatty acids. The most abundant of which are Omega 9 (Oleic acid) and Omega 6 (Linoleic acid). This product is also rich in the Vitamin E Anti-Oxidant.  This oil is  fast absorbing and works for all hair and skin types.  \r\n4oz ","options":[{"id":33918618,"name":"Default","price":22.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.75,"amount_with_others":3.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.95,"amount_with_others":4.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.4,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":5.5,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106287645/-/BEYA_FLOR-187.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106287645/-/BEYA_FLOR-187.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"},{"id":277242,"name":"Oils Nectars and Fragrances","permalink":"oils-nectars-and-fragrances","url":"/category/oils-nectars-and-fragrances"}]},{"id":8072754,"name":"Maracuja Milk for Kinks Curls and Coils ","permalink":"maracuja-milk-for-kinks-curls-and-coils-w-brazil-nut-and-passion-fruit-oils","position":3,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/maracuja-milk-for-kinks-curls-and-coils-w-brazil-nut-and-passion-fruit-oils","status":"active","on_sale":false,"created_at":"2012-11-19T08:30:11.000Z","description":"NEW nourishing leave-in with passion fruit and brazil nut oils.  If you looove the thick rich moisture of the Creme Brulee for Kinks Curls and Coils, but are craving a more aqueous cream based leave-in...meet our new Maracuja Milk!\r\n\r\nBy popular demand we have developed a creamier water based leave-in that delivers the ultimate softness and shine for wash and go styles. This product provides excellent \"slip\" as a detangler and  everyday leave-in. \r\n\r\nAs with all of our handmade products, we use 100% high quality natural/organic ingredients from the Amazon and beyond. No mineral oil, petroleum, sulphates, parabens, silicones or other cheap fillers, EVER! Very few brands deliver luxury ingredients at this level. We urge you to do a label by label comparison w/ your favorite brand!\r\n\r\nIngredients include: \r\n\r\nAloe Vera \r\nSweet Almond Oil\r\nBrazil Nut Oil\r\nPassion Fruit Oil (Maracuja)\r\nJojoba Oil\r\nOrganic Shea Butter\r\nAvocado Oil\r\nNeem\r\nRosemary\r\n\r\nWhat is Maracuja (Ma-Rah-Coo-Jah)? \r\nPASSION FRUIT OIL!\r\nThis Brazilian superfruit is one of the most costly oils on the market. Passion fruit Seed Oil is a superior moisturizer that feeds thirsty tresses due to its vitamin rich content.\r\n\r\nUse: Apply to clean wet, dry or damp hair. detangle and let air dry. This product can be used as is, or paired with the thick and rich Creme Brulee for Kinks Curls and Coils to provide hold and nourishment for twists and braids. Works for ALL curly kinky, coily, hair types. \r\n \r\n8oz","options":[{"id":25668225,"name":"Default","price":16.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.8,"amount_with_others":6.7,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":14.6,"amount_with_others":9.6,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.95,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":12.8,"amount_with_others":10.2}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288029/-/BEYA_FLOR-117.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288029/-/BEYA_FLOR-117.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"}]},{"id":336067,"name":"Cocoa Mango Buttercream (4oz)","permalink":"cocoa-mango-buttercream","position":4,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/cocoa-mango-buttercream","status":"active","on_sale":true,"created_at":"2009-07-03T22:34:03.000Z","description":"Gentle enough for babies bottoms, penetrating for dry cracked man hands, and a detangling moisturizing treat for dry  kinky to curly hair. Can it be true?! \r\n\r\nFresh and made to order. The Beija-Flor buttercreams are  concentrated, fast absorbing and lasts all day. Raw organic cocoa and mango butters are blended with aloe vera extracts and other essential goodies until they produce fluffy white clouds of moisture that is guaranteed to soften, smooth and leave you glowing.  It does not irritate  sensitive or problematic skin and it softens the texture of kinky, coily or curly hair when used as a leave in conditioner/moisturizer.  \r\n\r\nCUSTOMER REVIEWS\r\nI have been a natural for about 3 years now, and I try to keep my hair products natural as well. I have NEVER had a product leave my hair so soft and healthy looking. And may I also add...it smells AMAZING! I highly recommend Beija Flor Naturals\r\n-Sabrina, Warwick NY\r\n\r\n\"I have tried a lot of body butters, but this is the one with the most lasting effect of all; I can feel extra softness in my skin even many hours after using this, and I am in a very tough climate. Will be back for more soon. Highly recommended!\" Dawn, Nevada\r\n\r\nWorks wonders for the skin, really keeps away the dreaded frizzies in the hair, and it smells great.\r\nConnie Staten Island, NY\r\n\r\nI love this body cream!! It is so rich and moisturizing- unlike so many lotions that feel like they are full of \r\nwater(because they are). The fragrance is scrumptious, too! I often find scents overpowering and can't \r\nwear them- this one is perfect- its' so natural. Every time I smell it I get the feeling I'm on some tropical island :)\r\n thanks so much! Holly, California\r\n\r\nThis cream smells good enough to eat. I do bantu knots, two strand twists and flat twists with this all the time.\r\n Its definitely a beauty staple for me. Its excellent for my dry hair and skin. I love this product!\r\nElosi Los Angeles, CA\r\n\r\nActive Ingredients: \r\nOrganic Mango butter: moisturizes, smooths and heals dry skin, reduces signs of aging, provides UV protection against the sun, \r\nprevents stretch marks during pregnancy and treats eczema and dermatitis. \r\n\r\nOrganic Cocoa Butter: Centuries old ingredient that has been used to keep skin soft and supple. Creates a barrier between sensitive skin and the environment and also helps retain moisture. \r\n\r\nOther ingredients:  Organic Aloe Vera Extract, Sterilized Water, Organic Shea Butter, Jojoba Oil, Coconut Oil, Apricot Kernel Oil, Vegetable Emulsifiers, Vitamin E, Natural Preservatives\r\n\r\nSuggested Usage for Naturally Curly Hair: Apply Cocoa-Mango Buttercream in sections to damp or dry air. Comb through and air dry. Use alone or under a gel or styler for soft and manageable hair.\r\n\r\nSuggested Usage for Skin: Use as a traditional body butter or hand and foot cream. Best when applied to damp skin after bath/shower.  \r\n\r\n<head>\r\n    <title>CocoaMango Buttercream</title>\r\n    <meta name=\"description\" content=\"Gentle enough for babies bottoms, penetrating for dry cracked man hands, and a detangling moisturizing treat for dry kinky to curly hair. Can it be true?! Fresh and made to order. The Beija-Flor buttercreams are concentrated, fast absorbing and lasts all day. Raw organic cocoa and mango butters are blended with aloe vera extracts and other essential goodies until they produce fluffy white clouds of moisture that is guaranteed to soften, smooth and leave you glowing. It does not irritate sensitive or problematic skin and it softens the texture of kinky, coily or curly hair when used as a leave in conditioner/ light styler. Active Ingredients: Organic Mango butter: moisturizes, smooths and heals dry skin, reduces signs of aging, provides UV protection against the sun, prevents stretch marks during pregnancy and treats eczema and dermatitis. Organic Cocoa Butter: Centuries old ingredient that has been used to keep skin soft and supple. Creates a barrier between sensitive skin and the environment and also helps retain moisture. Other ingredients: Sterilized Water, Raw Organic Shea Butter, Coconut Oil, Apricot Kernel Oil, Vitamin E\">\r\n    <meta name=\"keywords\" content=\"Buttercream, BodyButter, NaturaBodyButter, OrganicCocoaButter, OrganicMangoButter, HairCream, CurlCream, HairMoisturizer, CurlMoisturizer, AfricanAmericanHair, NaturalHaircare, OrganicHaircare\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>\r\n","options":[{"id":1379501,"name":"Unscented ","price":15.0,"sold_out":false,"has_custom_price":false},{"id":33276265,"name":"Coconut Cupcake","price":15.0,"sold_out":false,"has_custom_price":false},{"id":38028480,"name":"Blackberry Sage","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.9,"amount_with_others":3.1,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.8,"amount_with_others":6.7,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":14.6,"amount_with_others":9.6,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":12.8,"amount_with_others":10.2}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288221/-/BEYA_FLOR-221.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288221/-/BEYA_FLOR-221.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2831069/-/DSC_0360__Custom_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2831069/-/DSC_0360__Custom_.JPG","width":1000,"height":664},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2831057/-/DSC_0311__Custom_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2831057/-/DSC_0311__Custom_.JPG","width":1000,"height":664}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"},{"id":1198911,"name":"Ships within 48 hours!","permalink":"ships-within-48-hours","url":"/category/ships-within-48-hours"}]},{"id":2682999,"name":"Creme Brulee for Kinks Curls and Coils (8oz)","permalink":"creme-brulee-for-kinks-curls-and-coils-8oz","position":5,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/creme-brulee-for-kinks-curls-and-coils-8oz","status":"active","on_sale":false,"created_at":"2010-08-03T01:34:01.000Z","description":"This product is for the happy and nappy, cute and coily, wild and wavy, kinky, curly...well you get the picture! No matter what your ethnic background, if the hair that sits on top of your head can be described as such you know that highly textured hair in all its glory tends to be dry, brittle and prone to breakage. \r\n\r\nOur Creme Brulee is an everyday leave-in moisturizer with ingredients hand selected for beautiful healthy hair. The formula starts with an infusion of healing herbs such as rosemary, burdock and Marshmallow root. Murumuru Butter, Aloe butter, Shea Butter, Coconut Oil and Grapeseed oil add shine, moisture and protection.\r\n\r\n In total, an infusion of 13 premium natural ingredients create a light cream texture that is perfect for all natural hair types. When used on wet or dry hair, the Creme Brulee  can actually change the texture of your hair from straw to silk making it soft and manageable. \r\nNOTE: This product now comes in an 8oz JAR. New photos coming soon!\r\n\r\nCUSTOMER REVIEWS: \r\n\"This conditioner is a shiny miracle in a jar!\" Mariela, San Juan Puerto Rico\r\n\r\n\"As always, I can't seem to NOT purchase this product. The texture is just so creamy/buttery, that I just can't pass it up...that spicy cake/cookie scent is so comforting, that I just needed it. Such lovely products from a dedicated seller. This is the ONLY place that I shop for when purchasing hair/body products. Sally's can't top the \"All-Natural Goodness\" of BeijaFlor Naturals!\" Jasmin, Indiana\r\n\r\n\"I could cry I'm so happy! My 3-yr old has fine, curly hair, and in our dry MN winter it has turned into a perpetual rats nest. I put this in her dry hair the second it came in the mail and ten minutes later I **MAGICALLY** brushed out all the knots without a scream, a teary eye, or even a \"stop doing that!\" I am SOOO happy!!!!\" Theresa, Minnesota\r\n\r\nI thoroughly enjoyed your products. Your Creme\r\nBrulee is the ONLY product that gives my two strand twists a good twist out  Aaroni, Texas\r\n\r\n\"This product with the Hemp Buttercreame worked well on my hair. My twists out has sheen and my style is defined and springs back into place. It also smells very nice.\" Ashley-Ottawa, Canada\r\n\r\n\"My daughter had gorgeous ringlets after using it, instead of her usual frizz. Thanks!\" Roxanne, Minnesota\r\n\r\n\"This smells delicious! I just put some on my \"day two\" hair, and it tamed my pillow frizzies, softened the texture, AND added a nice shine. Big plus is it doesn't feel greasy:).\" Angela, Illinois\r\n\r\n\"This product makes my hair feel so incredible\" Kayla, Minnesota\r\n\r\nWhat's Wrong with stuff found at the Beauty Supply Store?\r\nThese often contain petro-chemicals, lanolin, silicon, alcohol, animal waxes and other stuff that your hair naturally rejects (read your labels!) For advice on how to maintain your naturally curly hair please email themixtress@beijaflornaturals.com. \r\n\r\nThe Creme Brulee for Kinks, Curls and Coils is...\r\n\r\nNot heavy, Non-sticky, greasy\r\n65% organic, 100% Natural, 100% Vegan\r\nGood for afros, wash and gos, twists, braids and children styles\r\nCurls, Waves and Coils of all textures\r\nThose transitioning to natural hair\r\nDry, damaged, color treated hair\r\n\r\nSuggested Usage: Apply in sections to clean damp hair. This is a stand alone product that acts as both a light styler and moisturizer. It could also be used under another styler or gel. \r\n\r\n<head>\r\n    <title>Creme Brulee for Kinks, Curls and Coils</title>\r\n    <meta name=\"description\" content=\"This product is for the happy and nappy, cute and coily, wild and wavy, kinky, curly...well you get the picture! No matter what your ethnic background, if the hair that sits on top of your head can be described as such you know that highly textured hair in all its glory tends to be dry, brittle and prone to breakage. Our Creme Brulee is an everyday leave-in moisturizer with ingredients hand selected for beautiful healthy hair. The formula starts with an infusion of healing herbs such as rosemary, burdock and licorice root. Avocado butter, Cocoa Butter, Jojoba, Coconut Oil, and Aloe add shine, moisture and protection. In total, an infusion of 13 premium natural ingredients create a light cream texture that is perfect for all natural hair types. When used on wet or dry hair, the Creme Brulee can actually change the texture of your hair from straw to silk making it soft and manageable. What's Wrong with stuff found at the Beauty Supply Store? These often contain petro-chemicals, lanolin, silicon, alcohol, animal waxes and other stuff that your hair naturally rejects (read your labels!) For advice on how to maintain your naturally curly hair please email themixtress@beijaflornaturals.com. The Creme Brulee for Kinks, Curls and Coils is... Not heavy, Non-sticky, greasy 65% organic, 100% Natural, 100% Vegan Good for afros, wash and gos, twists, braids and children styles Curls, Waves and Coils of all textures Those transitioning to natural hair Dry, damaged, color treated hair \">\r\n    <meta name=\"keywords\" content=\"NaturalHaircare, CurlyHaircare, AfricanAmericanHair, CurlCream, KinkyCurly, BlackHair, NaturalHairProduct, www.beijaflornaturals.com, Afrohaircare\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>\r\n\r\n","options":[{"id":9454760,"name":"Creme Brulee Fragrance","price":16.0,"sold_out":false,"has_custom_price":false},{"id":9454761,"name":"Unscented","price":16.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.8,"amount_with_others":6.7,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":14.6,"amount_with_others":9.6,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.95,"amount_with_others":2.7,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":12.8,"amount_with_others":10.2}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288569/-/BEYA_FLOR-122.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288569/-/BEYA_FLOR-122.jpg","width":1000,"height":666},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46283053/-/CremeBrulee2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46283053/-/CremeBrulee2.jpg","width":753,"height":500},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46283121/-/CremeBrulee3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46283121/-/CremeBrulee3.jpg","width":500,"height":744}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"}]},{"id":324306,"name":"Agave Aloe Polisher (4oz)","permalink":"agave-aloe-skin-polisher","position":6,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/agave-aloe-skin-polisher","status":"active","on_sale":true,"created_at":"2009-06-17T04:55:08.000Z","description":"The perfect facial exfoliator. This ultra-nourishing blend gently removes dead skin cells to reveal a glowing new you. Vitamin rich agave nectar, soothing aloe vera, and moisturizing jojoba oil penetrate deep for younger, healthier looking skin you can feel. A few drops of rosemary and sweet orange essential oil is added for healing and aromatherapy properties. No artificial fragrances. 4oz\r\n\r\nCUSTOMER REVIEWS\r\n\"I'm in LOVE,LOVE,LOVE with this product! The first time I used it, I was amazed at how smooth & moisturized my face felt after one deep scrub! I have combo skin, so I use the scrub at least once or twice a week. I plan to order more soon!\" Kenisha, Los Angeles, California\r\n\r\n\"Love it. i used this as soon as it arrived and guess what? as soon as i rinsed it off my skin...it was SOFTER, SMOOTHER, GLOWING. it;s a gentle, nature exfoliant, but i know you're only supposed to exfoliate once or twice a week...i try to restrain myself on a daily basis ;)\" Merideth, Santa Monica CA\r\n\r\n\"This polish makes my skin so smooth and soft that even my boyfriend noticed!Lightning fast shipping!Thanks!\" \r\nLorais, Palm Springs, California\r\n\r\n\"I have sensitive skin that's prone to dryness and eczema. The Agave Aloe Polisher is great! It buffs your skin nicely without scratching you to death, it's non-irritating, and once you rinse it off, your skin is left feeling soft, smooth and moisturized from the aloe and jojoba oil and not too oily\" Alana, North Carolina\r\n\r\nActive ingredients:\r\nFinely ground raw sugars-Refines and brightens. Provides gentle exfoliation and removes dead skin cells.\r\nAgave nectar-vitamin rich with skin soothing antibacterial properties\r\nAloe Vera-Rich in Vitamins B1, B2, B6, C and amino acids\r\nJojoba Oil: Light and easily absorbed oil that is known to heal sensitive skin conditions and reduce fine lines and wrinkles.\r\nRosemary Extract: Aromatherapy properties, increases circulation\r\nVitamin E: Anti-Aging Super Vitamin\r\n\r\nFor more natural bath and body goods please visit: \r\nwww.beijaflornaturals.com\r\n\r\n<head>\r\n    <title>Agave Aloe Polisher</title>\r\n    <meta name=\"description\" content=\"The perfect 2-in-1 for face and body. This ultra-nourishing blend gently removes dead skin cells to reveal a glowing new you. Vitamin rich agave nectar, soothing aloe vera, and moisturizing jojoba oil penetrate deep for younger, healthier looking skin you can feel. A few drops of rosemary essential oil is added for healing and aromatherapy properties. 4oz Active ingredients: Finely ground raw sugars-Refines and brightens. Provides gentle exfoliation and removes dead skin cells. Agave nectar-vitamin rich with skin soothing antibacterial properties Aloe Vera-Rich in Vitamins B1, B2, B6, C and amino acids Jojoba Oil: Light and easily absorbed oil that is known to heal sensitive skin conditions and reduce fine lines and wrinkles. Rosemary Essential Oils: Aromatherapy properties, increases circulation Vitamin E: Anti-Aging Super Vitamin \">\r\n    <meta name=\"keywords\" content=\"AgaveNectarforBeauty, AgaveNecgtarforSkin, AloeVeraforSkin, AgaveNectar, AgaveAloePolisher, Aloe Vera, Scrub, FaceScrub, AgaveAloeScrub, FacialScrub, Facial Exfoliant, Exfoliator\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>","options":[{"id":1337177,"name":"Agave Aloe Polisher","price":16.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.9,"amount_with_others":3.12,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.12,"amount_with_others":6.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":13.48,"amount_with_others":10.12,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":11.48,"amount_with_others":8.9}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288281/-/BEYA_FLOR-141.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288281/-/BEYA_FLOR-141.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/28374681/-/Agave_Aloe_Polisher.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/28374681/-/Agave_Aloe_Polisher.jpg","width":399,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288473/-/BEYA_FLOR-147.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288473/-/BEYA_FLOR-147.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"}]},{"id":324309,"name":"Honey Butter Tough Love Scrub ","permalink":"honey-butter-tough-love-scrub","position":7,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/honey-butter-tough-love-scrub","status":"active","on_sale":true,"created_at":"2009-06-17T04:57:01.000Z","description":"Skip the trip to the spa. Our honey butter scrub is a weekly all over treatment full of moisturizing honey and healing natural butters. A detoxifying raw sugar base makes this perfect for anyone who wants to get down to serious exfoliating business. Can also be used to pamper feet and rough areas of the skin (elbows, knees etc).The lasting moisture and lightly sweet scent  will have you wishing you could fast forward to the next scrub day. \r\n\r\nBenefits of Raw Honey: \r\nContains mild alpha hydroxy acids that increase elasticity, balance out oily skin and stimulate collagen production. Honey can reverse damage caused by free radicals, and is an excellent humectant. \r\n\r\nActive ingredients: exfoliating sugars, cocoa, mango and shea butters, raw honey, Apricot Oil, Rice Bran Oil, Vitamin E\r\n\r\nSuggested Usage: 1-3X/week massage into clean wet skin while in the shower/bath. Rinse. \r\n\r\n8oz\r\n\r\n<head>\r\n    <title>Honey Butter Tough Love Scrub</title>\r\n    <meta name=\"description\" content=\"Skip the trip to the spa. Our honey butter scrub is a weekly all over treatment full of moisturizing honey and healing natural butters. A detoxifying raw sugar base makes this perfect for anyone who wants to get down to serious exfoliating business. Can also be used to pamper feet and rough areas of the skin (elbows, knees etc).The lasting moisture and lightly sweet scent will have you wishing you could fast forward to the next scrub day. Benefits of Raw Honey: Contains mild alpha hydroxy acids that increase elasticity, balance out oily skin and stimulate collagen production. Honey can reverse damage caused by free radicals, and is an excellent humectant. Active ingredients: exfoliating sugars, cocoa, mango and shea butters, raw honey, Apricot Oil, Rice Bran Oil, Vitamin E 10oz\">\r\n    <meta name=\"keywords\" content=\"HoneyButterScrub, OrganicBodycare, NaturalBodycare, HoneyButterToughLoveScrub, SugarScrub, OrganicSugarScrub, SpaScrub, SpaExfoliator, VeganBodycare, BathandBody\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>","options":[{"id":5006671,"name":"Unscented","price":18.0,"sold_out":false,"has_custom_price":false},{"id":14787561,"name":"Tea Rose","price":18.0,"sold_out":false,"has_custom_price":false},{"id":21797509,"name":"White Tea and Ginger","price":18.0,"sold_out":false,"has_custom_price":false},{"id":24135372,"name":"Fudge Brownie","price":18.0,"sold_out":false,"has_custom_price":false},{"id":24135375,"name":"Orange Tea Blossom","price":18.0,"sold_out":false,"has_custom_price":false},{"id":24135378,"name":"Ginger Peach","price":18.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":7.9,"amount_with_others":5.1,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":9.5,"amount_with_others":7.1,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":9.2,"amount_with_others":6.1}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288929/-/BEYA_FLOR-213.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288929/-/BEYA_FLOR-213.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2624773/-/sugarpolishnew_2881.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2624773/-/sugarpolishnew_2881.jpg","width":340,"height":340},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2848501/-/Sugar_4_szd.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2848501/-/Sugar_4_szd.jpg","width":600,"height":399}],"artists":[],"categories":[{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"}]},{"id":430598,"name":"Creme Brulee for Kinks, Curls and Coils Family Size (12oz)","permalink":"creme-brulee-for-kinks-curls-and-coils","position":8,"price":23.0,"default_price":23.0,"tax":0.0,"url":"/product/creme-brulee-for-kinks-curls-and-coils","status":"active","on_sale":true,"created_at":"2009-10-19T05:41:25.000Z","description":"Same great product, family size jar. \r\n-----------------------------------------------------\r\n\r\nThis product is for the happy and nappy, cute and coily, wild and wavy, kinky, curly...well you get the picture! No matter what your ethnic background, if the hair that sits on top of your head can be described as such you know that highly textured hair in all its glory tends to be dry, brittle and prone to breakage. \r\n\r\nOur Creme Brulee is an everyday leave-in moisturizer with ingredients hand selected for beautiful healthy hair. The formula starts with an infusion of healing herbs such as rosemary, burdock and Marshmallow root. Murumuru Butter, Aloe butter, Shea Butter, Coconut Oil and Grapeseed oil add shine, moisture and protection.\r\n\r\n In total, an infusion of 13 premium natural ingredients create a light cream texture that is perfect for all natural hair types. When used on wet or dry hair, the Creme Brulee  can actually change the texture of your hair from straw to silk making it soft and manageable. \r\n\r\nCUSTOMER REVIEWS: \r\n\"As always, I can't seem to NOT purchase this product. The texture is just so creamy/buttery, that I just can't pass it up...that spicy cake/cookie scent is so comforting, that I just needed it. Such lovely products from a dedicated seller. This is the ONLY place that I shop for when purchasing hair/body products. Sally's can't top the \"All-Natural Goodness\" of BeijaFlor Naturals!\" Jasmin, Indiana\r\n\r\n\"I could cry I'm so happy! My 3-yr old has fine, curly hair, and in our dry MN winter it has turned into a perpetual rats nest. I put this in her dry hair the second it came in the mail and ten minutes later I **MAGICALLY** brushed out all the knots without a scream, a teary eye, or even a \"stop doing that!\" I am SOOO happy!!!!\" Theresa, Minnesota\r\n\r\n\"This product with the Hemp Buttercreame worked well on my hair. My twists out has sheen and my style is defined and springs back into place. It also smells very nice.\" Ashley-Ottawa, Canada\r\n\r\n\"This conditioner is a shiny miracle in a jar!\" Mariela, San Juan Puerto Rico\r\n\r\n\"My daughter had gorgeous ringlets after using it, instead of her usual frizz. Thanks!\" Roxanne, Minnesota\r\n\r\n\"This smells delicious! I just put some on my \"day two\" hair, and it tamed my pillow frizzies, softened the texture, AND added a nice shine. Big plus is it doesn't feel greasy:).\" Angela, Illinois\r\n\r\n\"This product makes my hair feel so incredible\" Kayla, Minnesota\r\n\r\nWhat's Wrong with stuff found at the Beauty Supply Store?\r\nThese often contain petro-chemicals, lanolin, silicon, alcohol, animal waxes and other stuff that your hair naturally rejects (read your labels!) For advice on how to maintain your naturally curly hair please email themixtress@beijaflornaturals.com. \r\n\r\nThe Creme Brulee for Kinks, Curls and Coils is...\r\n\r\nNot heavy, Non-sticky, greasy\r\n65% organic, 100% Natural, 100% Vegan\r\nGood for afros, wash and gos, twists, braids and children styles\r\nCurls, Waves and Coils of all textures\r\nThose transitioning to natural hair\r\nDry, damaged, color treated hair\r\n\r\nSuggested Usage: Apply in sections to clean damp hair. This is a stand alone product that acts as both a light styler and moisturizer. It could also be used under another styler or gel. \r\n\r\n<head>\r\n    <title>Creme Brulee for Kinks, Curls and Coils</title>\r\n    <meta name=\"description\" content=\"This product is for the happy and nappy, cute and coily, wild and wavy, kinky, curly...well you get the picture! No matter what your ethnic background, if the hair that sits on top of your head can be described as such you know that highly textured hair in all its glory tends to be dry, brittle and prone to breakage. Our Creme Brulee is an everyday leave-in moisturizer with ingredients hand selected for beautiful healthy hair. The formula starts with an infusion of healing herbs such as rosemary, burdock and licorice root. Avocado butter, Cocoa Butter, Jojoba, Coconut Oil, and Aloe add shine, moisture and protection. In total, an infusion of 13 premium natural ingredients create a light cream texture that is perfect for all natural hair types. When used on wet or dry hair, the Creme Brulee can actually change the texture of your hair from straw to silk making it soft and manageable. What's Wrong with stuff found at the Beauty Supply Store? These often contain petro-chemicals, lanolin, silicon, alcohol, animal waxes and other stuff that your hair naturally rejects (read your labels!) For advice on how to maintain your naturally curly hair please email themixtress@beijaflornaturals.com. The Creme Brulee for Kinks, Curls and Coils is... Not heavy, Non-sticky, greasy 65% organic, 100% Natural, 100% Vegan Good for afros, wash and gos, twists, braids and children styles Curls, Waves and Coils of all textures Those transitioning to natural hair Dry, damaged, color treated hair \">\r\n    <meta name=\"keywords\" content=\"NaturalHaircare, CurlyHaircare, AfricanAmericanHair, CurlCream, KinkyCurly, BlackHair, NaturalHairProduct, www.beijaflornaturals.com, Afrohaircare\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>\r\n\r\n","options":[{"id":1712644,"name":"Creme Brulee Fragrance","price":23.0,"sold_out":false,"has_custom_price":false},{"id":9354183,"name":"Unscented","price":23.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":6.9,"amount_with_others":6.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":13.9,"amount_with_others":11.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":18.2,"amount_with_others":14.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":16.9,"amount_with_others":12.0},{"amount_alone":16.08,"amount_with_others":11.8,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288737/-/BEYA_FLOR-097.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288737/-/BEYA_FLOR-097.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288701/-/BEYA_FLOR-100.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288701/-/BEYA_FLOR-100.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106288773/-/BEYA_FLOR-103.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106288773/-/BEYA_FLOR-103.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"}]},{"id":423487,"name":"Licorice Root Scalp Elixir (4oz)","permalink":"licorice-root-scalp-elixir","position":9,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/licorice-root-scalp-elixir","status":"active","on_sale":true,"created_at":"2009-10-11T23:46:30.000Z","description":"The medicinal power of licorice has been used in hair/scalp health since the ancient Egyptians discovered its power in the 3rd century B.C.\r\n\r\nOur scalp elixir is a 4oz herbal serum that combines the regenerative properties of licorice and 8 other essential ingredients such as Rosemary, Burdock, Neem, Peppermint, and Brazilian Babassu.\r\n\r\nThis product is made to combat dry, itchy, irritated scalp, reduce dandruff, stop hair loss and promote healthy hair growth. It is a heaven sent for those suffering with hair loss, heat or chemical damage to scalp, or psoriasis of the scalp. When applied, the Licorice Root Elixir has a minty tingle that heals, stimulates and encourages growth. \r\n\r\nSuggested Usage: Massage serum directly into clean dry/damp scalp 2-3x/week. Can be a leave-in treatment thick, curly or afro textured hair. Other hair types may use overnight and wash out with shampoo in the morning. \r\n\r\n**Shake Well to infuse oils and herbal solution. Product texture may change or solidify in extreme cold temperatures, this is normal and product can still be used as prescribed. If this occurs please run under hot water for 20 seconds.\r\n\r\nCUSTOMER REVIEWS:\r\n\r\nI don't think I can say enough good things about this Scalp Elixir. My hair looks better after only one overnight application!! And it doesn't weigh it down like some products I've tried.  This is my third time purchasing. I got it the first time about a year ago. About six months after that, I noticed that I had lots of short, aggravating hairs sticking up. Then I realized, oh my gosh, that I was actually growing new hair! Now I have them in all lengths all over my head. I hadn't previously been using any kind of oil on my hair because it is oily anyway, but when I researched thinning hair, oil was recommended. So I bought this and voila--new hair!! I'm not kidding, this stuff works. I'm in love with BeijaFlores products. Never stop making this stuff, please!\"  A+++\" Linda Raleigh, North Carolina\r\n\r\nCouldn't be happier with this product. All of the previous reviews I read were absolutely true. I've tried numerous drugstore OTC products for dry scalp, and this is the only one that came close to the results of a prescription treatment I used years ago. It's part of my weekly regimen now, and I will have to come back for refills. Thanks!\r\nChristina, Lake Placid NY\r\n\r\n\"This is the only product that seems to sooth and heal my  scalp dermatitis\" Nichole, Glendale CA\r\n\r\n\"This stuff is fabulous, its the only oil that stops my scalp itching! I love it.\" Genevieve, London UK\r\n\r\n\r\n<head>\r\n    <title>Licorice Root Scalp Elixir</title>\r\n    <meta name=\"description\" content=\"The medicinal power of licorice has been used in hair/scalp health since the ancient Egyptians discovered its power in the 3rd century B.C. Our scalp elixir is an herbal blend that combines the regenerative properties of licorice and 7 other essential ingredients such as Rosemary, Neem, Peppermint, and Brazilian Babassu. This product is made to combat dry, itchy, irritated scalp, reduce dandruff, stop hair loss and promote healthy hair growth. It is a heaven sent for those suffering with hair loss, heat or chemical damage to scalp, or psoriasis of the scalp. \">\r\n    <meta name=\"keywords\" content=\"licorice root, licoriceforscalp, scalpserum, scalphealer, naturalhaircare, naturalscalpcare, rosemaryforscalp, rosemaryforskin\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>\r\n","options":[{"id":1682820,"name":"Default","price":16.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.9,"amount_with_others":3.12,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.12,"amount_with_others":6.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":13.48,"amount_with_others":10.12,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":11.48,"amount_with_others":8.9}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106289133/-/BEYA_FLOR-113.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106289133/-/BEYA_FLOR-113.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106289109/-/BEYA_FLOR-105.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106289109/-/BEYA_FLOR-105.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106289097/-/BEYA_FLOR-114.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106289097/-/BEYA_FLOR-114.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"}]},{"id":4134380,"name":"Raspberry & Aloe Soothing Bar for Dry and Sensitive Skin","permalink":"raspberry-aloe-soothing-bar-for-dry-and-sensitive-skin","position":10,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/raspberry-aloe-soothing-bar-for-dry-and-sensitive-skin","status":"active","on_sale":false,"created_at":"2011-07-22T19:59:47.000Z","description":"This luxurious facial cleansing bar soothes inflamed skin and cleanses away dirt and makeup.  The organic oils of raspberry, olive, avocado, and coconut plus aloe vera extract moisturize and protects the most sensitive skin. No irritating synthetic ingredients and only the good stuff is included in this long lasting facial soap bar. ","options":[{"id":13663700,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.8,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":2.5,"amount_with_others":0.0},{"amount_alone":3.5,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44902187/-/RasAloe_Soap_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44902187/-/RasAloe_Soap_1.jpg","width":735,"height":481},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44902203/-/RasAloe_Soap_3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44902203/-/RasAloe_Soap_3.jpg","width":761,"height":500},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44902219/-/RasAloe_Soap_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44902219/-/RasAloe_Soap_2.jpg","width":757,"height":500}],"artists":[],"categories":[{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"}]},{"id":335791,"name":"Amazon Antioxidant Treatment ","permalink":"amazon-antioxidant-treatment","position":11,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/amazon-antioxidant-treatment","status":"active","on_sale":false,"created_at":"2009-07-03T09:42:53.000Z","description":"Kicks the butt of any anti-aging product on the market today! All natural and at a fraction of the price. Antioxidants decrease cell destruction, which in turn combats the aging process. The Amazon Antioxidant treatment also fades skin blemishes-including those related to acne, and treats eczema and psoriasis.\r\n\r\nOur soft buttery blend of Cupacu, Murumuru, Passion Fruit, and Acai extracts liquefies upon contact and absorbs into skin quickly. Great as a daytime/overnight facial treatment. The natural cocoa fragrance of the ingredients will make you do a little samba!\r\nNEW PACKAGING 2.5oz Glass Jar.\r\n\r\n\r\nCUSTOMER REVIEWS\r\n\r\n\"WOW. I'm extremely picky and skeptical regarding skin care, so even though this got great reviews I decided to give it a few weeks worth of use before writing mine. The results are really that good- I've never had great skin, (too oily or too dry and always uneven and blotchy) but now I get so many compliments on my skin! My acne cleared up, all dryness is gone, and I have a much more even complexion now. I feel like this absorbs just the right amount without leaving my skin looking oily and makes me glow. I love it. I've never found anything better. Definitely worth it's weight in gold.\" Mollie, Alaska\r\n\r\nI will have to admit I was skeptical of this product's oily consistency at first, but I have been using it for two weeks now and I have grown in to a huge fan. My skin feels so smooth and well hydrated after using this cream and I have had hardly any breakouts since I first began using it.\r\nMallory, Montana\r\n\r\n\"I cannot live without this product! After using only a tiny bit my skin feels smooth, revitalized and healthy. Even on the days I do not use it, I can tell the moisture in my skin has been balanced because of this Brazilian complex. Talk about lasting effects!\" Chris, Salon Owner in San Jose, CA\r\n\r\nThis Anti-Oxidant Face Moisturizer Treatment is truly wonderful. Exceeded my expectations. It works! My skin's texture has changed. Wonderful for someone with Lupus or inflammation, like me. For the first time in years my skin is not flaming red. It looks normal and is softer than it's been in over a decade. Thank you. \r\nKerri, Kansas\r\n\r\n\"I've been using this cream for almost two weeks and have already seen such a huge difference in my skin's texture. This cream is wonderful! The little bumps that were all over my face from stress are now totally gone, my skin tone is noticeably more even and the scars I had from previous breakouts are fading rapidly also the little pimples I was starting to get on my cheeks from stress have disappeared as well. This is one of the very few products I've found that actually does what it's supposed to.\" Hannah, Pittsburgh PA\r\n\r\n\"Amazing product. My fair skin is prone to acne and rosacea, but I've had trouble with neither since using this. Thanks for providing such a great product and service!! xoxo\" Linda, Raleigh, North Carolina\r\n\r\n\"I love this product. The smell is uniquely Amazon/nutty, absorbs quickly. After one week my face is smoother and more glowing -- thanks a bunch.\" Nikki, North Dakota\r\n\r\n\"This is perfect. I use it on my face and hands, and even as anti-wrinkle treatment around the eyes, it does not irritate. Wonderful stuff!\" Tamara Florianopolis, Brazil\r\n\r\nHOW TO USE\r\nTake a small amount and slather on face. Best used as an overnight treatment or daily moisturizer to smooth, even and clarify.\r\n\r\n\r\nACTIVE INGREDIENTS\r\nAcai: Superfruit from the Amazon rainforrest. Rich in Vitamin C, B1, B2 and B3, and E as well as minerals such as iron, potassium, calcium, phosphorus\r\nBrazilian Murumuru Butter: Hydrating anti-inflamatory high in auric, miristic and oleic acid content.\r\nPassion Fruit: high in Vitamins A and C\r\nBrazilian Cupuacu Butter: Rich in omega vitamins and essential fatty acids. Offers a broad spectrum protection from damaging UV-A and UV-B rays.\r\n\r\nOther Ingredients: Organic Cocoa Butter, Brazilian Tucuma, Murumuru, and Cupuacu Butters, Acai Extract, Passion Fruit Oil, Rice Bran Oil, Vitamin E\r\n\r\nFor more natural bodycare items please visit www.beijaflornaturals.com \r\n\r\n<head>\r\n    <title>Beija Flor Naturals Amazon Antioxidant Treatment</title>\r\n    <meta name=\"description\" content=\"Active Ingredients: Acai: Superfruit from the Amazon rainforrest. Rich in Vitamin C, B1, B2 and B3, and E as well as minerals such as iron, potassium, calcium, phosphorus Murumuru Butter: Hydrating anti-inflamatory high in auric, miristic and oleic acid content. Passion Fruit: high in Vitamins A and C Cupuacu Butter: Rich in omega vitamins and essential fatty acids. Offers a broad spectrum protection from damaging UV-A and UV-B rays.\">\r\n    <meta name=\"keywords\" content=\"Amazon Anti-Aging Treatment, Cupuacu, Murumuru, Acai Oil, Passion Fruit Oil, Tucuma Butter, Acai, Omega Vitamins\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"stevonne408@hotmail.com\">\r\n</head>\r\n\r\n<div id=\"product-content\">","options":[{"id":1378531,"name":"Default","price":16.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.4,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.8,"amount_with_others":4.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.75,"amount_with_others":6.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":5.8,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106289349/-/BEYA_FLOR-128.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106289349/-/BEYA_FLOR-128.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/6153671/-/Amazon_Antioxidant_4__Medium_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/6153671/-/Amazon_Antioxidant_4__Medium_.JPG","width":800,"height":531},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/6153711/-/Amazon_Antioxidant_7__Medium_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/6153711/-/Amazon_Antioxidant_7__Medium_.JPG","width":800,"height":531}],"artists":[],"categories":[{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"}]},{"id":423432,"name":"Cali Peach Pomade (4oz)","permalink":"cali-peach-pomade","position":12,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/cali-peach-pomade","status":"active","on_sale":false,"created_at":"2009-10-11T22:42:52.000Z","description":"As with most Beija-Flor Natural products the Cali Peach Pomade can be used on both hair and skin! This product gives the shine and control of good old fashion hair grease and the skin protection of a body balm without the icky chemicals. \r\n\r\nWe use Passion Fruit, Peach Kernel and Coconut oils to nourish the scalp, correct split ends and serve as a shine enhancing agent for all hair types especially heat treated, chemically relaxed and color treated hair. On the body, this product is a light but lasting moisturizer. \r\n\r\nIt has 100% vegetarian ingredients and does not contain mineral oil or other petrochemicals. The firm texture is non-greasy/sticky and won't clog pours like other chemically concocted pomades. All of this goodness topped with a mouthwatering fragrance will be your biggest ally in the brutal winter months!\r\n\r\nSuggested Use for Naturally Curly Hair: This product is great for sealing in moisture, use alone or layered on top of leave-in conditioner for optimum shine and softness. Can also be used for twists, braids or to smooth edges of hair. \r\n\r\nSuggested Use for Body: Emulsify a small amount of product in palm of hands and apply all over body. For super soft skin use on damp skin after shower. \r\n\r\nActive Ingredients: Peach Kernel Oil, Passion Fruit Oil, Coconut Oil, Olive Oil, Grapeseed Oil, Shea Butter, Cocoa Butter, Castor Oi, Vitamin E\r\n\r\n<head>\r\n    <title>Cali Peach Pomade</title>\r\n    <meta name=\"description\" content=\"As with most Beija-Flor Natural products the Cali Peach Pomade can be used on both hair and skin! This product gives the shine and control of good old fashion hair grease and the skin protection of a body balm without the icky chemicals. We use Passion Fruit, Peach Kernel and Coconut oils to nourish the scalp, correct split ends and serve as a shine enhancing agent for all hair types especially heat treated, chemically relaxed and color treated hair. On the body, this product is great for chapped skin that needs protection in the chilly winter months. It has 100% vegetarian ingredients and does not contain mineral oil or other petrochemicals. The firm texture is non-greasy/sticky and won't clog pours like other chemically concocted pomades. All of this goodness topped with a mouthwatering fragrance will be your biggest ally in the brutal winter months!\">\r\n    <meta name=\"keywords\" content=\"NaturalBodyBalm, NaturalHairGrease, NaturalHairShine, CurlyHairCare, AfricanAmericanHair, PeachOil, PeachKernelOil, PeachPomade, CaliPeachPomade, BodyBalm, PassionFruitOil, PeachOilForHair\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>\r\n","options":[{"id":1682716,"name":"Default","price":13.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.9,"amount_with_others":3.12,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.12,"amount_with_others":6.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":13.48,"amount_with_others":10.12,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":11.48,"amount_with_others":8.9}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106289493/-/BEYA_FLOR-075.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106289493/-/BEYA_FLOR-075.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/6153831/-/Peach_Pomade2__Medium_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/6153831/-/Peach_Pomade2__Medium_.JPG","width":800,"height":531}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"},{"id":1198911,"name":"Ships within 48 hours!","permalink":"ships-within-48-hours","url":"/category/ships-within-48-hours"}]},{"id":373422,"name":"Acai Mango Light Face Lotion","permalink":"acai-mango-light-face-lotion","position":13,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/acai-mango-light-face-lotion","status":"active","on_sale":false,"created_at":"2009-08-19T04:22:10.000Z","description":"Another saucy Brazilian blend that packs a powerful anti-oxidant punch! Our acai mango lotion will provide a light balancing moisture to all skin types.  There is no artificial colors or fragrances that irritates sensitive skin. As always, this product contains all of the good stuff and none of the fillers. This includes the all powerful acai and mango extracts, murumuru butter, rosemary and orange essential oils.  \r\n\r\nOur Acai Mango Light lotion is a great daytime moisturizer that pairs perfect with the Amazon Antioxidant treatment at night for improved skin tone and texture. Gives a non-oily healthy glow that can be used under makeup. \r\nNEW PACKAGING: 1.5oz glass\r\n\r\nCUSTOMER REVIEWS\r\n\"My skin glows now because of this face lotion and the Acai antioxcident butter. This is now a beauty staple of mine. Love love love this product. Its by far my favorite.\" Elosi, California\r\n\r\n\r\n\"Absolutely LOVE these products. I was unsure about using butters on my skin as it breaks out very easily but I have seen a difference in my skin every single morning. I use the moisturizer during the day and the antioxidant treatment and night. My face is happy for the first time in months!\" Kate-Ontario, CANADA\r\n\r\n\"I love this lotion, is smooth creamy, not greasy, and absorbs into the skin nicely. Thank you.\" Leslie, Arizona\r\n\r\n\r\n\"FINALLY a product that isn't making my skin break out! I feel like I am doing a great service to my face by using this! Light, clean scent :)\" Heather, New York\r\n\r\nAbout Murumuru Butter\r\nMurumuru butter is extracted from trees that grow in the Amazon Basin.It is a powerful skin barrier repair agent and intense natural moisturize that is rich in oleic and linoleic oils, the contents that promote nutrition and moisture to skin and hair. As an excellent emollient it helps the skin to retain water by creating a protective film - ideal for dry skin. Repairing the skin's lipid barrier will yield long-term moisture.\r\n\r\n<head>\r\n    <title>Acai Mango Light Face Lotion</title>\r\n    <meta name=\"description\" content=\"Another saucy Brazilian blend that packs a powerful anti-oxidant punch! Our acai mango lotion provides light moisture perfect for combination to oily skin types. There is no artificial colors or fragrances that irritates sensitive skin. As always, this product contains all of the good stuff and none of the fillers. This includes the all powerful acai and mango extracts, murumuru butter, rosemary and orange essential oils. Our Acai Mango Light lotion is a great daytime moisturizer that pairs perfect with the Amazon Antioxidant treatment at night for improved skin tone and texture. \">\r\n    <meta name=\"keywords\" content=\"AcaiMango, MangoButter, AvocadoButter, NaturalFaceMoisturizer, OrganicMoisturizer, OrganicSkincare, NaturalSkincare, BrazilianSkinCare, NaturalAntioxidant, Beijaflornaturals\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>\r\n\r\n","options":[{"id":1512876,"name":"Default","price":16.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.8,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.8,"amount_with_others":2.8,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.95,"amount_with_others":3.75}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106289433/-/BEYA_FLOR-151.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106289433/-/BEYA_FLOR-151.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"}]},{"id":336023,"name":"Hemp Buttercream for Hair and Body (4oz)","permalink":"hemp-buttercream","position":14,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/hemp-buttercream","status":"active","on_sale":true,"created_at":"2009-07-03T21:06:43.000Z","description":"Gentle enough for babies bottoms, penetrating for dry cracked man hands, and a detangling moisturizing treat for dry  kinky to curly hair. Can it be true?  Yup, join the green revolution!! \r\n\r\nThe Beija-Flor Naturals hemp buttercream is a  luxurious concoction inspired by The Mixtress' time in Berkeley California. Hemp is naturally grown organic without pesticides and is a nutrient powerhouse rich in Omega 6, 3, and 9. Goes on smooth, absorbs instantly and lasts all day. This nourishing blend is guaranteed to leave both skin and hair buttery soft and hydrated. \r\n\r\nCUSTOMER REVIEWS\r\n\"My Skin and Hair Want Nothing Else\" Jennifer-Rio de Janeiro, Brazil\r\n\r\n\"A seriously great product. And a pleasure to do business with. If you you suffer from extremely dry or itchy skin, or eczema or psoriasis, I urge you to try this product as a treatment.\" Richard, California\r\n\r\n\"Moisturizing and light! I have natural type 4 a/b hair that I wear in twists and my ends are so soft and smooth since I have started using this cream. This item also works as a hand cream. I'll definitely order from this seller again. Mechio, Seattle\" \r\n\r\nHemp Butter\r\n Reduces dry skin discomforts by replenishing moisture and retention by penetrating the lipid layers of skin. This fast absorbing oil is highly effective in protecting sensitive skin and repairing cell breakdown caused by dry, itchy skin.\r\n\r\nThe Omega Acids in Hemp  have been found to assist in correcting dry and problematic skin; typically, psoriasis, acne, and eczema.  \r\n\r\nOther ingredients: Organic Aloe Vera Extract, Sterilized Water, Raw Organic Cocoa Butter, Raw Organic Shea Butter, Raw Organic Mango Butter, Jojoba Oil, Coconut Oil, Apricot Kernel Oil, Vitamin E\r\n\r\nSUGGESTED USE FOR NATURALLY CURLY HAIR:  Apply Hemp Buttercream in sections to damp or dry air. Comb through and air dry. Use alone or under a gel or styler for soft and manageable hair.\r\n\r\nSUGGESTED USE FOR SKIN:  Use as a traditional body butter or hand and foot cream. Apply to damp skin after bath/shower.  \r\n\r\n6oz Size, 12.95\r\n\r\nFor more natural haircare/bodycare please visit www.beijaflornaturals.com\r\n\r\n<head>\r\n    <title>Beija Flor Naturals Hemp Buttercream</title>\r\n    <meta name=\"description\" content=\"Hemp butter is naturally grown organic without pesticides and is a nutrient powerhouse rich in Omega 6, 3, and 9. Omega acids have been found to assist in correcting dry and problematic skin; typically, psoriasis, acne, and eczema. A 100% Vegan product that includes aloe vera extracts and other natural goodies. Absorbs instantly and lasts all day. This nourishing blend is guaranteed to leave your skin buttery soft and hydrated. \">\r\n    <meta name=\"keywords\" content=\"Hemp Buttercream, Hemp Skincare, Hemp Moisturizer, Beija Flor Naturals Hemp, Vegan Skincare, Eco Skincare, Organic Skincare, Beija Flor Hemp Buttercream, natural eczema cure\">\r\n    <meta name=\"author\" content=\"Stevonne Ratliff\">\r\n    <meta name=\"email\" content=\"stevonne408@hotmail.com\">\r\n</head>","options":[{"id":33919140,"name":"Unscented","price":15.0,"sold_out":false,"has_custom_price":false},{"id":42295788,"name":"Coconut Cupcake","price":15.0,"sold_out":false,"has_custom_price":false},{"id":49213185,"name":"Blackberry Sage","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.9,"amount_with_others":3.1,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.8,"amount_with_others":6.7,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":14.6,"amount_with_others":9.6,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":12.8,"amount_with_others":10.2}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106290021/-/BEYA_FLOR-206.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106290021/-/BEYA_FLOR-206.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106289961/-/BEYA_FLOR-205.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106289961/-/BEYA_FLOR-205.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2831325/-/DSC_0310__Custom_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2831325/-/DSC_0310__Custom_.JPG","width":1000,"height":664}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"},{"id":1198911,"name":"Ships within 48 hours!","permalink":"ships-within-48-hours","url":"/category/ships-within-48-hours"}]},{"id":1452771,"name":"Whipped Organic Shea Butter (4oz)","permalink":"whipped-organic-shea-butter-8oz","position":15,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/whipped-organic-shea-butter-8oz","status":"active","on_sale":false,"created_at":"2010-02-03T05:36:23.000Z","description":"Shea butter is a thick and rich butter extracted from the kernel of the karite tree located throughout African savannas. For hundreds of years it has been valued for its vitamin properties because it is rich in Vitamins A, E and F. Our shea butter is unrefined organic and whipped with nourishing coconut, jojoba, and apricot oils for a creamy spreadable texture. It is made to  easily penetrate skin and hair, providing moisture without clogging pores.\r\n\r\nCUSTOMER REVIEWS\r\n\r\n\"I received my shea butter the other day, and I just HAD to write to you to say thank you again. The shea butter is...for lack of any other word...FABULOUS. My skin LOVES it. :) It's such high quality and divine, I really have no words. The scrub also smells delicious and feels so great on my abused feet!\" Nikki Los Angeles, CA\r\n\r\n\"I love love love the whipped shea butters! It made made my skin so soft and smelled delicious!\" Ogechi Los Angeles, CA\r\n\r\n\"I LOVE the how soft my skin is after using the shea butter (the texture is really nice too). It's official....I'm a happy Beija-Flor addict :-)\" Kaee Washington, DC\r\n\r\nSuggested uses for shea butter:\r\n\r\n* Daily skin moisturizer (face and body)\r\n*Overnight face cream\r\n* Treatment for premature facial lines and aging\r\n* Dry scalp treatment\r\n* Great for African hairstyles-locks, twists, braids or chemically processed hair.\r\n* Skin rash- including diaper rash\r\n* Sunburn sun damange and skin peeling, after tanning\r\n* Itching skin due to dryness\r\n* Small skin wounds, skin cracks, and minor burns\r\n* Soften tough skin on feet (especially heels)\r\n* Stretch mark prevention during pregnancy\r\n* Fade blemishes, scaring and even skin tone\r\n* Eczema and psoriasis\r\n* Sun and wind protection\r\n* Helps restore elasticity to skin\r\n* Restores luster to hair","options":[{"id":24437466,"name":"Oatmeal Raisin Cookie","price":12.0,"sold_out":false,"has_custom_price":false},{"id":29670503,"name":"Unscented","price":12.0,"sold_out":false,"has_custom_price":false},{"id":29870003,"name":"Orange Blossom Tea","price":12.0,"sold_out":false,"has_custom_price":false},{"id":29870005,"name":"Fudge Brownie","price":12.0,"sold_out":false,"has_custom_price":false},{"id":29870007,"name":"Chocolate Raspberry","price":12.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.9,"amount_with_others":3.12,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.12,"amount_with_others":6.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":13.48,"amount_with_others":10.12,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":11.48,"amount_with_others":8.9}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106290369/-/BEYA_FLOR-182.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106290369/-/BEYA_FLOR-182.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106290387/-/BEYA_FLOR-179.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106290387/-/BEYA_FLOR-179.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/13741811/-/DSC_0321__Custom_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/13741811/-/DSC_0321__Custom_.JPG","width":1000,"height":664}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"}]},{"id":2897920,"name":"Artisan Perfume Oil (7ml)","permalink":"mandarin-plum-artisan-perfume-oil-3ml","position":16,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/mandarin-plum-artisan-perfume-oil-3ml","status":"active","on_sale":false,"created_at":"2010-11-19T00:48:07.000Z","description":"The Creme de la Creme of handpicked body oil that are non-oily yet concentrated and long lasting. only a dab behind the ears or on the neck will do. Comes in an attractive vintage style glass bottle. \r\n\r\nStrawberry Rhubarb: A sweet and tart fragrance that combines mouthwatering strawberries, the earthy Rhubarb plant and a touch of cinnamon. Savory, smooth and very wearable as an everyday fragrance. \r\n\r\nHoneysuckle: Perfume oil that is sweet, floral and very feminine. Every lady loves honeysuckle fragrance\r\n\r\nWhite Cran and Apple Cider (Women): Sparkling, refreshing cranberry with a bit of spicy sweet apple. \r\n\r\nMandarin Plum (Women): One of the most delicious fragrances I've ever encountered-and that's saying a lot! Sweet juicy plum with sophisticated citrus and floral undertones.\r\n\r\n\r\n\r\nFREE SHIPPING WITH ANY OTHER BEIJA-FLOR NATURALS PURCHASE. \r\n","options":[{"id":10070260,"name":"Mandarin Plum","price":10.0,"sold_out":false,"has_custom_price":false},{"id":10070296,"name":"White Cran and Apple Cider","price":10.0,"sold_out":false,"has_custom_price":false},{"id":14066295,"name":"Mum Mums Honeysuckle","price":10.0,"sold_out":false,"has_custom_price":false},{"id":14066297,"name":"Strawberry Rhubarb","price":10.0,"sold_out":false,"has_custom_price":false},{"id":20501215,"name":"Mum Mums Honeysuckle","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.8,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":2.5,"amount_with_others":0.0},{"amount_alone":4.5,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/28071418/-/Little_Bottles_Standig_Alone_Resized.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/28071418/-/Little_Bottles_Standig_Alone_Resized.JPG","width":382,"height":369},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/28071450/-/Small_Bottle_Elephant_Resized.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/28071450/-/Small_Bottle_Elephant_Resized.jpg","width":431,"height":363}],"artists":[],"categories":[{"id":277242,"name":"Oils Nectars and Fragrances","permalink":"oils-nectars-and-fragrances","url":"/category/oils-nectars-and-fragrances"},{"id":1198911,"name":"Ships within 48 hours!","permalink":"ships-within-48-hours","url":"/category/ships-within-48-hours"},{"id":1681824,"name":"Artisan Perfume Oils","permalink":"artisan-perfume-oils","url":"/category/artisan-perfume-oils"}]},{"id":324301,"name":"Organic Shea Butter Soap and Shampoo Bar Ala Carte","permalink":"organic-soap-and-poo-bars","position":17,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/organic-soap-and-poo-bars","status":"active","on_sale":true,"created_at":"2009-06-17T04:47:38.000Z","description":"Save the harsh cleansers for your bathtub. Beija Flor Naturals' handmade soaps have only the good stuff and are free of harsh detergents, chemicals and sulfates. Cold processed with only the best ingredients: organic shea butter, coconut oil, olive oils and various essential oils and herbs depending on the bar. These are an essential part of bathtime pampering rituals everywhere. \r\n\r\nAs a body cleansing bar, its safe for all adult and children's skin types including sensitive and eczematous. Leaves skin soft, moisturized and residue free. \r\n\r\n As a gentle cleansing shampoo bar, our soaps will leave curly, dry, damaged and/or color treated hair soft bouncy and shiny.  \r\nLarger than most natural soaps on the market, large 4.5oz. bar.\r\n\r\n\r\nCUSTOMER TESTIMONIALS\r\n\r\n\"I tried the sweet orange shampoo bar today. Sweet Orange lathers really well throughout my hair. This soap made my hair feel like silk. I was even able to detangle my hair while I was washing my hair. I had to write to tell you all that you get a 100% fantastic review of this product. It smells delicious. I felt the... need to bite it but I did not. :) Thank you so much. This is a perfect shampoo bar!\" Keisha M Riverside CA\r\n\r\n\r\n\"I washed by baby's curls with your cherry soap today. Words cannot express my satisfaction. Healthy, defined and clean....!\" Stephanie St. Louis, MO\r\n\r\n\"This soap makes my skin feel alive! It rinses clean but when I use it I don't have a need for lotion. Thank you!\" Shawn, Oakland, CA\r\n\r\n<head>\r\n    <title>Beija Flor Naturals</title>\r\n    <meta name=\"description\" content=\"Save the harsh cleansers for your bathtub. Beija Flor's handmade soaps have only the good stuff and are free of harsh detergents, chemicals and sulfates. Cold processed with a premium blend of shea butter, aloe, olive oil and a beavy of nourishing essential oils and herbs. As a gentle cleansing shampoo bar, our soaps will leave curly, dry, damaged and/or color treated hair soft bouncy and shiny. These bars are an essential part of bathtime pampering rituals everywhere. Large 5oz Bars for $6\">\r\n    <meta name=\"keywords\" content=\"ColdProcessedSoap, HandmadeSoap, OrganicSoap, NaturalBodyCare, Olive Oil Soap, SheaButterSoap, VeganBodycare, www.beijaflornaturals.com, naturalcosmetics, PlumeriaSoap, Champka Soap, BathandBody\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>","options":[{"id":35787264,"name":"Cherry Almond","price":6.0,"sold_out":false,"has_custom_price":false},{"id":40023402,"name":"Champaka","price":6.0,"sold_out":false,"has_custom_price":false},{"id":41912853,"name":"Mango ","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.6,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.2,"amount_with_others":2.9,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.1,"amount_with_others":5.1,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":6.9,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/6854301/-/Nom_Chompa_3_szd.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/6854301/-/Nom_Chompa_3_szd.jpg","width":425,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2830921/-/DSC_0094__Custom_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2830921/-/DSC_0094__Custom_.JPG","width":1000,"height":664},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/6854101/-/DSC_0433_Pearberry_Soap2__Medium_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/6854101/-/DSC_0433_Pearberry_Soap2__Medium_.JPG","width":800,"height":531}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"}]},{"id":3933574,"name":"Honey Cinnamon Detox Bar for Combination to Oily Skin","permalink":"honey-cinnamon-detox-bar-for-combination-to-oily-skin","position":18,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/honey-cinnamon-detox-bar-for-combination-to-oily-skin","status":"active","on_sale":false,"created_at":"2011-06-16T09:24:39.000Z","description":"This long lasting, perfectly refreshing facial cleanser is made from organically derived ingredients such as olive oil, cocoa butter & coconut oil. This bar is wonderful for those with combination to oily skin but is non-drying and works for all skin types.\r\nCinnamon and Honey are added anti-fungal/anti-bacterial properties to soothe inflammation due to acne or skin blemishes. This bar has a natural herbal cinnamon smell and it can be slathered directly on the skin for exfoliation. With regular use it should last over a month from my experience. This item ships free! ","options":[{"id":13086178,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.2,"amount_with_others":0.8,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":2.2,"amount_with_others":1.2}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/38345072/-/heartsoap2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/38345072/-/heartsoap2.jpg","width":570,"height":355}],"artists":[],"categories":[{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"}]},{"id":3952878,"name":"Hemp and Cocoa-Mango Buttercream Try Size","permalink":"hemp-and-cocoa-mango-buttercream-try-size","position":19,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/hemp-and-cocoa-mango-buttercream-try-size","status":"active","on_sale":false,"created_at":"2011-06-20T01:47:06.000Z","description":"2oz Select Varieties of the Hemp and Cocoa-Mango Buttercreams for Hair & Skin.  Full info on these products can be found here: \r\nHemp Buttercream: http://beijaflornaturals.bigcartel.com/product/hemp-buttercream\r\nCocoa-Mango Buttercream: http://beijaflornaturals.bigcartel.com/product/cocoa-mango-buttercream\r\n","options":[{"id":13134514,"name":"Cocoa-Mango Buttercream Unscented","price":5.0,"sold_out":false,"has_custom_price":false},{"id":26935089,"name":"Hemp Buttercream","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.8,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.9,"amount_with_others":2.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/38535320/-/SampleSizeCropped.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/38535320/-/SampleSizeCropped.jpg","width":226,"height":339}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"}]},{"id":1315801,"name":"Unrefined Organic Shea Butter ","permalink":"unrefined-orgnaic-shea-butter-8oz","position":20,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/unrefined-orgnaic-shea-butter-8oz","status":"active","on_sale":false,"created_at":"2010-01-22T11:32:42.000Z","description":"Shea butter is a thick and rich butter extracted from the kernel of the karite tree located throughout African savannas. For hundreds of years it has been valued for its vitamin properties because it is rich in Vitamins A, E and F.\r\n\r\nRaw unrefined shea butter comes in a few different colors and textures from bright yellow to beige. Ours is 100% unrefined and organic and comes in a beige color that has a creamy (not sticky) texture so it easily penetrates skin and hair, providing moisture without clogging pores.\r\nNew 4oz Size\r\n\r\nCUSTOMER REVIEWS\r\n\"Incredible stuff. I've paid a small fortune for dilutions of shea butter from large companies. Here's the pure, \r\nreal deal at a fraction of the cost. Nothing moisturizes dry skin better. Period.\" Heather, Connecticut\r\n\r\n\"Your raw shea is the best i've ever had !!! my face is luminous.. i love it !!! Xx\" Dawn, London UK\r\n\r\n\"Oh my goodness! I dont know how I ever lived without this! After experiencing the magic of shea on my face,\r\nI started using it everywhere else! It works great as a body butter, facial moisturizer, hair conditioner,\r\nand even as a lip balm. What a wonderful multi-purpose product! I LOVE this stuff and will be back for more. \r\nMay I never run out...\" Aisha, Utah\r\n\r\nSuggested uses for shea butter:\r\n* Daily skin moisturizer (face and body)\r\n*Overnight face cream\r\n* Treatment for premature facial lines and aging\r\n* Dry scalp treatment\r\n* Great for African hairstyles-locks, twists, braids or chemically processed hair.\r\n* Skin rash- including diaper rash\r\n* Sunburn sun damange and skin peeling, after tanning\r\n* Itching skin due to dryness\r\n* Small skin wounds, skin cracks, and minor burns\r\n* Soften tough skin on feet (especially heels)\r\n* Stretch mark prevention during pregnancy\r\n* Fade blemishes, scaring and even skin tone\r\n* Eczema and psoriasis\r\n* Sun and wind protection\r\n* Helps restore elasticity to skin\r\n* Restores luster to hair\r\n\r\nPLEASE NOTE: Shea Butter texture will be inconsistent and slightly chunky as it is 100% pure and comes straight from gourd of the Karite Nut. For a smoother textured shea butter please check out the whipped organic shea butter: \r\nhttp://tinyurl.com/2v7r9xk\r\n\r\nFor more quality natural products please visit: www.beijaflornaturals.com","options":[{"id":4839691,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.9,"amount_with_others":3.12,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.12,"amount_with_others":6.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":13.48,"amount_with_others":10.12,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":11.48,"amount_with_others":8.9}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44902347/-/RawShea.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44902347/-/RawShea.jpg","width":749,"height":497},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/12343441/-/Raw_Shea_Butter_Pic.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/12343441/-/Raw_Shea_Butter_Pic.jpg","width":300,"height":251}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277240,"name":"Face Products","permalink":"face-products","url":"/category/face-products"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"}]},{"id":2835098,"name":"Artisan Perfume Oils Large (15ml)","permalink":"artisan-perfume-oil-white-cran-apple-cider","position":21,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/artisan-perfume-oil-white-cran-apple-cider","status":"active","on_sale":false,"created_at":"2010-11-02T00:41:51.000Z","description":"The Creme de la Creme of handpicked body oil that are non-oily yet concentrated and long lasting. only a dab behind the ears or on the neck will do. Comes in an attractive vintage style glass bottle. \r\n\r\nStrawberry Rhubarb: A sweet and tart fragrance that combines mouthwatering strawberries, the earthy Rhubarb plant and a touch of cinnamon. Savory, smooth and very wearable as an everyday fragrance. \r\n\r\nMum Mums Honeysuckle: Perfume oil that is sweet, floral and very feminine. Every lady loves honeysuckle fragrance\r\n\r\nWhite Cran and Apple Cider (Women): Sparkling, refreshing cranberry with a bit of spicy sweet apple. \r\n\r\nMandarin Plum (Women): One of the most delicious fragrances I've ever encountered-and that's saying a lot! Sweet juicy plum with sophisticated citrus and floral undertones.\r\n\r\n\r\n\r\nFREE SHIPPING WITH ANY OTHER BEIJA-FLOR NATURALS PURCHASE. ","options":[{"id":9906236,"name":"White Cran and Apple Cider","price":18.0,"sold_out":false,"has_custom_price":false},{"id":10070336,"name":"Mandarin Plum","price":18.0,"sold_out":false,"has_custom_price":false},{"id":14066251,"name":"Mum Mums Honeysuckle","price":18.0,"sold_out":false,"has_custom_price":false},{"id":14066253,"name":"Strawberry Rhubarb","price":18.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.5,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/28068938/-/All_Perfume_Bottles_Resized_1.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/28068938/-/All_Perfume_Bottles_Resized_1.JPG","width":591,"height":340},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/28068922/-/Apple_Bottom_Bottle_and_Box_Reised_Brown.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/28068922/-/Apple_Bottom_Bottle_and_Box_Reised_Brown.JPG","width":398,"height":310},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27444960/-/WhiteCranandApple.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27444960/-/WhiteCranandApple.jpg","width":506,"height":303}],"artists":[],"categories":[{"id":277242,"name":"Oils Nectars and Fragrances","permalink":"oils-nectars-and-fragrances","url":"/category/oils-nectars-and-fragrances"},{"id":1681824,"name":"Artisan Perfume Oils","permalink":"artisan-perfume-oils","url":"/category/artisan-perfume-oils"}]},{"id":2431091,"name":"Juicy Summer Fruit Oils (4oz)","permalink":"juicy-summer-fruit-oils-4oz","position":22,"price":14.0,"default_price":14.0,"tax":0.0,"url":"/product/juicy-summer-fruit-oils-4oz","status":"active","on_sale":false,"created_at":"2010-04-20T12:52:38.000Z","description":"This light and luscious blend is a mixture of 100% Peach, Cherry, and Apricot extract oils.  Apricot oil is known to tone, soften, help retain skin elasticity. When massaged into the scalp it promotes healthy hair growth. Cherry Kernel Oil is rich in vitamins A and E and know for its UV protection. The high end, easily absorbed oil of Peach great for soothing and protecting sensitive skin. \r\n\r\nOur summertime blend is never sticky or greasy. Combined, these three oils are easily absorbed and perfect for a number of uses on face, hair and body. For starters this product can be a...\r\n\r\nPre-shampoo hot oil treatment\r\nScalp oil treatment\r\nBath oil\r\nNighttime face oil\r\nVitamin rich booster to leave-in conditioner\r\nHead to toe body treat\r\nGreat for massage, a day at the beach, or baby!\r\nGentle and soothing enough for sensitive skin, problematic skin and baby bottoms.\r\n\r\n<head>\r\n    <title>Juicy Summer Fruit Oils</title>\r\n    <meta name=\"description\" content=\"This light and luscious blend is a mixture of 100% Peach, Cherry, and Apricot extract oils. Apricot oil is known to tone, soften, help retain skin elasticity. When massaged into the scalp it promotes healthy hair growth. Cherry Kernel Oil is rich in vitamins A and E and know for its UV protection. The high end, easily absorbed oil of Peach great for soothing and protecting sensitive skin. Our summertime blend is never sticky or greasy. Combined, these three oils are easily absorbed and perfect for a number of uses on face, hair and body. For starters this product can be a... Pre-shampoo hot oil treatment Scalp oil treatment Bath oil Nighttime face oil Vitamin rich booster to leave-in conditioner Head to toe body treat Great for massage, a day at the beach, or baby! Gentle and soothing enough for sensitive skin, problematic skin and baby bottoms.\">\r\n    <meta name=\"keywords\" content=\"CherryKernelOil, BodyOil, NaturalHairOil, PeachKernelOil, HandmadeBodyCare, BathOil, NaturalMassageOil, SummerFruitOil, OrganicBodyCare \">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>\r\n","options":[{"id":8688361,"name":"Default","price":14.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.4,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":5.95,"amount_with_others":4.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":5.5,"amount_with_others":4.0},{"amount_alone":4.75,"amount_with_others":3.0,"country":{"id":7,"name":"Canada","code":"CA"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/106290477/-/BEYA_FLOR-185.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/106290477/-/BEYA_FLOR-185.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":277239,"name":"Hair Products","permalink":"hair-products","url":"/category/hair-products"},{"id":277242,"name":"Oils Nectars and Fragrances","permalink":"oils-nectars-and-fragrances","url":"/category/oils-nectars-and-fragrances"},{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"},{"id":1198911,"name":"Ships within 48 hours!","permalink":"ships-within-48-hours","url":"/category/ships-within-48-hours"}]},{"id":2686681,"name":"Honey Butter Tough Love Scrub (8oz)","permalink":"honey-butter-tough-love-scrub-8oz","position":23,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/honey-butter-tough-love-scrub-8oz","status":"active","on_sale":false,"created_at":"2010-08-05T07:27:47.000Z","description":"Skip the trip to the spa. Our honey butter scrub is a weekly all over treatment full of moisturizing honey and healing natural butters. A detoxifying raw sugar base makes this perfect for anyone who wants to get down to serious exfoliating business. Can also be used to pamper feet and rough areas of the skin (elbows, knees etc).The lasting moisture and lightly sweet scent  will have you wishing you could fast forward to the next scrub day. \r\n\r\nBenefits of Raw Honey: \r\nContains mild alpha hydroxy acids that increase elasticity, balance out oily skin and stimulate collagen production. Honey can reverse damage caused by free radicals, and is an excellent humectant. \r\n\r\nActive ingredients: exfoliating sugars, cocoa, mango and shea butters, raw honey, Apricot Oil, Rice Bran Oil, Vitamin E\r\n\r\nSuggested Usage: 1-3X/week massage into clean wet skin while in the shower/bath. Rinse. \r\n\r\n10oz\r\n\r\n<head>\r\n    <title>Honey Butter Tough Love Scrub</title>\r\n    <meta name=\"description\" content=\"Skip the trip to the spa. Our honey butter scrub is a weekly all over treatment full of moisturizing honey and healing natural butters. A detoxifying raw sugar base makes this perfect for anyone who wants to get down to serious exfoliating business. Can also be used to pamper feet and rough areas of the skin (elbows, knees etc).The lasting moisture and lightly sweet scent will have you wishing you could fast forward to the next scrub day. Benefits of Raw Honey: Contains mild alpha hydroxy acids that increase elasticity, balance out oily skin and stimulate collagen production. Honey can reverse damage caused by free radicals, and is an excellent humectant. Active ingredients: exfoliating sugars, cocoa, mango and shea butters, raw honey, Apricot Oil, Rice Bran Oil, Vitamin E 10oz\">\r\n    <meta name=\"keywords\" content=\"HoneyButterScrub, OrganicBodycare, NaturalBodycare, HoneyButterToughLoveScrub, SugarScrub, OrganicSugarScrub, SpaScrub, SpaExfoliator, VeganBodycare, BathandBody\">\r\n    <meta name=\"author\" content=\"Beija Flor Naturals\">\r\n    <meta name=\"email\" content=\"sales@beijaflornaturals.com\">\r\n</head>","options":[{"id":9465675,"name":"Unscented","price":18.0,"sold_out":false,"has_custom_price":false},{"id":29864507,"name":"Sugar and Spice","price":18.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.8,"amount_with_others":6.7,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":13.58,"amount_with_others":10.2,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.95,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":11.8,"amount_with_others":9.75}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25909200/-/sugarpolishnew_2881.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25909200/-/sugarpolishnew_2881.jpg","width":340,"height":340}],"artists":[],"categories":[{"id":277243,"name":"Moisturizers, Scrubs, Soaps and Bath Goods","permalink":"moisturizers-scrubs-soaps-and-bath-goods","url":"/category/moisturizers-scrubs-soaps-and-bath-goods"},{"id":1198911,"name":"Ships within 48 hours!","permalink":"ships-within-48-hours","url":"/category/ships-within-48-hours"}]}]