[{"id":2392791,"name":"Magic Power Coffee 2 x Sachets","permalink":"magic-power-coffee-2-x-sachets","position":1,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/magic-power-coffee-2-x-sachets","status":"active","on_sale":false,"created_at":"2010-04-17T13:56:02.000Z","description":"THIS ORDER IS FOR 2 SACHETS.\r\n\r\n\r\nTHIS IS WHAT YOU GET:\r\n\r\nHIM\r\nHarder Erections \r\nGreater Endurance\r\nPerform Harder\r\nBoost of Energy\r\nPowerful Orgasms\r\nIncreased Sex Drive    \r\n\r\nHER\r\nImproved Sensation\r\nIncreased lubrication production\r\nBoost of Energy\r\nEuphoric Feelings\r\nMultiple Orgasms\r\nIncreased Sex Drive  \r\n\r\nMagic Power Coffee will leave you with a satisfied lover - and a healthier, happier relationship.\r\nYou've never had coffee like this before and it brings a whole new meaning to let's get coffee! Stop and think about it, if you were to go to the doctor and get the little blue pill, you would have to pay the doctor visit and then buy the pills too...ALL NATURAL....WHAT ARE YOU WAITING FOR!!!\r\n\r\nMagic power coffee is the only coffee that is sold on the market that would lead you to the bedroom after a while. This is the world's most romantic coffee on the shelves today.\r\n\r\nThe matter of the fact is that many of us do like the taste of caffeine and what more could you ask for than a coffee that not only gives you a kick, but makes things in your bedroom improve as well. Magic power coffee is known to improve your love life and has a wonderful taste as well.\r\n\r\nThere is a wide variety of not only vitamins and mineral in this wonderful coffee, but it is one of the most overall sexual improvements as well. The ingredients in this coffee are one of the highest standards. There is a lot of research that is put in to the making of this unique coffee and it is sold with self-importance.\r\n\r\nA number of the special ingredients that are found in this unique coffee are; the Epimedium, this grows in a real small shrub and the leaves are shaped as that of a heart, it will remind you more of ivy at first glance. The Chinese prophecy states that a goat herder came across this herb and this is when the sexual potency was discovered. This herb is known to give an exhilarating feeling to the person that consumes it.\r\n\r\nThe other ingredient that is in this coffee is the Goji berry, this is known to improve the immune system as well as your eyesight, and the Goji berry is known to protect the liver and aides in the production of sperm. This is one of the ingredients that help with depression, as this is for the most part the cause for sexual dysfunction.\r\n\r\nMagic Power Coffee contains many well documented male enhancement herbs proven to improve the sexual experience... it doesn't stop there though! Just empty the contents of one package into 6-8 ounces of hot water 30-45 minutes before getting together with your partner and discover the most unforgettable time of your life!\r\n\r\n \r\n","options":[{"id":8567041,"name":"Default","price":14.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/23063571/-/_BqtW_rgBWk___KGrHqQOKkYEu_BR54KwBLwjdD2zgw___12.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/23063571/-/_BqtW_rgBWk___KGrHqQOKkYEu_BR54KwBLwjdD2zgw___12.jpg","width":398,"height":500}],"artists":[],"categories":[{"id":1447241,"name":"Coffee","permalink":"coffee","url":"/category/coffee"}]}]