[{"id":11759304,"name":"Labour of Love & Hate, The Book + CD","permalink":"labour-of-love-hate-the-book","position":1,"price":22.0,"default_price":22.0,"tax":0.0,"url":"/product/labour-of-love-hate-the-book","status":"active","on_sale":true,"created_at":"2013-06-13T06:46:14.000Z","description":"Forget everything you know about Southeast Asia.\r\nLabour of Love & Hate is a unique photo documentary book - the only one to have delved into the driving spirits of the underground music scenes of metal, hardcore and punk in Southeast Asia. In this book, metalheads share what it is like to be a fan of this kind of music today in Southeast Asia and what the music means to them. It becomes a tool, a weapon and a way for the young generation to revolt against everything they dislike in their society while searching for their own identities. They are the metal outlaws.\r\n\r\nDuring the past 30 years the Southeast Asian bands have gone from just playing covers by their Western idols, to producing and distributing their own music. Today it is an organised and thriving music scene but due to both political and religious oppression, and being considered as demoralising to the youth, it has been pushed away from the establishment. Metalheads fight for their passion and for free expression in music and creative arts every day. This book is all about them and how they use their music to make a difference.\r\n\r\nThe reader will for example meet descendants of headhunters on Borneo who play extra aggressive metal to honour their ancestors; Islamists in Jakarta spreading Jihad through political grindcore; female goth metal vocalists performing live in their veils and fighting for feminism in a male-dominated scene; and a re-incarnated Indian Viking whose life is in debt to Scandinavian metal bands. And that is just a few of them!\r\n\r\nEnhance your reading and viewing experience of Labour of Love & Hate by playing the exclusive CD featuring 12 great bands, giving you a soundtrack to your underground musical journey through Southeast Asia.\r\n\r\nReviews international press:\r\n \r\n'Extraordinary! It's a compelling account of [the Resborns'] travels in Southeast Asia and their unearthing of a huge and strident underground metal scene that has fascinating stories to tell and a vast quantity of fantastic music to share with the rest of the world' \r\n-Metal Hammer magazine, June 2013\r\n\r\n\r\n'Forget everything you know about South East Asia...this photo book delves into the underbelly of the region's metal, hardcore and punk scenes and the dedicated people fighting religious and political oppression. A frank look at a hidden subculture.' \r\n- Shortlist \r\n\r\nThe names of the bands on the CD that accompanies siblings John and Lena Resborn's underground-music journey through Southeast Asia might sound juvenilely abstruse - but the bands themselves are deadly serious. They have to be. Due to religious and political oppression, heavy metal on this continent has consequences. \r\n-The New Review (Independent on Sunday), 14 April 2013\r\n","options":[{"id":37155126,"name":"Default","price":22.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.0,"amount_with_others":16.0,"country":{"id":11,"name":"Denmark","code":"DK"}},{"amount_alone":8.0,"amount_with_others":16.0,"country":{"id":14,"name":"Finland","code":"FI"}},{"amount_alone":8.0,"amount_with_others":16.0,"country":{"id":32,"name":"Norway","code":"NO"}},{"amount_alone":4.0,"amount_with_others":8.0,"country":{"id":37,"name":"Sweden","code":"SE"}},{"amount_alone":15.0,"amount_with_others":25.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115801854/-/lolah_front_lowres.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115801854/-/lolah_front_lowres.jpg","width":953,"height":953},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127435572/-/_B1D6318.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127435572/-/_B1D6318.jpg","width":1024,"height":683},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127435584/-/_B1D6322.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127435584/-/_B1D6322.jpg","width":1024,"height":683}],"artists":[],"categories":[{"id":5535750,"name":"Books","permalink":"books","url":"/category/books"}]}]