[{"id":12895614,"name":"Pete and Royce - Suffering of Tomorrow LP LBCR-010","permalink":"pete-and-royce-suffering-of-tomorrow-lp-lbcr010","position":1,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/pete-and-royce-suffering-of-tomorrow-lp-lbcr010","status":"active","on_sale":false,"created_at":"2013-08-10T23:55:20.000Z","description":"New to the catelogue is the first archival reissue from LBC.  It's a little left field from what I've done in the past, but I'm here to expand thine ears mon friere.  With out further adue, I present the whacked out private press reboot of Pete and Royce \"Suffering of Tomorrow.\"  I enlisted John Olson of Wolf Eyes to spill a few words about the release.  Clips are below!\r\n\r\nHere is what John has got to say.....\r\n\r\n\"Ah I remember it well: After a slurry of then-common Rubber O Cement Detroit jammers around the end of the 90's= It was post gig time 2am and the crew was slow moving/ smoke headed and the always pleasant Grux (Rusty) was digging thru the (then slender) Zone Hut lp stacks, mumbling under his breath about some kinda displeasure: The hard low tech hard jamming SHYLOCK s/t was spinning wildly away on the deck- and Grux pulls his cardboard google suit away from his mug and grunts \"Progressive rock...nothing but...I HATE IT...\" Funny coming from a dude who always called me MONGO to be shocked by the stack of INTELLIGENT rock: but not surprising to get some prime SF street dumpster digging GRIME back at my grill from the PHD of Goofery.... It was that moment I realized \"YES\" - finally some jammage that not even the JAMMERS like...FREEDOM. I mean prog rock is like the almighy REGGAE to some: those you cant fly on the plane are gonna jam up & grind the engines to a hater-hault: ALL DAY. PROG: Its outsider-outsider music but with CHOPS and CONCEPTS. Anyone can sound like BYRDS but fuck find me a unit FAST that sounds like anyone from the Killer Dutch camp of Cargo, Windy Corner, Cliffhanger, Ahora Mazda, or the grim brillance of the entire Xhol Carvan outputs or the stark and ragged downer Gravestone lp. Even the well knowns: The Nice, Finch, Colosseum, any Vertigo Jammers: yes those have \"the aura\" to alienate & \"fantasy-ize\" the internal of your brain-existence....- Ever read Edgar Allan Poe WHILE \"Forbidden Planet\" is stroking your globes and massaging the electrics in your nug jelly on a long night ALONE and then fell asleep only to dream of HUXLEY? Ever wish Jazz was more.....makeup friendly wi/ dragons with a slight flirt of GLAM? Can you be a loner and draw Dragons? Did you spend your high school years with one thumb in \"Maximum Rock and Roll and the other in A Crack in the Cosmic Egg\"?Then playboy you are PROGRESSIVE, be proud. So what is this odd rugged looking lp here? This platter has been called the \"first\" private press Greek prog lp from the \"late and weird\" period of prog where things were getting softer and more \"living room\" soft-strange (re: Mexican Scene ala Iconoclasta) and nearly all the raw homemade privates were starting to sound like Jeff Libermans (amazing) \"Summertime\" jam off his phemon \"Synergy\" rec- so dont have the 1980 year by Pete and Royce fool yeah: This Greek duo with all sorts of elaborate help are throwing down a wicked and tuneful dose of Cantenbury UK Cressida-slowed downed Gracious!- styled \"Steel Mill\" English UK worship deal that can fit right next to your Spring reboot and NOT be filed in next to your Socrates, Poll or Blue Birds wrecks.... Organ runs the game here: there are slight flashes of the claustrophobic high end synth lurch to bring/jerk you back to the 80's but the majority of the movements are rich lavish Hammond pensive deals that recall DOM \"Edge of Time\" as much as they lay lazily in the thick Emerson shadow. Great songs here: In classic PROG style there is a short intro to side two then a lengthy broken up long concept track about \"Death and Decay\" that'll sink your boat FAST into a pool of complex arrangements and gadgetry: all well played and thought out: nothing on DERAM was this whacked out, not the World Of Oz single played on 16rpm can get this Brit-close..Even somehow with what I image to be a small budget this thing does NOT sound like the 3 Grit Basement attack of the almighty YEZDA URFA: Instead its big clean sound with strong emphasis on the song writing and plenty o'hooks/ the heralded \"interplay\" is kept slightly and subtle in the back rendering. The beyond amazing cover art is gonna draw/line you in but the SONGAGE is gonna keep you on a one year + lease with option to lurk for an Original. There are many reasons to own this Pete and Royce jammer: 1) its the first time its on wax and as close you are gonna get to owning a Oktohxos-label deal w/o having a child JUST to sell on the black market for loot grip and OG- 2)its way better than the follow up \"Days of Destruction\" - 3)you can leave the cover laying around in your hut/zone next to your old school ANTI HERO sk8 decks so anyone over will be magnetized to the area by the raw homemade brilliance and booosh and instant convo igniter happens 4) if you are new to the Progressive school this is a fine entrance point before you hooked on the real raw shit like Cobra & Spectator Records camp/ or god forbid you will take the leap into the almighty Rock Progressivo Italiano..... So anyway you shape it up having \"Suffering Of Tomorrow\" your greasy mitts you are already gonna started turning SOMEONE off: but the nectar of which you ween from Pete and his homey Royce will far exceed whatever SUFFERING you are under a spell from.....\"\r\n\r\n\r\nRemastered by members of Pete and Royce.\r\n\r\nOfficially licensed reissue from MusicBazz.\r\n\r\nThe link to order is below.  Expected ship date is 9/8. \r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/4g314nQVNTA\" frameborder=\"0\" allowfullscreen></iframe>\r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/Cf0bvtog7g8\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":41117433,"name":"Default","price":14.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123070713/-/pete_royce-cover_FFF.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123070713/-/pete_royce-cover_FFF.jpg","width":1955,"height":1871}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":12160710,"name":"TRUE SONS OF THUNDER - STOP AND SMELL YOUR FACE LP LBCR-009","permalink":"true-sons-of-thunder-stop-and-smell-your-face-lbcr-009","position":2,"price":10.99,"default_price":10.99,"tax":0.0,"url":"/product/true-sons-of-thunder-stop-and-smell-your-face-lbcr-009","status":"active","on_sale":false,"created_at":"2013-07-03T12:18:10.000Z","description":"\r\n\r\n\"Time fer some real talk. If'n the hirsute squad that pillage the junt in Conan had a band, they'd probably sound more like \"Psychedelic Warlords\" than the first Cathedral record, nah'mean? Well, the barlichood ablutophobes in this True Sons of Thunder act done roared over the hills in bout the same way, layin' a strip all round town thick n hot enough to stand out in the most post of apocalypses (i.e. Memphis). Still lampin' on that \"Buy\" button? Havin' a crusty mitt in a clutch of other ill-reputed bands in those parts (Manatees, Oblivians, Sharp Balloons, Four Johns...) mightcould give you a sense of what's in store here. Or maybe you chipmunked away their Spoonful of Seedy Dudes LP for a fortnight-and-a-half of beer sweat and pant stains but just ain't got to it? So ya mean to tell me you don't know they got solos that are to Dave Brock and Ron Asheton what Leigh Stevens was to Hendrix? You don't know about the cold-knuckled clubber behind that there kit? For shame, cuz the bedunged heaviness and aboiement that abound all over their discography are herein stretched out and slowed down juuust enough so they can boogie like motherfuckers when they wanna and maybe affix a lil proto to their punk. They've also finally put to vinyl a Duran Duran/Black Oak Arkansas medley they been kickin around for years and boy-howdy! Never did I realize how much both songs sounded like \"Born to Go\". THAT and other crumbs is finna get belched out ya brainz quicker than you can say \"O-Mound\". Gird yer bits all ya like; they're comin' for ya either way.\r\n-Sebastian Morris-White, Buffet of Loathesome/Fuck You Counselor\r\n\r\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F93418554\"></iframe>\r\n","options":[{"id":38520639,"name":"Default","price":10.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/119824398/-/front_cover-page-001.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/119824398/-/front_cover-page-001.jpg","width":900,"height":900}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":10258960,"name":"Birds of Maya - Celebration LP LBCR-008","permalink":"birds-of-maya-celebration-lp-lbcr-008","position":3,"price":12.99,"default_price":12.99,"tax":0.0,"url":"/product/birds-of-maya-celebration-lp-lbcr-008","status":"active","on_sale":false,"created_at":"2013-03-30T23:14:17.000Z","description":"repress.  pro pressed sleeves that are a beaut to behold!  \r\n\r\n\r\nThough the game mighta changed round em, the three years since Ready to Howl ain't diminished Birds of Maya one ounce (or do they measure in...grams?). You can tell right away on Celebration, cuz it's just as stupefying to describe as every other moment they've put down. Why is that? Seems so simple! But ya get near pronouncements like \"Free or The Groundhogs as seen in the busted mirror mosaic of Japanese underground psych\" and a lil balloon of acid anxiety busts in yer gut. Insufficient. This ain't just about shred and dread; this is about sweat and spit and busted bottles. This is about volume--meaning both quantity AND decibels. It takes a lot for many of us to sit still for side-long live tracks, so I suggest you dethrone that ass and break some valuables when the evil busts start rollin' out like smoke from Sleep's van; it's only natural. And don't fear the \"TV Eye\" cover, neither, cuz it surely made me forget the last 67 beef-witted versions I'd heard. Course, there's so much snarl all over this thing, I'm surprised the mic ain't slumped in the corner, nursing an ulcer, by the end.\r\nAnother fetid feather in Philly's cap. Dressed in hand-painted sleeves, it'll make all the records you file it next to cooler via osmotic paint flakes.\r\n- Sebastian Morris-White, Buffet of Loathsome\r\n\r\n2nd pressing.  Pro Pressed jackets lookin' suave!\r\n\r\n<iframe width=\"420\" height=\"315\" src=\"http://www.youtube.com/embed/3wDT4PQhxN8\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":32111269,"name":"Default","price":12.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":9.5,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.5,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127639668/-/Untitled.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127639668/-/Untitled.png","width":725,"height":685},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100810924/-/celebration.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100810924/-/celebration.jpg","width":960,"height":717},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/101138380/-/master.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/101138380/-/master.jpg","width":960,"height":720}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":8641875,"name":"Dan Melchior - \"C.C.D.E Music \" LP LBCR-007","permalink":"dan-melchior-c-c-d-e-music-lp-lbcr-007","position":4,"price":10.99,"default_price":10.99,"tax":0.0,"url":"/product/dan-melchior-c-c-d-e-music-lp-lbcr-007","status":"active","on_sale":false,"created_at":"2012-12-21T01:34:01.000Z","description":"LAST COPIES.\r\n\r\nDan Melchior's first release of 2013 (I say that with optimism) is bound to confound 's much as impress. Haters gwan hate ad infinitum, but even still. The din of annoyance at Dan's output by many-a critic is really just the pinched wheezing of prudes, straightenin' their periwigs in a last ditch to cover up nervous bald spots. And don't you go joining 'em; ask me, the good times are just gettin' underway.\r\nIn the hazy afterburn of The Backward Path, wherein we glimpsed Dan at his most lyrically candid, comes C.C.D.E, where words are half-smothered in the molting earth and linearity is just some other jaunt. Best I can tell, it's a backyard wedding of Assemblage Blues and Excerpts & Halfspeeds, with Lard Free and Yuzo Iwata on the bride's flank. As you might imagine, the voyage into the sunset of these two involves a roaring mutant chassis and plenty of muddy vistas off the backroads of songform. Is that the Texas outland in the distance? Either way, the geography ahead can only get woolier. But with Dan's thoroughly Scotch-taped map at the ready, there's no need to clench yer cheeks. The next turn's just up the road a piece, I swear. - Sebastian Morris White\r\n\r\nStill Single - \"RECOMMENDED\r\n\r\nThere was a time when the volume of music coming out of Dan Melchior, and the weight of expectation that came with reviewing it in a critical capacity, seemed like either the preambleto a foregone conclusion (“it’s good, buy it”) or the cross-examination of an artist under every light imaginable. I’ll admit, it got hard to keep up, not because what Dan was doing was less than exceptional, but because it was starting to feel like his persona was looming so largely over the music that the records were all staring back at me. There is a lot to evaluate in that statement on its own, let alone across his body of work. And with a few recent releases – 2011’s Assemblage Blues, last year’s Excerpts (& Half Speeds) – it seemed like Melchior had finally moved enough boxes around to locate the trap door in his musical psyche, one that evaded description, particularly against his own past. With the recent C.C.D.E. Music (that’s “Curator Culture Death Epoch,” so don’t even try, blog-man), Dan is lost under one of the strangest and most gloriously unnatural-sounding albums of his career. It’s even stranger that these sounds might be expected from others, but not from him – long swaths of analog synth/ring-mod abuse, two-note blues with no vocals to anchor our image of him, not until the last track at least, where his corrosive croon wishes thoughts of Richard Branson and black hole atoms. The pummeling “Fantasma Negra” aside, these are alien sounds, maybe just as suited/sooted on a Mark E. Smith or a Ben Wallers, had either of those gentlemen the enervation necessary to complete such a work with such a fine-tuned mastery of the home studio/lack of the inebriated butterfingers 4-track drop to the floor, to get to the measurable depths that Melchior accomplishes across this work. It took a while, but the artist is no longer merely content to improve on his own sound than encroach upon a number of others. Might as well – anyone this strong of will should’ve annexed the entire Piedmont by now.\"\r\n\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/upls7dNPEG8\" frameborder=\"0\" allowfullscreen></iframe>\r\n\r\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F75635601\"></iframe>","options":[{"id":27117939,"name":"Default","price":10.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":20.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/85012161/-/rsz_dan_melchior_ccde.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/85012161/-/rsz_dan_melchior_ccde.jpg","width":578,"height":600}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":6609525,"name":"MOUNTAIN CULT - S/T LP LBCR-004","permalink":"mountain-cult-s-t-lp-lbcr-004","position":5,"price":10.99,"default_price":10.99,"tax":0.0,"url":"/product/mountain-cult-s-t-lp-lbcr-004","status":"active","on_sale":false,"created_at":"2012-07-04T01:29:30.000Z","description":"Straight out of a cultural dead zone, aka Brooklyn, comes a band that defies all half assed attempts at lifeblood leaking, beer soaked, fuggin' rock.  Seriously, stumbling upon their self released 7\" was a jolt, from a part of the world where shit like this shouldn't exist.  Blues influenced punk with the right amount of hazy stumble to it that keeps it all coagulated and alive.  Edition of 300 with pro pressed jackets.\r\n\r\n\"Heard plenty of “so bad it’s good” talk of the Mountain Cult single that was going around earlier this year (usually in little more than a paper envelope, from what else I heard), but I passed on it, afraid of being laughed at rather than laughing with. Turns out Mountain Cult aren’t so bad they’re good, but so bad they’re great, as this LP is a wonderful pile of rock n’ roll mush, music that I nearly can’t believe anyone would be willing to claim as their own. They barely stumble through their songs, as the bassist is the only one who seems to keep a beat – the drummer rarely uses two sticks at a time, just kinda smacking his kit when he feels like it. And don’t even get me started on the guitarist, as he makes Thurston Moore sound like Thurston Mozart by comparison – if any actual notes are ever played, it’s accidental. This might all sound like a total wreck, and it is, but I can’t stop listening – Mountain Cult sounds like four Walking Dead zombies getting together to practice Rolling Stones and Moss Icon covers, fumbling their broken fingers on their instruments until someone comes in and blows their heads off. Can’t get enough of this record, and it manages to go by fast – thank you, Little Big Chief!\" -yellowgreenred.com\r\n\r\n\"Man we dug the hell outta the Mountain Cult's self released single and it seems Little Big Chief Records did as well cuz here they are releasing the debut full length by the one and only Mountain Cult. \r\n\r\nMountain Cult's fractured drugged out blues-y negative rock is still sliming its oozing wounds through the filth filled streets and we, for one, are fucking stoked about that!  The self titled long player ventures further down the bombed out k-hole as a logical progression from the single giving up 8 dirges of loose and lice infested bum out punk with caveman trashcan thud drumming, syrupy bass groove, tattered guitar ramblings and moaned vocals that sound as if they were sung from behind a ball gag.  Grimy and grim, Mountain Cult lays out a dark and sordid gutter lifestyle 'how to' manual of primitive trash rock.  While many groups currently trying their hand at lo-fi nebbed out punk seem to fly off the handle going full speed, Mountain Cult slow things down to savor the flavor as they wallow in dungeons of the soul.  Yup, Recommended. \" - Permanent Records\r\n<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/Cu-z3SU1HlY\" frameborder=\"0\" allowfullscreen></iframe>\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/9I6BXfcIji8\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":28640213,"name":"Default","price":10.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":9.5,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.75,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.5,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/64910877/-/cultlp.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/64910877/-/cultlp.jpg","width":638,"height":322}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":5853677,"name":"girls girls girls - borsh lp LBCR-002","permalink":"girls-girls-girls-borsh-lp","position":6,"price":10.99,"default_price":10.99,"tax":0.0,"url":"/product/girls-girls-girls-borsh-lp","status":"active","on_sale":false,"created_at":"2012-04-04T04:41:15.000Z","description":"LAST COPIES.\r\n\r\ngirls girls girls - borsh LBCR-002 4 songs of complete dementia. avant garage to some. 2 shorties and 2 long tracks. edition of 250 with silk screened album art. Steve McCabe from Axemen wrote a few words about their most recent live performance at the Negative Guest List show in Brisbane back in December. \"Gir!s Gir!s Gir!s headed up the lineup with a set so ambient the management asked them to tone down the Brian Eno interstitial sounds between sets. Hauntingly beautiful even with volume set on level 1 GGG reflected the moment with the subtlety of an exquisite Monet depicting a fragment of daily life. C’est magnifique, as quietly charming yet nigglingly grating as a young marble giants cd set on infinite loop in the vacant house next door, playing too quietly to call the noise control but loudly enough to irritate if one were to focus on it.\" \r\n\r\nSince 2005, in the form of releasing various home spun/hand assembled CDrs and cassettes, and for a few years before that in various other musical ventures, Matt Earle, along with a lengthy list of collaborators, has been quietly building a vast discography of unwaveringly disjointed sounds, much of which is available from his own Breakdance the Dawn label. The patience and dedication required to sift through these endless streams of CDrs and tapes are simply qualities I don't have, but lucky for lazy assholes like me classy VA label/mail order LBC has presented two creamers of the considerable crop with this release and the Xwave platter reviewed below. On Borsch, originally released as a C90 before Earle's tape deck broke (or is it after he got a new one?), Brisbane’s premier Motley Crue-band name derived outfit deliver their first vinyl offering. Matt is backed here by Adam Park on bass and Rohan Holiday on guitar, both of whom have also been in a million incestuous bands heading this beyond-primitive wing of current OZ Out-Rock. Under the Girl's handle they present some fairly dark, dwindling stuff, and throughout the four instrumental tracks I'm routinely picturing the backing band of Distorted Levels jammin' in a dingy warehouse on the outskirts of the same sunless Michigan town the Index once called home (specifically the last jaw-dropping title track on here), with the fidelity and attitude similar to a grip of weathered Swell Maps demos. Lofty praise I know, but they earned it.  Like pops always said: \"They's all the same from the waist down.\" But what about when they don't even got no legs to fall down the stairs with? - Put The Music In It's Coffin Blog\r\n\r\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"http://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F29848883&show_artwork=true\"></iframe>\r\nLBCR-002","options":[{"id":18769605,"name":"Default","price":10.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":9.5,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.75,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":18.5,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/57473871/-/gggfront.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/57473871/-/gggfront.jpg","width":864,"height":864}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":15364917,"name":"Astor 'Inland' LP (Kye 26)","permalink":"astor-inland-lp-kye-26","position":7,"price":15.99,"default_price":15.99,"tax":0.0,"url":"/product/astor-inland-lp-kye-26","status":"active","on_sale":false,"created_at":"2013-12-06T01:00:17.000Z","description":"Kye is proud to present 'Inland', the new LP by Clapton-based Astor. Advancing the cause of 2012's 'Alcor' LP, 'Inland' finds Mark Harwood and sometime collaborator Maja Larsson further complicating reason with dark and circuitous audio constructs.\r\nTaking its inspiration from Gerard Murnane's 1988 novel of the same name, 'Inland' explores a personalized perception of space, both real and imagined, returning a fabricated dreamworld which teases logic and tricks the ear. Conceived with piano, bells, tapes, gong, autoharp, hammer, t.v., organ, and dry ice pellets, 'Inland' cuts the face of expectation to expose a 10 part fractal sonic geography, governed by its own laws, and flushed with all the beauty and horror of the natural world. 'Inland' arrives in a full color, high gloss sleeve, in an edition of 400 copies.\r\n\r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/sDnVUNKwL70\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":49966284,"name":"Default","price":15.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128901462/-/astor.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128901462/-/astor.jpg","width":956,"height":960}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":15271119,"name":"Agents of Misfortune single sided 12\"","permalink":"agents-of-misfortune-single-sided-12","position":8,"price":15.99,"default_price":15.99,"tax":0.0,"url":"/product/agents-of-misfortune-single-sided-12","status":"active","on_sale":false,"created_at":"2013-12-02T15:59:49.000Z","description":"LEGIT>\r\nVT nails it.\r\nStaggering out of nowhere LP with classy paste-on sleeves in a hand-numbered edition of 300 copies that documents a live blat from this legendary short-lived proto-metal/thug/avant psych group led by Cliff Burton, the soon to be Metallica bassist who played on Ride The Lightning/Master Of Puppets et al before being killed in a bus crash in 1986. Never before released, this is the legendary Hayward Area Recreation Department’s 1981 Battle Of The Bands appearance, where Burton led this crude power trio into areas of avant/psych excess that the label describes as “Haino ’78 jamming live in a gym hall”. It truly has to be heard to be believed, starting out with precision nod-out riffs and batteries of machine gun drums before the bass and guitar just melt in a-formal F/X damaged heaven, tearing through form and fidelity with alla the six string excess of Heather Leigh’s Me-Ba (which parts of it sound uncannily like), Masayuki Takayanagi’s Call In Question or, yeah, Fushitsusha at their most ludicrously power trio. Seriously, this is one of the ear-popping revelations of the years, a side of guitar playing so wild it comes over like Billy TK’s intro to The Human Instinct’s Stoned Guitar extrapolated at length by a bunch teenage metal nuts on serious acid. Just walls of spirit-carved feedback joys and the celebratory sound of electricity maxing out into pure synaesthetic euphorics.  Been playing this one non-stop, back-to-back at VT all this week and it is a goddamn revelation. File next to Lulu as they only two Metallica satellites that ever mattered. Beyond metal, beyond psych, totally drooling electric guitar excess. Very highly recommended but won’t be around long!\r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/N1q0zLaXUuE\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":49638801,"name":"Default","price":15.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128667225/-/551376_10152052397898817_593210711_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128667225/-/551376_10152052397898817_593210711_n.jpg","width":535,"height":380}],"artists":[],"categories":[{"id":6801807,"name":"s/sided 12\"","permalink":"s-sided-12","url":"/category/s-sided-12"}]},{"id":15313944,"name":"Put The Music in It's Coffin Zine - Vol. 5","permalink":"put-the-music-in-it-s-coffin-vol-5","position":9,"price":8.99,"default_price":8.99,"tax":0.0,"url":"/product/put-the-music-in-it-s-coffin-vol-5","status":"sold-out","on_sale":false,"created_at":"2013-12-04T01:27:10.000Z","description":"FINAL ISSUE.  best rag to come along in forever.   if you think postage is wonky, email me and we can figure it out.\r\n\r\n\"Put the Music in its Coffin is back from a long hibernation for one last coming out party before self-imposed exile, and you?re invited to cum ahn pheel tha noize! Originally, the fifth and final issue was planned to be a collaborative effort of a small but admirable gathering of the minds from the underside of contemporary ?music journalism,? but as your lone wolf ?Editor? ?aint exactly the networking type and can?t be bothered with follow up reminders/requests, it soon became clear that it was best to stick to the same format as the previous four. Here ?The Journalist? lends his insights to a reappraisal of the harsher sides of early non-music, be it academic, underground, or decidedly above in nature, and discusses a few works in terms of the birth Hardcore Punk. Plus, a lengthy overview of Scott Foust?s career from the man?s biggest fan, himself, a long talk, rife with informed commentary on topics ranging from inept Japanese Prog. to Taylor Swift, with the duo that compromise what is currently Philadelphia?s most promising musical unit, Good Area, and a brief but poignant internet correspondence with one of Australia?s top exports of broken sound for over a decade strong, Matt Earle. Not to mention the typically bulging reviews section made even more so from the amount of time we?ve been away for and you?ve got an issue with as much content as the first four combined. 84 full size (11x17) pages with full color center spread. Good Gard what a way to go out!\"","options":[{"id":49792119,"name":"Default","price":8.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":14.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128773632/-/photo_1_copy.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128773632/-/photo_1_copy.jpg","width":240,"height":320}],"artists":[],"categories":[{"id":2594155,"name":"Zine","permalink":"zine","url":"/category/zine"}]},{"id":15145119,"name":"AARON DILLOWAY \"THE BEAUTY BATH\" LP RR-011","permalink":"aaron-dilloway-the-beauty-bath-lp-rr-011","position":10,"price":31.99,"default_price":31.99,"tax":0.0,"url":"/product/aaron-dilloway-the-beauty-bath-lp-rr-011","status":"active","on_sale":false,"created_at":"2013-11-27T15:34:37.000Z","description":"japanese import.  small press of 250.\r\n\r\n\"This is another landmark of the most respected artist in today's noise scene, \r\nAaron Dilloway.\r\n\r\nAtmospheric and beautifully simple, a pure tape composition stands out his crude and intense nature.\r\n\r\nNothing ever released like this before.\r\n\r\nComes with the flyer of Aaron dilloway and Hanson Records 20 years anniversary exhibition \"Archive\" at gallery haus in Tokyo which can get only at here.\r\n\r\nPlus we have a special package comes with very limited \"Archive\" exhibition catalog zine book which also can get here only.\r\n\r\nDon't miss it.\" - rockstanksy records.","options":[{"id":49195893,"name":"Default","price":31.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128343123/-/beautybath2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128343123/-/beautybath2.jpg","width":1000,"height":786}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":15131556,"name":"15-60-75 Numbers Bands \"Jimmy Bell's Still In Town\" Reissue DBL LP","permalink":"15-60-75-numbers-bands-jimmy-bell-s-in-town-reissue-lp","position":11,"price":23.99,"default_price":23.99,"tax":0.0,"url":"/product/15-60-75-numbers-bands-jimmy-bell-s-in-town-reissue-lp","status":"active","on_sale":false,"created_at":"2013-11-27T01:22:27.000Z","description":"can't tell you how many time's i almost pulled the trigger on discogs for the OG of this.  one of the most anticipated reissues in a year flooded with em'.  already in the second pressing according to the website?  i dunno which one i'm getting.  i'll update when i know.  previewed track don't float your boat?? DON'T FRET.  this is a motherfuckin' GROWER.  seriously.  \r\n\r\nHailing from Kent, Ohio, 15 -60-75 (The Numbers Band) is considered one of the forefathers of the Akron / Cleveland music scene of the 1970s and their musical pedigree is pretty impressive---including members who would later go to found Devo and siblings of the legendary Chrissie Hynde.\r\n\r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/kZl0i4HuRYc\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":49150755,"name":"Default","price":23.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128306256/-/JimmyBellFrontCover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128306256/-/JimmyBellFrontCover.jpg","width":680,"height":680}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":14975979,"name":"Buck Biloxi And The Fucks / Giorgio Murderer 7\"","permalink":"buck-biloxi-and-the-fucks-giorgio-murderer-7","position":12,"price":6.99,"default_price":6.99,"tax":0.0,"url":"/product/buck-biloxi-and-the-fucks-giorgio-murderer-7","status":"active","on_sale":false,"created_at":"2013-11-20T15:06:33.000Z","description":"too good not to restock!!! last copies from the label methinks.\r\n\r\n","options":[{"id":48594741,"name":"Default","price":6.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127906734/-/buck.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127906734/-/buck.jpeg","width":600,"height":585}],"artists":[],"categories":[{"id":2258429,"name":"7\"","permalink":"7","url":"/category/7"}]},{"id":14699349,"name":"Amateur Childbirth - PRIPYAT LP","permalink":"amateur-childbirth-pripyat-lp","position":13,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/amateur-childbirth-pripyat-lp","status":"active","on_sale":false,"created_at":"2013-11-08T01:25:07.000Z","description":"first release from Joel Stern of Sky Needle's new imprint, Disembraining.\r\n\r\nVT - \"New release on Joel Stern of Sky Needle et al’s Australian underground imprint: second LP by Brisbane acoustic pop destroyer Amateur Childbirth aka Ivan Matthew Hicks. Recorded by Joel Stern in his old Grecian home across 2012-2013, Hicks summons the lonesome ghosts of Chris Knox and the Kilgour brothers across a buncha tracks that would transmute The Madcap Laughs into even more paranoid contemporary scenarios, with lyrics that feel like scraps of found text, rejection letters, mysterious reports and self-loathing diary entries. Hicks channels the early Flying Nun singer/songwriter style with considerable aplomb, giving the nod to the cracked visions of the Shimmy Disc roster while digging into new vectors of blurry acoustic drone and edge of the bed heartbreak and confusion. Stern’s recording style is key, with enough haze and distance to situate the goings-on in a parallel universe where the ghost of Tall Dwarfs is the presiding deity and the bedroom the beating heart of the kingdom. Great loner folk-pop power-cried straight to tape, recommended. \"\r\n\r\n\"Pripyat is the second LP from Brisbane acoustic pop destroyer Amateur Childbirth, aka Ivan Matthew Hicks.  Recorded by Joel Stern (Sky Needle) in his old Grecian home over a protracted period through 2012 - 2013 - It is an eleven part atonal poem to the desecration of the hollow halls of Eastern Europe by UFO cults, a soliloquy to the radiation blossoming in the clouds from its broken windows as the populace flee down ropes.  Paul Slater guests on drums, Josh Watson (Sewers) on violin, and the Ecclesiastic Uprising of the Comet's Tail guest as spiritual & literary support.\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/t-Hh0703MgM\" frameborder=\"0\" allowfullscreen></iframe>  \r\n\r\n\r\n<iframe style=\"border: 0; width: 100%; height: 42px;\" src=\"http://bandcamp.com/EmbeddedPlayer/album=1854451905/size=small/bgcol=ffffff/linkcol=0687f5/t=1/transparent=true/\" seamless><a href=\"http://disembraining.bandcamp.com/album/pripyat\">PRIPYAT by Amateur Childbirth</a></iframe>","options":[{"id":47616168,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127195809/-/a2543730672_10.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127195809/-/a2543730672_10.jpg","width":751,"height":747}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":14458974,"name":"Flamen Dialis – Symptôme Deï (1979) reissue LP","permalink":"flamen-dialis-symptome-dei-1979-reissue-lp","position":14,"price":27.99,"default_price":27.99,"tax":0.0,"url":"/product/flamen-dialis-symptome-dei-1979-reissue-lp","status":"active","on_sale":false,"created_at":"2013-10-28T14:28:43.000Z","description":"Just got hooked onto this earlier in the year.  from the label that brought you the mighty Archaïa reissue.  don't miss this.\r\n\r\nFirst ever vinyl reissue of this legendary French masterpiece named after the high priest of Jupiter. Not surprising there’s an often ritualistic quality to the music, with endless repetitive synth melodies, solemn wordless chanting and brooding layers of mellotron spacing out in an overall eerie occult atmosphere. The lysergic vision of Flamen Dialis recalls like-minded French outcasts as Archaïa, Spacecraft, Verto etc. A truly unique album which was first rescued from obscurity by Mio Records, who reissued the album on cd back in the day, but this has also been long out of print. Mastered from a pristine LP copy as the original masters got lost in the mists of time. Includes pro-printed insert detailing the band’s history. Limited to 500 copies on 180gr vinyl.\r\n\r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/gBz3pjM0Iuo\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":46800033,"name":"Default","price":27.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126589455/-/flamendialiswebsite.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126589455/-/flamendialiswebsite.png","width":557,"height":575}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":14493666,"name":"Yeast Culture - Shit On A Shingle CASS BOX (hand made triple cassette)","permalink":"yeast-culture-shit-on-a-shingle-cass-box-hand-made-triple-cassette","position":15,"price":21.99,"default_price":21.99,"tax":0.0,"url":"/product/yeast-culture-shit-on-a-shingle-cass-box-hand-made-triple-cassette","status":"active","on_sale":false,"created_at":"2013-10-29T21:33:07.000Z","description":"I'd be a fool not to carry \"new\" material from this band of misanthropes.  America's hidden gem coated in industrial waste.  their earlier recordings are stuff of legend.  see below for further insight.  love these guys.  Screen printed tape set mounted on 7x7\" cedar shingle, with inner 12pp booklet of drawings, text, montage. ed. of 100.\r\n\r\nShit-on-a-Shingle.  Originally produced February 1991 as untitled studio working tapes over two hours in length.  Unlike the Yeast Culture vinyl that's out there (earlier records predating these sessions), this material is free form studio experimentation with a whole lot of odd tapes of all kinds what we recorded during 1987-early 91.  The sounds are from the earliest years, done much in a collective experimental spirit with no precise goal.  The mixdown glues these together in a way that's a pastiche of primitive recordings, mostly at playback speeds unlike the original material. Sounds vary from an almost power electronics intensity in parts to progressing collages with tinny rhythms, or tiny voices and background electronics.  It's the juxtaposition of the different styles that forms the abstraction.\r\nNone of these long tracks have been released before now.  These tapes are a good sample of the wackiness or intensity of Incubator circa 1990, during the time that we had the retail shop and mail order operating on a daily basis.  The 7\" single by Yeast Culture in the Circusirus compilation was made originally from these same tapes by several levels of extreme processing  Roughly 2.5 hours of studio material here, had been reduced to merely 4 minutes of compressed sound in Circusirus.  Now the full expanded sounds may be heard here.  Mastered 2013.","options":[{"id":46919301,"name":"Default","price":21.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126674415/-/SOASMontage2x1100-150DPI.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126674415/-/SOASMontage2x1100-150DPI.jpg","width":1036,"height":1044}],"artists":[],"categories":[{"id":2269308,"name":"cass","permalink":"cass","url":"/category/cass"}]},{"id":14198475,"name":"Rusted Shut - Rehab LP","permalink":"rusted-shut-rehab-lp","position":16,"price":17.99,"default_price":17.99,"tax":0.0,"url":"/product/rusted-shut-rehab-lp","status":"active","on_sale":false,"created_at":"2013-10-15T20:01:58.000Z","description":"the one that kicked it all off.  first time on wax.  limited to 300.  \r\n\r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/jPe5aJfsodc\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":45858111,"name":"Default","price":17.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125913837/-/RustedShut_11183_LP_Jkt_FRONTCOVER.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125913837/-/RustedShut_11183_LP_Jkt_FRONTCOVER.jpg","width":302,"height":304}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":14057025,"name":"Graham Lambkin 'Abersayne' b/w 'Attersaye' 7\" (Kye 706)","permalink":"graham-lambkin-abersayne-b-w-attersaye-7-kye-706","position":17,"price":10.99,"default_price":10.99,"tax":0.0,"url":"/product/graham-lambkin-abersayne-b-w-attersaye-7-kye-706","status":"active","on_sale":false,"created_at":"2013-10-08T22:36:58.000Z","description":"Kye is proud to present 'Abersayne'/'Attersaye', a brand new 7\" single by Graham Lambkin, his solo debut on the format after 21 years in the game. 'Abersayne'/'Attersaye' pairs a perfectly serviceable love song with a rough-and-ready late-night lament (featuring one conspicuous overdub). Expertly mastered by Jason Lescalleet at Glistening Labs, 'Abersayne'/'Attersaye' arrives in a pro-printed full color high gloss sleeve, with lyric insert, in an edition of 500 copies.\r\n\r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/DtQFP0RAqlk\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":45350145,"name":"Default","price":10.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":9.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":18.5,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125551098/-/1244398_10202154083357669_50674640_o.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125551098/-/1244398_10202154083357669_50674640_o.jpg","width":3092,"height":1355}],"artists":[],"categories":[{"id":2258429,"name":"7\"","permalink":"7","url":"/category/7"}]},{"id":14249043,"name":"Dark Sunny Land \"Emanations for a Returning\" LP","permalink":"dark-sunny-land-emanations-for-a-returning-lp","position":18,"price":20.99,"default_price":20.99,"tax":0.0,"url":"/product/dark-sunny-land-emanations-for-a-returning-lp","status":"active","on_sale":false,"created_at":"2013-10-17T23:28:36.000Z","description":"Ahh the kind of alienating pulse that resognates in this house quite nicely.  limited to 150 copies.  Beautiful silk screened art.  \r\n\r\n\r\nThe Archdrude Julian Cope reviewed it in October's Address Drudion on Head Heritage and says:\r\n\"Also, do try and search out the delightful and highly useful EMANATIONS FOR A RETURNING by Boston?s Dark Sunny Land. Released on One Hand Records, this limited vinyl edition shakes and sparkles with that same shimmer as Japanese Gagaku ceremonies, all Timeless and Hazy and Almost and Nearly. It?s probably those singing bowls that throw time off so, or perhaps the household objects, or maybe even the subtly rendered Theremin. Indeed, I?m loathe to compare this vinyl LP with anything too specific, for it is entirely itself. Yes, the music of Dark Sunny Land occupies mostly a peculiar heat haze hinterland, a semi-permanent perch that always appears to threaten a massive increase in volume, but never does. But EMANATIONS FOR A RETURNING is a fine LP housed in a delightful art sleeve, and it don?t half endlessly repeat well, Motherfuckers.\"\r\n\r\nReaders of the Black To Comm blog might also be familiar with Dark Sunny Land ... Stigliano has championed DSL for years and has also written up this one:\r\n\"Yupyupyup, it's the same thang that I reviewed late last year but here's a freshly-pressed vinyl version for those of you who wouldn't even dream of buying one of these newfangled tea coasters in a millyun years! Frankly I wouldn't mind spinning and re-spinning this engaging melange of electro-acoustic sounds if they were pressed up on paper plates, but this particular issue sounds surprisingly warm and human like good vinyl always has and many Cee-Dees never will. Not only that but the guy who did this 'un up ought to be pretty proud releasing a platter like this which not only sounds great but looks fantastic in a silkscreened sleeve that stands as a work of art in itself. One of the highlights of the 12-inch season that should be on your must-have list, and if you must have it better hurry up because only 150 of these smackers were popped out!\"\r\n\r\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/84874549\"></iframe>","options":[{"id":46032810,"name":"Default","price":20.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126043296/-/dsl-emanations2.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126043296/-/dsl-emanations2.png","width":307,"height":299}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":13298568,"name":"SKY NEEDLE - DEBASED SHAPES LP","permalink":"sky-needle-debased-shapes-lp","position":19,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/sky-needle-debased-shapes-lp","status":"active","on_sale":false,"created_at":"2013-09-01T15:49:49.000Z","description":"\"Second full-length album from this amazing Australian homemade instruments orchestra, now upgraded to a seven piece big band: Debased Shapes is a revelation, with the group moving on from the weirdo Sun Ra/Moondog hands-on DIY improvisations of their first album into a liminal zone of left field pop synthesis and ‘debased’ songcraft. Parts of this beautiful album almost sound like a Scratch Orchestra re-imagining of the early Rough Trade sound, stuff like the Raincoats or even The Swell Maps re-crafted for clunky hands-on sound sculptures, with female vocals somehow directing every squawk and dunt towards a vision of psychedelic pop that comes out of invention more than technique. There’s still a dazzling afro-primitive free jazz feel to the choruses of honking geese and thrifty percussion but they feel more like hallucinatory song forms here, true DIY imaginings of heavenly pop hits. A stunning amalgam of sound sculpture, improvised percussive freak out and super personal pop vision. Still no one like them, highly recommended!\" -VT\r\n\r\nAnnouncing  the  second  full  length  LP  ‘Debased  Shapes’  by  Australian  band  Sky  Needle  performing  hypnotic, messed up, unmistakable / mistaken music using an array of invented and homemade instruments.\r\n(Bruit Direct Disques, 2013)\r\n<iframe width=\"420\" height=\"315\" src=\"//www.youtube.com/embed/gyQ_HpCCIHw\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":42538911,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123628413/-/sky-needle.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123628413/-/sky-needle.jpg","width":418,"height":418}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":12245154,"name":"A BAND CALLED LIFE 7\" (Albert's Basment)","permalink":"a-band-called-life-7-albert-s-basment","position":20,"price":12.99,"default_price":12.99,"tax":0.0,"url":"/product/a-band-called-life-7-albert-s-basment","status":"active","on_sale":false,"created_at":"2013-07-08T17:35:18.000Z","description":"for all you lovers of \"what the fuck is going on here\" moments, this has got it in spades!!!  de listen below.  It's a LONG 7\".  100 pressed.\r\n\r\nAbc Life formed in Melbourne in 2003 by Adam Best and Karl von Bamberger(of Horse Mania, Hammering The Cramps), recorded first album that year, played a gig. For seperate reasons both had to return in 2004 to Tasmania where they originally harkened from. Had one more band practice in Tassie in 2004 which this EP is the outcome and then broke up to pursue nothing. Got back together in 2009 to release and promote the first record, happily together ever since.\r\n\r\n\r\n<iframe style=\"border: 0; width: 100%; height: 42px;\" src=\"http://bandcamp.com/EmbeddedPlayer/album=2556015474/size=small/bgcol=333333/linkcol=ffffff/transparent=true/\" seamless><a href=\"http://albertsbasement.bandcamp.com/album/a-band-called-life-ep\">A Band Called Life EP by Albert&#39;s Basement</a></iframe>","options":[{"id":38810319,"name":"Default","price":12.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":9.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":12.5,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/120658938/-/abclife.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/120658938/-/abclife.jpg","width":987,"height":1000}],"artists":[],"categories":[{"id":2258429,"name":"7\"","permalink":"7","url":"/category/7"}]},{"id":11739441,"name":"RAGTIME FRANK - LIVE AT ST. GEORGE'S LP","permalink":"ragtime-frank-live-at-st-george-s-lp","position":21,"price":24.99,"default_price":24.99,"tax":0.0,"url":"/product/ragtime-frank-live-at-st-george-s-lp","status":"active","on_sale":false,"created_at":"2013-06-12T13:33:19.000Z","description":"\r\n\r\nNGL036, Limited edition of 100 copies only.  blasted blues hounds take note.  8 live shakes of crude tasmanian heavy.  A. Bishop would approve.\r\n\r\nFirst blast of the post-Lost Domain era from our man in the south, in which brother Frank fires one down from the pulpit in Hobart town. And my, nobody knows how to confer the sacraments to the assembled brethren like this brandy soaked boho. \r\n\r\nThe hail of gtr/vox brimstone showered down in this his second NGL LP oughtta dispel any notion that old mate might have curled up with his slippers and pipe after leaving Brisbane a couple of years back. In true form he stomps and hollers his way through a set of favourites (Stagger Lee, John the Revelator, Mole in the Ground et al) with his trademark loose swagger and some of his 'heaviest' vocal delivery to date. Meanwhile, the string work on this disc punches well above the weight of his 3 Watt vintage amp, arcing lines of feedback and fuzz into the congregation that nod back to the kinda damage he was doing in peak form Lost Domain and G55. \r\n\r\nThe locational anomaly of an Australian based 'believer' out-muscling the pack of blues hound wannabes and channelling the true spirit of the south is one of those sweet mysteries you shouldn't think about too much - just dig it man. He's got the keys to the kingdom. \r\n- Leighton Craig \r\n\r\nUnhinged live performance from a Hobart church hall. \r\n\r\nRagtime Frank liberates gospel, blues & field hollers from the constraints of tuning and good sense. \r\n\r\nHis right foot stomps with a church elder's religious zeal & the guitar burns away on the cusp of feedback like a Memphis session player who was too noisy & random for Sam Phillips. And then he sings & yells about looking just like a monkey & wailing on electric harp like Wild Man Fischer mixed with Little Walter. \r\n\r\nFar too weird for the purists....just right for boozy parties. - Simon Ellaby\r\n\r\n<iframe width=\"400\" height=\"100\" style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"http://bandcamp.com/EmbeddedPlayer/v=2/track=1995213358/size=venti/bgcol=FFFFFF/linkcol=0687f5/\" allowtransparency=\"true\" frameborder=\"0\"><a href=\"http://negativeguestlistrecords.bandcamp.com/track/side-a-live-at-st-georges\"> by Ragtime Frank</a></iframe>\r\n","options":[{"id":37088736,"name":"Default","price":24.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115603854/-/rag.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115603854/-/rag.jpg","width":927,"height":1000}],"artists":[],"categories":[{"id":2193046,"name":"LP","permalink":"lp","url":"/category/lp"}]},{"id":10968891,"name":"Glands Of External Secretion ‎– Reverse Atheism DBL LP","permalink":"glands-of-external-secretion-reverse-atheism-dbl-lp","position":22,"price":22.99,"default_price":22.99,"tax":0.0,"url":"/product/glands-of-external-secretion-reverse-atheism-dbl-lp","status":"active","on_sale":false,"created_at":"2013-05-05T22:35:40.000Z","description":"uninitiated?  DIP YOUR TOES IN HERE.  an unbelievably out there slice.  one of defining moments in the BUFMS catalog.  \r\n\r\nidwal fisher blog really nails it...\r\n\"And then there's the philosophy that lies behind all this. Something I feel less than qualified to write about but which points a big dirty finger at religion, theology and most probably existentialism. One day somebody will disseminate this remarkable double album and its true greatness will be revealed. As for me I’m still digging around in Jodorowsky’s background and wondering how Roald Dahl ended up getting credited on the same album as L. Ron Hubbard. The Glands have given us an album that continues that great tradition of taking an experimental approach to popular music and infused it with a religious health warning. Not something you come across everyday.\r\n\r\nWhat saddens me about Reverse Atheism is that its greatness has yet to be recognised. I’m not sure how long this has been on release but a cursory scan of the internet reveals that little has been said in its support. As an intelligent listener the least you can do is buy a copy and find out what’s going on for yourself.\"\r\n\r\nLAX MAN writeth.....\r\n\r\nThe dedicated emergence of BUFMS as both a historical 'n contemporary source of neo Dadaist styled brain disembowelment has been most joyous to behold lo these past few years. From the stupendously great compendium that was the 'Induced Musical Spasticity' 4lp boxset (2009) & movin forward into the blindin light of hipster indifference, the whacked, manipulative collages they's embroider is perhaps the finest aural lysergide to be found amongst us since the goldern era of LAFMS. To wit, one need look no further than Glands Of External Secretion's 2xlp 'Reverse Atheism', which's just been released 'n whose varied landscapes of sound stitchery takes on all manner of religiosity, both real & imagined. And it ain't just the sublime duo of Manning & Glass this time neither. Ye, they have assembled a supporting cast of DOZENS to assist them in this magnum opus, the credits've those both impressed 'n enlisted readin like a freaks moderne take on 'It's Mad Mad Mad Mad World' (there must be bodies buried everywhere!-Capt'n Siltbreeze). For instance Bruce Russell, Alastair Galbraith, Patricia Rowland, Scott Simmons, Doug Pearson, shit, even Earl Kuck makes an appearance! Which proves once & for all him 'n Seymour Glass ain't the same feller. It's one of them conundrums, like for years I thought Dan Marino was just a fat suit alias for Roger Daltrey , then come that Super Bowl not long back where's they was both on screen pretty much at the same time, so's then I knowed the difference. I don't ask for much, a little proof will do. But let's not digress. \r\nAnd this ad hoc patchwork've left field tinklers, tappers, tapers 'n tots tackle not only the obvious (L Rondo or Lizzy Claire P for instance) but also re-diddle the words & tuneage of Hippocrates, Roald Dahl, Osmond Brothers, God's Gift, Alejandro Jodorowsky & Flannery O'Conner to name but a few. For those what like they's room filled with layers've sound transparency, perhaps to impress or intimidate housemates or neighbors into thinkin yr legion is many, 'Reverse Atheism' is a most excellent ally in the pursuit've such chicanery. As Quinus Ennius wrote (shoeless) many moons ago 'Amicu certus in re incerta cernitur'. And who amongst us could argue with that? Even John Frum needed a buddy sometimes. Glands Of External Secretion understand that if you wanna win the race, you's gotta go a little berserk to do so. Which is how this fine document operates; it's successfully wrestled the madness of others & dropped'em on they's collective noggin. You might think that winnin isn't everything, but losin most assuredly sucks.\r\n\r\nincludes a 30 minute cdr.\r\n","options":[{"id":34492212,"name":"Default","price":22.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":23.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/107884749/-/R-3366091-1327526009.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/107884749/-/R-3366091-1327526009.jpeg","width":303,"height":303}],"artists":[],"categories":[{"id":2498669,"name":"2xLP","permalink":"2xlp","url":"/category/2xlp"}]},{"id":6744739,"name":"MUURA \"untitled\" 7\" ","permalink":"muura-untitled-7","position":23,"price":7.99,"default_price":7.99,"tax":0.0,"url":"/product/muura-untitled-7","status":"active","on_sale":false,"created_at":"2012-07-20T00:45:15.000Z","description":"Last copies of the debut 7\" from Matt Earle's solo project Muura!  All the art on these are done on cardboard.  one of my favorite 7\"s to toss on right before i pass out.\r\n\r\n\"If you’re unfamiliar, Muura is Matt Earle who is perhaps best known in the States from xNOBBQx or his work with his indefatigable label, Breakdance the Dawn. Here we are treated with feedback heavy minimalist drones done the old fashioned way, with amps, guitar and a little drum (I think anyway). Real immersive stuff. Like the more sensitive parts of A Handful of Dust, particularly the B side. Geez, that’s a niiiice one.\" - quemada\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/K4f4Qw-5jy4\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":21433997,"name":"Default","price":7.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":8.5,"amount_with_others":2.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/66219469/-/Muura1-520x500.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/66219469/-/Muura1-520x500.jpeg","width":520,"height":500}],"artists":[],"categories":[{"id":2258429,"name":"7\"","permalink":"7","url":"/category/7"}]},{"id":6744705,"name":"WARDENBURGER \"S/T\" CASS","permalink":"wardenburger-s-t-cass","position":24,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/wardenburger-s-t-cass","status":"active","on_sale":false,"created_at":"2012-07-20T00:39:23.000Z","description":"Alberts basement.  brisbane super group!  previous release was on BDTD.\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/Q2u1pXMUsew\" frameborder=\"0\" allowfullscreen></iframe>","options":[{"id":21433903,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":1.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":3.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":7.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/66219165/-/wardenburgercover1.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/66219165/-/wardenburgercover1.jpeg","width":552,"height":880},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/66653717/-/ward.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/66653717/-/ward.jpg","width":720,"height":405}],"artists":[],"categories":[{"id":2269308,"name":"cass","permalink":"cass","url":"/category/cass"}]}]