[{"id":2419211,"name":"Black diamond sterling wedding set inlaid with onyx and opal","permalink":"wedding-set","position":1,"price":800.0,"default_price":800.0,"tax":0.0,"url":"/product/wedding-set","status":"active","on_sale":false,"created_at":"2010-04-19T21:26:27.000Z","description":"Unique his and hers sterling silver black diamond wedding set inlaid with Australian opal and black onyx. Matching handmade bands feature 2 channel set round black diamonds flanked by alternating black onyx and blue-green Australian opal inlay. His wedding ring has 2 black diamonds totaling .16 carats. The ring is 6mm wide and is a size 10. This band is available in other sizes and color combinations by special order. It is hand signed \"MMH\" by Mark Hileman on the inside of the ring. \r\n\r\nHer wedding band also has 2 channel set black diamonds totaling .12 carats. The blue-green Australian opal in her ring is a perfect match to the opal in his band. Her ring measures 5.5mm wide and is a size 6 1/2. It is also available in other sizes and color combinations.\r\n\r\nA black diamond is a genuine diamond that has been enhanced through a radiation treatment to obtain a uniform black color. Just like white diamonds, black diamonds are a 10 on the Moh's hardness scale and make a good stone for everyday wear.\r\n\r\nOpal is the only gemstone known to man to have the natural ability to diffract light. An opal’s color is created when the voids between the particles split light entering the stone. The size and alignment of the spheres and voids, as well as the light source, determines the colors produced. To view an opal’s color play at its best, the light source must be coming over your shoulder. An opal’s color can cover the full spectrum of the rainbow.\r\n","options":[{"id":8647091,"name":"size 6 1/2 and 10","price":800.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/23315761/-/MD256_CS001_black_diamond_onyx_opal_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/23315761/-/MD256_CS001_black_diamond_onyx_opal_1.jpg","width":999,"height":999}],"artists":[],"categories":[{"id":1460031,"name":"Wedding Sets","permalink":"wedding-sets","url":"/category/wedding-sets"}]},{"id":2419271,"name":"Gem dinosaur bone inlay ring in sterling silver ","permalink":"handmade-mans-sterling-silver-band-inlaid-with-gem-dinosaur-bone","position":2,"price":350.0,"default_price":350.0,"tax":0.0,"url":"/product/handmade-mans-sterling-silver-band-inlaid-with-gem-dinosaur-bone","status":"active","on_sale":false,"created_at":"2010-04-19T21:34:26.000Z","description":"Unique handmade sterling silver man's band inlaid with dinosaur bone by artisan Mark Hileman. The band measures 8mm wide and is a size 10 1/4. The ring is inlaid with 2 different kinds of gem dinosaur bone- red-orange with black matrix and reddish brown with grey matrix. This Utah dinosaur gem bone came from the Colorado Plateau and was a living animal during the Jurassic Period around 144 to 208 million years ago.\r\n\r\nThis ring may be special ordered in other sizes or inlay stones.","options":[{"id":8647511,"name":"size 10 1/4","price":350.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":14.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/23316601/-/Sterling_silver_man_s_band_inlaid_with_red_dinosaur_bone_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/23316601/-/Sterling_silver_man_s_band_inlaid_with_red_dinosaur_bone_1.jpg","width":999,"height":999}],"artists":[],"categories":[{"id":1460021,"name":"Men's Rings","permalink":"mens-rings","url":"/category/mens-rings"}]},{"id":2419311,"name":"Unique sterling silver Amethyst ring with inlaid Australian opal and sugilite","permalink":"unique-sterling-silver-amethyst-ring-with-inlaid-australian-opal-and-sugilite","position":3,"price":450.0,"default_price":450.0,"tax":0.0,"url":"/product/unique-sterling-silver-amethyst-ring-with-inlaid-australian-opal-and-sugilite","status":"active","on_sale":false,"created_at":"2010-04-19T21:37:06.000Z","description":"Sterling silver ring featuring a 1.6 carat Amethyst accented by Australian opal and sugilite inlay. Inlaid lavender and purple sugilite combine with red Australian opal for a striking accent to the 8mm trillion cut purple amethyst. The ring is a size 6 ¼ and is available in other sizes and color combinations by special order.\r\n\r\nAmethyst boasts the color of royalty, a rich violet-purple and is the most highly prized variety of quartz. Amethyst is cleansing, both physically and psychologically. It helps promote internal balance, harmony and stability. Amethyst also helps sharpen the conscious mind and enhances one’s mental powers. It is used to improve memory and keeps thoughts in line with life goals. Amethyst is the stone of pure, true, emotional love.\r\n\r\nAbout Sugilite\r\nSugilite is named for the Japanese geologist who discovered the first specimens in 1944, Ken-ichi Sugi. In 1975, the only known deposit of gem grade sugilite was found in the Wessel Mine in the Kalahari Desert near Hotazel in Kuruman, Republic of South Africa. At first it was thought to be a very small sugilite deposit, but later found to be a commercial sized deposit estimated to contain as much as ten to twenty tons located 3,200 feet below the surface. Sugilite commands a high price for an opaque gem material, due in part to the difficulty of removing it from such a great depth.\r\n\r\nIt is thought that sugilite strengthens the heart and promotes physical healing as well as reducing stress by balancing the mind, body and spirit. Sugilite seems to protect against and dissipate anger and other negative energies by encouraging peace of mind, a general feeling of well being and spiritual love.\r\n\r\nAustralian opal information\r\nOpal is a tightly packed array of millions of spherical particles of amorphous silica (SiO2 NH2O). Opal has a hardness of 5.5 to 6.5 on Moh’s Scale. It is the only gemstone known to man to have the natural ability to diffract light. An opal’s color is created when the voids between the particles split light entering the stone. The size and alignment of the spheres and voids, as well as the light source, determines the colors produced. To view an opal’s color play at its best, the light source must be coming over your shoulder. An opal’s color can cover the full spectrum of the rainbow.\r\n\r\nOpal has been mined worldwide; however, Australia accounts for 96% of all commercial opal and is the main source of precious opal. Opal is mined in many locations throughout New South Wales, Queensland and South Australia. The main areas of production are Mintabie, Lightning Ridge, Coober Pedy, Andamooka and Queensland. Most opal in Australia is found in Cretaceous rock with one exception; opal from the Mintabie area is found in Paleozoic rock. Opal may form in vertical or horizontal seams in the sandstone as well as in fossilized formations. Because of the unique conditions under which opal is formed, it is nearly impossible to find two opals exactly the same.\r\n","options":[{"id":8647631,"name":"Default","price":450.0,"sold_out":false,"has_custom_price":false},{"id":8647641,"name":"size 6 1/4","price":450.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":15.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/23317401/-/CS023_Amethyst_sterling_silver_inlaid_sugilite_and_Australian_opal_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/23317401/-/CS023_Amethyst_sterling_silver_inlaid_sugilite_and_Australian_opal_2.jpg","width":999,"height":999}],"artists":[],"categories":[{"id":1460011,"name":"Women's Rings","permalink":"womens-rings","url":"/category/womens-rings"}]},{"id":2419331,"name":"Inlaid Australian opal sterling silver pendant","permalink":"inlaid-australian-opal-sterling-silver-pendant","position":4,"price":150.0,"default_price":150.0,"tax":0.0,"url":"/product/inlaid-australian-opal-sterling-silver-pendant","status":"active","on_sale":false,"created_at":"2010-04-19T21:40:27.000Z","description":"Genuine Australian opal inlaid in a handmade sterling silver pendant. The pendant is inlaid with one piece of unique rolling flash multi-color Australian opal. The opal inlay fires strong green, red, yellow and orange as you move the pendant. It is a very unique piece of Australian opal! The pendant measures 12mm wide at the bottom and is 14mm long. Other inlay stones may be substituted for the opal inlay by special order. The bale on the back of the pendant will accommodate most chains or up to a 4mm omega chain. The sterling silver chain in the photo is not included. ","options":[{"id":8647671,"name":"Default","price":150.0,"sold_out":false,"has_custom_price":false},{"id":8647771,"name":"chain is not included","price":150.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/23317841/-/P412_silver_and_rolling_opal_inlay_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/23317841/-/P412_silver_and_rolling_opal_inlay_2.jpg","width":999,"height":999}],"artists":[],"categories":[{"id":1460041,"name":"Pendants","permalink":"pendants","url":"/category/pendants"}]},{"id":2419361,"name":"Spiderweb turquoise and Australian opal inlay ring with blue topaz","permalink":"womans-sterling-silver-topaz-ring-inlaid-with-turquoise-and-australian-opal","position":5,"price":450.0,"default_price":450.0,"tax":0.0,"url":"/product/womans-sterling-silver-topaz-ring-inlaid-with-turquoise-and-australian-opal","status":"active","on_sale":false,"created_at":"2010-04-19T21:42:53.000Z","description":"Unique handmade woman's sterling silver blue topaz ring inlaid with Australian opal and spiderweb turquoise. A sparkling .75 carat trillion cut blue topaz is accented by 2 pieces of inlaid blue Australian opal and 3 pieces of inlaid spiderweb turquoise. The Australian opal is deep blue with flashes of green coming through. The turquoise inlay is sky blue with black webbing. The contemporary ring design features a space between the two sides of the ring which makes the topaz appear to float. It also allows for the the size of the ring to be adjusted slightly without having to size it. This ring is a size 6 1/2 but can be special ordered in other finger sizes and other colors of inlay materials. The ring measures 16mm at its widest point and tapers to 4mm at the bottom of the shank.\r\n\r\nAustralian opal information\r\nOpal is a tightly packed array of millions of spherical particles of amorphous silica (SiO2 NH2O). Opal has a hardness of 5.5 to 6.5 on Moh’s Scale. It is the only gemstone known to man to have the natural ability to diffract light. An opal’s color is created when the voids between the particles split light entering the stone. The size and alignment of the spheres and voids, as well as the light source, determines the colors produced. To view an opal’s color play at its best, the light source must be coming over your shoulder. An opal’s color can cover the full spectrum of the rainbow.\r\n\r\nOpal has been mined worldwide; however, Australian opal mines account for 96% of all commercial opal and are the main source of precious opal. Opal is mined in many locations throughout New South Wales, Queensland and South Australia. The main areas of opal production are Mintabie, Lightning Ridge, Coober Pedy, Andamooka and Queensland. Most opal in Australia is found in Cretaceous rock with one exception; opal from the Mintabie area is found in Paleozoic rock. Opal may form in vertical or horizontal seams in the sandstone as well as in fossilized formations. Because of the unique conditions under which opal is formed, it is nearly impossible to find two opals exactly the same.\r\n","options":[{"id":8647781,"name":"size 6 1/2","price":450.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":14.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/23318161/-/CS010_topaz_inlaid_with_turquoise_and_opal-1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/23318161/-/CS010_topaz_inlaid_with_turquoise_and_opal-1.jpg","width":999,"height":999}],"artists":[],"categories":[{"id":1460011,"name":"Women's Rings","permalink":"womens-rings","url":"/category/womens-rings"}]}]