[{"id":12787761,"name":"CAGE Grind Noir - Pilots CD","permalink":"cage-grind-noir-pilots-cd","position":1,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/cage-grind-noir-pilots-cd","status":"active","on_sale":true,"created_at":"2013-08-05T16:15:21.000Z","description":"It's here at last! The debut CD from CAGE Grind Noir.\r\n\r\ncomes in card lancing pack.\r\nlimited to 500 copies.\r\nfeatures 3 bonus tracks from the 'Saint Nicolas' download EP.\r\nget a free download (sent via email) upon purchase.\r\n\r\nTracklist-\r\n\r\n1. Con Air\r\n2. The Rock\r\n3. Vampire's Kiss\r\n4. Face/Off\r\n5. Matchstick Men\r\n6. Kick Ass\r\n7. Knowing\r\n8. 8MM\r\n9. The Wicker Man\r\n10. World Trade Center\r\n11. Deadfall\r\n12. Firebirds\r\n13. Trapped In Paradise\r\n14. A Christmas Carol\r\n15. The Family Man\r\n\r\nTo check out the trailer go here-\r\n\r\nhttps://soundcloud.com/cagegrindnoir/sets/pilots-trailer\r\n\r\nFACEBOOK.COM/CAGEGRINDNOIR\r\nCAGEGRINDNOIR.BANDCAMP.COM\r\n\r\nReviews-\r\nhttp://rubyredriver.tumblr.com/post/59709759893/cage-grind-noir-pilots-review-what-you-looking\r\n\r\nhttp://grindtodeath.com/zine/cage-grind-noir-pilots-2013","options":[{"id":40750353,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.0,"amount_with_others":0.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122957460/-/IMG-20130807-00199.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122957460/-/IMG-20130807-00199.jpg","width":2048,"height":1536}],"artists":[{"id":226461,"name":"CAGE Grind Noir","permalink":"cage-grind-noir","url":"/artist/cage-grind-noir"}],"categories":[{"id":2294623,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":12096303,"name":"Atomçk - NEVER WORK CD","permalink":"atomck-never-work-cd","position":2,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/atomck-never-work-cd","status":"active","on_sale":true,"created_at":"2013-06-30T06:37:51.000Z","description":"Previously only available for download or a cassette that was limited to 100 copies, this Grindcore masterpiece is now available on CD for the first time! feature 19 bonus tracks of the whole album being played live! 38 tracks total.\r\n\r\nReview from Grind To Death Zine and used with permission of Alex-\r\n\r\nOne thing people can never call Atomck is boring, love them or loathe them their work occupies an exclusive tangent of music, a resonance of that wave length that imbues their work  full of inventive albeit unorthodox gateways that perplex as much as they do grind. \r\n\r\nNever Work their second studio full length, a follow up from quantum musical minefield  \"Yes to Alien Victory\", is very much in the same vein of its quasi-experimental-progressive-grind surrealism predecessor, only with more traction, clarity and everything inherently Atomck. Starting with doom-riffic opener Desert Blast, Atomck set the stage for peace, only for the tail end of the track to open up to a series of disorientating cacophonies, a modus operandi set in motion with their trademark thrice layered majestic clamour. It is this triarchy of daze, hypnotise and grind that forms the core of their content with notable exception to the out of the blue mid-release noise mongering of No Sleep to Trutnov, colabarated between Linus and Winters in Osaka, and a secondary entanglement with noise with the boisterous rabble of Atoknong.\r\n\r\nHowever dissecting their core armament, the most ambitious and shocking element in their aberrant exploitation is without a doubt the fantastical and sometimes inexplicable range and dynamic of  vocal contortions.  From ear-bone splintering highs of seemingly alien peaks, to backwater gruffs and bellows, the vocal experience is unforgettable and boasts a fluidity that allows it to jump from pitch based zeniths to nadirs without transition.\r\n\r\nGuitars ever faithful to their dualistic progressive and grind via absurdism roots posses a logarithmic flare, but one born of an mathematical anomaly rather than any conformative technical skill set. The guitar tone employed has a distinct needle-pointed sharpness and agility to it, but without hesitation jumps into something beefier for those more entropic moments. Drums are likely the only anchor to normality the band possess, normality being a relative and distorted point of contact by now, although not fixated on rampant blasts, the drums give a flexible referential drive to the release, their output directly analogous to the guitars.\r\n\r\nIts bohemian grind at its most tempered, radical yet not excessive, boldly presenting something engaging in a curios rarity. Atomck have refined their modular brain storm grind, to a point of great finesse, truly worthy of your attentions.\r\n\r\nAtomçk - NEVER WORK CD Review from Power Play magazine....\r\n\r\nOriginally released as a limited edition, one hundredcopy cassette, this album now enters the realm of positively mainstream, with a run of 500 copies on CD. Those that poses the tape-and clearly there aren't that many-will probably want to track this down, as you get the original recording plus the bonus of a complete gig at The Undertone, Cardiff in 2011. \r\nIf you're unfamiliar with grind (why?), the sheer volume of tracks, and collective running time, shouldn't put you off. 38 in asmidge under forty minutes tells you all you need to know. Generally, it's fast, brutal and much akin to England's current disintegration of the Aussies in their quest to retain that famous urn,as far as sadistic intent is concerned. Spot the cricket fan, uh? The production's adequate, but not much more, but for a 500 run, really, what do you expect? Cue nostalgic chat about tape trading days, ohh when I was a lad etc... \r\nAccompanied by a press pack that has its tongue pressed very firmly in cheek: \"starting as a drum machine/Agorophobic Nosebleed grind band they got a \"real\" drummer so they could play live and disappointpeople more often...\" makes a refreshing change from the norm, too. Having witnessed them unleashing their fury supporting Wormrot, I can certainly vouch for their level of intensity and indeed self-deprecation. If you feel like being hit by a sledgehammer somewhere around your cranium, then this is about as close as you'll want to get. Time to grin and accept the punishment...\r\n\r\n(POWERPOINTS 7)\r\n\r\nAtomçk - NEVER WORK CD Review from Metal Hammer Magazine.\r\n\r\nThe press release accompanying Never Work says that Atomck have been 'perennially under-appreciated since 2006'. That much could be said about many UK grind bands, but in recent years the scene has begun to poke its grotty head out of the gutter. Of that scene, Atomck are worthy representatives, incorporating influences that span grind's history, yet daring to be different. Song titles like Disco-Dance Axis give a strong clue of where their heart lies. Desert Blast's doom-laden groove is an unexpected opening, as chaos soon decends in a violent succesion of short song bursts, vocalist Linus ranging from the screams of a 50s b-movie starlet to the roars of the beast chasing her. No Sleep Til Trutnov's electronic noise terrors are prehaps the zenith of a record set to kill, with enough frenetic savagery to please the encrusted faithful, while songs like Big Shit and and Monster Of Justice are, dare it be said, catchy, their grooves and infectiously shrill leads thus providing safe havens amidst the maelstrom and anchor points for newcomers trying to make sense of it all. 7/10","options":[{"id":38299965,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.0,"amount_with_others":0.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/119173098/-/atomckcoverfordiscogs.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/119173098/-/atomckcoverfordiscogs.jpeg","width":350,"height":350}],"artists":[{"id":214410,"name":"Atomçk","permalink":"atomck","url":"/artist/atomck"}],"categories":[{"id":2294623,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":10716249,"name":"Ocksen - All We Were CD","permalink":"ocksen-all-we-were-cd","position":3,"price":4.25,"default_price":4.25,"tax":0.0,"url":"/product/ocksen-all-we-were-cd","status":"active","on_sale":true,"created_at":"2013-04-23T06:01:08.000Z","description":"We have compiled all the recorded output from this U.K. Power Violence band onto on handy, cheaply priced CD.\r\n\r\nComes in card sleeve and Limited to 200 copies.\r\n\r\nTracks 1-6 are from the European Fastness 5 way split CD w/ Xaros/ The Afternoon Gentlemen/ A Den Of Robbers/ Ablach\r\nTracks 7-9 are from the split 7\" w/ Wake The Machines\r\nTracks 10-12 are Previously Unreleased\r\n\r\nReview-\r\nhttp://grindtodeath.com/zine/review-ocksen-all-we-were-2013","options":[{"id":33613545,"name":"Default","price":4.25,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.0,"amount_with_others":0.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/109421877/-/ock.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/109421877/-/ock.jpg","width":441,"height":456}],"artists":[{"id":196086,"name":"Ocksen","permalink":"ocksen","url":"/artist/ocksen"}],"categories":[{"id":2294623,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":4495615,"name":"Bathtub Shitter - Dance Hall Grind CD","permalink":"bathtub-shitter-dance-hall-grind","position":4,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/bathtub-shitter-dance-hall-grind","status":"active","on_sale":true,"created_at":"2011-09-23T18:53:34.000Z","description":"Limited edtion U.K. release. Limited to 500 copies. Remastered. 2 bonus tracks-track 12 previously unreleased/track 13 from the split 7\" with Misery Index. comes in Digipack with new/extended artwork.\r\n15 Track cd.\r\n\r\nFirst release on Rip Roaring Shit Storm Records\r\n\r\nGrind To Death review-\r\nhttp://grindtodeath.com/zine/review-bathtub-shitter-dance-hall-grind-2005\r\n\r\nD review from Mass Movement Magazine-\r\n\r\nBathtub Shitter – Dance Hall Grind CD (Rip Roaring Shit Storm)\r\nTo the uninitiated, Bathtub Shitter is one of the BEST grindcore bands ever. EVER! This incredible record starts off with a Nintendo/Super Mario Bros style intro “Introduction – Over the SOB” then smacks you straight in the face with Bathtub Shitter’s unique style of grindcore. Sludgy (almost Gism-sounding) growled vocals meet screechy high pitched wailed screams over the top of some of the most intense grindcore. The assault on your senses will have you happily bleeding from your ears (and quite possibly your eyes, nose and mouth as well) This is a remastered re-release of an older Bathtub Shitter record they self released on their own label a few years back, it’s nice to see Rip Roaring Shit Storm release it with excellent packaging (digipack) and lyrics (thank you!) to bring this band to as many people as possible. BS cover a range of topics in their lyrics including the very important topics of shit, bowels, bed wetting, stinking asses and of course shit. Their tongues are planted firmly in their cheeks lyric wise, but to me it makes it that much more enjoyable, and if you look deeply enough you’ll see their lyrics tackle some serious issues as well. “Skate of Bulgaria” is a prime example. While not wild about the cover art, the interior art and back cover art more than make up for it. The inside drawing under the CD is AWESOME, I love it and the Bathtub Shitter graffiti art on the back is epic! Prepare yourself to be brutalized by the masters of grind, as this remastered re-release will tear your head off. Highlights, every song! Seriously there is not a bad track on here. If you don’t like this, I seriously worry about you. Jethrobot\r\n\r\nCD Review from Power Play Magazine-\r\n\r\n BATHTUB SHITTER\r\n\"DANCE HALL GRIND\"\r\nGenre: Grindcore\r\nRip Roaring Shit Storm Records\r\n\"Grindcore by its very nature is hideous, and  when you throw it in a bag with the zany proclivities of the Japanese, you get something that sounds an awfull lot like Osaka's Bathtub Shitter.\r\n'Dance Hall Grind' originally released in 2005, is everything you already imagine it to be and more. Song titles follow the principle of fusing bodily fluids with well known phrases, such as 'Rest In Piss' and 'Everybody Has The Wet', though other tracks such as 'Re-Shit' and 'POP-People On The Paper' show a more reflective, intelligent side to Bathtub Shitter, resulting in some of the most sophisticated and morally astute observations this side of Cumchrist.\r\nI'm pulling your leg of course, which is what i assume Rip Roaring Shit Storm Records were doing when they decided this deserved a re-release. The music within follows a standard grindcore blueprint, a little Dying Fetus here, some Brutal Truth there, with a couple of thrash moments and somr truly repulsive high pitched squealing which is quite like the sound of a child would make were it speaking in tongues.\r\nIf you have any self - respect as a music, this will only irritate, anger and disgust you. All those in aspiring bands hoping to find a place for your music, this is proof that anything,, no matter the quality, can make it onto the shelves.\"\r\n2 out of 10\r\n\r\nReview from Metal Hammer-\r\nBATHTUB SHITTER\r\n'Dance Hall Grind'\r\n\r\n'Japanese Grindsters making a splash'\r\n\r\nWith a name that brings to mind all you favourite YouTube scat videos, Bathtub Shitter clearly aren't going to be a chin-stroking experience in thoughtfull post-metal with songtitles named after quantum physics and Rimbaud poems. What we have here is some funny voiced death metal/grindcore with titles like 'Shit Drop' and the seven minute epic 'Rest In Piss'. Dance Hall Grind was originally self released in 2005 but its seeing a limited re-release for some reason. This won't be an album you listen to repeatedly, and you won't be trying to unravel great Mayan secrets in its 45 minutes, but you'll get some pretty sick riffs and the odd giggle from the screechy vocals. Thing is, underneath all the poop and yelping Bathtub Shitter have serious intent. Sometimes. 'Skate Of Bulgaria' cover WWI, and 'Rest In Piss' itself is a tribute to Mieszko from grind legends Nasum, so they're occasionally sensitive chaps underneath all the 'HaHa Bonk' silliness. Like Tony Robinson if he 'marked his territory' during a Time Team dig.\r\n6 out of 10","options":[{"id":14734201,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.0,"amount_with_others":0.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44021091/-/Dance-hall-grind-front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44021091/-/Dance-hall-grind-front.jpg","width":1000,"height":900}],"artists":[{"id":83163,"name":"Bathtub Shitter","permalink":"bathtub-shitter","url":"/artist/bathtub-shitter"}],"categories":[{"id":2294623,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":5255711,"name":"Distro items - £6 or less","permalink":"distro-items-individually-priced","position":5,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/distro-items-individually-priced","status":"active","on_sale":true,"created_at":"2012-01-15T17:17:08.000Z","description":"Agathocles / Necrocannibalistic Votorium split cd (Mince grind meets gore grind)\r\n\r\nArtery Eruption-Limbless Splitting Sewage (discography) cd (sick gore grind. collects the demo, split cd w/ Mangled Atrocity and first cd)\r\n\r\nAuthority Crisis cd (straight up grind)\r\n\r\nAwaiting The Autopsy-Couldn't Tell The Bodies Apart cd (Death metal)\r\n\r\nBack To Reality - Awaken Dream cd ep (French HXC)\r\n\r\nBandana Revenge/ LxExAxRxNx/ The Balls Of Justice - Spraypaint 3 way split cd (hardcore/thrash/skate, Suicidal Tentencies type stuff)\r\n\r\nBathtub Shitter-Xmas cd ep (3 tracks by these Japanese Grind legends on  3\" cd)\r\n\r\nBlack Depths Grey Waves-Nightmare Of The Blackend Heart cd (digipack. dark ambiant drone soundscapes, bleak as fuck!)\r\n\r\nBloodboil-Festering Fornication cd (death metal)\r\n\r\nBuried At Birth-Force/Quit cd (Awesome Female fronted Grindcore)\r\n\r\nButcher ABC -Butchered at birthday cd (death / grind from Japan)\r\n\r\nButcher ABC - Promo demo 2002 cassette (Rare demo from japanese death/grind band)\r\n\r\nCadaveric Crematorium-Grindpeace cd (Tech death/grind from Italy)\r\n\r\nCAGE Patch (now known as CAGE Grind Noir)\r\n\r\nCarnivorous Voracity-Debasement Incarnated cd (death metal)\r\n\r\nD.E.R.-Quando A Esperanca Desaba cd (Furious Brazilian grindcore)\r\n\r\nDeflorace-Massacre cd (Tech death/grind)\r\n\r\nDevoured Flesh Regurgitation-Bones, Flesh And Partysnacks cd (Bouncy Gore Grind. 1st and only album from these guys!)\r\n\r\nDifenacum - Alegrame El Dia cd (Ols school grindcore, unrelenting)\r\n\r\nDirk Diggler-s/t cd (porno grind for Boogie Nights fans)\r\n\r\nDiscreate-Contingent Development Of Inanimate Modifications cd ep (Brutal Death Metal from the Philippines)\r\n\r\nDisentomb-Sunken Chambers Of Nephilim cd (death metal)\r\n\r\nDisturbance Project / RAS split cd (2 spanish grind bands on one cd-awesome!)\r\n\r\nD9-s/t cd (Grindcore from Israel)\r\n\r\nEbolie-Elevation Into Disintergration cd (Aussie Grind Featuring Grindhead records founder Bubsy on vocals. kick ass grind!)\r\n\r\nEnmity-Vomit Forth Intestinal Excrement cd (death metal. includes both demos.)\r\n\r\nEvig Natt-I Am Silence cd (epic Black gothic metal with duo male/female vocals)\r\n\r\nExterminas-Seventh Demoniacal Hierarchy cd (Proper Black Metal with corpse paint, unreadable band name, the lot.)\r\n\r\nFatal Nunchaku - Paving Stone Under The Beach cd (Fastcore)\r\n\r\nFecund Betrayal-Depths That Buried The Sea cd (Blackend funeral Doom Metal)\r\n\r\nFromtheashes-Heading For Dystopia 3\" cd (Grindcore simialr to Magrudergrind)\r\n\r\nGenghis Tron-Cloak Of Love cd ep (Grind meets 80's synth pop, like Kill The Client meets The Cure)\r\n\r\nGlass Casket-We Are Gathered Here Today cd (A furious mixture of grind, metal and hardcore executed with an unrelenting accuracy throughout the nine-song barrage of riffs, blastbeats and chugging battery)\r\n\r\nGoatpsalm-Erset Le Tari cd (limited to 1000 copies. demonic ambiant doom based on Sumerian kingdoms and all that. 3 tracks=45 minutes)\r\n\r\nGodless Truth-Arrogance Of Supreme Power cd (Death metal)\r\n\r\nGrog / Roadside Burial / Pussyvibes 3 way split cd (Gore influenced tech grind on Grind Head records, Austrailia)\r\n\r\nGruel - Gruel cd (creepy doom from the u.k.)\r\n\r\nHaiku Funeral-Nightmare Painting cd (jazz-funk/blackend metal with ambiant experimentation)\r\n\r\nHalo Of Flys-Bloodier Shade Of Red cd creepy Heavy Metal)\r\n\r\nHarsh Supplement / Rotgut split cassette (more short sharp blasts of grind!)\r\n\r\nHindrance - Rebirth cd (Straight up Old school grind)\r\n\r\nI Shit On Your Face-Defecation Domination cd (new album from these Brazilian death/gore monsters!)\r\n\r\nIntakt-Bacite Ih Zverima pro-cdr (hardcore/metal from France)\r\n\r\nInto The Gore-Bureau Of Disgust (Comes in custom made digipack. Freestyle grindcore madness! Relentless beating, political violence a la Nasum, Regurgitate, Rotten Sound.)\r\n\r\nKazamate/A.D.T./GxFxTx 3 way split cd (5 songs from each band)\r\n\r\nKazamate/Nihilizzm split cassette (hardcore/grindcore)\r\n\r\nK.S.K. - Bouncecore From Tha Hood cd (Bouncecore!??)\r\n\r\nLow Fat / Onset Of Serious Problems split cd (both bands play fastcore/ powerviolence)\r\n\r\nLucifer D. Larynx And The Satanic Grind Dogs Of Death ‎– Absolute Defilement cd (old scholl grind ala Naplm Death and Carcass with horror/sexploitation inspired themes)\r\n\r\nLysergene-Critical Mass cd (Bleak Doom dome with power electronics and soundscapes)\r\n\r\nMekigah-The Necessary Evil cd (slow depressive blackend doom)\r\n\r\nMoloch-Abstrakter Wald cd (Dark Ambiant/Black Metal)\r\n\r\nMurkrat-Drudging The Mire cd (Ambiant doom done with keyboards and drums with female vocals)\r\n\r\nNeuropathia-Satan Owns Your Stereo cd (Grindcore rock 'n roll - Entombed meets Blood Duster)\r\n\r\nNightstick - Rock And Roll Weymouth digi cd (trailer trash redneck rock)\r\n\r\nNoism- + gatefold cd (Brutal,Fast Grind, chopped up and put back together to make the most intense chaos put on plastic)\r\n\r\nThe Null Collective-De Monstris cd (Occult Doom metal)\r\n\r\nOldhead- Maximum Rock cd (metal band featuring Rich Hoak of Brutal Truth/ Exit-13/ Total Fucking Destruction)\r\n\r\nOrtega - 1634 cd (official cd release of the out of print cdr. Doom metal)\r\n\r\nPathology-Surgically Hacked cd (Death metal)\r\n\r\nPesta Porcina - Ultimo Mondo Rurale cd (like Tu Carne)\r\n\r\nPhobia-Grind Your Fucking Head In cd (17 songs in 20 minutes. along the lines of Watchmaker and Kill The Client)\r\n\r\nProgress Of Inhumanity-Escalating Decay cd (Progress of Inhumanity is a Greek band featuring the drummer of Vulnus/Straighthate, and they play a pure Brutal Grindcore in vein of Terrorizer, Lock Up and Napalm Death. If you're sick of today's hypes and trends, you can't absolutely miss their debut full length \"Escalating Decay\"!)\r\n\r\nProletar-Back To Hatevolution cd (discography compiling all 6 cassettes releases by this Indonisian grind band)\r\n\r\nRabid Dogs - S/T cd (Blasting grind and cool grooves, like Splitter meets Neuropathia)\r\n\r\nReiketsu-Cinza cd (hxc crust slude all on one album)\r\n\r\nRupture-Jubilee \"49 Greatest Hates\" cd (features tracks from OOP comps, 7\"s, split 7\"s, split 8\" w/Dropdead as well as big chunks from previous albums.)\r\n\r\nSabu / People Hate / Firing Squad (3 way grind split)\r\n\r\nShattered Eyes-Prey Of Depravity cd (death metal. includes demo tracks)\r\n\r\nSlaktrens-Stralande Tider cd (hardcore/powerviolence)\r\n\r\nSloth-A whole other world of fun AKA 13 songs 13 samples cd (Errie, Brainwashing, cult metal)\r\n\r\nSnatch Club-True Kids Superbowl cd (An unholy bastard between Goregrind and brutal Deathmetal)\r\n\r\nStraighthate-Indiginous (Digipack. “Indingenous” is the first and only album of STRAIGHTHATE (R.I.P.). for fans of: Entombed, Napalm Death, Isis, Nasum, Regurgitate, Discordance Axis.)\r\n\r\nStumm-I cd - (doom/sludge. 4 songs over 35 minutes from Finland)\r\n\r\nTu Carne / Necrocannibalistic Vomitorium split cd (limited to 300 copies. russian grind meets mexican grind)\r\n\r\nUltimo Mondo Cannibale / Facial Abuse split cd (U.M.C.-catchy gore grind like Devoured Flesh Regurgitation with Impetigo and Haemorrhage covers. F.A.-Facial Abuse own this split! Gore themed but not straight up gore kinda like how Embalming Theatre do it but with more guitar solos!)\r\n\r\nUndernoise cd (Brutal death/grind)\r\n\r\nV/A -Not Without A Fight 2xcd comp with 32 page zine (includes bands like Agathocles / Rot / Dahmer / Unholy Grave / Strong Intention / Cripple Bastards and Final Exit)\r\n\r\nVaginal Chicken-Hangover Chicken cd (brutal death/grind/gore from France)\r\n\r\nVaginal Chicken / Bestial Devestation / Defecal Of Gerbe 3 way split cd (brutal gore/death/grind)\r\n\r\nVelocidad Absurda - Inexorably Doomed To Cataclysm cd (Brutal Technical Death metal from Spain)\r\n\r\nVex-Capitalism Is Cannibalism cd (compiles the Capitalism Is Cannibalism cd-r and the Cum And Taste Our Revenge Demo. fastcore/grind)\r\n\r\nVomit Through-It's Grind cd ep (nuff said)\r\n\r\nWe Are The Sons Of Faow Verny - \"Grimreapers On Unicorns\" Book 1 cd (Folk/emo from france)\r\n\r\nWrathful Plague ‎– Thee Within the Shadows cd (First Release sine The Frostbitten Path cd-r in '06. Black Metal)\r\n\r\nWreck Of The Hesperus - Light rotting out cd (lo-fi doom metal. comes in dvd size card sleeve with lyric cards)\r\n\r\nYattai-Fifty Love Hymns For Grindheads cd (discography compiling the demo, comp tracks and all 6 split releases.)\r\n\r\nZarach 'Baal' Tharagh-Eternal Darkness cd (Compiles 3 out of print demos. Dark black metal, probably recorded in the shack where they filmed The Evil Dead)\r\n\r\n7 Minutes Of Nausea / Tn 666 / Sist En 343 - 3 way split cd. (grind/noise) hand numbered and limited to 300 copies. nice sleeve size and shape.","options":[{"id":18316211,"name":"Agathocles / Necrocannibalistic Vomitorium","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026721,"name":"Artery Eruption","price":6.0,"sold_out":false,"has_custom_price":false},{"id":21473023,"name":"Authority Crisis","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47159280,"name":"Awaiting The Autopsy","price":6.0,"sold_out":false,"has_custom_price":false},{"id":40623729,"name":"Back To Reality","price":5.0,"sold_out":false,"has_custom_price":true},{"id":40827954,"name":"Bandana Revenge/LxExAxRxNx/The Balls Of Justice","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009062,"name":"Bathtub Shitter-Xmas","price":4.5,"sold_out":false,"has_custom_price":true},{"id":37181157,"name":"Black Depths Grey Waves","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47159283,"name":"Bloodboil","price":6.0,"sold_out":false,"has_custom_price":false},{"id":18147847,"name":"Buried At Birth","price":6.0,"sold_out":false,"has_custom_price":false},{"id":46392342,"name":"Butcher ABC CD","price":6.0,"sold_out":false,"has_custom_price":false},{"id":46392345,"name":"Butcher ABC Tape","price":3.5,"sold_out":false,"has_custom_price":true},{"id":17026723,"name":"Cadaveric Crematorium","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47159286,"name":"Carnivorous Voracity","price":6.0,"sold_out":false,"has_custom_price":false},{"id":18344257,"name":"D.E.R.","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026725,"name":"Deflorace","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17540285,"name":"Devoured Flesh Regurgitation","price":6.0,"sold_out":false,"has_custom_price":false},{"id":21473025,"name":"Difenacum","price":6.0,"sold_out":false,"has_custom_price":false},{"id":23380259,"name":"Dirk Diggler","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009065,"name":"Discreate","price":4.5,"sold_out":false,"has_custom_price":true},{"id":47159301,"name":"Disentomb","price":6.0,"sold_out":false,"has_custom_price":false},{"id":21473035,"name":"Disturbance Project/RAS","price":6.0,"sold_out":false,"has_custom_price":false},{"id":23380257,"name":"D9","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17540287,"name":"Ebolie","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47159292,"name":"Enmity","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37181172,"name":"Evig Natt","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009083,"name":"Exterminas","price":6.0,"sold_out":false,"has_custom_price":false},{"id":40827957,"name":"Fatal Nunchaku","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009080,"name":"Fecund Betrayal","price":6.0,"sold_out":false,"has_custom_price":false},{"id":23019227,"name":"Fromtheashes","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026727,"name":"Genghis Tron","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17759893,"name":"Glass Casket","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37181154,"name":"Goatpsalm","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47159298,"name":"Godless Truth","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17540289,"name":"Grog / Roadside Burial / Pussyvibes ","price":6.0,"sold_out":false,"has_custom_price":false},{"id":39751968,"name":"Gruel","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37181178,"name":"Haiku Funeral","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009071,"name":"Halo Of Flys","price":6.0,"sold_out":false,"has_custom_price":false},{"id":40320903,"name":"Harsh Supplement split cassette","price":3.5,"sold_out":false,"has_custom_price":true},{"id":21473027,"name":"Hindrance","price":6.0,"sold_out":false,"has_custom_price":false},{"id":42246492,"name":"I Shit On Your Face","price":6.0,"sold_out":false,"has_custom_price":false},{"id":43580790,"name":"Intakt","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17230419,"name":"Into The Gore","price":6.0,"sold_out":false,"has_custom_price":false},{"id":40623732,"name":"Kazamate/A.D.T./GxFxTx","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47313594,"name":"Kazamate/Nihilizzm","price":3.5,"sold_out":false,"has_custom_price":true},{"id":18344263,"name":"K.S.K.","price":6.0,"sold_out":false,"has_custom_price":false},{"id":41971791,"name":"Low Fat/Onset Of Serious Problems","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009068,"name":"Lucifer D. Larynx And The Satanic Grind Dogs Of Death","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37181166,"name":"Lysergene","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37181163,"name":"Mekigah","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009077,"name":"Moloch","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37181160,"name":"Murkrat","price":6.0,"sold_out":false,"has_custom_price":false},{"id":18344261,"name":"Neuropathia","price":6.0,"sold_out":false,"has_custom_price":false},{"id":39751965,"name":"Nightstick","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026735,"name":"Noism","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37181175,"name":"The Null Collective","price":6.0,"sold_out":false,"has_custom_price":false},{"id":39751971,"name":"Oldhead","price":6.0,"sold_out":false,"has_custom_price":false},{"id":40004688,"name":"Ortega","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47159295,"name":"Pathology","price":6.0,"sold_out":false,"has_custom_price":false},{"id":21473033,"name":"Pesta Porcina","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026751,"name":"Phobia","price":6.0,"sold_out":false,"has_custom_price":false},{"id":18232593,"name":"Progress Of Inhumanity","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026757,"name":"Proletar","price":6.0,"sold_out":false,"has_custom_price":false},{"id":21473029,"name":"Rabid Dogs","price":6.0,"sold_out":false,"has_custom_price":false},{"id":42246489,"name":"Reiketsu","price":6.0,"sold_out":false,"has_custom_price":false},{"id":19911535,"name":"Rupture","price":6.0,"sold_out":false,"has_custom_price":false},{"id":18344255,"name":"Sabu / People Hate / Firing Squad","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47159289,"name":"Shattered Eyes","price":6.0,"sold_out":false,"has_custom_price":false},{"id":23019225,"name":"Slaktrens","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026755,"name":"Sloth","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17759891,"name":"Snatch Club","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026741,"name":"Stumm","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17230421,"name":"Straighthate","price":6.0,"sold_out":false,"has_custom_price":false},{"id":18316213,"name":"Tu Carne / Necrocannibalistic Vomitorium","price":6.0,"sold_out":false,"has_custom_price":false},{"id":21473031,"name":"Ultimo / Facial Abuse ","price":6.0,"sold_out":false,"has_custom_price":false},{"id":21472271,"name":"Undernoise","price":6.0,"sold_out":false,"has_custom_price":false},{"id":39422586,"name":"V/A Not Without comp","price":12.0,"sold_out":false,"has_custom_price":true},{"id":43580796,"name":"Vaginal Chicken","price":6.0,"sold_out":false,"has_custom_price":false},{"id":43580793,"name":"Vaginal Chicken 3 way split","price":6.0,"sold_out":false,"has_custom_price":false},{"id":21473021,"name":"Velocidad Absurda","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026749,"name":"Vex","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009059,"name":"Vomit Through","price":4.5,"sold_out":false,"has_custom_price":true},{"id":40623735,"name":"We Are The Sons Of Faow Verny","price":6.0,"sold_out":false,"has_custom_price":false},{"id":37009074,"name":"Wrathful Plague","price":6.0,"sold_out":false,"has_custom_price":false},{"id":40004694,"name":"Wreck Of The Hesperus","price":6.0,"sold_out":false,"has_custom_price":false},{"id":43580799,"name":"Yattai","price":6.0,"sold_out":false,"has_custom_price":false},{"id":17026753,"name":"Zarach &#x27;Baal&#x27; Tharagh","price":6.0,"sold_out":false,"has_custom_price":false},{"id":20117557,"name":"7MON/Tn66/Sist En 343","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":3.0,"amount_with_others":0.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/51613149/-/F012-010.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/51613149/-/F012-010.jpg","width":671,"height":800}],"artists":[],"categories":[{"id":2294623,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]