[{"id":4712471,"name":"ThickShag & Marty EP","permalink":"thickshag-marty-ep","position":1,"price":6.66,"default_price":6.66,"tax":0.0,"url":"/product/thickshag-marty-ep","status":"active","on_sale":true,"created_at":"2011-10-26T14:38:18.000Z","description":"This is our debut EP sporting 7 awesome country songs amongst which our hit song \"Today I Sold My Soul To Satan\". Available through the iTunes store, CDBaby, Amazon and many other digital music stores.\r\n\r\nToward the end of June 2007, we rented ourselves a small friesian farmhouse near Surhuisterveen, Friesland, Holland. We crammed two cheap japanese cars chock full of guitars, amps and studio gear and me my buddy Marty, the awesome guitarman (Jellybooty / Matelo Duo / Stift) drove into \r\nthe sticks; this place is so rural and quiet; you'd feel rude farting outside. \r\n\r\nWe completely rearranged the main living area into one big recording studio and started jamming. It started raining. And it never stopped, really. It was like living in an aqaurium. Old farmhouses have strange beds: cupboard beds; small beds in big cupboards. I tried one, and never looked back. The mosquitoes were of a super breed; a week of bloodletting felt quite refreshing. \r\n\r\nWe had already attempted to record some of my country fever prior to the \"In A Cabin With\" project, but we re-recorded one, and I wrote the rest of them on the spot. We got up, showered (individually!), made coffee, started jamming, found a riff, found a complementary riff, then Marty fooled around with 12-string, harmonica, slide guitar and other fancy stuff while I wrote lyrics, and then we started recording; one song a day! We only went shopping once or twice, so we were in this timeless \"pod\" which enabled us to focus on the music. \r\n\r\nI am very proud of the result, I think I wrote a couple of kickass country songs; hey, country music CAN be good AND fun. I hope my hero and inspiration Eddie Spaghetti (The Supersuckers) will approve of us freaky deaky dutch boys shamelessly writing a chapter of dutch country music history. I hope you enjoy the recordings, and you can look forward to more to come! \r\n\r\nHoot, hollar and stomp, ya'll buy our cd now, you hear! \r\n\r\nThickShag \r\n\r\nPop Instituut (NL) Review in FRET Magazine: \r\n\r\nLooking at the cover of ThickShag & Marty you know what time it is: it's Country time. They kick off in a jolly atmosphere. Hook in, no worries for tomorrow and a nice singalong by the barbecue. But this group has another side too. Apart from the cornyness, there are some stronger songs on it like Your Vicious Lies and Get You Back where they dig a little deeper. With songs like these the duo proves that they can write some contagious melodies. Add a nice, raw sounding voice to that and ThickShag & Marty show they have a lot going on. \r\n\r\n(Arnold van Huet) ","options":[{"id":15435917,"name":"Default","price":6.66,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46189997/-/thickshagmarty.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46189997/-/thickshagmarty.jpg","width":200,"height":200}],"artists":[],"categories":[{"id":2562605,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]