[{"id":8841617,"name":"Super Weight Loss (HoV-LEP/ADP)","permalink":"super-weight-loss-hov-lep-adp","position":1,"price":27.5,"default_price":27.5,"tax":0.0,"url":"/product/super-weight-loss-hov-lep-adp","status":"active","on_sale":false,"created_at":"2013-01-08T10:36:59.000Z","description":"The Super Weight Loss product has been designed to help the body to make more of the proteins leptin and adipose. These proteins help people to lose weight more effectively by reducing fat formation, suppressing the appetite (so the urge to over-eat is lessened) and increasing energy expenditure (so that the food is converted into energy rather than stored in the body as fat). Scientists have discovered that the leptin protein also helps to resolve Type 2 diabetes and increase bone density so that bone fracture is less likely.\r\n\r\nMay be taken long term until required BMI is reached and then taken at half dosage permanently to maintain optimum BMI.\r\n\r\nWhat are the functions of LEP and ADP?\r\n\r\nThe Homeovitality Super Weight Loss product has been developed to target both the LEP and ADP genes. The gene that synthesises leptin, LEP, was first isolated by Zhang and associates [1]. It is located on human chromosome 7. \r\n\r\nPeople with leptin deficiency have voracious appetites and suffer profound obesity. Their appetites can be controlled and weight lost by administration of leptin, confirming that leptin plays an important role in suppressing the appetite and weight control [2]. It follows that boosting LEP activity would reduce the appetite and promote weight loss.\r\n\r\nOther important properties of leptin have been discovered. Scientists have shown that it plays a very important role in increasing bone density, reducing the likelihood of bone fractures, particularly in post-menopausal women. Bone is continually being remodelled; old bone is being replaced by new bone. Leptin promotes new bone formation in a dose dependent manner [3]; so, increasing leptin production promotes better bone formation.\r\n\r\nSecondly, it was previously thought that late onset diabetes, associated with obesity was relieved simply as a consequence of leptin induced weight loss. Now, scientists at Rockefeller University have made the exciting discovery that leptin can correct late onset diabetes independently of its role in weight loss. In other words, even if weight is not lost, leptin can still play a very important role in correcting diabetes [4].\r\n\r\nHomeovitality Super Weight Loss also targets the gene that encodes adipose, ADP. The ADP gene is referred to as “the anti-obesity gene” because it plays an important role in reducing fat accumulation [5].\r\n\r\nRecently, scientists at Tufts University discovered that most people have inherited a sluggish ADP gene that slows down the way that fat it is burnt off or turned into energy [6]. The sluggish ADP gene also enables fat to be stored in tissues more easily, resulting in weight gain. So, where did our sluggish ADP gene come from?\r\n\r\nIt is now thought that the common inefficient ADP gene originated millions of years ago and, over time, increased in frequency because it gave our ancestors an important survival advantage. The less effective fat metabolising gene was of benefit to our ancestors because what little food was available was easily laid down and stored as fat deposits. Fat deposits could then be used as a source of energy and help survival in times of famine.\r\n\r\nIn modern times though, in areas of the world where, for the first time in human history, refined food is plentiful, the common ancestral ADP gene has become a health problem because it continues to store our food as fat, resulting in obesity and increased susceptibility to development of diseases such as diabetes and heart disease. In fact, it has been suggested that the sluggish ADP gene is directly responsible for development of late onset diabetes associated with obesity [7]. It follows that increasing the efficiency of the common ancestral ADP gene would be an effective way to lose weight, reduce fat deposition, maintain a healthy BMI and avoid development of many diseases.\r\n\r\nReferences\r\n1. Zhang et al., Positional cloning of the mouse obese gene and its human homologue. Nature, 374: 425, 1994.\r\n2. http://www.foodnavigator.com/Science-Nutrition/Leptin-replacement-therapy-to-fight-obesity.\r\n3. Blain et al., Serum leptin level is a predictor of bone mineral density in postmenopausal women. J. Clin. Endocrinol. & Metab., 87:1030, 2002.\r\n4. Hedbacker et al., Antidiabetic effects of IGFBP2, a leptin regulated gene. Cell Metab.,11:11, 2010.\r\n5. Suh et al., Adipose is a conserved dosage-sensitive antiobesity gene. Cell Metab., 6: 195, 2007.\r\n6. Lai et al., WDTC1, the ortholog of Drosophila adipose gene, associates with human obesity, modulated by MUFA intake. Obesity, 17: 593, 2009.\r\n7. http://www.dancewithshadows.com/business/pharma/adipose-obesity-gene.asp.\r\n\r\nAdditional Information\r\n\r\nVolume (of 1 bottle)\r\n50 mL (min. 1½ months supply - £0.23/dose)\r\n\r\nStorage\r\nKeep away from strong odours. Store at room temperature, out of direct sunlight, excessive heat and away from children. Keep product in original container.\r\n\r\nIngredients\r\nAcidum Nucleicum LEP/ADP UHD at 10 -12\r\nStabiliser* - 0.014mg/mL\r\nEthanol (25%) in purified water\r\n*Sodium Phosphate buffer\r\n\r\nProduct code\r\nHoV-LEP/ADP\r\n\r\nDirections for use\r\nShake before use. Twice daily, add 8 drops to a little clean water. On a clean palate, rinse round mouth and swallow.\r\nDo not use if seal is broken. Keep product in original container.\r\n\r\nRemember: It is recommended that you inform your medical doctor/GP that you are taking Homeovitality products. Homeovitality products should not be used as a substitute for treatments prescribed your physician. A practitioner's prescription is not required to use Homeovitality products.\r\n","options":[{"id":27755303,"name":"Default","price":27.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.5,"amount_with_others":15.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/87115337/-/super_weight_loss.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/87115337/-/super_weight_loss.jpg","width":90,"height":236}],"artists":[],"categories":[]},{"id":8839910,"name":"Super Memory/IQ (HoV-CM2/S25)","permalink":"super-memory-iq-hov-cm2-s25","position":2,"price":27.5,"default_price":27.5,"tax":0.0,"url":"/product/super-memory-iq-hov-cm2-s25","status":"active","on_sale":false,"created_at":"2013-01-08T06:26:14.000Z","description":"The Homeovitality Super Memory/IQ product has been prepared to help the body synthesise more CHRM2 and SNAP-25 proteins so that people may remember better and enjoy an increased IQ. Researchers have discovered that a lack of these two proteins leads to a poor memory and reduced IQ.\r\n\r\nMay be used on a permanent basis.\r\n\r\nWhat do CHRM2 and SNAP-25 do?\r\n\r\nHomeovitality Super Memory/IQ has been designed to target the CHRM2 and SNAP-25 genes. The gene SNAP-25, targeted by the Homeovitality Super Memory/IQ product, is located on human chromosome 20. It was discovered by Dr Zhao and colleagues [1]. It is expressed in the brain and encodes synaptosomal-associated protein, 25kDa, a presynaptic plasma membrane protein involved in the regulation of neurotransmitter release. Reduced SNAP-25 gene activity results in memory loss [2]. \r\n\r\nThe Homeovitality Super Memory/IQ product also targets CHRM2. The fine structure of the CHRM2 gene was determined by Dr Zhou and colleagues [3]. It encodes a cholinergic receptor, muscarinic 2, that belongs to a larger family of G protein-coupled receptors. In contrast to SNAP-25, CHRM2 is located on chromosome 7.\r\n\r\nCHRM2 has been proven to be a key promoter of intelligence [4].\r\n\r\nReferences\r\n1. Zhao et al., Cloning and sequence analysis of the human SNAP25 cDNA. Gene, 145: 313, 1994.\r\n2. Hou et al., SNAP-25 in hippocampal CA3 region is required for long-term memory formation. Biochem. Biophys. Res. Commun., 347: 955, 2006.\r\n3. Zhou et al., Structure of the human M(2) muscarinic acetylcholine receptor gene and its promoter. Gene, 271: 87, 2001.\r\n4. Dick et al., Association of CHRM2 with IQ: converging evidence for a gene influencing intelligence. Behav. Genet., 37: 265, 2007.\r\n\r\nAdditional Information\r\n\r\nVolume (of 1 bottle)\r\n50 mL (min. 1½ months supply - £0.23/dose)\r\n\r\nStorage\r\nKeep away from strong odours. Store at room temperature, out of direct sunlight, excessive heat and away from children. Keep product in original container.\r\n\r\nIngredients\r\nAcidum Nucleicum CM2/S25 UHD at 10 -12\r\nStabiliser* - 0.014mg/mL\r\nEthanol (25%) in purified water\r\n*Sodium Phosphate buffer\r\n\r\nProduct code\r\nHoV-CM2/S25\r\n\r\nDirections for use\r\nShake before use. Twice daily, add 8 drops to a little clean water. On a clean palate, rinse round mouth and swallow.\r\nDo not use if seal is broken. Keep product in original container.\r\n\r\nRemember: It is recommended that you inform your medical doctor/GP that you are taking Homeovitality products. Homeovitality products should not be used as a substitute for treatments prescribed your physician. A practitioner's prescription is not required to use Homeovitality products.","options":[{"id":27749600,"name":"Default","price":27.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/87115373/-/super_memory_iq.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/87115373/-/super_memory_iq.jpg","width":90,"height":236}],"artists":[],"categories":[]},{"id":8839787,"name":"Allergicare (HoV-INT10)","permalink":"allergicare-hov-int10","position":3,"price":27.5,"default_price":27.5,"tax":0.0,"url":"/product/allergicare-hov-int10","status":"active","on_sale":false,"created_at":"2013-01-08T06:17:56.000Z","description":"The Allergicare product has been prepared to help the immune system synthesise the immuno-regulatory protein IL-10. Scientists have shown that IL-10 helps to stop the development of an undesirable immune response that causes allergies such as asthma as well as reducing inflammation. IL-10 has also been shown to resolve psoriasis and may be helpful in other disorders such as inflammatory bowel disease and rheumatoid arthritis. May be taken on a permanent basis or until symptoms subside. \r\n\r\nWhat does IL-10 do?\r\n\r\nThe Homeovitality Allergicare product is designed to target the IL-10 gene. IL-10 serves many functions; it is mostly involved in regulation of immunity and inflammation.\r\n\r\nIt has very important anti-inflammatory properties that help resolve many disorders associated with chronic inflammation such as auto-immune diseases. Its anti-inflammatory properties also reduce pain.\r\n\r\nRegarding allergic reactions that cause bronchial asthma and other allergies: Normally, the immune system makes antibodies called IgM, IgA and IgG. Sometimes, people make another type of antibody called IgE. Unlike IgG, IgA and IgM, which circulate in the blood and other body fluids, IgE binds to the surface of mast cells in the airways, nasal passages and other tissues such as the skin. An allergic reaction is caused by the binding of foreign substances, or allergens such as pollen to mast cell bound IgE. The binding of allergens to mast cells causes them to disrupt leading to the release of histamine and other substances that cause localised inflammation and breathing difficulties.\r\n\r\nThe switch from production of beneficial or normal antibody types, IgG, A and M to IgE production is regulated by IL-10. The Homeovitality Allergicare product is designed to support the activity of IL-10 so that the likelihood of IgE antibody formation, and hence development of an allergic reaction is reduced. It has also been recently discovered that IL-10 can even suppress the formation of mast cells [1]. In fact, the positive effects of asthma drugs such as triamcinolone and montelukast are considered to be due to their ability to increase IL-10 production [2].\r\n\r\nDr. Asadullah and colleagues [3] at the Humboldt University in Germany have demonstrated that susceptibility to development of psoriasis is also associated with reduced IL-10 activity. So, targeting the IL-10 gene is helpful in controlling psoriasis. Quoting from their paper, “Our investigations demonstrate the major importance of IL-10 in psoriasis and show that IL-10 administration represents a new therapeutic approach.” The same authors pointed out the usefulness of IL-10 in the treatment of other diseases such as multiple sclerosis and rheumatoid arthritis.\r\n\r\nIL-10 also has important pain relief properties and has been shown to counteract depression [4].\r\n\r\nOne of the most common forms of alopecia which affects both men and women is due to an auto-immune process which attacks hair follicles. The immune suppressive and anti-inflammatory properties of IL-10 are recognised as useful treatments for this disorder [5][6].\r\n\r\nReferences:\r\n1. Federation of American Societies for Experimental Biology. \"Cellular on and off switch for allergies and asthma discovered.\" ScienceDaily, 30 Apr. 2009.\r\n2. Stelmach I et al., A randomized, double-blind trial of the effect of glucocorticoid, antileukotriene and beta-agonist treatment on IL-10 serum levels in children with asthma. Clin. Exp. Allergy, 2002: 32; 264.\r\n3. Asadullah A et al., IL-10 Is a key cytokine in psoriasis. Proof of principle by IL-10 therapy: a new therapeutic approach. J. Clin. Invest. 1998: 101; 783.\r\n4. Roque S et al. Interleukin-10: A Key Cytokine in Depression? Cardiovascular Psychiatry and Neurol. 2009, Article ID 187894, doi:10.1155/2009/187894.\r\n5. http://www.hindawi.com/journals/mi/2010/928030/.\r\n6. http://www.hairlosstalk.com/hair-loss-news/article318.php.\r\n\r\nAdditional Information\r\n\r\nVolume (of 1 bottle)\r\n50 mL (min. 1½ months supply - £0.23/dose)\r\n\r\nStorage\r\nKeep away from strong odours. Store at room temperature, out of direct sunlight, excessive heat and away from children. Keep product in original container.\r\n\r\nIngredients\r\nAcidum Nucleicum INT10 UHD at 10 -12\r\nStabiliser* - 0.014mg/mL\r\nEthanol (25%) in purified water\r\n*Sodium Phosphate buffer\r\n\r\nProduct code\r\nHoV-INT10\r\n\r\nDirections for use\r\nShake before use. Twice daily, add 8 drops to a little clean water. On a clean palate, rinse round mouth and swallow.\r\nDo not use if seal is broken. Keep product in original container.\r\n\r\nRemember: It is recommended that you inform your medical doctor/GP that you are taking Homeovitality products. Homeovitality products should not be used as a substitute for treatments prescribed your physician. A practitioner's prescription is not required to use Homeovitality products.","options":[{"id":27749024,"name":"Default","price":27.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.5,"amount_with_others":15.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/87115421/-/allergicare.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/87115421/-/allergicare.jpg","width":90,"height":236}],"artists":[],"categories":[]}]