[{"id":429608,"name":"The Casino's Most Valuable Chip: How Technology Transformed the Gaming Industry ","permalink":"the-casinos-most-valuable-chip-how-technology-transformed-the-gaming-industry","position":1,"price":49.95,"default_price":49.95,"tax":0.0,"url":"/product/the-casinos-most-valuable-chip-how-technology-transformed-the-gaming-industry","status":"active","on_sale":false,"created_at":"2009-10-17T23:54:45.000Z","description":"From the days of Benjamin \"Bugsy\" Siegel, when high-tech meant bright pink neon signs, through today's latest digital technology, this book reviews how technology played a crucial role in the shaping of the gaming industry and the modern casino. From security to marketing, technology has greatly impacted the evolution of the gaming industry and how casinos conduct business. Gone are the days of free casino chips for patrons handed out by well-dressed pit bosses - they have been replaced by computerized slot machines that track a player's every spin and issues electronic credits right at the slot machine. The author traces technology's roots in gaming through today's high-tech casino gadgets and explores what the future may hold for technology in casinos. Touching on various aspects of casino operations, readers will get a broad review of the interesting role technology plays in the casino resort. This visually stunning book takes an informative and entertaining look at technology in the gaming industry. Written by an industry insider with over 20 years of experience, it explains how technology helped rid the industry of organized crime, allowed for the design of more exciting casino games, created a system to reward players while enabling casinos to improve their marketing, and respond to the need for increased security for properties and patrons alike.\r\n\r\nHardcover: 176 pgs./No Dust Jacket\r\nPublisher: Institute for the History of Technology \r\nPublication Date: October 1, 2005\r\nISBN-10: 0964921782\r\nISBN-13: 978-0964921788\r\n\r\n*Shipping is FREE via USPS Media Mail within the United States. Please email sally@historytech.org for international shipping quote.\r\n","options":[{"id":1709596,"name":"Default","price":49.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3556448/-/casino4.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3556448/-/casino4.jpg","width":740,"height":634}],"artists":[],"categories":[]}]