[{"id":6714747,"name":"Leftside LeftCoast Official DoubleUp Chucks©™","permalink":"leftside-leftcoast-official-doubleup-chuckstm","position":1,"price":99.99,"default_price":99.99,"tax":0.0,"url":"/product/leftside-leftcoast-official-doubleup-chuckstm","status":"active","on_sale":true,"created_at":"2012-07-16T21:39:36.000Z","description":"Go to the contact tab and leave a message with your Email, Shipping Address, Color & Size and you will be sent an Invoice to make a secure order for your shoes. \r\n\r\nOr, simply use our shopping cart to order securely.\r\n\r\nCOLORS: Blue, Pink, Red, Grey\r\n\r\nThank's for shopping with Calicomfort.biz!!!\r\n\r\ncheck us out on Facebook: http://www.facebook.com/pages/Leftside-LeftCoast-Official-DoubleUp-Chucks/320122894747135","options":[{"id":21349427,"name":"Blue","price":99.99,"sold_out":false,"has_custom_price":false},{"id":21349727,"name":"Pink","price":99.99,"sold_out":false,"has_custom_price":false},{"id":21349729,"name":"Red","price":99.99,"sold_out":false,"has_custom_price":false},{"id":21349731,"name":"Grey","price":99.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/65924417/-/Leftside_Leftcoast_Chucks_side2.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/65924417/-/Leftside_Leftcoast_Chucks_side2.png","width":752,"height":501}],"artists":[],"categories":[{"id":3461077,"name":"Shoes","permalink":"shoes","url":"/category/shoes"}]},{"id":4784057,"name":"Cali Comfort Champagne","permalink":"cali-comfort-champagne","position":2,"price":124.99,"default_price":124.99,"tax":0.0,"url":"/product/cali-comfort-champagne","status":"active","on_sale":true,"created_at":"2011-11-06T00:22:05.000Z","description":"\t\r\nSPECIALTY BEVERAGE#1\r\n\r\n\" Our Fine Champagne\"\r\n\r\nTasting Notes:\r\n\r\n\"It's composed of 65% pinot noir & 35% chardonnay, and while the pinot is clearly driving the bus here, the chard shows it's elegant face shiningly. Fruit forward, with the AV pinot bringing creamy strawberry/raspberry, cherry and brambly plum in. The chardonnay component undergoes 100% malolactic fermentation, enhancing the vanilla creaminess. Twenty-first century Cali tropicality brings exotic mango, lychee and pineapple fluff notes. Two years rested on lees, the chard brings a yeasty toastiness, dense with pastry shop butterscotch brioche and lemon chiffon flavors.\"\r\n\r\nWinemaker's Notes:\r\n\r\n\r\n\r\n\"This is a beautiful brut, easily worth its price. It shows the fancy elegance of more expensive bubblies, with its refined texture and rich but subtle flavors of strawberries, peaches and brioche.\" 91 Wine Enthusiast\r\n\r\n\r\n\r\nSweet this is not, true brut dry-finishing with a crunchy mineral backbone. Our favorite domestic sparkling wine at this price point.\r\n\r\n\r\nEach state has it's alcohol regulation agency and maintains the right to limit wine shipments entirely or partially. \r\n\r\nWE WILL BE SHIPPING TO THE FOLLOWING STATES VIA UPS:\r\n\r\n\r\n\r\nArizona (AZ), Alaska (AK), California (CA), Connecticut (CT), Delaware (DE), Florida (FL), Georgia (GA), Hawaii (HI), Iowa (IA), Idaho (ID), Illinois (IL), Indiana (IN), Kansas (KS), Louisiana (LA), Maryland (MD), Michigan (MI), Minnesota (MN), Missouri (MO), North Carolina (NC), North Dakota (ND), Nebraska (NE), New Hampshire (NH), New Jersey (NJ), New Mexico (NM), New York (NY), Ohio (OH), Oregon (OR), Rhode Island (RI), South Carolina (SC), Virginia (VA), Vermont (VT), Wisconsin (WI), Washington (WA), West Virginia (WV), Wyoming (WY).\r\n\r\nWines are shipped by UPS. United States Postal Service does not allow wine shipments, thus we are bound by private carriers. Typically the cost of shipping wines runs approximately $10.00 for single bottle, $12 per double bottle, $13 per four bottle, and $17 per six bottle, and $28 per twelve bottle (case) shipment. Overnight and 2-day expedite orders can be placed online or call in orders for rush ground shipments to 818-305-4492\r\n\r\nFine taste originated in Mendocino County, CA....","options":[{"id":15634951,"name":"Default","price":124.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46922113/-/calicomfort2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46922113/-/calicomfort2.jpg","width":65,"height":255}],"artists":[],"categories":[{"id":2591993,"name":"Liquor","permalink":"liquor","url":"/category/liquor"}]},{"id":4857303,"name":"DIGITAL Live TV channels,1000 RADIO STATIONS (Watch Internet TV)","permalink":"digital-live-tv-channels-1000-radio-stations-watch-internet-tv","position":3,"price":49.0,"default_price":49.0,"tax":0.0,"url":"/product/digital-live-tv-channels-1000-radio-stations-watch-internet-tv","status":"active","on_sale":false,"created_at":"2011-11-16T03:20:18.000Z","description":"Digital TV on PC offers unique viewing options!\r\nIf you are looking for a form of entertainment that suits your viewing taste and budget, it's about time you switched to Digital TV on PC. Dump the conventional TV set with antenna unless it goes dark. It's time to keep pace with the needs of the new generation and stay ahead of the rest in the race. The DTV on your PC offers superior technology that is used to send TV broadcasts to your house. This is simply a new and flexible solution that is a lot more efficient than analog TV in the sense that it enables clearer picture, more choices in terms of programming and finally better sound output than analog TV. \r\n\r\n#########################\r\n==>> Go Here: http://wwtv2012.cablebills.hop.clickbank.net/ \r\n#########################\r\n\r\nAs far as the entertainment potential is concerned, Digital TV on PC allows all the individual stations to offer up to 5 or 6 different programs without any charges. On screen TV listings are also provided alongside red button interactivity and true widescreen resolution. All you need to do is make a software download to set about viewing your favorite TV channels. You can even check out the local TV channels with equal results. Digital TV on PC is the latest buzzword in the television entertainment scenario, the biggest blessing being that it consumes scanty bandwidth space. \r\n\r\n#########################\r\n==>> Go Here:http://wwtv2012.cablebills.hop.clickbank.net/ \r\n#########################\r\n\r\nDigital broadcasters are allowed to provide more digital channels and this is why even the government has taken initiatives in lowering the price of Digital TV on PC. Get Digital TV on PC from cash back website that helps you to earn money in the form of cash back. You will also chance upon lucrative offers and the latest prices here. With the wide acceptability of digital TV, it's time to say goodbye to analog TV. So, here's your chance to get acquainted with the latest technology to re-inspire yourself for a unique TV viewing experience. \r\n\r\n#########################\r\n==>> Go Here: http://wwtv2012.cablebills.hop.clickbank.net/ \r\n#########################","options":[{"id":15834595,"name":"Default","price":49.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/47662725/-/DIGITAL_TV.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/47662725/-/DIGITAL_TV.jpg","width":400,"height":525}],"artists":[],"categories":[{"id":2591981,"name":"Electronics","permalink":"electronics","url":"/category/electronics"}]},{"id":4783999,"name":"Spacebook Android Tablet Phone!","permalink":"spacebook","position":4,"price":249.99,"default_price":249.99,"tax":0.0,"url":"/product/spacebook","status":"active","on_sale":true,"created_at":"2011-11-06T00:10:14.000Z","description":"The next generation of tablets - a mix of Phone and Tablet. With Android 2.2, WiFi, a 7 inch touch screen, front facing camera, 4GB internal memory, AND the ability to make phone calls, the SpaceBook has it all.\r\n\r\n\r\nThe SpaceBook brings a lot of convenience and originality by merging a phone with a tablet. Now, no need for both a smartphone and a tablet any more, because you can do everything directly on the SpaceBook: make and receive calls, write and read SMS and browse the internet using WiFi, watch videos on Dailymotion, read ebooks, send emails, play your favorite games, and much more.\r\n\r\nPowered by the ingenious Android 2.2 operating system, the SpaceBook provides true multi-tasking, widgets, and many more features that can't be found anywhere else. It also comes packed with convenient applications such as email, YouTube, Skype, and gives one-touch access to the official Google Marketplace, which is home a huge selection of third-party applications for any purpose - work, personal, or entertainment. Best of all, with the performing Android 2.2, everything works smoothly on this baby! \r\n\r\nAt a Glance...\r\n\r\n    Android 2.2 Tablet Phone\r\n    Quad-band GSM for phone calls\r\n    7 inch touchscreen\r\n    800MHz processor, 256MB RAM\r\n    WiFi\r\n    4GB internal memory\r\n    Ultra-thin form factor\r\n    Front facing camera\r\n    Pre-loaded with YouTube, Skype, and many more apps\r\n    Built-in MIC and speaker\r\n    Google Android Marketplace lets you download tons of third-party apps and games!\r\n","options":[{"id":15634687,"name":"Default","price":249.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46920857/-/SPACEBOOK.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46920857/-/SPACEBOOK.jpg","width":643,"height":500}],"artists":[],"categories":[{"id":2591981,"name":"Electronics","permalink":"electronics","url":"/category/electronics"}]},{"id":4784717,"name":"HD BlackBox Android Network Media Player","permalink":"hd-blackbox-android-network-media-player","position":5,"price":199.99,"default_price":199.99,"tax":0.0,"url":"/product/hd-blackbox-android-network-media-player","status":"active","on_sale":false,"created_at":"2011-11-06T02:24:51.000Z","description":"HD BlackBox Android 2.2 Media Player Box (Full HD 1080P) – watch your TV come alive with the power of Android! Combining TV(no cable account needed!), the internet, and Android apps, this new full HD media player is not to be missed!\r\n\r\nIt’s Android on your television\r\nYour favorite smart phone and tablet PC operating system is now available for your television and it comes with the full power of Android 2.2. Chatting through the Twitter app? Sure! Sharing pictures through Picasa? Of course! Checking weather through WeatherBug? Not a problem! Experience the Android operating system in a newer, bigger way!\r\n\r\nInternet media streaming made easy\r\nThe HD BlackBox Android 2.2 Media Player Box easily connects to any home or office network by Ethernet cable. This allows you to access on the web. Type in what you want to watch and it will find it for you. Watch your favorite web videos, view photos, access streaming music or videos, play YouTube videos and do everything else you're accustomed to doing online. Plus, the world's best websites are now being perfected for televisions.\r\n\r\nShare with your family\r\nPicture this: relaxing together as a family in the comfort of your living room with this Media Player BlackBox connected to your 50 inch flat screen. One second you’re enjoying a streaming online movie together, the next you’re browsing the internet, and the next you’re listening to streaming music. How wonderful! Finally, the internet can become a family activity!\r\n\r\nAt a Glance...\r\n\r\n    Full high definition 1080P support\r\n    Support for almost every audio and video format\r\n    Connect to your TV through composite\r\n    Extensive online functionality including streaming movies, news, internet radio, YouTube, and much much more.\r\n\r\nadd an optional mouse, keyboard and external hard drive at your convenience.\r\n\r\n\r\n","options":[{"id":15637113,"name":"Default","price":199.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46928217/-/HDBLACKBOX3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46928217/-/HDBLACKBOX3.jpg","width":800,"height":500}],"artists":[],"categories":[{"id":2591981,"name":"Electronics","permalink":"electronics","url":"/category/electronics"}]}]