[{"id":2799218,"name":"PER- Lámina Film Permanente","permalink":"per-lámina-film-permanente","position":1,"price":318.0,"default_price":318.0,"tax":0.0,"url":"/product/per-lámina-film-permanente","status":"active","on_sale":false,"created_at":"2010-10-13T18:45:41.000Z","description":"PER es una lámina muy fina (75 micras) con un solvente adhesivo en una de sus caras. PER se puede pegar en cualquier superficie lisa y transparente, como puede ser cristal, vidrio o acrílico. Que sea ventana, escaparate, lámina de metacrilato o tabique transparente, podemos crear cualquier formato y dimensión.\r\nPER está hecha para montajes FIJOS, y una vez instalado ofrece una gran seguridad y duración de colocación (no se puede mover, es muy fino y resistente al lavado)\r\n\r\nVERSIONES PER DISPONIBLES\r\n\r\nCONTRAST: retroproyección. Uso en luz alta o exterior. La lámina “todo terreno”.\r\nDIFUSION:  retroproyección. Uso interior, para instalaciones vídeos exigentes (control, simulación, exposiciones, home cinema…) No hot spot, difusión 100% de la luz emitida por el proyector, incluso con ópticas cortas.\r\n360º: retroproyección. Uso interior. La imagen se forma en las dos caras con la misma luminosidad. Perfecto para proyecciones que sólo llevan imágenes.\r\nHOLO-G:  retroproyección. Uso interior. Transparencia 90%; si no se proyecta, es transparente y se ve lo que hay detrás de la pantalla. Efecto holográfico.\r\nFRONT: proyección frontal. Uso interior. Pantalla adhesiva, pero de proyección frontal. La facilidad y el diseño de Screenmon para una proyección clásica.\r\n","options":[{"id":9802469,"name":"Consultar Tamaños y precios","price":318.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27076580/-/Screen-mon_Fitnessmon.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27076580/-/Screen-mon_Fitnessmon.jpg","width":1000,"height":750}],"artists":[],"categories":[]},{"id":2799221,"name":"ESC- Lámina anti-reflejante para escaparates","permalink":"esc-lámina-anti-reflejante-para-escaparates","position":2,"price":371.0,"default_price":371.0,"tax":0.0,"url":"/product/esc-lámina-anti-reflejante-para-escaparates","status":"active","on_sale":false,"created_at":"2010-10-13T18:48:22.000Z","description":"ESC es un producto exclusivo totalmente dedicado a resolver las problemáticas de la proyección en escaparates y ventanales.\r\nEl reflejo en la cara exterior del escaparate y la luminosidad exterior son los problemas principales de la proyección en escaparate a plena luz del día. Junto a un proyector con bastante brillo, ESC es la única lámina de retroproyección del mercado realmente ANTI-REFLEJANTE que anula totalmente el reflejo en el cristal, para una mejor y muy significativa de la visibilidad a plena luz del sol. Es el producto perfecto para sus instalaciones de carcelería dinámica, digital signage y comunicación en escaparates.\r\nESC resiste a la intemperie, al sol y a los UV, tiene protección anti-vandálica, anti-grafiti y anti-pintura. ESC se puede limpiar con disolventes químicos y ácidos sin problema. Garantía anti-grafiti de 2 años. Grosor 100 micras.\r\n","options":[{"id":9802479,"name":"Consultar Tamaños y precios","price":371.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27076609/-/Tienda_Moda_Lisa_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27076609/-/Tienda_Moda_Lisa_2.jpg","width":339,"height":324}],"artists":[],"categories":[]},{"id":2799226,"name":"REM- Lámina removible.","permalink":"rem-lámina-removible","position":3,"price":504.0,"default_price":504.0,"tax":0.0,"url":"/product/rem-lámina-removible","status":"active","on_sale":false,"created_at":"2010-10-13T18:52:13.000Z","description":"El REM es una lámina óptica de retroproyección que se pega sólo con agua, sin pegamento no solvente. Con esta característica, el REM se puede pegar y despegar sin límites. Se queda pegado semanas, meses, o sólo unas horas, y luego se quita para su transporte e instalación en otro sitio. El REM tiene un grosor de 700 micras, es resistente y duradero. El REM evita los costes y riesgos de instalación de los vinilos (burbujas, pantalla torcida, etc,…); si no se instala donde se quiere o si quedan imperfecciones… se quita y se coloca de nuevo. El REM es ecológico, no utiliza solventes químicos para su instalación, sólo agua. El REM se utiliza para cualquier montaje de retroproyección en soporte transparente (escaparate, ventana, tabique interior, lámina de metacrilato…) y para usos de demos, ferias, cada vez que hay necesidad de desplazar la lámina en unos minutos. También, ofrece una seguridad añadiad para todos aquellos clientes que quieren flexibilidad en las instalaciones.\r\n\r\nVERSIONES REM DISPONIBLES\r\n\r\nCONTRAST: retroproyección. Uso en luz alta o exterior. La lámina más “todo terreno”. Escaparate, interiorismo, ferias,…\r\nDIFUSION: retroproyección. Uso interior. Para instalaciones vídeos exigentes (control, simulación, exposiciones, home cinema…) No hot spot, difusión 100% de la luz emitida por el proyector, incluso con ópticas cortas.\r\n360º: retroproyección. Uso interior. La imagen se forma en las dos caras con la misma luminosidad. Perfecto para proyecciones que sólo llevan imágenes.\r\nFRONT: proyección frontal. Uso interior. Pantalla adhesiva… pero de proyección frontal. La facilidad y el diseño de Screenmon para una proyección clásica.\r\n","options":[{"id":9802492,"name":"Consultar Tamaños y precios","price":504.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27076670/-/Screenmon_Fira_Nuvis_VNG2.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27076670/-/Screenmon_Fira_Nuvis_VNG2.JPG","width":1000,"height":750}],"artists":[],"categories":[]}]