[{"id":13320984,"name":"\"BUSCANDO LA FELICIDAD DE LA MANERA EQUIVOCADA\" de Elisa Fuenzalida (Crónicas)","permalink":"buscando-la-felicidad-de-la-manera-equivocada","position":1,"price":7.5,"default_price":7.5,"tax":0.0,"url":"/product/buscando-la-felicidad-de-la-manera-equivocada","status":"active","on_sale":true,"created_at":"2013-09-02T21:25:43.000Z","description":"En estos encuentros con la desesperación propia y ajena, Elisa Fuenzalida aprieta el acelerador  por el resbaladizo camino de la autoayuda al autoterrorismo con tal honestidad liberadora que no esquiva el paisaje devastado de sus ruinas sentimentales y sus fantasías más paranoicas. Así es como esta autora practica la escritura del riesgo: volver con el recuerdo a los lugares del dolor para empezar a escuchar su secreto.\r\n\r\n“Por fin un libro de autoayuda que no intenta ayudarte en lo absoluto. Y quizá por eso acierta en su enloquecida tarea de narrar la épica supervivencia de su protagonista en un mundo de tragedia y de farsa. Elisa Fuenzalida ha escrito un relato de humor alucinado que es pura filosofía cáustica, en la mejor tradición de la anarcoliteratura. Después de su lectura serás incapaz de comer alimentos balanceados y ver series on line sin avergonzarte un poco de ti mismo. Un antídoto radical contra la estupidez”. GABRIELA WIENER\r\n\r\nEncuadernación rústica. 10 X 15 cm. 90 páginas.\r\n\r\nPrecio: 7,50 € \r\n \r\nGastos de envío (España) 1 € . El envío será por correo normal, por lo tanto puede demorar entre una semana a diez días desde el momento en que se hace efectivo el pago.","options":[{"id":42609651,"name":"Default","price":7.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":1.0,"country":{"id":36,"name":"Spain","code":"ES"}},{"amount_alone":2.5,"amount_with_others":2.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125529516/-/solo_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125529516/-/solo_cover.jpg","width":1207,"height":1776}],"artists":[],"categories":[{"id":3093693,"name":"Libro","permalink":"libro","url":"/category/libro"}]},{"id":6608165,"name":"\"2013\" de LUCÍA MUÑOZ MOLINA (Ficción)","permalink":"2013-de-lucia-munoz-molina","position":2,"price":9.0,"default_price":9.0,"tax":0.0,"url":"/product/2013-de-lucia-munoz-molina","status":"active","on_sale":true,"created_at":"2012-07-03T23:10:17.000Z","description":"España, año 2013. En un futuro cercano, poco después de que una revuelta popular subvirtiera el sistema político dominante, la protagonista de esta crónica nos relata su experiencia como maestra en un centro de reeducación para egobloggers, estilistas, editoras de revistas de moda y otras predicadoras de la decadente fast-fashion que reinaba en el antiguo régimen. En la piel de la educadora de este gulag tan particular, una voz intempestivamente irónica matiza la tradición de la utopía soviética con un humor tan incisivo que abate todo signo de corrección política. Y así como la moda, la ideología, el consumo y la revolución son las grandes cuestiones con las que Lucía Muñoz Molina realiza un ejemplar acto de justicia social inspirado en el paradigma de inclusividad promovido por el 15M. \r\n\r\n\"La sátira feroz que la frivolidad sin ideología y el activismo sin estilo estaban pidiendo a gritos\" Jordi Costa\r\n\r\n\"La historia te juzgará, gin tonic de mandarina, burguer de canguro, cultura de tendencias tendenciosa que con el lodo hasta las fosas nasales te sigues metiendo cocaína de DJ molón. La historia te juzgará...Ah, no. Que de eso ya se ha encargado Lucía Muñoz con maestría\" Lucía Lijtmaer\r\n\r\nEncuadernación rústica. 10 X 15 cm. 90 páginas.\r\n\r\nPrecio: € 9.00 \r\n \r\nGastos de envío (España) 1 € . El envío será por correo normal, por lo tanto puede demorar entre una semana a diez días desde el momento en que se hace efectivo el pago.","options":[{"id":21023997,"name":"Default","price":9.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":1.0,"country":{"id":36,"name":"Spain","code":"ES"}},{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":16,"name":"Germany","code":"DE"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/64898933/-/2013_portada.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/64898933/-/2013_portada.jpg","width":539,"height":800}],"artists":[],"categories":[{"id":3093693,"name":"Libro","permalink":"libro","url":"/category/libro"}]},{"id":6087987,"name":"“E-MAILS PARA ROLAND EMMERICH” de SERGI DE DIEGO MAS (Poesía)","permalink":"e-mails-para-roland-emmerich-de-sergi-de-diego-mas-poesia","position":3,"price":7.5,"default_price":7.5,"tax":0.0,"url":"/product/e-mails-para-roland-emmerich-de-sergi-de-diego-mas-poesia","status":"active","on_sale":true,"created_at":"2012-05-02T22:05:55.000Z","description":"Con una mirada estrábica, Sergi de Diego Mas analiza el imaginario postapocalíptico contemporáneo, formulando en su poesía una inquietante arqueología del futuro. Así es como, mientras con un ojo observa algunas paradojas de nuestra promiscua convivencia con la técnica, con el otro practica el sampleo y el remix contaminándose con las ruinas del progreso que describe. De tal forma, en estos E-mails para Roland Emmerich, el tono epistolar deviene elegía, una indagación melancólica sobre nuestra íntima relación con la tecnología. \r\n\r\n“Un primer libro de poemas impecable. Sergi de Diego Mas sintoniza tanto con su presente histórico y tecnológico como con el reverso de su propia piel.” Jordi Carrión\r\n\r\n“Este libro es un auténtico manual sobre cómo exprimir la imagen, la búsqueda de un sonido nuevo, un eco posindustrial que define otra manera de escribir poesía.” David Refoyo\r\n\r\nEncuadernación rústica. Tamaño 10 x 15 cm. 80 páginas.\r\nPrecio: €7,50\r\n","options":[{"id":19439515,"name":"Default","price":7.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":1.0,"country":{"id":36,"name":"Spain","code":"ES"}},{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":16,"name":"Germany","code":"DE"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59776639/-/tumblr_lztgpkqWX71r1ctee.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59776639/-/tumblr_lztgpkqWX71r1ctee.jpg","width":600,"height":872}],"artists":[],"categories":[{"id":3093693,"name":"Libro","permalink":"libro","url":"/category/libro"}]},{"id":6088015,"name":"“MARI KLINSKI” de AINHOA REBOLLEDO (Crónicas)","permalink":"mari-klinski-de-ainhoa-rebolledo-cronicas","position":4,"price":7.5,"default_price":7.5,"tax":0.0,"url":"/product/mari-klinski-de-ainhoa-rebolledo-cronicas","status":"sold-out","on_sale":true,"created_at":"2012-05-02T22:08:10.000Z","description":"Nunca antes fue tan peligroso circular en bicicleta por las ciudades europeas. Una bicicleta con ruedines robada en la más tierna infancia. Otra desaparecida, casi dos décadas después, frente a una famosa discoteca de Barcelona. Los dos hechos son unidos por una crónica autobiográfica, salvaje y visceral que relata una (otra) historia de amor, venganza y redención. Con un particular sentido de la justicia poética, Ainhoa Rebolledo subvierte la corrección política de aquel libelo cortazariano, Vietato Introdurre Biciclette, para animarnos a usar nuestros frágiles vehículos de dos ruedas como armas para hacer “justicia con bicicletas”.\r\n\r\n“Esta autobiografía accidental, donde pedalear tiene menos que ver con ser libre que con estar todo el día poniendo candados, atropellando señoras y obedeciendo a la policía, puede leerse como un clamor personal para que alguien impida a Ainhoa Achtung Rebolledo subirse nunca más a una bici.” Alberto Olmos\r\n\r\n“vale. lo que escribe AINHOA a quien conocí por casualidad en el blogworld que nos acosa me ha alimentado e incluso más cosas esas mañanas en las que pensaba-sentía-o-no que todo estaba definitivamente perdido. Así: ¡OH! NO todo está definitivamente PERDIDO PARA LA IMAGINACIÓN. yo no puedo dejar de leer a AINHOA.” Cristina Fallarás\r\n\r\nEncuadernación rústica. Tamaño 10 x 15 cm. 80 páginas.\r\n\r\nPrecio: € 7,50\r\n\r\nESTE LIBRO HA SIDO DESCATALOGADO A PARTIR DEL 01/07/2013","options":[{"id":19439593,"name":"Default","price":7.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":1.0,"country":{"id":36,"name":"Spain","code":"ES"}},{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":16,"name":"Germany","code":"DE"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59776927/-/Mari_Klinski.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59776927/-/Mari_Klinski.jpg","width":600,"height":872}],"artists":[],"categories":[{"id":3093693,"name":"Libro","permalink":"libro","url":"/category/libro"}]}]