[{"id":5735931,"name":"BEAN BAG SENSATIONS","permalink":"bean-bag-sensations","position":1,"price":22.0,"default_price":22.0,"tax":0.0,"url":"/product/bean-bag-sensations","status":"active","on_sale":false,"created_at":"2012-03-20T06:40:32.000Z","description":"NEW BEAN BAG SENSATIONS !!\r\n\r\nSets of 5 bean bags specifically designed to give extra sensory stimulation as well as the classic games!  These are a fantastic way to stimulate the little people in your life!\r\n\r\nEach bean bag has a different sensory experience - from soft to rough to furry to smooth to buttons to ribbons etc - the list is endless...some bags even have windows with items inside!!\r\n\r\nBags are filled with non-toxic poly pellets and in some cases poly pellets and an organic fiber fill to give a different sensory feel.\r\n\r\nBags are between 10 -12cm square in size and each set is made up of bags within this size range: again different sizes for different sensations.\r\n\r\nEach set is made up at time of ordering and we will randomly put together a full sensory experience for you, so please allow 5-7 days from purchase date for postage.\r\n\r\n{Due to the large range of embellishments,designs, styles etc we do not offer a specific customisation/fabric choice - we will however gladly colour match male/female (e.g. less pink for boys etc)  }\r\n\r\nWe 100% guarantee that no two bags will be the same!!\r\n\r\nWe also include 8 suggestion games to play - though we're sure you'll think of hundreds more!\r\n\r\n\r\nN.B. due to embellishments we recommend sets for 36 months and above - however parents should use personal discretion for younger children.\r\nAllyBeeDesigns has a working history in behavouralism and has used these Bean Bags as well as our classic range for many years with children of all ages and intellectual capabilities (they are great for children with Autism due to sensory stimulation too).\r\n\r\n(c) 2011 AllyBeeDesigns\r\nFor any further information please email us at awpyoung@hotmail.com or check out our Facebook page: http://www.facebook.com/AllyBeeDesigns\r\n","options":[{"id":18414577,"name":"Default","price":22.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56309055/-/DSC03692.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56309055/-/DSC03692.JPG","width":480,"height":380}],"artists":[],"categories":[]},{"id":5735905,"name":"Mini Cutesie Doll  3\"","permalink":"mini-cutesie-doll-4","position":2,"price":28.0,"default_price":28.0,"tax":0.0,"url":"/product/mini-cutesie-doll-4","status":"active","on_sale":false,"created_at":"2012-03-20T06:38:35.000Z","description":"Mini-Cutesie Doll\r\n\r\n \r\n\r\nMeasures 3\"Tall from head to toe\r\n\r\n \r\n\r\nMade from 100% wool felt and hand-sewn\r\n\r\n \r\n\r\nCustom made to order (just let me know what you'd like!)  Let your imagination go wild:\r\n\r\nKnight\r\nFairy\r\nPrincess\r\nGoth Fairy\r\nVampire\r\nAlien\r\n.......\r\n\r\n \r\n\r\nEvery care is taken while sewing these little dolls however we recommend that they are not used in rough play due to their handsewn nature.\r\n\r\n \r\n\r\nThey are also NOT SUITABLE FOR CHILDREN UNDER 36 MONTHS DUE TO SMALL PARTS\r\n\r\n \r\n\r\nLike what you see...please check out our range in store or at our other sites:\r\n\r\nwww.allybeedesigns.com\r\n\r\nwww.facebook.com/AllyBeeDesigns - Pictures available of previous made dolls\r\n\r\n\r\nWE ALSO PRODUCE ITTY BITTY BOOS - at 3\" in a range of characters\r\n \r\n\r\nCheers xx","options":[{"id":18414537,"name":"Default","price":28.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56308895/-/Boos8.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56308895/-/Boos8.jpg","width":1000,"height":563}],"artists":[],"categories":[]},{"id":5735885,"name":"Complete Starter Set - Mama Moon Pads","permalink":"complete-starter-set-mama-moon-pads","position":3,"price":128.0,"default_price":128.0,"tax":0.0,"url":"/product/complete-starter-set-mama-moon-pads","status":"active","on_sale":false,"created_at":"2012-03-20T06:36:18.000Z","description":"Complete Set of 18 Eco Friendly Reusable Cloth Menstrual Pads & Panty Liners\r\n\r\n\r\nWith this  Set, you will receive, six overnight cloth pads, six regular cloth pads and six cloth panty liners.\r\n\r\nYou will get a random set or you can contact me to discuss a custom set - I have a large range of farbics x\r\n\r\n\r\n\r\nPlease be advised that my fabric stock changes daily with the volume of orders I fill. I will always try to get you the fabrics you prefer thoughx \r\n\r\n\r\nThe details:\r\n\r\nThe Overnight Pads\r\n\r\nMeasure approx 35cm in length and 20cm in width (6cm when snapped shut) - they are flared at both ends to help avoid any leaks\r\n\r\n Materials: Made of an outer layer of comfortable flannel with a layer of 100% organic cotton batting, waterproof PUL  and a layer of absorbant terry.\r\n\r\n \r\n\r\nGreat for overnight\r\n\r\n\r\n\r\nThe Regular Pads\r\nMeasures: Approximately 25cm in length and 18cm in width (6cm when snapped shut)\r\nMaterials: Made of an outer layer of comfortable flannel with a layer of waterproof fabric (PUL) and100% cotton batting sewn in between.\r\n\r\nFlow Meter: My pads usually contain a medium - heavy flow - great for mon cup backup\r\n\r\n The Panty Liners\r\nMeasures: Approximately 20cm length and 15cm width (6cm when snapped shut)\r\n\r\n Materials: Made of an 4 layers of comfortable flannel\r\n\r\nFlow Meter: Panty liners are best for light days (like the end of your period) since they do not contain a waterproof lining.\r\n\r\nCare: Simply store used pads/liners in cold water (to help prevent staining) and then toss them in the wash before drying out. Pads/liners are machine washable and dryer safe. If cared for properly, they can last for years.\r\n\r\n \r\n\r\nWe make a range of other sizes - Post-Partum, petite, long, extra-long - if you'd like a custom set made up please contact me at awpyoung@hotmail.com\r\n\r\n \r\n\r\nAlso check out our full range i at www.allybeedesigns.com & facebook or www.allybeedesigns.com\r\n\r\n \r\n\r\nCheers","options":[{"id":18414487,"name":"Default","price":128.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56308783/-/DSC00584.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56308783/-/DSC00584.JPG","width":480,"height":419}],"artists":[],"categories":[]},{"id":5735865,"name":"Car Track/Holder - FREE PERSONALISATION","permalink":"car-track-holder-free-personalisation","position":4,"price":28.0,"default_price":28.0,"tax":0.0,"url":"/product/car-track-holder-free-personalisation","status":"active","on_sale":false,"created_at":"2012-03-20T06:33:47.000Z","description":"Folding Car Track- Holder and Playmat - EXTRA LARGE\r\n\r\n \r\n\r\n**new track fabric!!**\r\n\r\n\r\n\r\nAs my boy grows...so does his need for a larger play space for him and his friends.\r\n\r\nSo I made the Large car playmat/folding track with storage for 5-6 cars/trucks/trains etc (various sizes).  \r\n\r\nI then slip the whole thing in my handbag for easy storage/access where ever we are.\r\n\r\n~~~~~\r\n\r\n\r\n\r\nThis Play mat measures approx 60cm x 70cm and is made from 100% new cotton materials.\r\n\r\n \r\n\r\nEach mat comes with an easy storage pocket and snap closure and is triple stitched to give extra strength.\r\n\r\nBlankets are completely machine washable and can be ironed on a warm setting.\r\n\r\n \r\n\r\nUpon purchasing please let me know your childs name for personalisation.\r\n\r\n \r\n\r\nPlease email me if you'd like something different.\r\n\r\n \r\n\r\nPlease view our FACEBOOK PAGE for a full range of products: \r\nhttp://www.facebook.com/AllyBeeDesigns\r\n\r\n** We have two other sized mats avaliable in store x","options":[{"id":18414461,"name":"Default","price":28.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56308599/-/DSC00010.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56308599/-/DSC00010.JPG","width":480,"height":432}],"artists":[],"categories":[]},{"id":5735855,"name":"Bean Bag Sets (6 bags)","permalink":"bean-bag-sets-6-bags","position":5,"price":14.0,"default_price":14.0,"tax":0.0,"url":"/product/bean-bag-sets-6-bags","status":"active","on_sale":false,"created_at":"2012-03-20T06:32:29.000Z","description":"Bean Bags come in a standard set of 6.\r\n\r\n \r\n\r\nBean Bags make great classic toys for children as they encourage hand/eye coordination skills, colour regcognition, counting skills...oh yes and they are heaps of fun!\r\n\r\n \r\n\r\nEach set is randomly filled with bags of bright colours and patterns to give extra sensory input for little ones.\r\n\r\nWith each set we also send eight games for you to play xx\r\n\r\n\r\nEvery bag is 100% cotton, fully lined and filled with poly pellets.\r\n\r\nYou can wash these bags on the gentle cycle if they get dirty - don't tumble dry though!\r\n\r\n \r\n\r\nPlease let us know at checkout if you would like a male/female themed set and we'll try to help you out (i.e. less pink for boys, less blue for girls) - if not we'll send a random mix of bright colours.\r\n\r\nN.B. We've tried to make our sets bright and colourful and as non-gender specific as possible xx\r\n\r\n\r\nWe're happy to make you a custom set/s of particular colours/ fabrics (upon avaliablity)- if you're interested please contact me via email me at awpyoung@hotmail.com.\r\n\r\nThe colours shown in the set are a guide only - most of our sets will match the colours shown however occassionaly we're snowed under with orders and the colour combinations may change - there will always be 6 different bright colours though..matching as closley as possible to what's shown :-)\r\n\r\n \r\n\r\nCustomer Feedback:\r\n\r\n \"Thanks for the wonderful beanie bags. I've come back again and again as they're such fantastic presents! In a world with plenty of fancy flashy options, these have been a real hit and I would highly recommend. Am sure I'll be back for more!\" A.G.\r\n","options":[{"id":18414441,"name":"Default","price":14.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56308479/-/DSC01173.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56308479/-/DSC01173.JPG","width":303,"height":480}],"artists":[],"categories":[]}]