[{"id":14589012,"name":"Dr. Gangrene Presents Volume 1 - DVD","permalink":"dr-gangrene-presents-volume-1-dvd","position":1,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/dr-gangrene-presents-volume-1-dvd","status":"active","on_sale":false,"created_at":"2013-11-03T13:53:24.000Z","description":"Dr. Gangrene, Physician of Fright, presents four classic tales of terror and schlock.\r\n\r\nTHE HAUNTED PORTRAIT - Robert Webber, Nancy Hadley - B & W - 1959\r\nA young married couple purchase a house with a strange portrait that has ties to the supernatural.\r\n\r\nTHE CLOWN - Christopher Dark, Yvette Mimieux - B & W - 1960\r\nA circus clown seeks revenge for a murder he didn't commit.\r\n\r\nTHE EXECUTIONER - Crahan Denton, Buzz Martin - B & W - 1961\r\nA Civil War spy is captured and sent to the firing squad but a ghostly event intervenes.\r\n\r\nMOON OF THE WOLF  - David Janssen, Barbara Rush - Color - 1972\r\nA werewolf stalks a rural Louisiana town and it's up to the sheriff to stop him.","options":[{"id":47255250,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126919638/-/dgp1cover_redo_42612.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126919638/-/dgp1cover_redo_42612.jpg","width":300,"height":387}],"artists":[],"categories":[]},{"id":14588931,"name":"The Dreadful Hallowgreen Halloween Special - DVD","permalink":"the-dreadful-hallowgreen-halloween-special-dvd","position":2,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/the-dreadful-hallowgreen-halloween-special-dvd","status":"active","on_sale":false,"created_at":"2013-11-03T13:45:30.000Z","description":"Rondo Award winners Doctor Gangrene  and Penny Dreadful  join forces in this spooktastic production hosted by Count Gore De Vol. \r\n\r\nSorcery threatens to destroy Halloween as the holiday is turned upside-down: pumpkins turn pink, candy tastes sour, and goblins and ghouls begin acting lovable! Something must be done!! To the rescue - infamous Doctor Gangrene (famed host of Nashville's \"Creature Feature\") and the enchanting Penny Dreadful (hostess of New England's \"Shilling Shockers\") - assisted by her werewolf sidekick, Garou - combine science, magic and horrifying humor to save their beloved holiday! \r\n\r\nDVD includes the extended cut of the film, with footage not aired in the original half-hour broadcast version. In addition to The Dreadful Hallowgreen Special, the DVD includes an all new half hour special entitled \"Trailer Terror\" hosted by Penny Dreadful & Dr. Gangrene, featuring the hosts introducing some of their favorite classic horror film trailers. Bonus features include trailers, bios, shorts, bloopers and outtakes. In addition, this DVD contains rarely seen Penny Dreadful footage from her live Holiday Specials and eight public service short films from the Emmy nominated series \"Go Green With Dr. Gangrene!\"  A must have for Halloween lovers and horror host fans alike!","options":[{"id":47255076,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126919368/-/DHGcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126919368/-/DHGcover.jpg","width":296,"height":431}],"artists":[],"categories":[]}]