[{"id":407637,"name":"\"U Don't Know Tha Sko\"","permalink":"u-dont-know-tha-sko","position":1,"price":9.99,"default_price":9.99,"tax":0.0,"url":"/product/u-dont-know-tha-sko","status":"active","on_sale":true,"created_at":"2009-09-25T01:48:14.000Z","description":"Born Danville, Ill, ( Lil Sko ) was raised in Memphis, Tenn.       \r\n\r\n \r\n\r\nAs he began his journey through the back streets of Memphis, his presence was being felt on the underground scene. From popping up on DJ Squeeky’s and Skinny Pimp mix tapes “Underground Hustlers “, to Indo G’s “Christmas in Memphis”, and Tommy Wright  III ”Behind Closed Doors”. Lil Sko was making his name stand out in the south Hip Hop world.\r\n\r\n \r\n\r\n \r\n\r\nWith Lil Sko seeing the success of the projects he participated on, it focused him and gave him the urge to search for angles to the next level of the game. Anxiously to lead the New South, he began a paper route that tat landed him out west, in Las Vegas, NV. There he connected with Mac Nig a.k.a Alnardo Wright and some of his home, town partners.\r\n\r\n \r\n\r\n \r\n\r\nMac Nig was a produceing tracks for artist around Vegas and introduce Lil Sko  to Space Hog and let him hear some of the work they was doing and from there “we went into the kitchen “say’s Sko.\r\n\r\n \r\n\r\n“I heard Sko and felt his vibe (Space  Hog) this the element to officially locked the game and start our movement.”\r\n\r\n \r\n\r\nWorking toward his first solo debut, with his M-town slang and his rapid hostile metaphors twisting, like bullets are going to be something you couldn’t duck from if you tried!\r\n\r\n \r\n\r\nWith the south tightening there grips on the Hip Hop game please believe you’ll be seeing Lil Sko right in the front!       “I’ve been thanking god for giving me the ability to show my skills and be able to keep people believing in me “Lil Sko….\r\n","options":[{"id":1628192,"name":"Lil Sko","price":9.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3332547/-/100_1156.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3332547/-/100_1156.jpg","width":1000,"height":750}],"artists":[],"categories":[{"id":284424,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]