[{"id":2264561,"name":"Igloo on Fire logo","permalink":"igloo-on-fire-logo","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/igloo-on-fire-logo","status":"coming-soon","on_sale":false,"created_at":"2010-04-07T21:08:30.000Z","description":"Centuries ago, before new-age inventions such as lighters, matches, and flame throwers, a lonely Inuit was sat in the Arctic. His friends had tried to capture a polar bear and use its fur to make fashionable, winter coats. However, this particular polar bear had already read his horoscope for the day, and he knew that he’d have to prepare for a blood-thirsty battle. He’d hidden a machete inside a concealed pocket underneath his belly, and once approached by the Inuit’s, he attacked and ate them.\r\n\r\nSo now there was just one Inuit left in the Arctic, desperately battling with a severe case of Pneumonia, and maybe a slight Hepatitis issue. He could have purchased a new coat at the local Topshop store which was only two miles down the road, but they didn’t have any in his size, so he sat inside his igloo, stuck needles into a Voodoo doll of his long-lost father, and cried.\r\n\r\nThen, he smelt a burning sensation which created foggy fumes, rapidly filling his igloo. He struggled to breathe, and so climbed out of his home, only to find that it had caught on fire. For a moment, this was a joyous occasion, as no other Inuits had yet discovered fire, and he was sure to be awarded by the mayor and be given a promotion at work. But then he had a chilling thought. The one item which he cherished the most was a signed Ramones poster which he had stuck onto his bedroom ceiling with a fish paste adhesive. It was now bound to be destroyed. This drove the poor Inuit wild with anger. He had lost his friends, and his home, and his signed Ramones poster, all in one day. So he found a rock, repeatedly hit at the thick layer of ice which he was stood on, and jumped into the icy water and froze to death.\r\n\r\nBut the Inuit didn’t care, because he’d already seen a Psychic during a drunken Stag Night party, and she’d told him that in a few thousand years, polar bears will become extinct anyway, so he was happy.","options":[{"id":8130311,"name":"Igloo on Fire logo","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24534651/-/dsg_er.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24534651/-/dsg_er.jpg","width":720,"height":636}],"artists":[],"categories":[{"id":1374391,"name":"Tees","permalink":"tees","url":"/category/tees"}]},{"id":2547801,"name":"Twisted Roses","permalink":"twisted-roses","position":2,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/twisted-roses","status":"coming-soon","on_sale":false,"created_at":"2010-04-28T23:20:00.000Z","description":"A long time ago, before interesting shows were allowed to be broadcasted on national television, the producers of 'Gardeners World' decided to confront Alan Titchmarsh. They told him that they no longer wanted him to be on the show, and that Alys Fowler was going to replace him because gardeners are weird and fantasise about people with ginger hair a bit too much, because they look a bit like flowers I think.\r\nOn his way back from the studio, Alan decided to pop into the local strip club to drown his sorrows. He was so distraught that he turned into Edward Scissorhands and started destroying pretty, sculpted bushes and popped car tyres with a paper parasol from a cocktail he'd drank.\r\nOnce he got back home, he stumbled into his kitchen, and through the large French doors he solemnly noticed the perfectly arranged flowerbed which was placed gracefully in the middle of his garden. This upset poor Alan, because he'd recently bought some new seeds to sow in the flowerbed, but he'd now lost faith in his gardening, and no longer wished to plant them. Instead, he viciously threw them all across the patio, where they lay shrivelled and lonely.\r\nA few hours later, a pigeon was waltzing around in Alan's garden, searching for food to regurgitate for his newly born chicks. He then noticed one of the seeds, and immediately picked it up with his beak and flew off into the distance.\r\nUnfortunately, before the pigeon had chance to arrive at his nest, he had dropped the seed in a nearby field. It was too dark for him to go back and find some more seeds for his chicks, so instead they had to eat their own feathers.\r\nWhilst the chicks were busy choking on their own eggshells, in the field where the seed had fallen, a cluster of ornate, vibrant roses grew amongst the weeds and Dandelions. However, an observant little cow came to investigate, and pricked her nose on the thorns.\r\nSo I suppose, in a sense, this t-shirt isn't that cheerful after all...","options":[{"id":9033011,"name":"Default","price":13.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24533331/-/30771_114228028610090_105643989468494_115225_4572633_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24533331/-/30771_114228028610090_105643989468494_115225_4572633_n.jpg","width":720,"height":671}],"artists":[],"categories":[{"id":1374391,"name":"Tees","permalink":"tees","url":"/category/tees"}]},{"id":2548561,"name":"Ninja Robot","permalink":"ninja-robot","position":3,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/ninja-robot","status":"coming-soon","on_sale":false,"created_at":"2010-04-29T00:11:28.000Z","description":"There once was a lonely robot. He attended a local college, where he learnt how to knit Shreddies like grandmas, and how to make jelly out of pretty much anything. The other robots in his classes disliked him intensely, because he once tried to show them all a clip of '2 Girls 2 Cup' on the TV screen inside his belly.\r\nWhat the other robots didn’t know, was that he only showed them the video to make them aware of human beings, they weren’t bothered by the excrement; they thought it was ice cream. When the other robots saw the two girls on the video, they completely freaked out and accused the robot of having aliens inside his stomach. He became extremely deranged, and started to obsess about serial killers and the likes of Josef Fritzl. \r\nOne dark, summer's night, he got home from robot college, and searched Ebay for a samurai sword and a gimp mask. Unfortunately, because he was under 18, and didn't think ahead and lie about his age when he signed up for Ebay, he could not search for gimp masks. Also, his parents would have thought he was into bondage if they happened to notice the mask, and then they wouldn't allow him to go through with an arranged marriage with the robot mayor's cute granddaughter. So instead, he painted his entire head black with an acrylic paint set he’d been given for his birthday.\r\nAfter many impatient, verbally abusive phone calls to the Royal Mail, the sword had finally arrived to the robot's house. He was so excited, that he aggressively tore off the bubble wrap straight away, and completely disregarded the sticker saying: “handle with care – sharp objects’.\r\nHowever, he didn't use the sword to decapitate the other robots who were nasty to him, instead, he crept up on dragonflies and tickled their tails with the end of the weapon.\r\nThis only led to further discrimination from his peers at robot college, and a few of them started being vindictive, catching the dragonflies and enclosing them in the glass jars that Nutella sometimes comes in, so that the ninja robot could no longer play with them.\r\nBut when the recession hit the robot economy, they could no longer afford to buy Nutella anymore, so they had no jars to trap the dragonflies in.\r\nSo the ninja robot happily played with his new, floaty friends, and because he was now in line to marry a rich, beautiful robot, he could eat all the Nutella he wanted.","options":[{"id":9037001,"name":"Default","price":13.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24540571/-/30771_114228018610091_105643989468494_115223_4453725_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24540571/-/30771_114228018610091_105643989468494_115223_4453725_n.jpg","width":720,"height":636}],"artists":[],"categories":[{"id":1374391,"name":"Tees","permalink":"tees","url":"/category/tees"}]},{"id":2548841,"name":"Shark Attach","permalink":"shark-attach","position":4,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/shark-attach","status":"coming-soon","on_sale":false,"created_at":"2010-04-29T00:28:38.000Z","description":"Buried deep within the ocean, amongst broken anchors and the remains of sunken ships covered in Anemone, a television set was stuck in the sand. It was a magical TV, and didn't need electricity to work; it was powered by a special type of leprechaun gold which was enclosed inside a nearby treasure chest.\r\nOne day, the sea creatures looked at the TV guide and noticed that 'Jaws' was going to be shown on BBC3 at 9 O'clock, so they all gathered around to watch it.\r\nHowever, the sharks were so disgusted by the way in which they'd been stereotyped as vicious, blood-thirsty beasts, that they decided to make their opinions known.\r\nThey could easily have approached Steven Spielberg and discussed the matter in a more formal, dignified manner, whilst eating cookies and drinking tea. But instead, because they had seen 'Free Willy' a few weeks ago, and noticed that the humans liked it when the whales performed stunts, the sharks started to leap out of the water, in order to impress the families and couples on the beach, so that they could see how graceful and talented they were.\r\nHowever, the humans were terrified, and ran for their lives...\r\n.","options":[{"id":9039421,"name":"Default","price":13.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24542531/-/30771_114228011943425_105643989468494_115222_8019371_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24542531/-/30771_114228011943425_105643989468494_115222_8019371_n.jpg","width":720,"height":628}],"artists":[],"categories":[{"id":1374391,"name":"Tees","permalink":"tees","url":"/category/tees"}]},{"id":2614814,"name":"Terror Cheese","permalink":"terror-cheese","position":5,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/terror-cheese","status":"active","on_sale":true,"created_at":"2010-06-14T20:47:04.000Z","description":"High Quality, very yellow t-shirt, available in small, medium and large. Only 30 in stock.","options":[{"id":9257835,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25191121/-/Copy_of_P4220300.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25191121/-/Copy_of_P4220300.JPG","width":336,"height":448}],"artists":[],"categories":[{"id":1374391,"name":"Tees","permalink":"tees","url":"/category/tees"}]}]