[{"id":3876350,"name":"Shoot Great Newborn Baby Photos with this Posing Puck™ Jumbo White Waterproof Photography Ottoman","permalink":"shoot-great-newborn-baby-photos-with-this-posing-pucktm-jumbo-white-waterproof-tot-prop-baby-booster","position":1,"price":110.0,"default_price":110.0,"tax":0.0,"url":"/product/shoot-great-newborn-baby-photos-with-this-posing-pucktm-jumbo-white-waterproof-tot-prop-baby-booster","status":"active","on_sale":false,"created_at":"2011-06-07T04:10:29.000Z","description":"This item is available for immediate shipment.  From St. Paul, MN, USPS Priority Mail delivers to most locations within 3 days. Several other sellers of this item are taking back orders...but who wants to wait up to 6 weeks?\r\n+++++++++++++\r\n\r\nAre you a newborn baby photographer? This Posing Puck™ is just for you!\r\n\r\nHere is a wonderful, MUST HAVE tool for newborn photography. The jumbo cushion is large enough to hold TRIPLETS and very well built! It gets the babies up off the floor and keeps them cozy while you work. Blankets and other backdrops look lovely draped over the cushion. \r\n\r\nIf you’ve ever worked with newborns, you’ll want something completely waterproof! This cushion is made with smooth, high quality faux leather WATERPROOF polyurethane vinyl. Quality double/reinforced stitching with strong upholstery thread- this cushion is built to last. Hidden ZIPPER closure for easy filling and firmness adjustment.\r\n\r\nThis Posing Puck™ ships EMPTY.   The Puck requires 12 “cubes” or cubic feet of Polystyrene pellets (beanbag fill).  The cheapest I've found is at Walmart.com (free shipping if you have it shipped to their store).  You'll need 4 bags of fill (3.5 cubic feet each).\r\n\r\nMeasures 42” across and 12” tall.\r\n\r\nI'm proud to offer FAST, RELIABLE shipping. Who doesn’t need their stuff quickly?\r\n\r\nCreated in a smoke-free, pet-free environment. Shipping includes insurance. International shipping available (6-10 day arrival time).\r\n\r\nA great investment for consistently great newborn poses!\r\n\r\nFind the Posing Puck™ on Facebook: http://www.facebook.com/PosingPuck/","options":[{"id":12922238,"name":"Default","price":110.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":45.5,"amount_with_others":45.5,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":27.95,"amount_with_others":27.95,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":45.5,"amount_with_others":45.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":13.0,"amount_with_others":13.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/37792870/-/7.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/37792870/-/7.JPG","width":579,"height":386}],"artists":[],"categories":[{"id":2158936,"name":"Posing Puck™","permalink":"posing-pucktm","url":"/category/posing-pucktm"}]},{"id":3876500,"name":"Four Zippered White Waterproof Vinyl Photo Props for Positioning Baby, Set of 4 in a Sack","permalink":"four-zippered-white-waterproof-vinyl-photo-props-for-positioning-baby-set-of-4-in-a-sack","position":2,"price":100.0,"default_price":100.0,"tax":0.0,"url":"/product/four-zippered-white-waterproof-vinyl-photo-props-for-positioning-baby-set-of-4-in-a-sack","status":"active","on_sale":false,"created_at":"2011-06-07T04:35:32.000Z","description":"Are you a newborn baby photographer?\r\n\r\nHere are 4 plump beanbags cushions that can be used to delicately prop up or position the baby being photographed. It's time to leave those awkward rolled up towels behind!! Useful to help position the baby’s head, face, arms or legs into the perfect position for your photograph. These are a MUST HAVE for photographers specializing in newborns.\r\n\r\nThese props are each fitted with a zipper, so you can adjust the firmness to exactly fit your needs.\r\n\r\nMade with high quality faux leather WATERPROOF polyurethane vinyl (because the babies do wet, don't they?), this sturdy four piece set includes a mesh draw-string sack, to help keep the bags neatly bundled and dry quickly if they've been wiped down.\r\n\r\nThese can be used on a flat photography surface or in conjunction with the large Posing Puck™ cushion. These smaller props arrive PRE-FILLED and ready to use- no need to order poly-fill. [INTERNATIONAL ORDERS:  these are sent empty to save on shipping and get through Customs]\r\n\r\nMeasurements of the rectangles are: 16\" x 4\" x 2\" and 10\" x 6\". The circles measure 8\" and 6\". They are filled with rice so they are firm and easy to shape, yet soft to the touch. The bags should not be completely submerged in water (e.g. washing machine), but simply wiped down and dried.\r\n\r\nI can ship these empty which lowers the cost by $5, and reduces U.S. shipping cost by $6. I only charge actual shipping, I combine shipping if you order multiple items to save money, and immediatly refund excess shipping back to your Paypal account.\r\n\r\nCreated in a smoke-free, pet-free environment.\r\n\r\nI pride myself on offering FAST, RELIABLE shipping. Doesn’t everybody want to receive their stuff quickly?\r\n\r\nContact me if you need a single prop, or a different combination of props than what is pictured- we can work something out to meet your needs.\r\n\r\nFind the Posing Puck™ on Facebook: http://www.facebook.com/PosingPuck/\r\n\r\nCustomer comments:\r\n\r\n\"These are exactly what I have been searching for! VERY well made and shipped quickly. Can't wait to use them! Well Done!!!\"\r\n\r\n\"Dear Liz... Thank you so much for the great posing pillows. They are 'just the ticket' for photographing a newborn baby. In the past I've used rolled up towels and whatever else I could find. Now I just pick up my mesh bag of goodies and it's all I need. Thank you also for the prompt service...Your Happy Customer...barb\" ","options":[{"id":12922744,"name":"Default","price":100.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":45.5,"amount_with_others":0.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":27.95,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":45.5,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":13.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/37793774/-/IMG_7978.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/37793774/-/IMG_7978.JPG","width":1000,"height":667}],"artists":[],"categories":[{"id":2158938,"name":"Positioning Props","permalink":"positioning-props","url":"/category/positioning-props"}]}]