[{"id":10137844,"name":"PlayPlax","permalink":"playplax","position":1,"price":16.5,"default_price":16.5,"tax":0.0,"url":"/product/playplax","status":"active","on_sale":false,"created_at":"2013-03-25T04:11:21.000Z","description":"The iconic 1960’s game, originally invented by Patrick Rylands in 1966, is back and as beautiful as ever. The box contains 48 brilliantly coloured squares that interlock to make endless shapes… No batteries, no manual, no character branded nonsense just pure architectural creativity! The only limitation is your imagination!\r\n\r\nPortobello Games are proud to bring this classic toy to a new generation. Using the same factory in Cheshire who used to make them and even sticking to the original dye recipe to achieve the same vivid colours means that these PlayPlax are just as fresh and modern as they ever were.\r\n\r\n<B>Matilda loves PlayPlax because…</B>\r\n\r\n<I>“The colours are really pretty when the sun shines.”</I>\r\n\r\n<b>Mummy and Daddy say…</b>\r\n\r\n<I>“We both remember paying with PlayPlax as children and it’s great that Matilda can experience them too!”</I>","options":[{"id":31724017,"name":"Default","price":16.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/99597259/-/playplax.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/99597259/-/playplax.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":4767187,"name":"Toys & Games","permalink":"toys-games","url":"/category/toys-games"}]},{"id":9941032,"name":"Magic And Fairy-Tale Dice","permalink":"magic-and-fairy-tale-dice","position":2,"price":9.95,"default_price":9.95,"tax":0.0,"url":"/product/magic-and-fairy-tale-dice","status":"active","on_sale":false,"created_at":"2013-03-14T23:16:53.000Z","description":"Revive the art of storytelling using these nine beautifully illustrated wooden dice to create the most imaginative, funny and bizarre stories. “Once upon a time there was a beautiful princess, who lived all alone in an enchanted forest with only a top hat and a magnifying glass for company. One fine day, a singing frog on a broomstick flew past and... “\r\n\r\nThis is the perfect family game that will stimulate the imaginations of children and adults alike. Role the eight “black” dice and if you’re lucky enough to role the red vortex you get to role the ninth “red” dice to assign a super power to your lead character. Take all the elements you’ve rolled, which could include a storm, a mouse, a magic wand, a rainbow, a bottle of poison, a magic mirror or even an enchanted forest (there is a useful key card describing what’s what) and amalgamate them into a magical fairy-tale for the whole family to enjoy! No two stories will ever be the same! \r\n\r\nIts compact nature makes it perfect for travel, taking on holiday and even playing round the campfire!\r\n\r\n<B>Matilda loves the Magic And Fairy Tale Dice because…</B>\r\n\r\n<I>“Mummy uses them to tell me nice stories!”</I>\r\n\r\n<B>Mummy and Daddy say…</B>\r\n\r\n<I>“Matilda is still a little too young to play the game by herself, although she still likes to try, but we find the Magic And Fairy-Tale Dice very handy in creating our own special stories to tell Matilda. We’ve even started to write down some of the ones she’s like best to tell over again! Our teacher friends also tell us they’re great for stimulating ideas in creative writing classes.”</I>","options":[{"id":31088620,"name":"Default","price":9.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":1.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/97653217/-/magicandfairytaledice.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/97653217/-/magicandfairytaledice.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":4767187,"name":"Toys & Games","permalink":"toys-games","url":"/category/toys-games"}]},{"id":9940870,"name":"Alexander Girard’s Eden Giant Floor Puzzle","permalink":"alexander-girards-eden-giant-floor-puzzle","position":3,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/alexander-girards-eden-giant-floor-puzzle","status":"active","on_sale":false,"created_at":"2013-03-15T05:08:06.000Z","description":"Alexander Girard’s lovely and abstract design, titled “Eden,” graces this gigantic floor puzzle. The design features an array of wildlife including flowers, birds and other creatures. Young children will enjoy this brightly coloured and challenging puzzle and design-savvy parents will appreciate the beautifully designed imagery of Alexander Girard.\r\n\r\nMeasuring an impressive 24” x 36” when assembled, this jigsaw is made up of 24 jumbo-sized pieces. Without doubt the largest jigsaw puzzle we’ve ever seen!\r\n\r\n<B>Matilda loves the Edan Giant Floor Puzzle because…</B>\r\n\r\n<I>“The pieces are as big as my head!”</I>\r\n\r\n<B>Mummy and Daddy say…</B>\r\n\r\n<I>“Alex Girard’s beautifully simple pattern-like design works so well as a jigsaw puzzle, which isn’t surprising seeing as he’s best known for his textile designs for Herman Miller. Matilda isn’t as taken with the design as much as some of her more illustrative puzzles but the impressively vast size of the jigsaw has definite appeal.”</I>","options":[{"id":31088071,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/97651483/-/edengiantfloorpuzzle.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/97651483/-/edengiantfloorpuzzle.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":4767187,"name":"Toys & Games","permalink":"toys-games","url":"/category/toys-games"}]},{"id":9921304,"name":"All Aboard Train Puzzle","permalink":"all-aboard-train-puzzle","position":4,"price":10.99,"default_price":10.99,"tax":0.0,"url":"/product/all-aboard-train-puzzle","status":"active","on_sale":false,"created_at":"2013-03-14T06:36:32.000Z","description":"Children won’t believe their eyes as they assemble the beautifully illustrated jigsaw pieces of this one-of-a-kind train puzzle.\r\n\r\nEach jigsaw piece features a single train carriage packed with quirky and colourful characters… one carriage is a ball pool, another is a huge fish tank bursting with aquarium animals there is even a prehistoric carriage with caveman passengers… capped off at each end by an engine and a caboose! \r\n\r\nMarc Boutavant’s magical creatures adorn both sides of the 12 puzzle pieces, so there are 24 different carriages allowing the train to be arranged in countless ways! Unlike most jigsaws there is no right or wrong way to put the jigsaw pieces together. The joy lies in making the train your own.  The train can be long or a short putting your favorite carriages in any order you wish!\r\n\r\n<B>Matilda loves the All Aboard Train Puzzle because…</B> \r\n\r\n<I>“The train is really cute with lots and lots of animals. I like making the train as long as possible and different every time I play!”</I>\r\n\r\n<B>Mummy and Daddy say…</B> \r\n\r\n<I>“Marc Boutavant is a fantastic artist and illustrator who created Mouk, one of Matildas favorite TV shows, as well as numerous picture books. His recognizable cute animal characters were an instant hit with Matilda and she enjoys picking out the little details and creatures packed into each piece of the jigsaw. It seems each time she plays with the All Aboard Train Puzzle she spots something new!”</I>","options":[{"id":31031269,"name":"Default","price":10.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/97459783/-/allaboardtrainpuzzle.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/97459783/-/allaboardtrainpuzzle.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":4767187,"name":"Toys & Games","permalink":"toys-games","url":"/category/toys-games"}]},{"id":9797425,"name":"10 Little Penguins","permalink":"10-little-penguins","position":5,"price":9.99,"default_price":9.99,"tax":0.0,"url":"/product/10-little-penguins","status":"active","on_sale":false,"created_at":"2013-03-08T05:28:48.000Z","description":"In this inventive pop-up book by Joelle Jolivet and Jean-Luc Fromental's cute penguins must count down from ten to zero - one page and one pop-up for each number. The book starts with 10 penguins on an iceberg, one by one they disappear in a variety of amusing accidents. Are the penguins gone forever? A great counting book with a surprise ending!\r\n\r\n<B>Matilda loves 10 Little Penguins because...</B>\r\n\r\n<I>“Penguins are funny and cute!”</I>\r\n\r\n<B>Mummy and Daddy say...</B>\r\n\r\n<I>“We thought the disappearance of penguins into the mouth of killer whale and through a hole in the ice might be a bit upsetting, but Matilda thought it was hilarious and the surprise ending makes it all okay.”</I>\r\n","options":[{"id":30654997,"name":"Default","price":9.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":1.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/96254908/-/10littlepenguins.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/96254908/-/10littlepenguins.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":4767184,"name":"Books","permalink":"books","url":"/category/books"}]}]