[{"id":11970444,"name":"Caricature","permalink":"caricature-black-and-white","position":2,"price":30.0,"default_price":30.0,"tax":0.0,"url":"/product/caricature-black-and-white","status":"active","on_sale":false,"created_at":"2013-06-23T22:26:24.000Z","description":"Have you or someone you know ever been curious about what your face would look like through the eyes of a caricature artist?\r\n\r\nHere’s your chance! I would love the opportunity to draw YOU, your spouse, boyfriend, girlfriend, friend, family member, close enemy, etc…\r\n\r\nThese QUALITY Caricatures make great one-of-a-kind gifts for ALL occasions (Christmas, Birthdays, Anniversaries…etc).\r\nEach piece is specially designed and tailored to each person. So if you or someone you know has a great sense of humor, loves cartoons, is not easily offended and has a face that is just begging to be made even crazier, look no further, you’ve come to the right place!\r\n\r\nHOW ARE THEY DRAWN?\r\n\r\nMy Caricatures are drawn in either Black and White or Full Colour and capture from the very top of the head to just below the shoulders (sorry no full body drawings). The charge is £30 per person or Animal for Black and White and £40 for Full Colour and of course I can also draw several faces into one piece of art.\r\n\r\nHOW TO SEND PHOTOS?\r\n\r\nAfter Payment is sent, the next things I need are PHOTOS. When sending photos it’s best to send them through to stuff@flakychump.com\r\nPlease send photos of who you want to be drawn that are high quality shots that clearly show the face(s), straight forward, 3/4 view (not quite side, not straight forward either) are preferred. I will need a set of QUALITY images from each person in the Caricature. REMEMBER, the better the reference is, the better the Caricature will turn out. Feel free to contact me if you have any more questions stuff@flakychump.com\r\n\r\nThat’s pretty much it! Once I have recieved payment and photos I will take it from there. Please allow 2 weeks after time of purchase to be delivered directly to you. Thank you for your interest.","options":[{"id":37864326,"name":"One Person / Animal Black and White","price":30.0,"sold_out":false,"has_custom_price":false},{"id":37864644,"name":"Two People / Animals Black and White","price":60.0,"sold_out":false,"has_custom_price":true},{"id":37864647,"name":"Three People / Animals Black and White","price":90.0,"sold_out":false,"has_custom_price":true},{"id":37864650,"name":"One Person / Animal Full Colour","price":40.0,"sold_out":false,"has_custom_price":true},{"id":37864653,"name":"Two People / Animals Full Colour","price":80.0,"sold_out":false,"has_custom_price":true},{"id":37864656,"name":"Three People / Animals Full Colour","price":120.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124330179/-/Finished_Drawing.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124330179/-/Finished_Drawing.jpg","width":2272,"height":3488}],"artists":[],"categories":[{"id":5612349,"name":"Commissions","permalink":"commissions","url":"/category/commissions"}]}]