[{"id":2783313,"name":"REBUILD THE FALLEN EMPIRE","permalink":"rebuild-the-fallen-empire","position":1,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/rebuild-the-fallen-empire","status":"active","on_sale":true,"created_at":"2010-10-04T18:40:32.000Z","description":"The Dead Will Tell is a metal band from Johannesburg, South Africa.\r\n<br/>\r\nThe band has played with Underoath (USA), Haste The Day (USA), No turning back (NED), Have Heart and Shipwreck A.D (USA), Seven Year Kismet (UK), Through this Defiance (USA). The band has toured South Africa intensely as well as being seen at many festivals such as Woodstock and Ramfest. The band’s aggressively melodic sound is a result of the elegant combination of elements drawn from a range of different genres, the main ones being death metal and hardcore.\r\n \r\nThe mixture of the two, along with other sub genre elements, results in a melodic but brutal sound that is aggressively delivered with a fervent energy. Melodically based guitars are layered with pure perfection over the destructively solid drumming and the result is a fast paced delivery of brutal melody. The listener is taken on a head twisting journey as the songs flow from the melodic to the churning and pounding breakdowns. The band has been playing live for three years and has a stage act that can rival any. Their songs are delivered with ferocious focus and the result is a chaotic dream of both the brutal and the melodic. \r\n<br/>\r\nwww.myspace.com/thedeadwilltellband\r\n","options":[{"id":9744024,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/26911299/-/hollpoesALBUM-front-01.gif","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/26911299/-/hollpoesALBUM-front-01.gif","width":310,"height":291}],"artists":[{"id":46494,"name":"THE DEAD WILL TELL","permalink":"the-dead-will-tell","url":"/artist/the-dead-will-tell"}],"categories":[{"id":1656180,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]