[{"id":2564723,"name":"Personalized Wooden Baby Blocks-Raspberry Swirls Butterflies","permalink":"personalized-wooden-baby-blocks-raspberry-swirls-butterflies","position":1,"price":22.5,"default_price":22.5,"tax":0.0,"url":"/product/personalized-wooden-baby-blocks-raspberry-swirls-butterflies","status":"active","on_sale":false,"created_at":"2010-05-08T01:08:09.000Z","description":"This Listing is for a 6 Letter Name & the 2 End Blocks Unique to your Nursery Decor.\r\n\r\nThese wooden blocks are hand painted and designed to uniquely match the nursery decor of your choice. The blocks are 2 inches in size. Paint used is non-toxic, but it is still recommended that these blocks are for decor use only, and not as a toy.\r\n\r\nThe picture of above is just an example of what I can do to coordinate with the \"Raspberry Swirls Butterflies\" nursery decor. I can design the set based on your preferences. Feel free to ask any questions or make suggestions regarding the design.\r\n\r\nIf you want to purchase a set of blocks and you have more or less letters in the baby's name please go to my store and select the listing with the correct number of letters. I charge $2 for each additional block. Similarly, I will deduct $2 for each block you don't need. Send me a message with the name after purchasing. It takes me 5-7 days to create your blocks and then I will quickly ship them to you. \r\n\r\nEach set of finished baby blocks are tightly wrapped in clear plastic cellophane wrap and coordinating ribbon is used to completely provide you with a fantastic product to keep for yourself & baby or to give as a gift. The baby blocks are then tightly packed and shipped to you. \r\n\r\n\r\nAs I said before, these blocks are created just for you & I am willing to work with you to create exactly what you want. Please just send me a message with any questions or ideas that you may have. Just check out my store for other listings and ideas. Also, if I don't have your nursery decor in a listing, just email me a link or picture of the bedding and I will let you know what I can create for you.\r\n\r\n","options":[{"id":9092740,"name":"Default","price":22.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.5,"amount_with_others":4.5,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24695300/-/raspberry_swirls_1_1_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24695300/-/raspberry_swirls_1_1_.jpg","width":500,"height":375}],"artists":[],"categories":[{"id":1537681,"name":"Girl Themes","permalink":"girl-themes","url":"/category/girl-themes"},{"id":1537684,"name":"Butterfly Themes","permalink":"butterfly-themes","url":"/category/butterfly-themes"}]}]