[{"id":8775941,"name":"The Lucky Charm","permalink":"the-lucky-charm","position":1,"price":49.99,"default_price":49.99,"tax":0.0,"url":"/product/the-lucky-charm","status":"active","on_sale":false,"created_at":"2013-01-03T21:09:13.000Z","description":"Brings Prosperity To The Possessor.  \r\n\r\nTHE LUCKY CHARM\r\n\r\nSometime during the 1880’s my great grandfather, a traveling merchant, was lost in the Middle Eastern desert. While camping for the night beside the fire he was approached by a traveling stranger who asked if he could join my great grandfather for the night; my great grandfather welcomed the stranger. As the stranger offloaded his camel and sat beside the fire, my great grandfather explained that he was lost and could not find his way back home and asked if he could help. The stranger responded by saying he did not know the way back to where my great grandfather was seeking. However, he did offer my great grandfather a gift that would change his life. The stranger gave him a pouch filled with three semi precious stones and instructed my great grandfather never to separate them or show them to any living soul. If he could do that, the stranger promised they would bring him prosperity in all his endeavors. My great grandfather accepted the gift and they both went to sleep beneath the starry desert. In the morning my great grandfather woke up and the stranger was gone. To cut a long story short, not only did my great grandfather find his way back home, he also became a very prosperous trader. \r\nIn addition, twenty-five years after that night, my great grandfather met the stranger in a market place in Baghdad. My great grandfather insisted that the stranger tell him the secret behind those three normal looking semi precious stones that he had been carrying for twenty-five years without separating them or showing them to anybody. The stranger shared the secret, which my great grandfather shared with his son, my grandfather, who shared it with me. When my grandfather shared it with me he instructed me not to share it with anyone, and if I wished to sell the rock combination, I could only do so twenty-five years after he told me the secret. \r\n\r\nIt has now been twenty-five years since my grandfather shared the secret with me, and the rocks have been with me for that long and have brought me a lot of prosperity. Now is the time for me to sell them. \r\n\r\nTHE SECRET\r\n\r\nThe rocks are a variety of three different semi precious rocks, which, when combined together on a particular day of any lunar month will give the combination the powers they hold. That is it. \r\n\r\nRESEARCH\r\n\r\n“Can luck really influence the outcome of events? That question has captivated otherwise rational people for centuries—and challenged scientists to somehow prove whether lucky charms, special shirts or ritualistic behaviors hold special powers.\r\n\r\nIn a test conducted by researchers from the University of Cologne, participants on a putting green who were told they were playing with a \"lucky ball\" sank 6.4 putts out of 10, nearly two more putts, on average, than those who weren't told the ball was lucky. That is a 35% improvement. The results suggest new thinking in how to view luck and are intriguing to behavioral psychologists.”\r\n\r\nSource: http://online.wsj.com/article/SB10001424052748703648304575212361800043460.html\r\n\r\nCONCLUSION\r\n\r\nAbove you have two versions of Lucky Charms. It does not matter which one you choose to believe in for what matters is that Lucky Charms only work when you believe in them. You can choose to believe my story, which is true, or you could believe in the scientific approach, whichever you choose, prosperity is surely to come your way. \r\n\r\nProsperity is uniquely defined by each individual. Meaning, \"prosperity\" is whatever you wish it to be. \r\n\r\nToday, January 3rd, 2013, marks the end of the twenty-five year wait. \r\n\r\nSo, if you decide to purchase my Lucky Charms, the rocks that were gathered together according to my story will be mailed to you with a set of simple instructions on how to make them effective for you personally. \r\n","options":[{"id":27557369,"name":"Default","price":49.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/86300453/-/Pouch.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/86300453/-/Pouch.jpg","width":500,"height":461}],"artists":[],"categories":[{"id":4277045,"name":"Lucky Charm","permalink":"lucky-charm","url":"/category/lucky-charm"}]}]