[{"id":11679,"name":"ACOUSTIC REVOLUTION debut album release","permalink":"acoustic-revolution-debut-album-release","position":1,"price":8.99,"default_price":8.99,"tax":0.0,"url":"/product/acoustic-revolution-debut-album-release","status":"active","on_sale":true,"created_at":"2007-01-29T08:36:55.000Z","description":"Album review from the Murfreesboro pulse Entertainment Magazine&#8230;Murfreesboro/Nashville TN&#8230;\nEvery once in awhile, there is an album that stands out among the rest. To start off our New Year with a bang, Acoustic Revolution has done just that. Led by the talented John Salaway and his brother Mick, Acoustic Revolution draws the line between the indie/folk rock of today to the modern rock sound of the late sixties to the early seventies. The music itself is very progressive, pulling its influences from Beck to the days of Pink Floyd and the Beatles&#8217; Sgt. Peppers. Throughout this album, Salaway delves his way through the evils of the modern recording era, detailing the plights of the average band trying to make it in the real world. Acoustic Revolution is a revolution of sorts, letting go of the typical commercial aspects of the music industry to reveal a more honest and real approach to music. This relentless pursuit for real music with feeling is obvious as the band explores the boundaries of folk and rock, leaving behind the constraints of the traditional recording styles to blend together great harmony, melody, and lyrics. Every part of the album is planned with the utmost intricacies, leaving the listener ready for more, feeling every ounce of energy and passion. It seems that Salaway has outdone himself, writing with impressive craftsmanship and playing with excellent dexterity and sophistication. Even Salaway&#8217;s vocals display solid workmanship, complimenting his well-structured songs with well-delivered emphasis at just the right moment. The overall pace of the album is almost perfect, taking the listener slowly in with the pleasantly intoxicating &#8220;There&#8217;s Always Something&#8221; to the heavy, percussive, guitar-driven sound of &#8220;Sally&#8217;s Back Door&#8221; and &#8220;The Great Escape.&#8221; This album details what rock and roll should be about, offering an answer to the many listeners who are looking for something more than the typical formats of today. Produced with the help of DefKat Records, the album shows every facet of great recording techniques, using an amazing display of keyboards, synthesizers, guitars, bass, and percussion to provide pure listening pleasure. Heavy guitar riffs, smooth acoustic picking, steady rhythmic bass playing, and precision drumming encompass the entire album. The powerful style and artistic expression have been captured in every nuance and detail on the album, revealing more than just an album full of songs, but rather an album that explores some specific theories or concepts. Acoustic Revolution displays almost an obsessive compulsion to achieve the perfect sound, the perfect melody, the perfect harmony. This constant compulsion to succeed gives them something to bring clarity to their own identity, achieving true focus and attitude. Acoustic Revolution displays a prominent voice that is true to their own. Their fight for something perfect, something unique, is fascinating, leaving an air of mystery that offers some type of poetic justice for the average listener. This album is a revolution, and the fact remains, this band is about making real music. Really damn good music. This music takes you everywhere, taking you on a personal, emotional level to a political level. Yet, despite these dark times, there is a revolution. This is an Acoustic Revolution that is paving the way for something real&#8212;full of great promise and hope.that is sure to leave you wondering about the main issues in our lives, and maybe even wondering about a girl named Sally. By Jeff Russell jeffrussellmusic@yahoo.com\n\n","options":[{"id":53026,"name":"Default","price":8.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.45,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/21936/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/21936/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":19521,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":11770,"name":"ACOUSTIC REVOLUTION TEE","permalink":"acoustic-revolution-tee","position":2,"price":11.99,"default_price":11.99,"tax":0.0,"url":"/product/acoustic-revolution-tee","status":"active","on_sale":true,"created_at":"2007-01-30T07:56:30.000Z","description":"Show your support for the revolution with this high quality Tee. Comes in Large and X-Large; Solid Black with silkscreen logo.\n\n","options":[{"id":54684,"name":"Default","price":11.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.95,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/22068/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/22068/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":19524,"name":"Tees","permalink":"tees","url":"/category/tees"}]}]