[{"id":13069407,"name":"NOTE","permalink":"note","position":1,"price":1.0,"default_price":1.0,"tax":0.0,"url":"/product/note","status":"active","on_sale":false,"created_at":"2013-08-20T13:41:32.000Z","description":"","options":[{"id":41713911,"name":"Default","price":1.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":37,"name":"Sweden","code":"SE"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123044466/-/NOTE2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123044466/-/NOTE2.jpg","width":700,"height":700}],"artists":[],"categories":[]},{"id":13069308,"name":"Light My Way V","permalink":"light-my-way-v","position":2,"price":2200.0,"default_price":2200.0,"tax":0.0,"url":"/product/light-my-way-v","status":"active","on_sale":false,"created_at":"2013-08-20T13:32:07.000Z","description":"A painting that “Works” for me, is a painting that “Talks” to me. \r\nIt has to have the quality to inspire an emotional response. It’s like a note on a wall or a “sign”, a “totem” reminding me of something important in life or a message that I need to “hear” from time to time. \r\n\r\nWhen I create my paintings it’s as if they were for my walls, knowing that eventually they will travel to their future owners. Some folks tell me that the paintings seem to have “spirit”, like they emanate some energy in their homes. I do believe in energies and the power us humans possess, specially the power of thoughts.\r\n\r\nI believe that as I paint my paintings a part of me, or a part of my thoughts mixes with the paint and becomes the soul of the painting. Its like each painting I create has a tiny little piece of my life, energy and thoughts in it… Then people connect or not to them. I also think that sometimes paintings are like mirrors that can reflect emotions that are inside us. \r\n\r\nWhen folks connect to the work, I get this wonderful feeling of accomplishment and of being connected to another human being, someone that relates to the message as I do. So much that they have to have it in their homes.\r\n\r\nIn my mind, my collectors and I become a little “tribe” of fellow thinkers, travellers, adventurers, the art connecting us somehow. They become part of my journey and my paintings a part of theirs.\r\n\r\nThe “light my way series” to me is a series of images that remind me to always have faith in myself, in others and in life itself. A call to “Carry on”, to have “Hope” no matter how long or difficult the journey towards the Goal seems. \r\n\r\nIt’s also a reminder of gratitude for all the blessings we all receive daily.\r\n\r\nThanks for being a part of this adventure! \r\nA good ol’ Bear Hug of gratitude to you, \r\n\r\nRic\r\n\r\n\r\n“Not what he wishes and prays for does a man get, but what he justly earns. His wishes and prayers are only gratified and answered when they harmonize with his thoughts and actions. You are today where your thoughts have brought you; you will be tomorrow where your thoughts take you. A man cannot directly choose his circumstances, but can choose his thoughts, and so indirectly, yet surely, shape his circumstances. \r\n\r\nSo Cherish your visions; cherish your ideals. Cherish the music that stirs in your heart, the beauty that forms in your mind, the loveliness that drapes your purest thoughts. For out of them will grow all delightful conditions, all heavenly environment; of these, if you but remain true to them, your world will at last be built.” \r\n- James Allen\r\n\r\n","options":[{"id":41713707,"name":"Default","price":2200.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123044193/-/2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123044193/-/2.jpg","width":700,"height":700}],"artists":[],"categories":[{"id":4126410,"name":"ThoughtScapes","permalink":"thoughtscapes","url":"/category/thoughtscapes"},{"id":4126413,"name":"CloudScapes","permalink":"cloudscapes","url":"/category/cloudscapes"},{"id":4778383,"name":"NightScapes","permalink":"nightscapes","url":"/category/nightscapes"}]}]