[{"id":9379604,"name":"Large Custom Rainbow Dragon","permalink":"large-custom-rainbow-dragon","position":1,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/large-custom-rainbow-dragon","status":"active","on_sale":false,"created_at":"2013-02-08T05:11:15.000Z","description":"Up until 150 years ago,  there were eye witness accounts of flocks of small rainbow colored dragons that would fly out of the forest in the evening in England. Dragon is 23\" long from head to tail, made of super-soft hand dyed cotton sherpa, stuffed with wool, appliqued with hand dyed wool felt spots, with an embroidered face. His wings, horns and ears are also wool felt and are sewn on by hand with thick embroidery floss. You may choose the colors and hues of this dragon to make him one of a kind and he is sure to be a favorite for years to come. ","options":[{"id":29340875,"name":"Default","price":60.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.0,"amount_with_others":2.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/92162798/-/MVC-020S__1_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/92162798/-/MVC-020S__1_.JPG","width":200,"height":147}],"artists":[],"categories":[{"id":3473371,"name":"Animals","permalink":"animals","url":"/category/animals"}]},{"id":9379319,"name":"21\" Custom Waldorf Doll","permalink":"21-custom-waldorf-doll","position":2,"price":150.0,"default_price":150.0,"tax":0.0,"url":"/product/21-custom-waldorf-doll","status":"active","on_sale":false,"created_at":"2013-02-08T04:43:23.000Z","description":"21\" custom Waldorf style doll - your choices of details. You may choose baby doll style, or child style doll.  Classic one piece rag doll type body or Button Jointed, or Hybrid, which is a classic body with button jointed arms. Dolls are made with organic 100% cotton doll skin knit in your choice of skin tone, firmly stuffed with wool and a lavender sachet tucked into the chest. The baby doll  has a crocheted wig in boucle' (curly) or straight mohair (whispy), or sweet little baby pigtails. For the girl dolls choose shoulder length or longer hair, fixed pigtails or ponytails or a short layered style in mohair yarn - straight or boucle' (curly), or chunkier wool/mohair.  I also do mixed yarn hair in various colors, weights, textures and hues. For boy dolls choose my spiky hair, a longer layered wig or a loose curly style. The features are hand embroidered and you may choose round eyes or my special eye shape. Noses are optional. Comes with one outfit - your choice of colors. The girls come with a hand dyed cotton velour dress and leggins or a cotton print dress and long bloomers or a hand dyed broomstick pleated dress and bloomers. The boys come with a t-shirt and khakis or jeans and long gnome hat or a hand dyed cotton velour sweatsuit. The babies come with a cotton velour  gown, baby sac,  romper or dress hooded or with a long pointy hat and tie on diaper.   Weighting in either sand or organic millet is another option. (Weighting works best with Classic body)  How about freckles?  Please e-mail me if I can answer any questions. ","options":[{"id":29339963,"name":"Default","price":150.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.95,"amount_with_others":2.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":15.0,"amount_with_others":2.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/92161142/-/MVC-324F.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/92161142/-/MVC-324F.JPG","width":640,"height":480}],"artists":[],"categories":[{"id":3473365,"name":"Custom Waldorf Doll","permalink":"custom-waldorf-doll","url":"/category/custom-waldorf-doll"}]},{"id":6739047,"name":"16\" Custom Waldorf Doll","permalink":"16-custom-waldorf-doll","position":3,"price":120.0,"default_price":120.0,"tax":0.0,"url":"/product/16-custom-waldorf-doll","status":"active","on_sale":false,"created_at":"2012-07-19T07:55:53.000Z","description":" 16\" custom Waldorf doll - you choose details! You may choose a baby doll or a child style doll in Classic one piece rag doll type body or Button Jointed, or Hybrid, which is a classic body with button jointed arms. Dolls are made with 100% organic cotton doll skin knit in your choice of skin tone, firmly stuffed with wool and a lavender sachet tucked into the chest. The baby doll  has a crocheted wig in boucle' (curly) or straight mohair (whispy), or sweet little baby pigtails. For the girl dolls choose shoulder length or longer hair, fixed pigtails or ponytails or a short layered style in mohair yarn - straight or boucle' (curly), or chunkier wool/mohair. I alos do mixed yarn hair in various colors, textures, weights and hues. For boy dolls choose my spiky hair or a loose curly style. The features are hand embroidered and you may choose round eyes or my special eye shape. Noses are optional. Comes with one outfit - your choice of colors. The girls come with a hand dyed cotton velour dress and leggins or a cotton print dress and long bloomers or a hand dyed broomstick pleated dress and bloomers. The boys come with a t-shirt and khakis or jeans or a hand dyed cotton velour sweatsuit. The babies come with a cotton velour  gown, baby sac,  romper or dress hooded or with a long pointy hat and tie on diaper. Now available - hand knit wool longies and a cotton velour kimono top. Weighting with sand or organic millet is another option. Weighting works best with Classic body.  How about freckles?  If you would like to see more pictures of my work, please visit my main cart at http://hyenacart.com/hillcountrydollmaker or my Etsy store  http://www.etsy.com/shop/HillcountryDollmaker  Please e-mail me if I can answer any questions. ","options":[{"id":21415517,"name":"Default","price":120.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.95,"amount_with_others":2.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":12.5,"amount_with_others":2.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/66162061/-/IMG_0931__2_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/66162061/-/IMG_0931__2_.JPG","width":654,"height":718}],"artists":[],"categories":[{"id":3473365,"name":"Custom Waldorf Doll","permalink":"custom-waldorf-doll","url":"/category/custom-waldorf-doll"}]}]