[{"id":7590477,"name":"KAFKA \"TRUe WOMAN\"","permalink":"kafka-true-woman","position":1,"price":79.0,"default_price":79.0,"tax":0.0,"url":"/product/kafka-true-woman","status":"active","on_sale":false,"created_at":"2012-10-18T19:43:17.000Z","description":"A fragrance full of life, discreet, light yet very sustainable. A triumphant fragrance experience classy and sensuality!\r\nFrom the first moment extraordinary and compelling. Is not it exactly what expects a \"true woman\" of a particular perfume? To describe the understated, yet very lasting fragrance is not easy, but it involves a whole lifestyle. A touch of white orange blossom, rose, mandarin, ylang-ylang, in conjunction with a refined composition of amber musk, orchid and iris resulting in a triumphant fragrance!\r\n\r\nEin Duft voll Lebensstil, dezent, leicht und zugleich sehr nachhaltig. Ein triumphales Dufterlebnis voll klassischer Sinnlichkeit!\r\nVom ersten Augenblick außergewöhnlich und überzeugend. Ist es nicht genau das, was eine „wahre Frau“ von einem besonderen Parfum erwartet? Den dezenten und zugleich sehr nachhaltigen Duft zu beschreiben fällt nicht leicht, beinhaltet er doch einen ganzen Lebensstil. Ein Hauch von weißer Orangenblüte, Rose, Mandarine, Ylang-Ylan in Verbindung mit einer raffinierten Moschuskomposition von Amber, Orchidee und Iris resultieren in einem triumphalen Dufterlebnis!\r\n\r\n","options":[{"id":23971523,"name":"Default","price":79.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/74504817/-/Kafka_mit_Schachtel_Kopie.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/74504817/-/Kafka_mit_Schachtel_Kopie.jpg","width":533,"height":1000}],"artists":[],"categories":[{"id":3839835,"name":"fragrance","permalink":"fragrance","url":"/category/fragrance"},{"id":3839837,"name":"perfume","permalink":"perfume","url":"/category/perfume"},{"id":3839839,"name":"must have","permalink":"must-have","url":"/category/must-have"},{"id":3839841,"name":"luxury","permalink":"luxury","url":"/category/luxury"}]},{"id":7590143,"name":"KAFKA FOR MEN, INTENSE","permalink":"kafka-for-men-intense","position":2,"price":79.0,"default_price":79.0,"tax":0.0,"url":"/product/kafka-for-men-intense","status":"active","on_sale":false,"created_at":"2012-10-18T19:01:09.000Z","description":"The scents KAFKA FOR MEN is the essence of haute couture perfume line. The fragrance is wild masculinity, heroic habit and current style dynamically to the fore. The new line of fragrances KAFKA FOR MEN is an expressive and masculine charm with an infinite elegance, while indulging themselves true luxury. The new fragrance expresses determined from a relaxed and timeless elegance of haute couture KAFKA FOR MEN perfume line, which presents a stylish and modern in a simple but elegant glass bottle. Built in one of the most renowned glass manufacturer in the world.\r\n\r\n\r\nDie Düfte KAFKA FOR MEN ist die Quintessenz der Haute Couture Parfum Linie. Das Parfum stellt wilde Männlichkeit, heroischen Habitus und aktuellen Stil dynamisch in den Vordergrund. Die neue Parfumlinie KAFKA FOR MEN ist ein ausdrucksvoller und maskuliner Zauber mit einer unendlichen Eleganz, dabei sich wahrem Luxus hingebend. Der neue Duft drückt entschlossen eine relaxte und zeitlose Eleganz der KAFKA FOR MEN Haut Couture Parfum Linie aus, der sich stilvoll und modern in einem schlichten, aber edlen Glasflakon präsentiert. Gefertigt in einer der renommiertesten Glasmanufaktur der Welt.  \r\n  \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","options":[{"id":23970769,"name":"Default","price":79.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/74500553/-/Kafka_for_Men_oben_small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/74500553/-/Kafka_for_Men_oben_small.jpg","width":742,"height":827}],"artists":[],"categories":[]}]