[{"id":3624714,"name":"Conan O'Brien Amigurumi Pattern ","permalink":"conan-o-brien-amigurumi-pattern","position":1,"price":6.2,"default_price":6.2,"tax":0.0,"url":"/product/conan-o-brien-amigurumi-pattern","status":"active","on_sale":false,"created_at":"2011-04-20T02:00:16.000Z","description":"Oh, Conan. We've laughed, we've cried, we've cheered you on and cheered you off. Where would we be without the Walker Texas Ranger Lever, PimpBot 5000, or of course Triumph the Insult Comic Dog?? Conan, you were robbed!\r\n\r\nThe true king of late night will be moving on to greener pastures (we'll be watching!) but for now this little guy will have to do. He's tall, pale, and red-headed just like Conan. You'll crochet him with simple stitches and easy to find materials, all detailed in this pattern which will be emailed to you as a PDF. He's even got a removable beard, for those times when he's on strike or off air! Conan's jacket is removable too; dress him up or dress him down. Finished he'll stand almost 15\" tall. Big guy!\r\n\r\nLet me know if you have any questions about this guy or any of my patterns. I have taken great pains to make the characters lifelike and stylized but all somewhat different from the exact characters in the book, movie, tv show etc that inspired them. Feel free to make color changes to suit your own tastes! As always, please do not sell finished products. Make as many as you want for gifts or yourself, but the pattern may not be passed around! Don't resell the items you make from this pattern. Please see my shop policies for more information on this. Thanks!\r\n\r\n\"...if you work really hard and you're kind, amazing things will happen.\"\r\n","options":[{"id":12114228,"name":"Default","price":6.2,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35242284/-/conanclosebeard.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35242284/-/conanclosebeard.jpg","width":532,"height":800}],"artists":[],"categories":[{"id":2044298,"name":"Pattern","permalink":"pattern","url":"/category/pattern"}]},{"id":3624698,"name":"Pee-wee Herman with Chairry and Jambi Amigurumi Patterns ","permalink":"pee-wee-herman-with-chairry-and-jambi-amigurumi-patterns","position":2,"price":6.2,"default_price":6.2,"tax":0.0,"url":"/product/pee-wee-herman-with-chairry-and-jambi-amigurumi-patterns","status":"active","on_sale":false,"created_at":"2011-04-20T01:55:57.000Z","description":"Playhouse buddies, Pee-Wee, Jambi and Chairry! Recreate your favorite Playhouse moments! They're soft and squishy and fun to play with. Maybe you can take them to Broadway, or set up your own stage show at home! \r\n\r\nYou'll love making these toys! Pee-wee even comes with a removable jacket with real working buttons. All the techniques are detailed in the pattern instructions with plenty of photos to help you along.\r\n\r\n\r\nLet me know if you have any questions about this or any of my patterns. I have taken great pains to make the characters lifelike and stylized but all somewhat different from the exact characters in the book, movie, tv show etc that inspired them. Feel free to make color changes to suit your own tastes! As always, please do not sell finished products. Make as many as you want for gifts or yourself, but the pattern may not be passed around! Don't resell the items you make from this pattern. Please see my shop policies for more information on this. Thanks!\r\n\r\n","options":[{"id":12114192,"name":"Default","price":6.2,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35242198/-/playhousecollage.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35242198/-/playhousecollage.jpg","width":557,"height":608}],"artists":[],"categories":[{"id":2044300,"name":"Pattern Set","permalink":"pattern-set","url":"/category/pattern-set"}]}]