[{"id":3766482,"name":"Michael Nona 'Waii'","permalink":"michael-nona-waii","position":1,"price":195.0,"default_price":195.0,"tax":0.0,"url":"/product/michael-nona-waii","status":"active","on_sale":false,"created_at":"2011-05-17T17:05:52.000Z","description":"\r\n\r\nWork on paper; relief print\r\n\r\nPaper Size: 560mm x 380mm\r\n\r\nImage Size: 305mm x 200mm\r\n\r\nEdition: 30\r\n\r\nStory: Waii is one of Badu Island's greatest and most feared warriors.Fighting side by side with his brother, Sorbai through countless battles and one of his most greatest battles was up against Tudu's greatest warrior, Kaigus. The skulls that Waii is holding represent his heritage of a lifetime of battle and war.\r\n\r\nArtist: I went to high school on Thursday Island and studied art there. We studied lino printing, drawing and painting. I really like working with lino because it's more than just drawing and painting, you have to carve the lines and then print the design. I come from a long time of artists - Dennis, Harry and Laurie Nona are all related to me. I decided to be an artist before the art centre happened. I went to Cairns after high school and studied art at TAFE but I really wanted to come back to my island and work up here. Being able to do the TAFE art course here on Badu meant I could study and learn without having to leave my family. The art centre gives me an opportunity to follow my dreams but to still live the island lifestyle of hunting and fishing.\r\n","options":[{"id":12605980,"name":"Default","price":195.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.5,"amount_with_others":6.25,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36690676/-/michael-nona-waii.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36690676/-/michael-nona-waii.JPG","width":480,"height":331}],"artists":[],"categories":[{"id":2108922,"name":"Works on Paper","permalink":"works-on-paper","url":"/category/works-on-paper"}]},{"id":3766468,"name":"Aiona Gaidan 'Zagul Dhangal'","permalink":"aiona-gaidan-zagul-dhangal","position":2,"price":155.0,"default_price":155.0,"tax":0.0,"url":"/product/aiona-gaidan-zagul-dhangal","status":"active","on_sale":false,"created_at":"2011-05-17T17:04:02.000Z","description":"\r\n\r\nWork on paper; etching\r\n\r\ncopper plate; blue on white\r\n\r\nPaper Size: 380mm x 280mm\r\n\r\nImage Size: 195mm x 150mm\r\n\r\nEdition:10\r\n\r\nStory: to come\r\n\r\nArtist: I have been drawing since primary school on Badu and then when I went to Abergawrie College in Ingham where I studied more drawing techniques. It was not until TAFE ran a course on Badu that I got to start lino printing. I like lino because I can draw directly onto the lino and then use carving tools to create the blocks. My Dad and my Grandfather were both boat builders and our family has a tradition of wood working so that's why I really enjoy using the carving tools. My brother is an artist too, so it's great that we can share that. My culture makes me what I am, I cannot separate myself from my culture which is why I use it for inspiration for my artworks.\r\n","options":[{"id":12605950,"name":"Default","price":155.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":12.5,"amount_with_others":6.25,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36690604/-/Aiona-Gaidan-Zagul-Dhangal.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36690604/-/Aiona-Gaidan-Zagul-Dhangal.JPG","width":353,"height":480}],"artists":[],"categories":[{"id":2108922,"name":"Works on Paper","permalink":"works-on-paper","url":"/category/works-on-paper"}]},{"id":3766450,"name":"Laurie Nona 'Kirisgamul Mut' (Sunbird)","permalink":"laurie-nona-kirisgamul-mut-sunbird","position":3,"price":1090.0,"default_price":1090.0,"tax":0.0,"url":"/product/laurie-nona-kirisgamul-mut-sunbird","status":"active","on_sale":false,"created_at":"2011-05-17T16:59:15.000Z","description":"Work on paper; relief print with hand coloured background\r\n\r\nPaper Size: 1120mm x 760mm\r\n\r\nImage Size: 790mm x 570mm\r\n\r\nEdition: 25\r\n\r\nStory:\r\n\r\nIn this image I show flowers from my mum’s garden around my home - padau muthd (house on the hill) – here on Badu Island, where I grew up and still live today.\r\n\r\nAs one of my many after school and weekend jobs, I would water my mum’s garden of hibiscus and frangipani flowers. Whilst watering the plants, I would get visited by this kirisgamul mut (little yellow chested sunbird).\r\n\r\nThis little visitor seemed to me a very free, friendly, joyful and happy singing little bird. The designs within the bird image represent its flight from flower to flower in search of sweet nectar and insects for its young.\r\n\r\nI would watch the kirisgamul mut fly from flower to flower, listening, licking its beak and manoeuvring in ways that would have me stunned by its ability to defy laws of gravity. Even today, I still see the what could be the same kirisgamul mut repeating its daily flight plan around my mum’s garden.\r\n\r\nFrom this bird I learnt that if he or she could live life freely, friendly, joyfully and happily, I could too!\r\n\r\nI now believe we all can thanks to the kirisgamul mut.\r\n\r\nLaurie Nona 2011\r\n\r\n\r\nArtist:\r\nMy Artwork is based on my life's experiences mainly to tell my children and my grandchildren about how I grew up, who I am and what they could learn from my life. Today you have to set your compass towards your destination, believing and trusting your values and beliefs to guide you in reaching the destination you want in your life. I would like to see our future young people learn that as long as the Warup (drum) is beating, our culture is still alive. In everything, do unto others as you would have them do unto you. It is up to us to make sure our cultural, family and religious values are maintained, respected and handed down to future generations. As we live in a multicultural society, may our diverse lifestyles be rewarding experiences in reaching others through the acceptance and appreciation of our many differences.","options":[{"id":12605920,"name":"Default","price":1090.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":25.0,"amount_with_others":12.5,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36690916/-/Laurie-Nona-11_01-Kirisgamul-Mut.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36690916/-/Laurie-Nona-11_01-Kirisgamul-Mut.JPG","width":314,"height":480}],"artists":[],"categories":[{"id":2108922,"name":"Works on Paper","permalink":"works-on-paper","url":"/category/works-on-paper"}]},{"id":3766410,"name":"Gehmat Nona 'Zurathau Dogai'","permalink":"gehmat-nona-zurathau-dogai","position":4,"price":500.0,"default_price":500.0,"tax":0.0,"url":"/product/gehmat-nona-zurathau-dogai","status":"active","on_sale":false,"created_at":"2011-05-17T16:52:28.000Z","description":"Work on paper; relief print\r\n\r\nPaper Size: 765mm x 580mm\r\n\r\nImage Size: 620mm x 420mm\r\n\r\nEdition: 40\r\n\r\nStory: \r\nThis art work is based on a story from Badu Island. It’s about a dogai (witch), a boy and village people. One day a boy named Gabu Kaikai paddled his canoe across from Math Island to Zurath Island when he got to the beach at Zurath Island right away he saw a big fruit tree called haubau. The haubau was very big and juicy but he didn’t have anything to put it in. So he paddled back to Math Island to pick up his basket. The very next morning Gaby Kaikai paddled back to Zurath to collect the juicy haubau. When he got there he picked up the juicy haubau off the ground until there was nothing left on the ground. So he climbed the tree and started picking the haubaus in the tree then suddenly the owner of the dogai crawled out of her cave and saw that there was no juicy haubau laying on the ground.\r\n\r\nBut she saw some foot prints so she followed the foot prints that headed straight to the tree then a haubau fell right in front of here she looked up and saw Gabu Kaikai and said to him “You stole all my juicy haubau, throw me down one haubau!”.\r\n\r\nGabu Kaikai threw one haubau down to the ground and the dogai took one step to pick up the haubau then proceeded to eat it. Gabu Kaikai thought he could drive her away by throwing haubau. So he threw the second haubau and the dogai took another step and ate the haubau. Gabu Kaikai threw the third and last haubau as far as he could the dogai ran to pick up the haubau. Gabu Kaikai quickly jumped down and ran to his canoe and heard the dogai running behind him as he paddled as fast as he could. The dogai swam behind him but couldn’t get him. Gabu kakai got back to the village at Math and told the villagers that there was a dogai at Zurath island. The next day the villagers prepared harpoons and arrows and they paddled across to Zurath Island. When the villagers arrived there they went to the cave and chased the dogai out one off the villagers shot the dogai with a harpoon which chopped off her arm and breast. The dogai ran down to the beach and buried herself under the ground. The villagers paddled happily back to the village at Math island and on their way they threw the breast into the sea for sharks. But the boy wanted to tie the arm on a tree for target practice. That night the dogai came for her arm. She sang a song which made her arm come flying back to her and it made a very big noise as it got back into place the villagers woke up and chased her away. She took off without her breast.\r\n\r\nStill today at Zurath Island the basket of Gabu Kaikai lies and the cave of the dogai the breast formed into two big stones shaped like the dogai’s breast between Math and Zurath which we call “Dogai Susu”.\r\n\r\nGehmat Nona 2011\r\n\r\nArtist: \r\nI grew up on Badu Island and used to watch my mother draw different tropical designs like local flowers and then turn these into paintings. I used to carve pearl shell and make necklaces for fun. I was influenced to focus on my art by my uncles, Dennis and George Nona. I used to see Uncle Dennis cutting lino on Badu Island. His work was detailed and looked like it took a long time. I was an apprentice painter and also worked rendering buildings wherever the work took me in North Queensland including Cape York and the Torres Straits. I studied art on Thursday Island at TAFE and learnt all different mediums including pencil sketching, water colour painting, screen printing and lino printing. My work is based on my totems and I try to be a bit different from everyone else. A lot of our traditional stories have been told through lino prints and I'd like to one day do different things with the stories, re-telling them with my own visual interpretation.\r\n","options":[{"id":12605842,"name":"Default","price":500.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":25.0,"amount_with_others":12.5,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36690244/-/Gehmat-Nona-Zurathau-Dogai.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36690244/-/Gehmat-Nona-Zurathau-Dogai.jpg","width":326,"height":480}],"artists":[],"categories":[{"id":2108922,"name":"Works on Paper","permalink":"works-on-paper","url":"/category/works-on-paper"}]},{"id":3766398,"name":"Zacharia Gaidan  'Zurrumui Zurrumuil Kurrsan Yalpaik'","permalink":"zacharia-gaidan-zurrumui-zurrumuil-kurrsan-yalpaik","position":5,"price":690.0,"default_price":690.0,"tax":0.0,"url":"/product/zacharia-gaidan-zurrumui-zurrumuil-kurrsan-yalpaik","status":"active","on_sale":false,"created_at":"2011-05-17T16:50:13.000Z","description":"\r\n\r\nWork on paper; relief print\r\n\r\nPaper Size: 850mm x 770mm\r\n\r\nImage Size: 665mm x 610mm\r\n\r\nEdition: 20\r\n\r\nStory:\r\n\r\nThis print is about my life experience. It starts when I go diving for kaiyar (crayfish). This is my favourite part of my traditional culture.\r\n\r\nMy design represents the sea itself - the water and tide.\r\n\r\nThe fish that are swimming in the tide and going with the tide are called zurrumui zurrumuil (school of yellow tail trevally) and are the best tucker of all. Kurrs (hammerhead shark) swim around as the guff (suckerfish) follow.\r\n\r\nThe moment I dive it is dangerous and I am risking my life, but it is the way I learn how to live and survive. It is my culture. My ancestors say that when you come across zurrumui zurrumuil it is a sign that there is something big approaching.\r\n\r\nThis knowledge has been passed down to me from my ancestors and I will continue the culture and pass it down to my future generations.\r\n\r\nZacharia Gaidan 2011\r\n\r\nArtist:\r\n\r\nI went to high school in Cairns, Emmanuelle College and studied art in Years 8 and 9. After that I went to Shalom College in Townsville and did some large-scale drawings. I have always been drawing at home, mainly sea creatures from the Torres Strait.\r\n\r\nI use the drawings of these sea creatures in my lino designs. Every time I go out in my dinghy I see these creatures: they are beautiful, swimming around in the sea.\r\n\r\nI would really like to make a successful career out of being an artist, maybe make enough money to buy a house down south, and a car. I would also like to have the respect that goes with being successful, meeting lots of different people from the art world.\r\n\r\nThe art centre on Badu will give me an opportunity to realise these dreams, at the moment it’s running really well, but I am looking forward to our new building and a bigger press so I can make big prints like the ones Denis Nona and Alick Tipoti have done.\r\n\r\nI also like to do woodcarving and screen-printing. I have many designs in my head, I don’t need to look at other people’s work to get ideas but I like working at the art centre, I enjoy teaching the other students how to use the press and how to print properly.\r\n","options":[{"id":12605830,"name":"Default","price":690.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":25.0,"amount_with_others":12.5,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36690108/-/Zac_zurrmuil_zurrmuil_kurrsan_yulpaik__12816_zoom.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36690108/-/Zac_zurrmuil_zurrmuil_kurrsan_yulpaik__12816_zoom.JPG","width":480,"height":441}],"artists":[],"categories":[{"id":2108922,"name":"Works on Paper","permalink":"works-on-paper","url":"/category/works-on-paper"}]}]