[{"id":4603835,"name":"Agents Of Woe - Get Illiterate 12\" Vinyl","permalink":"agents-of-woe-get-illiterate-12-vinyl","position":1,"price":14.0,"default_price":14.0,"tax":0.0,"url":"/product/agents-of-woe-get-illiterate-12-vinyl","status":"active","on_sale":false,"created_at":"2011-10-10T20:32:31.000Z","description":"*Price includes Domestic Shipping via USPS\r\n\r\nFrom the depths of the Mississippi now transmitting from Brooklyn, Agents Of Woe are making their presence felt with Get Illiterate (BLNK-23), the sophomore effort from the reconstituted duo. Agents’ approach to music is rooted in southern tradition, inspired by the blues and soul, but also half a century of electronic music. As awesome as it reads, it sounds even better. A trip to another place on two sides of vinyl, this record is capable of taking you places your Smartphone and GPS simply cannot.\r\n\r\nThe title track Get Illiterate (ahem, literally) connects the dots between Memphis’ antiquity and New York City’s modernity, making a great dancefloor sing along. Remixes of other AOW songs allow Scott Ferguson (London, Ferrispark), Kevin Reynolds (Detroit, Todchai) and Blank Artists’ founder Josh Dahlberg to offer further interpretation of their sound. The diverse group offers a range of explication, evoking scenes ranging from the muddy waters of the delta to the bustle of city life, and the dark recesses of both. But don’t go looking for it on foursquare, it’s a place one may only check-in to by putting the needle on the record.\r\n\r\nA1 Get Illiterate\r\nA2 R U Ready For Love? (Scott Ferguson Remix)\r\nB1 Take It Out (Kevin Reynolds Remix)\r\nB2 Take It Out (Josh Dahlberg Remix)","options":[{"id":15071473,"name":"Default","price":14.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":11.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/45094293/-/BLNK-23_a_side350.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/45094293/-/BLNK-23_a_side350.jpg","width":350,"height":350}],"artists":[{"id":21421,"name":"Josh Dahlberg","permalink":"josh-dahlberg","url":"/artist/josh-dahlberg"},{"id":86053,"name":"Agents Of Woe","permalink":"agents-of-woe","url":"/artist/agents-of-woe"}],"categories":[{"id":718431,"name":"Records","permalink":"records","url":"/category/records"}]},{"id":3840934,"name":"Josh Dahlberg - Natura Futura 12\"","permalink":"josh-dahlberg-natura-futura-12","position":2,"price":14.0,"default_price":14.0,"tax":0.0,"url":"/product/josh-dahlberg-natura-futura-12","status":"active","on_sale":false,"created_at":"2011-05-31T15:55:46.000Z","description":"*Price includes Domestic Shipping via USPS\r\n\r\nIt has been the better part of two years since Josh Dahlberg’s music last saw release. In that time Josh has familiarized himself more with both sides of the bar, consequently giving rise to many terrible ideas but a few good ones too. We’re sure you’ll agree, Natura Futura (BLNK-21) is one of the better ideas on which action was taken.\r\n\r\nSurfacing from a desire to collaborate – and reinforced by longtime influence and one time mentor Underground Resistance, Dahlberg enlists the help of other Detroit musicians to complete the songs on his new 12”. Throughout the three original cuts Rob “Downy” Wilson of The Summer Pledge handles the drum kit and Bassist Tim “T Bottoms” Shellabarger of Detroit funk staple Will Sessions provides additional groove support on I C It. Planet E’s Monty Luke and electro demigods Ectomorph turn out expertly crafted mixes of I C It creating a b-side built for vaporous nights.\r\n\r\nRecorded by Andy Toth who is quickly becoming one of Detroit’s most sought after engineers, the EP commands attention without demanding it, which only demonstrates the level of discipline and resolve that are brought to bear for our enjoyment.\r\n\r\nA1 Prophecy Unknown\r\nA2 I C It\r\nA3 Red Summer White Winter\r\nB1 I C It (Monty Luke’s Black Catalogue Mix)\r\nB2 I C It (Ectomorph’s Cassandra Complex)","options":[{"id":12821740,"name":"Default","price":14.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/37449706/-/BLNK-21_web.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/37449706/-/BLNK-21_web.jpg","width":300,"height":300}],"artists":[{"id":21421,"name":"Josh Dahlberg","permalink":"josh-dahlberg","url":"/artist/josh-dahlberg"}],"categories":[{"id":718431,"name":"Records","permalink":"records","url":"/category/records"}]},{"id":3669524,"name":"The Siege - Randall Flurgenbach's Stange Space Chalet 12\"","permalink":"new-the-siege-randall-flurgenbach-s-stange-space-chalet-12","position":3,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/new-the-siege-randall-flurgenbach-s-stange-space-chalet-12","status":"active","on_sale":false,"created_at":"2011-04-28T17:17:47.000Z","description":"*Price includes Domestic Shipping via USPS\r\n\r\nAnd now… for our next release, Randall Flurgenbach’s Strange Space Chalet, appropriately named for the magical recording of wonderment that it is. Randall, a figment of partial imagination and part corporeal madness has, on occasion, brought to fruition unreal and often painful manifestations. But one of many recurring incarnations from the bizarre minds of brothers Drew Pompa and Pipé Scuttleworth, Randall’s vital essences seep from every rich tone of The Seige’s first EP, an album arising from the depths of their dark and compelling collective consciousness.\r\n\r\n* Sealed, Hand Numbered, Full Color Jackets, Stuffed with Handmade Art by The Siege\r\n\r\nTracklist:\r\nA1) Beyond Death is the Vast Ocean of Nothingness\r\nA2) Sunrise (Gates of Hades Remix)\r\nB1) Politicizing the Plight of the People\r\nB2) AV is Set, All Systems Online","options":[{"id":12296728,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35691384/-/BLNK-20_components.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35691384/-/BLNK-20_components.jpg","width":659,"height":494}],"artists":[{"id":62408,"name":"The Siege","permalink":"the-siege","url":"/artist/the-siege"}],"categories":[{"id":718431,"name":"Records","permalink":"records","url":"/category/records"}]},{"id":3314309,"name":"Codine - CIrcadian Rhythms (Selections) 12\"","permalink":"codine-circadian-rhythms-selections-12","position":4,"price":14.0,"default_price":14.0,"tax":0.0,"url":"/product/codine-circadian-rhythms-selections-12","status":"active","on_sale":false,"created_at":"2011-02-20T23:07:59.000Z","description":"*Price includes Domestic Shipping via USPS\r\n\r\nLazy, phased acid waves ebb and flow as if possibilities smashing and retracting, cleaving into countless additional new forms; a continuous cycle of life. Effective simplicity harkens back to earlier times, days when Detroitʼs streets bubbled with timbres of frenetically bowed strings, assembly lines, and the stamping, metallic thud of machines now rusted into oblivion.\r\n \r\nFor the young ones, just shy of the now crested watermark of the second rising, fret not the missed opportunities. Codineʼs handsomely crafted full length, Circadian Rhythms (BLNK-19) is as close an approximation to the Autumnal night party rituals of late 90's Detroit as you have a probability of uncovering. One can almost hear the tired, hissing bass still struggling to punch through the damp walls of Motor where a young Derek Plaslaiko held court.\r\n \r\nHaving earned favor from Laurent Garnier and Matthew Dear, Circadian Rhythms embodies the spirit of old times, the filthy spaces, the charlatans and true magicians, the wilderness of it all. ","options":[{"id":11243251,"name":"Default","price":14.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/32167461/-/blnk_19_record_image.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/32167461/-/blnk_19_record_image.jpg","width":400,"height":400}],"artists":[{"id":52929,"name":"Codine","permalink":"codine","url":"/artist/codine"}],"categories":[{"id":718431,"name":"Records","permalink":"records","url":"/category/records"}]}]