[{"id":13728636,"name":"STABLE DOUBLE C SERUM with royal jelly","permalink":"stable-double-c-serum-with-royal-jelly","position":1,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/stable-double-c-serum-with-royal-jelly","status":"active","on_sale":false,"created_at":"2013-09-23T02:08:54.000Z","description":"STABLE DOUBLE C SERUM with Royal Jelly:\r\n\r\nCollagen building and UV protecting/repairing. Lightening and brightening.\r\n\r\nFor all skin types. To be used first on clean skin in AM under sunscreen.\r\nIf you are allergic to bees do not use this product.\r\n\r\n•This serum is light and slippery and has a cooling sensation on the skin. \r\n\r\n•Using two stable and very effective forms of vitamin C, ASCORBIC ACID 2-GLUCOSIDE and ETHYL ASCORBIC ACID, we are able to achieve better collagen building and skin clarifying/lightening effects than L-ascorbic acid without the low pH (acidic) which is irritating to some. AA2G and EAA are more stable against oxidation than L-ascorbic acid but convert in the skin to L-ascorbic acid. \r\n\r\n•Stable Double C Serum's pH is 5, which is closer to the normal pH of skin and this helps maintain its natural barrier against oxidative stress, rather than impairing it with strong acids.\r\n\r\nhttp://jn.nutrition.org/content/122/4/87 1.full.pdf\r\n\r\nhttp://www.ncbi.nlm.nih.gov/pubmed/11383 624\r\n\r\nhttp://www.ncbi.nlm.nih.gov/pubmed/12977 31 \r\n\r\n•ROYAL JELLY contains B vitamins and promotes collagen production in the presence of AA2G as seen in the following studies:\r\n\r\n\"\" an in vitro study, RJ has promoted the \r\ncollagen production of skin fibroblasts in the \r\npresence of ascorbic acid-2-O-α-glucoside (AA- \r\n2G), the increase of the collagen production being induced by 10-hydroxy-2-decenoic acid \r\n(10H2DA) and 10-hydroxydecanoic acid \r\n(10HDA) in a dose-dependent manner.\" \r\n\r\nfrom: Biological Activities of Royal Jelly - Review \r\nCrenguţa I. Pavel,Liviu Al. Mărghitaş, Otilia Bobiş,Daniel S. Dezmirean, Agripina Şapcaliu, Ion Radoi,Mariana N. Mădaş\r\nPavel C. et. al./Scientific Papers: Animal Science and Biotechnologies, 2011, 44 (2) \r\n\r\n•Also contains VITAMIN E ACETATE, CHIRALLY CORRECT D-PANTHENOL, ALPHA LIPOIC ACID, SILYMARIN, ECTOIN, and FERULIC ACID to help protect against free radical damage and give added UV  protection to the cells of the epidermis.\r\n\r\n•Included is the amino acid L-CARNOSINE to nourish and plump tired skin and give a glow from the first application. It provides anti-glycation benefits.\r\n\r\n•SILYMARIN is an anti-inflammatory and antioxidant; it also effectively protects against and treats sun damage and melasma.\r\n\r\n•ECTOIN protects against UV damage while shielding the active ingredients.\r\nSkin Pharmacol Physiol. 2004 Sep-Oct;17(5):232-7.\r\nEctoin: an effective natural substance to prevent UVA-induced premature photoaging.\r\nBuenger J, Driller H.\r\nSource\r\nhttp://www.ncbi.nlm.nih.gov/pubmed/15452409\r\n\r\nCAUTION: DO a patch test before applying to your face. Apply a small amount of product to the skin behind the knee and observe for any irritation for 48 hours. If you experience irritation do not use on your face. Ingredients are at highest recommended percentages for optimal results. Please see \"About MyFawnie\" section for instructions on how to do the patch test.\r\n\r\nUSAGE: Apply to cleansed skin in the morning and apply your sunscreen over it in the daylight hours.  Store away from heat and light but refrigeration is not required.\r\n\r\nINGREDS: Aqua, ascorbic acid 2-glucoside, ethyl ascorbic acid, alpha lipoic acid, organic pomegranate seed oil, organic cold pressed macadamia oil, royal jelly, ectoin, ferulic acid, trehalose, Hawaiian algae extract, hydroxymethylcellulose, pullulan, sclerotium gum, lecithin, silymarin, L-carnosine, vitamin e acetate, d-panthenol, p-anisic acid, NaOH pH adjuster, bisabolol (natural penetration enhancer), organic wild mint essential oil (natural penetration enhancer.)\r\n\r\n30 ml in an airless pump bottle.\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":47225451,"name":"Stable Double C Oil-Free","price":45.0,"sold_out":false,"has_custom_price":false},{"id":49872714,"name":"h pomegranate and macadamia ois","price":45.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":2.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128149977/-/IMG_0120_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128149977/-/IMG_0120_2.jpg","width":1304,"height":1956}],"artists":[],"categories":[]},{"id":6823337,"name":"Lift & Lighten Eye Serum  ","permalink":"fawnie-firming-and-lightening-eye-serum","position":2,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/fawnie-firming-and-lightening-eye-serum","status":"active","on_sale":false,"created_at":"2012-07-29T20:54:55.000Z","description":"LIFT & LIGHTEN EYE SERUM\r\n\r\nNew larger size, same price.\r\n\r\n•Includes hyaluronic acid crosslinked, ceramides, and jujube extract for increased moisturizing and collagen building.\r\n\r\n•This legendary sunny yellow lotion-serum lifts, brightens. smoothes in lines and sagging tissue, moisturizes and helps build collagen all in one product.  With continued regular use twice a day, pigmentation deposits around the eye area fade, leaving the eyes brighter and younger and more rested looking. \r\n\r\n•Avocado oil contains high amounts of Vitamin A, B1, B2, D, and E and works to smooth the thin skin around the eye.  Avocado extract firms and plumps lines and wrinkles around the eye area.\r\n\r\n•Cucumber seed oil contains 3 main fatty acids, phytosterols, natural tocopherols and minerals. Phytosterols help the skin strengthen its lipid barrier, restoring proper moisture balance, smoothing the skins surface, improving skin elasticity and nourish and stimulate the skin cells to encourage regeneration of healthy skin cells.\r\n\r\n•Chrysin and vitamin K act upon some of the causes of darkening around the eyes. Allergies, food intolerances, lack of sleep and dehydration are other causes worth eliminating. \r\n\r\n•Eyebright and cucumber extracts tone the undereye tissues and help to reduce puffiness. Sleeping on the back, reducing salt intake and doing Tanaka massage can also help.\r\n\r\n•Lecithin and d-panthenol help to rebuild and protect tissues. Lecithin helps with penetration of the active ingredients into the tissues. \r\n\r\n•Contains light refracting spheres to minimize appearance of fine lines.\r\n\r\nINGREDIENTS: Aqua, hyaluronic acid crosslinked, vitamin K , chrysin, pure glacier hydrosol, natural bisabolol, glycerin (vegetable source), ceramides, Zizyphus Jujuba Seed Extract, olive leaf extract, 1-3 beta glucans, Sea L'Silk™, biotin, organic avocado oil, avocado extract, organic cucumber seed oil,  tocopherol, caviar extract, polysaccharides, eyebright extract, d-panthenol, lecithin, chitin, cucumber extract, organic mint essential oil, hydrospheres, PrettyFace® flower essence, phenoxyethanol as preservative.  \r\n\r\nUSAGE:  Do not apply to upper eyelids as it may cause stinging in some people. Apply twice a day by massaging and pressing a very small amount around each eye avoiding the upper eyelid.  Should be used on the undereye and crowsfeet areas, extending to temples and brows.\r\n\r\n•Vitamin K may cause transient stinging sensation, please do a patch test first on another part of the body. Gently pat the serum upward along the bony rim of the eye and brow bone to lift the area.  Use on freshly cleansed and slightly damp skin to seal in moisture then follow with serum or moisturizer of choice and sunscreen daily.\r\n\r\n•As with any product you have never used before, do a patch test before applying to your face and discontinue use if irritation occurs, Please see \"About MyFawnie\" for instructions for patch test.\r\n\r\n20 grams in airless pump bottle. $45\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":43103850,"name":"1 gram sample $5","price":5.0,"sold_out":false,"has_custom_price":true},{"id":48798480,"name":"20 gram bottle $45","price":45.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129433071/-/IMG_0134.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129433071/-/IMG_0134.jpg","width":1536,"height":2048}],"artists":[],"categories":[]},{"id":13463703,"name":"Collagen Colostrum and Vitamin C Cream","permalink":"collagen-colostrum-and-c-cream","position":3,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/collagen-colostrum-and-c-cream","status":"active","on_sale":false,"created_at":"2013-09-09T23:18:08.000Z","description":"NEW!: COLLAGEN COLOSTRUM & VITAMIN C CREAM:\r\n \r\n•For nourishing face, eye area, neck, decolletage, hands and body. Suitable for all skin types, this is the perfect All-in-One Day and Night Cream for moisturizing, promoting elasticity and evening skin tone.\r\n\r\n• ~Does not contain retinol. ~Contains beta carotene, a milder form of vitamin A. \r\n\r\n•Clarifies skin, hydrates, and lessens appearance of large pores. Its immune-boosting effects help to strengthen skin and make it function more like young skin does. Normalizes oil production with continued use.\r\n\r\n•Marine collagen is especially effective for ultra moisturizing of UV-stressed skin and providing nutrients to skin after dermal needling. \r\n\r\n•Colostrum naturally contains many nutrients including Cytokines, amino acids, Epidermal Growth Factors, IGF-I and IGF-II, Transforming Growth Factors and Antioxidants. It gives immediate glow and long-range anti-ageing benefits to the skin.\r\n\r\n•Spirulina contain oligominerals and healing factors.\r\nSpirulina has the following benefits:\r\n Protein \r\n Calcium \r\n Iron \r\n Beta-carotene (vitamin A precursor)\r\n Vitamin E\r\n Potassium \r\n Gamma- linoleic acid\r\n Vitamin B1 \r\n\r\n•Hyaluronic acid, trehalose, urea, glycerin and algin attract and retain moisture within the top layers of the skin and maintain the skin's natural barrier continuously. Even after C3 Cream is washed off, the benefits continue: skin remains hydrated for 24 hours with consistent use.\r\n\r\n•Yeast beta 1,3 glucans help to rebuild healthy cell layers, and reorganize skin elasticity and homogeneity. Within 8 weeks, the skin already appears significantly smoother, firmer and more radiant. \r\n\r\n•Passionfruit seed oil soothes and promotes collagen production of the skin. Passionfruit seed (Maracuja) oil is known for its content of Piceatannol, in addition to containing vitamin C and essential fatty acids. Piceatannol is a potent sirtuin activator (more so than resveratrol).\r\n\r\n•Pomegranate Seed Oil and Extract promote collagen synthesis and regeneration of the epidermis.\r\n  http://www.ncbi.nlm.nih.gov/pubmed/16221534\r\n\r\n•We use a very stable form of vitamin C that tolerates wider pH range than other forms of ascorbic acid, and provides collagen stimulation, UV protection and superior and steady whitening effects without being irritating.\r\n\r\n• An ECOCERT preservative is added for your protection. Refrigeration and keeping the jar out of heat and light will help prolong its freshness and potency. The airless pump jar helps to protect it also.\r\n\r\n•Scented with soothing and refreshing organic lavender mailette and organic French plum oil, this is a rich silky pale blue cream with a lecithin and benehyl base. \r\n\r\n•Contains PrettyFace® flower essence which encourages the soul to contact its true inner luminosity, for it is this soul radiance which is the real component of beauty.\r\n\r\n•Performs best when used on clean barely moist skin to seal in moisture. A small amount goes a long way as its very concentrated and densely nutritious.  Use twice daily: morning and night. May be used instead of/ or in addition to Holy Grail or Blue Heaven.\r\n\r\nIngredients: Aqua, marine collagen, hydrolyzed elastin, colostrum, organic passionfruit oil, organic French Plum oil, organic pomegranate seed oil, organic pomegranate extract, Sea L'Silk™, Hawaiian algae extract, nori, wakame, D-panthenol, spirulina, biotin, yeast 1-3 beta glucans, trehalose, vitamin E acetate,pullulan, ethyl ascorbic acid (vitamin C), glycerin, algin, allantoin, sodium hyaluronate, urea,  serine, PrettyFace® flower essence, sodium. levulinate, sodium anisate (ECOCERT preservatives), organic French lavender oil, organic mint essential oil.\r\n\r\n30g in an airless pump jar/$45\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":43105041,"name":"Default","price":45.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128149710/-/IMG_0117.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128149710/-/IMG_0117.jpg","width":720,"height":1007}],"artists":[],"categories":[]},{"id":6824659,"name":"Blue Heaven ","permalink":"holy-grail-serum","position":4,"price":75.0,"default_price":75.0,"tax":0.0,"url":"/product/holy-grail-serum","status":"active","on_sale":false,"created_at":"2012-07-29T23:59:00.000Z","description":"BLUE HEAVEN \r\n30ml airless pump bottle/$75\r\n \r\n\r\n•For all skin types to repair, clarify and stimulate collagen and hyaluronic acid production within the skin. \r\n\r\n•Especially good for use with dermal needling to supply the skin with the needed nutrients for skin rejuvenation at the cellular level.\r\n\r\n•You will notice that your skin texture is improved with initial use and deeper lines are smoothed after 2 weeks of consistent nightly application. \r\n\r\n•Contains encapsulated RETINOL for night time use.\r\n\r\nUSAGE:\r\nApply on clean skin with gentle massage. May be used after dermarolling.\r\n\r\n•Contains PUERARIA LOBATA ROOT Extract to inhibit advanced glycation end products and protect fibrillin from degradation.\r\n \r\n•Also contains a powerful unique AMINO ACID COMPLEX to re-energize senescent fibroblasts and trigger essential elements to produce collagens and elastin. \r\n\r\n•The blue-green algae SPIRULINA has the following benefits: Protein, Calcium, Iron, Beta-carotene (vitamin A precursor), Vitamin E, Potassium, Gamma- linoleic acid, and Vitamin B1. \r\n\r\n•The triad of N-ACETYL GLUCOSAMINE, NIACINAMIDE and BIOTIN work in synergy with each other to help reduce pigmented areas, reduce signs of wrinkling and help the skin produce its own hyaluronic acid.\r\n\r\n•KINETIN, the first of the cytokines has antioxidant properties and is a major signal peptide growth factor. Kinetin delays the onset of aging characteristics.\r\n\r\n•A very stable and non-irritating encapsulated form of RETINOL is included to affect inhibition of  collagenase expression and collagen synthesis. \r\n\r\n•PASSIONFRUIT SEED (Maracuja) OIL is known for its content of Piceatannol, in addition to containing vitamin C.  Piceatannol is a potent sirtuin activator (more so than resveratrol).\r\n\r\n•POMEGRANATE SEED OIL stimulates keratinocyte proliferation and inhibits MMP-1 production.  http://www.ncbi.nlm.nih.gov/pubmed/16221534\r\n\r\n•Includes ALLANTOIN which, when applied along with dermarolling, helps with deposition of more organized and early tissue.\r\n\r\n•Contains COQ10, a potent and gentle antioxidant.\r\n\r\n•LECITHIN has an affinity for the skin and helps ingredients to penetrate as well as strengthening the barrier of the skin itself.\r\n\r\n•Wild mint extract facilitates penetration of the active ingredients into the deeper skin structures and gives a cooling, refreshing and relaxing sensation.\r\n\r\n•PRETTYFACE® FLOWER ESSENCE encourages the soul to contact its true inner luminosity, for it is this soul radiance which is the real component of beauty.\r\n\r\n•Preserved with phenoxyethanol for your protection. Holy Grail Blue Heaven will remain active for 3 months after opening and must be kept in a cool dark environment.\r\n\r\nIngredients:\r\nAqua, pueraria lobata root extract, Hawaiian algae extract, kinetin, N-acetyl glucosamine, retinol, L-carnosine, niacinamide, biotin, glycerin, proline/copper/lysine complex, ALA, organic French plum oil, saffron, passionfruit (maracuja) oil, pomegranate seed oil,  natural bisabolol, d-panthenol, spirulina, yeast (1,3) beta glucans, lecithin, allantoin, sodium PCA, sclerotium gum, hydroxyethyl cellulose, encapsulated CoQ10, natural preservative, vitamin E acetate, undecylenoyl glycine, organic wild mint essential oil, organic French mailette lavender essential oil, PrettyFace® flower essence.\r\n\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>\r\n\r\n ","options":[{"id":43104489,"name":"Default","price":75.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":2.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128150217/-/IMG_0106.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128150217/-/IMG_0106.jpg","width":1352,"height":2028}],"artists":[],"categories":[]},{"id":13463568,"name":"Holy Grail Ultimate","permalink":"holy-grail","position":5,"price":75.0,"default_price":75.0,"tax":0.0,"url":"/product/holy-grail","status":"active","on_sale":false,"created_at":"2013-09-09T23:13:34.000Z","description":"HOLY GRAIL ULTIMATE SERUM: (original brown serum)\r\n\r\nFOR NIGHT TIME USE ON MATURE SKIN.\r\n30ml/$75\r\n\r\n•Extreme nourishing and renewing serum that helps to build collagen and elastin over time. Imparts overnite smoothing, freshening and plumping.  The color of Holy Grail may vary from time to time depending on the source of the raw natural ingredients. \r\n\r\n•Contains retinol 1%\r\n\r\n•Kinetin, the first of the cytokines has antioxidant properties and is a major signal peptide growth factor. Kinetin delays the onset of aging characteristics.\r\n\r\n•N-acetyl-glucosamine has demonstrated various benefits to the skin, such as enhancing hydration, reducing wrinkles, and accelerating wound healing. The triad of NAG, niacinamide and biotin work in synergy with each other to help reduce pigmented areas, reduce signs of wrinkling and help the skin produce its own hyaluronic acid.\r\n\r\n•Matrixyl 3000 is a matrikine antiwrinkle and procollagen complex that helps to firm the skin with consistent use. Along with dipalmitoyl hydroxyproline it helps to build and protect collagen and elastin in the skin.\r\n\r\n•An essential minerals complex energizes skin, protects proteins from the effects of glycation, boosts other actives and is a free radical scavenger.\r\n\r\n•Organic French Plum Oil infused with saffron threads is a light and sensual aromatic oil that nourishes without being oily or greasy. •Passionfruit seed (Maracuja) oil is known for its content of Piceatannol, besides vitamin C.  Piceatannol is a potent sirtuin activator (more so than resveratrol). \r\n\r\n•L-Carnosine and dipalmitoyl hydroxyproline help to lighten hyperpigmentation as well as promote regeneration of the skin. Dipalmitoyl hydroxyproline is a potent anti-wrinkle ingredient.\r\n\r\n•Yeast 1-3 beta glucans protect the Langerhans cells from the effects of UV radiation and promote healing and immune function of the skin.\r\n\r\n•The cooling sensation of mint also helps the active ingredients to penetrate the skin.\r\n\r\nINGREDIENTS:\r\nAqua, soy isoflavones, silymarin extract, kinetin, N-acetyl glucosamine, retinol, dipalmitoyl hydroxyproline, L-carnosine, niacinamide, biotin, glycerin, organic French plum oil, saffron, passionfruit (maracuja) oil, Matrixyl 3000 ( Pal-GHK and Pal-GQPR), natural bisabolol, d-panthenol, yeast (1,3) beta glucans, lecithin, sclerotium gum, hydroxyethyl cellulose, myrtus communis, idebenone, copper gluconate, zinc gluconate, ascorbyl palmitate, magnesium aspartate, natural preservative, extract of ginger (zingibar officinale rose), tocopherols, organic wild mint essential oil, organic wild frankincense essential oil, organic rosewood oil.\r\n\r\nDIRECTIONS FOR USE:\r\n\r\nApply on *barely damp* clean skin each night, starting with every 3rd night and working up after doing a patch test on the inner forearm for 48 hours. Applying it on barely damp skin helps to seal in moisture and make it spread easier. \r\n\r\nEnjoy a few moments while this serum interacts with your skin, inhaling the relaxing fragrance of frankincense and feeling the cooling mint sensation. This is a very rich serum and a little goes a long way. May be used around eye area if tolerated on the face. Discontinue use if irritation occurs. \r\n\r\nMay be used 20 nights on/10 nights off to maximize the immune-boosting effects of yeast 1-3 beta glucans. Yeast (1-3) beta glucans also reduce the production of free radicals and help with tissue regeneration.\r\n\r\n**Getting to bed before 11 pm ensures that we will reach Stage 4 deep delta sleep by 2 am when most of cell division occurs and growth hormone secretion is at its highest.**\r\n\r\nhttp://www.sleepdex.org/beautysleep.htm \r\n\r\nDisclaimer:\r\nBy clicking to buy this serum you agree to do a patch test for 48 hours and discontinue use if you experience irritation. Please see \"About MyFawnie\" for instructions for patch test.     __________________________________________________________\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":43104777,"name":"Default","price":75.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128150442/-/IMG_0110.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128150442/-/IMG_0110.jpg","width":1365,"height":2048}],"artists":[],"categories":[]},{"id":15242712,"name":"Elixir Serum","permalink":"elixir-serum","position":6,"price":30.0,"default_price":30.0,"tax":0.0,"url":"/product/elixir-serum","status":"active","on_sale":false,"created_at":"2013-12-01T15:19:25.000Z","description":"A luxurious nourishing oil serum for imparting rejuvenating benefits. \r\nSupports skin's barrier function naturally without clogging pores.\r\nAnti-inflammatory and anti-oxidant rich.\r\n\r\n•ECHIUM OIL  is a clear yellow to reddish orange oil, Cold Pressed from the seeds of Echium plantagineum. It is rich in the Essential Fatty Acids (EFA’s) Alpha Linolenic Acid (Omega 3, ALA), Linoleic Acid (Omega 6, LA), and also contains Gamma Linolenic Acid (GLA), Oleic acid \r\n(Omega 9), and Stearidonic Acid (SDA). Echium Oil is unique in that it contains nature’s richest known source of SDA, a form of anti-inflammatory that is excellent in reducing skin inflammation, and helping treat disorders such as eczema, acne and psoriosis. \r\nEchium Oil is a superb ingredient for skincare \r\nformulations and is commonly used in anti-wrinkle \r\nproducts.\r\nhttp://www.osel.co.nz/content/Product_Flyers/Echium.pdf\r\n\r\nUSAGE: \r\n•Applied to barely damp skin it provides hydrating, barrier repair and renewing treatment to all skin, especially mature, dehydrated and stressed.\r\n•Can be used under or over other serums and creams for additional hydrating and smoothing effects.\r\n•Contains no preservatives other than rosemary antioxidant. Please refrigerate after opening and use within 3 months.\r\n\r\nINGREDIENTS:\r\nPure microalgal oil, Echium plantagineum oil, Schizochytrium,\r\ngreen tea extract, natural tocopherols, ascorbyl palmitate, organic sea buckthorn essential oil, organic CO2 expressed rosehip seed oil, organic pomegranate oil, organic cranberry seed oil, organic rose otto attar, organic helichrysum essential oil, organic carrot seed essential oil, organic Zingiber officinale (L.) Rose oil, organic rose geranium essential oil, organic rosewood essential oil, organic rosemary antioxidant, Pretty Face® flower essence, Cymbopogon Martini Oil.\r\n\r\n15 ml cobalt blue dropper bottle/$30\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":49544160,"name":"15 ml bottle $30.00","price":30.0,"sold_out":false,"has_custom_price":false},{"id":50936799,"name":"1 ml bottle $5.00","price":5.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":8.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":20.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128594100/-/anti_aging_skin_oil_picture.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128594100/-/anti_aging_skin_oil_picture.jpg","width":150,"height":150}],"artists":[],"categories":[]},{"id":13463745,"name":"PHOTOSHOP ","permalink":"dmae-collagen-neck-firming-cream","position":7,"price":50.0,"default_price":50.0,"tax":0.0,"url":"/product/dmae-collagen-neck-firming-cream","status":"active","on_sale":false,"created_at":"2013-09-09T23:20:14.000Z","description":"PHOTOSHOP: Collagen Firming and Line-Blurring Cream\r\n30g airless pump jar/$50\r\n\r\n•A lightweight and highly emollient sheer apricot colored and apricot scented cream for mature skin that blurs lines and wrinkles visibly while firming and stimulating it to behave like younger skin. Hydrolyzed collagen, hyaluronic acid, and amino acids contribute to the skin's moisture levels and health.\r\n\r\n•Does not contain retinol.\r\n\r\n•Soft focus spheres fill in tiny lines and blur the edges of wrinkles by refracting light rather than covering up skin like a concealer would do.\r\n\r\n•Colloidal gold gives a glow and refracts light.\r\n\r\n•Dipalmitoyl hydroxyproline tightens and energizes cells to stimulate collagen production.\r\n\r\n•Contains barrier-repairing and protecting ingredients: ceramides, cholesterol, fatty acids and phosphosphingolipids. Improves skin's elasticity and moisture levels.\r\n\r\n•Pomegranate seed oil and extract promote keratinocyte production and inhibit MMP-1 production, promoting regeneration of the dermis and epidermis. http://www.ncbi.nlm.nih.gov/pubmed/16221534\r\n\r\n•To be massaged into the skin in upward and outward strokes for lifting and tightening effects while imparting moisture and suppleness to the tissues. May be used anywhere that special care is needed for lifting, firming and blurring of lines. Play with it! Use it on bare skin, over sunscreen, or over makeup!\r\n\r\n• May be used as a primer for makeup. Allow a few minutes for it to tighten the skin and fill in lines before applying anything over it.\r\n\r\n•May have a slight warming or stinging sensation as it tightens and stimulates the skin. **Exercise caution using it around the eye area ** and flush eyes copiously with clean water if stinging occurs. Discontinue use if irritation occurs.\r\n\r\n•Can also be used on lips for visible and tangible plumping and smoothing.\r\n\r\nINGREDIENTS: Pure glacier water,  Hawaiian algae extract, dipalmitoyl hydroxyproline, organic French plum oil, organic pomegranate seed oil and pomegranate extract, hydrolyzed collagen, biotin, ceramide/cholesterol/phosphosphingolipids, mixed tocopherols, glycine, trehalose, glycerin, proprietary minerals complex, schizandra extract, hyaluronic acid, cellulose spheres, nylon-12, serine, pullulan, oat beta glucans, lecithin, Sea L'Silk™, natural bisabolol, p-anisic acid, colloidal gold, CO2 extracted organic rosehip seed oil, organic rosewood oil.\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":43105176,"name":"10 ml jar/$20","price":20.0,"sold_out":false,"has_custom_price":true},{"id":43553445,"name":"30 ml jar/$50","price":50.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128150565/-/IMG_0119.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128150565/-/IMG_0119.jpg","width":1224,"height":1688}],"artists":[],"categories":[]},{"id":6823361,"name":"KinNiaNag Serum","permalink":"kinnianag-serum","position":8,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/kinnianag-serum","status":"active","on_sale":false,"created_at":"2012-07-29T20:58:43.000Z","description":"KIN-NIA-NAG SERUM:\r\nFor all skin types.\r\n\r\n•This serum is based upon SEA's revolutionary formula for revitalizing the skin.\r\n\r\n•Does not contain retinol. If you need a retinol serum, please order Blue Heaven serum on this website.\r\n\r\n•Kinetin,  Niacinamide, and N-Acetyl-Glucosamine promote collagen production and lighten skin hyperpigmentation in a safe and natural way that is compatible with all skin types including oily, normal, dry and mature. Especially good for blemish prone skin as niacinamide is proven to be healing and blemish-discouraging.\r\n\r\n•Biotin is an essential B vitamin and acts in synergy with niacinamide and N-acetyl glucosamine for skin health.\r\n\r\n•Lightweight gel-cream suitable for day and/or night use. Softens skin perfectly without stickiness and promotes collagen production.  Imparts a cooling sensation. pH 5.5\r\n\r\nINGREDS: Aqua, 0.1% kinetin, niacinamide,  N-acetyl glucosamine, biotin, pure organic passionfruit oil, pure organic French Plum Oil, lecithin, trehalose (non-oily moisture binder), d-panthenol, L-carnosine, natural bisabolol (antioxidant, anti-inflammatory and penetration enhancer), Hawaiian algae extract, sclerotium gum, xanthan, pullulan, vitamin E acetate, natural preservative, organic wild mint essential oil (natural penetration enhancer).\r\n\r\nUSAGE:  Apply to freshly cleansed skin once or twice daily. May be used morning and/or night. This is the little sister to Holy Grail and is more suitable for younger skin than Holy Grail. \r\n\r\nAs with any product you have never used before, do a patch test before applying to your face. Please see \"About MyFawnie\" for instructions for patch test.\r\n\r\n30 ml bottle/$40\r\n\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":43104009,"name":"Default","price":40.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128150664/-/IMG_0109.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128150664/-/IMG_0109.jpg","width":1352,"height":2028}],"artists":[],"categories":[]},{"id":13925310,"name":"CLEAR SKIN TONER","permalink":"clear-skin-toner","position":9,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/clear-skin-toner","status":"active","on_sale":false,"created_at":"2013-10-02T14:01:02.000Z","description":"For all skin types especially blemished and acne prone. \r\n\r\nSalicylic acid at 2% helps with congestion of pores and exfoliation in a gentle way.\r\nAntimicrobial peptide and frankincense extract and manuka honey help to purify skin and prevent outbreaks.\r\nMinimizes oil production but does not strip skin of moisture.\r\npH = 4.1\r\n\r\nINGREDIENTS:\r\nPure distilled water, lactic acid, salicylic acid, frankincense extract, manuka honey, oligopeptide-10, rice bran extract, trehalose, phenoxyethanol, sodium benzoate, TEA (pH adjuster), organic wild mint EO. \r\n\r\nUSAGE:\r\nApply morning and/or evening to clean skin and patch test before using, especially if using retin-a or other retinoids or acids.\r\nWear sunscreen when using acids.\r\n\r\n30 ml airless pump bottle/$40\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":44746098,"name":"Default","price":40.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125223024/-/image_clear_skin.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125223024/-/image_clear_skin.jpeg","width":225,"height":225}],"artists":[],"categories":[]},{"id":13463523,"name":"A.C.E. Oil for Dermarolling","permalink":"a-c-e-oil-for-dermarolling","position":10,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/a-c-e-oil-for-dermarolling","status":"active","on_sale":true,"created_at":"2013-09-09T23:11:19.000Z","description":"A.C.E. OIL FOR DERMAROLLING:\r\n\r\n15ml cobalt blue glass dropper bottle/$20\r\n\r\nContains: \r\n•1.0% Encapsulated Retinol (vitamin A) \r\n\r\n•Tetrahexyldecyl Ascorbate (oil soluble non irritating non-acid vitamin C) \r\n\r\n•Tocopherols alpha, beta, gamma and delta (vitamin E) \r\n\r\n•Passionfruit seed (Maracuja) oil which is known for its content of Piceatannol, essential fatty acids, and vitamin C.  Piceatannol is a potent sirtuin activator (more so than resveratrol).\r\n\r\n•Pomegranate Seed OIl stimulates keratinocytes in the skin.\r\nRosemary Antioxidant to inhibit oxidation of the oils. \r\n\r\nUsage:\r\nAfter dermarolling, apply A.C.E. Oil in the evening for the first 5 days and Stable Double C Serum in the daytime; \r\n\r\nMay also be used to prepare skin for 6 weeks before dermarolling as it contains vitamin C and retinol. May be used all over the body.\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":43104666,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128150781/-/IMG_0112.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128150781/-/IMG_0112.jpg","width":1295,"height":1942}],"artists":[],"categories":[]},{"id":13463637,"name":"UnderWear Serum","permalink":"underwear-serum","position":11,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/underwear-serum","status":"active","on_sale":false,"created_at":"2013-09-09T23:15:46.000Z","description":"UNDERWEAR SERUM\r\n\r\n•For all skin types and shades. Protects skin from oxidative stress under sunscreen.\r\n\r\n•To be used under sunscreen each morning. May also be used at night under Holy Grail or Blue Heaven or KNN for additional skin lightening/clarifying effects. \r\n\r\n•Contains red and brown algae extracts, chlorella and antioxidants in a light tan oil-free serum base to mop up and absorb any UV light that may get thru your sunscreen.\r\n\r\n•Shake well before each use. Keep in dark cool place but does not need refrigeration.\r\n\r\n•Also contains skin lightening/clarifying extracts of bearberry, mulberry, kojic acid, liquorice and burnet. Does not contain hydroquinone.\r\n\r\n\"UV-absorbing substance in the red alga Porphyra yezoensis (Bangiales, Rhodophyta) block thymine photodimer production.\"\r\nMisonou T, Saitoh J, Oshiba S, Tokitomo Y, Maegawa M, Inoue Y, Hori H, Sakurai T.\r\nSource\r\nDepartment of Ecosocial System Engineering, Faculty of Engineering, Yamanashi University, Kofu, Yamanashi 400-8511, Japan, mist@ccn.yamanashi.ac.jp\r\nhttp://www.ncbi.nlm.nih.gov/pubmed/12876656\r\n\r\nINGREDIENTS:\r\nAqua, ferulic acid, chlorella, morus alba root extract, glycyrrhiza glabra root extract, poterium sanguisorba root extract, uva ursi leaf extract, kojic acid, red algae extract, brown algae extract, silymarin, hyaluronic acid, orchid extract (skin soother and barrier repair), emblica (Indian gooseberry) extract, hydroxyethylcellulose, vitamin E acetate, watercress extract, vitamin B3, zinc PCA, natural preservative, Glycerin, lecithin.  \r\n\r\n30 ml airless pump bottle $40\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":43104918,"name":"Default","price":40.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124740912/-/IMG_0108.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124740912/-/IMG_0108.jpg","width":1008,"height":1513}],"artists":[],"categories":[]},{"id":8212941,"name":"Decadently Rich Body Cream;  Geisha Balm; DMAE Body Cream","permalink":"rich-and-decadent-body-cream","position":12,"price":30.0,"default_price":30.0,"tax":0.0,"url":"/product/rich-and-decadent-body-cream","status":"active","on_sale":false,"created_at":"2012-11-26T17:42:18.000Z","description":"DECADENT BODY CREAM:\r\n\r\n4 oz jar $30\r\n\r\n•With natural nourishing and repairing ingredients like allantoin, d-panthenol, vitamin E, trehalose, biotin, glycerin from vegan source and rich oils and butters, this creamy rich soothing body cream leaves skin velvety soft and protected from moisture loss. Consistent use smoothes the rough spots and leaves your skin supple, protected from moisture loss, and comfortable.  \r\n\r\n•Lightly fragranced with pure organic essential oils and extracts. Allow a few relaxing moments before dressing to indulge in the texture and fragrance of this rich body cream; the skin will drink it in and it will leave a buttery feel. Your skin will be plumped and smooth and utterly comfortable. Protects against environmental stressors.\r\n\r\nINGREDIENTS:\r\nPure organic oils of avocado sunflower, chia, and shea butter, cocoa butter, virgin coconut oil, olive oil, mango butter, cupuaçu butter, fractionated coconut oil, ceramides, lecithin, pure distilled water and hydrosols, plant derived glycerin, hyaluronic acid, allantoin, d-panthenol, trehalose, vitamin E acetate, Hawaiian algae extract, organic plant derived emulsifiers, phenoxyethanol (preservative), organic essential oils.\r\nU\r\nsing a clean spatula to dip out the cream maintains its purity. \r\n\r\n\r\nON THE MENU:\r\n\r\n•ANGEL CAKES BODY CREAM\r\nis a heavenly treat for the skin and senses. Contains organic virgin coconut oil, organic French plum oil, Tahitian vanilla absolute, lemon EO, sweet orange EO, orange blossom absolute, and other softening butters and oils.  4 oz jar\r\n\r\n•CHOCOLATE DELIGHT BODY CREAM.\r\nMade with pure chocolate absolute and Tahitian vanilla absolute plus a touch of sweet orange essential oil. Cocoa butter, vanilla butter and coconut oil in addition to other nourishing oils and butters make a rich and fragrant treat for body and face.  A pale ivory rich cream that doesnt stain clothes or sheets. Smells good enough to eat!  4 oz jar\r\n\r\n•CINNAMON CELLULITE CREAM FOR BODY\r\nhas ingredients to reduce the appearance of \"orange-peel\" skin and improve tonicity of skin. \r\nRose geranium oil stimulates the lymphatic system to flush away the wastes that are accumulated as cellulite. Caffeine stimulates fat breakdown in the skin.\r\nApply to clean skin twice daily. \r\n\r\nhttp://www.ncbi.nlm.nih.gov/pubmed/21564138\r\n\r\n\"Evaluation of the efficacy of a topical cosmetic slimming product combining tetrahydroxypropyl ethylenediamine, caffeine, carnitine, forskolin and retinol, In vitro, ex vivo and in vivo studies\"\r\n\r\nR. Roure1, T. Oddos2, A. Rossi1, F. Vial3, C. Bertin1\r\nArticle first published online: 13 MAY 2011\"\r\nhttp://onlinelibrary.wiley.com/doi/10.1111/j.1468-2494.2011.00665.x/abstract\r\n\r\nIngreds: Cinnamon bark essential oil, cinnamon leaf essential oil, tocopherol, tetrahydroxypropyl ethylenediamine, glycerin, sodium ascorbate, rosemary leaf extract, horse chestnut extract, caffeine, carnitine, retinol, forskolin extract, sea kelp bioferment, raspberry ketones, spirulina extract, cetostearyl alcohol, polysorbate 60, avocado oil, passionfruit oil, rose geranium EO, capric/caprylic triglycerides, madder root (for color), preservative and pure water. \r\n\r\nThis yummy cinnamon fragranced cream helps to increase circulation to the skin - please patch test before using and do not let it get into eyes or mucus membranes. Do not use at night if you are sensitive to caffeine keeping you awake. May be used under Saran Wrap to increase absorption. Applying before exercise helps too! Discontinue use if irritation occurs.\r\n4 oz jar\r\n\r\n•UNWIND THE MIND \r\nThis smooth cream is wonderful for foot and body massage! Give yourself a relaxing foot massage or share with someone you love. Uplifting and comforting essential oils of frankincense, lavender, sweet marjoram, palmarosa, rose geranium and others, folded into a softening and silky rich cream will delight your senses and truly Unwind your Mind!\r\n\r\nAlso available as scented oil for aromatherapy @ 15ml/$25\r\n\r\n•SILK BODY CREAM\r\nA luxuriously silky and rich cream with silk protein, hyaluronic acid, shea oil, French plum oil and NaPCA to cocoon your skin in moisture and heal it. Fortified with panthenol, vitamin E, ceramide complex and allantoin. Silicones provide protection against moisture loss thru the epidermis and give an incomparable feel to the skin. Lightly and deliciously scented with euphoric citrus accord and white flowers.  4 oz jar\r\n\r\n•GEISHA BALM FOR FACE\r\nThis smooth and rich peach colored balm is based on a famous Japanese geisha recipe. A nourishing blend of healing oils and extracts, it was used under their makeup and then applied again after makeup was removed to restore their skin to softness and health. Organic shea butter, pure Japanese camellia oil, sea buckthorn oil, organic French plum oil, helichrysum, rose geranium, rosewood oil, frankincense, carrot seed CO2 extract and rosehip CO2 extract are proven to help regenerate, soothe and protect skin of face and body and promote elasticity. Warm a small amount of this buttery balm between the hands and apply to slightly damp skin AM and/or PM.\r\n\r\nBenefits of shea butter:\r\nVitamin A&E\r\nShea butter is very high in Vitamin A. In combination with Vitamin E, Shea butter is highly effective in skin regeneration and anti-aging. Shea butter greatly improves the look and feel of skin. After a few days of use, skin looks noticeably younger and healthier.\r\n\r\nStigmasterol\r\nKnown as the \"anti-stiffness factor\", the stigmasterol in shea butter gives its ability to relax tired muscles as well as provide relief for swelling and arthritis.\r\n\r\nUV sun protection\r\nFor centuries, shea butter has helped women in Africa to have beautiful skin fighting off sun and harsh climate.\r\n1 oz jar/$30\r\n\r\n•DMAE FIRMING BODY CREAM \r\nincludes DMAE bitartrate in an emollient cream base for tightening and smoothing the skin of body. With repeated and consistent use skin is firmed and lifted.\r\n4 oz jar/$40\r\n\r\n<script type=\"text/javascript\" data-pp-pubid=\"ae1b85575a\" data-pp-placementtype=\"120x240\"> (function (d, t) {\r\n\"use strict\";\r\nvar s = d.getElementsByTagName(t)[0], n = d.createElement(t);\r\nn.src = \"//paypal.adtag.where.com/merchant.js\";\r\ns.parentNode.insertBefore(n, s);\r\n}(document, \"script\"));\r\n</script>","options":[{"id":27710369,"name":"ANGEL CAKES 4 oz $30","price":30.0,"sold_out":false,"has_custom_price":false},{"id":27710372,"name":"CHOCOLATE DELIGHT 4 oz $30","price":30.0,"sold_out":false,"has_custom_price":false},{"id":50143611,"name":"RED MANDARIN BODY CREAM 4 oz $30","price":30.0,"sold_out":false,"has_custom_price":false},{"id":28404056,"name":"CINNAMON CELLULITE 4 oz $30","price":30.0,"sold_out":false,"has_custom_price":false},{"id":28930895,"name":"UNWIND THE MIND 4 oz  $30","price":30.0,"sold_out":false,"has_custom_price":false},{"id":34058808,"name":"SILK 4 oz $30","price":30.0,"sold_out":false,"has_custom_price":false},{"id":43437495,"name":"DMAE FIRMING BODY CREAM","price":40.0,"sold_out":false,"has_custom_price":true},{"id":33382729,"name":"GEISHA BALM 1 oz $30","price":30.0,"sold_out":false,"has_custom_price":false},{"id":39729726,"name":"UNWIND THE MIND Aromatherapy oil 15ml $25","price":25.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":7.0,"amount_with_others":4.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":26.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/86693861/-/body_butter_in_blue_jar.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/86693861/-/body_butter_in_blue_jar.jpeg","width":190,"height":266}],"artists":[],"categories":[]}]