[{"id":13780554,"name":"Schnauser - Where Business Meets Fashion","permalink":"schnauser-where-business-meets-fashion","position":1,"price":7.0,"default_price":7.0,"tax":0.0,"url":"/product/schnauser-where-business-meets-fashion","status":"active","on_sale":false,"created_at":"2013-09-25T13:32:13.000Z","description":"So it’s official: we’ve all seen the news every day, and we’re all going to hell in a handcart. But why not be like Schnauser and take the scenic view?\r\n\r\nThe last time we had cause to consider Bristol’s literate, cineaste purveyors of roseate neo-psych prog-pop with a fistful of thorns was the 2010 release of their second album, The Sound Of Meat. Since then, they’ve converted screeds of gig-goers to their cause via rapturously-received headline appearances, sexy support slots and festival fraternising, and have just sprinkled the last handful of poisoned hundreds and thousands on to their wholly remarkable new album Where Business Meets Fashion.\r\n\r\nIf you’ve been searching for the exact spot where a geyser of sparkling Rundgrenesque melody intersects with delicious Kinksian melancholia, Canterbury Scene conviviality and the pitiless basilisk gaze of Chris Morris, look no further. It’s right here.\r\n\r\n\r\nAlan Strawbridge: Guitars, Vocals                                 Holly McIntosh: Bass, Vocals\r\nDuncan Gammon: Keyboards, Vocals                           Jasper Williams: Drums\r\n\r\nREVIEWS\r\n\r\n“Flip pop-cultural analysis over Beach Boys harmonies and the sort of baroque inflections favoured by 1970s technicians such as Todd Rundgren & The Raspberries”  SUNDAY TIMES\r\n\r\n”A failsafe combination of melodious, inventive songwriting, energetically airtight musicianship, neo-psych bendiness and an irrepressible classic pop sensibility”  RECORD COLLECTOR\r\n\r\n“Schnauser have an uncanny ability to channel the difficult, the overtly cerebral and the proggy into irresistible and timeless pop music.\" THE ACTIVE LISTENER\r\n\r\nhttp://www.schnauser.co.uk\r\n \r\n","options":[{"id":44236440,"name":"Default","price":7.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.5,"amount_with_others":0.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124850541/-/Schnauser_Gatefold_Artwork.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124850541/-/Schnauser_Gatefold_Artwork.jpg","width":969,"height":500}],"artists":[],"categories":[{"id":256513,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":304447,"name":"Lord Gammonshire's Guide to Everyday Sounds","permalink":"lord-gammonshires-guide-to-everyday-sounds","position":2,"price":8.99,"default_price":8.99,"tax":0.0,"url":"/product/lord-gammonshires-guide-to-everyday-sounds","status":"active","on_sale":true,"created_at":"2009-05-22T02:11:47.000Z","description":"Lord Gammonshire's Guide to Everyday Sounds documents the strange hinterland of half remembered dreams, tedious office work and the delirium induced when being stung by wasps. Along the way we encounter giant killer herons, screaming vegetables, humankind reduced to a seething algal bloom and a featureless drone beavering away in the Uncivil Service. Musically indebted to the 2 great M s of the early 70 s (Moog and Mellotron), and to the playful inventiveness of the bands of that era (Stackridge/Caravan / Kevin Ayres / 10cc / Viv Stanshall), the album is none the less no simple retro-pastiche, but rather a celebration of the possibilities in sound and subject matter that seemed to exist in that era. Veering from wry-observational pop nous (Summer Smash / Uncivil Servant) through rollicking sea shanties (Rise of the Stromatolites), full on progressive rock (Tundra /Barlain Forest) to eccentric ditties (Brie Before Bedtime / Thistles on yer Tootsies), The album offers humour, but not to the expense of the musical journey, so why not clear out yer lugoles and take a listen to some Everyday Sounds ","options":[{"id":1264113,"name":"Default","price":8.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":2.0,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2327982/-/Low_Front_Cover600px.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2327982/-/Low_Front_Cover600px.jpg","width":600,"height":600}],"artists":[{"id":7255,"name":"Lord Gammonshire","permalink":"lord-gammonshire","url":"/artist/lord-gammonshire"}],"categories":[{"id":256513,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]