[{"id":5103685,"name":"The 400 Calls on Milwaukee (Print)","permalink":"the-400-calls-on-milwaukee-print","position":1,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/the-400-calls-on-milwaukee-print","status":"active","on_sale":false,"created_at":"2011-12-18T09:20:22.000Z","description":"Prints are available in:\r\n11x14 - $25\r\n12x16 - $30\r\n16x20 - $40\r\n\r\nPrints are from a limited run of 100 prints per size. Each one is hand numbered and signed by the artist. A note card with the painting description and matching number and signature is also included.\r\n\r\nABOUT THE PAINTING\r\nLocated at the end of Wisconsin Street (now Wisconsin Avenue) stood the Chicago & North Western’s train depot. The 207 foot tall Romanesque clock tower made it an instant landmark for city folk and favorite target of Mother Nature’s winter furry when completed in 1899. Designed by Charles Summer Frost, the depot featured a train shed that was tucked below the bluff along the shore of Lake Michigan, making the accompanying hillside a perfect vantage point to sit and watch the activity. Efforts to save this splendid structure as a reminder of hometown railroading failed and in 1968, she succumbed to the wrecking ball in a pile of dust. Rail patrons were then redirected to the new Donald Grieb styled depot on St. Paul Avenue where the C&NW shared a train shed with the Milwaukee Road.. Today, auto traffic briefly traverses the old line northbound on Lake Drive and most motorists are oblivious to the fact that they are driving on the ghost rails of trains long gone.\r\n\r\nOn this sunny fall day in the mid 1950’s, before the completion of the War Memorial, the famous 400 calls on the Cream City with a Minneapolis bound streamliner in tow. Intent on keeping her “400 miles in 400 minutes” schedule form Chicago to the Twin Cities, she’ll pause just long enough to detrain patrons and board additional travelers with business in Minneapolis. In the blink of an eye, but not before sounding a few off key notes from her baritone horns, she’ll duck beneath Lincoln Memorial Drive and glide through the suburb of Shorewood where the local police guard the grade crossings from the passing blur of green and yellow.\r\n\r\n18 x 24 original acrylic painting was completed in 1999.\r\n\r\nNOTES:\r\nPrint sizes include 1\" border\r\nPlease check the image of the print you are ordering as cropping may vary from size to size.\r\n","options":[{"id":16561593,"name":"11x14","price":25.0,"sold_out":false,"has_custom_price":false},{"id":16561595,"name":"12x16","price":30.0,"sold_out":false,"has_custom_price":true},{"id":16561597,"name":"16x20","price":40.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":10.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50163871/-/storep1_11x14.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50163871/-/storep1_11x14.jpg","width":871,"height":684}],"artists":[],"categories":[{"id":2712975,"name":"Prints","permalink":"prints","url":"/category/prints"}]},{"id":5103639,"name":"Swansong of the Flambeau (Print)","permalink":"swansong-of-the-flambeau-print","position":2,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/swansong-of-the-flambeau-print","status":"active","on_sale":false,"created_at":"2011-12-18T09:11:52.000Z","description":"Prints are available in:\r\n11x14 - $25\r\n12x16 - $30\r\n16x20 - $40\r\n\r\nPrints are from a limited run of 100 prints per size. Each one is hand numbered and signed by the artist. A note card with the painting description and matching number and signature is also included.\r\n\r\nABOUT THE PAINTING\r\nTrain 216, The Flambeau 400 with two 1958 bi-level cars in tow, calls on Eland Wisconsin after coming down the line from Ashland enroute to Green Bay, Milwaukee and finally Chicago on this first day of 1960. To the west of the depot on the Marshfield line, a pair of GP7’s idles as the crew, taking advantage of a lull in the action, has gone inside to top off their thermos’s with hot coffee. They’ll soon retreat to the confines of cab # 1549 in hopes to sip a cup or two before hooking up to a string of pulp cars due within the hour from Wausau. Eland’s fine depot once boasted a lunch counter that existed for the pure indulgence of its patrons traveling one of the 38 passenger or 30 freight trains that converged from all four directions each day. Eight of those passenger trains alone arrived between the hours of 11:00-1:00pm daily.\r\n\r\nUnfortunately, by the time this scene was captured, automobiles were already replacing the passenger train and semi trucks had their ligature tightening on the remaining freight traffic. Not even new bi-level equipment or a depot freshly painted in matching 400 colors could persuade people to go by train.\r\n\r\nThe line from Eland north to Rhinelander was abandoned on August 24, 1982 and the last steel wheels to scrape the rust from the rails was GP7 # 4152 on January 30, 1994. The depot still stands today as a faded reminder of the glory days of railroading in Wisconsin’s north woods.\r\n\r\n18 x 24 original acrylic painting was completed in 2007.\r\n\r\nNOTES:\r\nPrint sizes include 1\" border\r\nPlease check the image of the print you are ordering as cropping may vary from size to size.","options":[{"id":16561521,"name":"11x14","price":25.0,"sold_out":false,"has_custom_price":false},{"id":16561523,"name":"12x16","price":30.0,"sold_out":false,"has_custom_price":true},{"id":16561525,"name":"16x20","price":40.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":10.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50164023/-/storep9_11x14.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50164023/-/storep9_11x14.jpg","width":871,"height":684}],"artists":[],"categories":[{"id":2712975,"name":"Prints","permalink":"prints","url":"/category/prints"}]},{"id":5103725,"name":"Ballast Scorchers of the North Shore (Print)","permalink":"ballast-scorchers-of-the-north-shore","position":3,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/ballast-scorchers-of-the-north-shore","status":"active","on_sale":false,"created_at":"2011-12-18T09:34:53.000Z","description":"Prints are available in:\r\n11x14 - $25\r\n12x16 - $30\r\n16x20 - $40\r\n\r\nPrints are from a limited run of 100 prints per size. Each one is hand numbered and signed by the artist. A note card with the painting description and matching number and signature is also included.\r\n\r\nABOUT THE PAINTING\r\nThe Chicago, North Shore and Milwaukee Railroad depot at 5th and Michigan Streets in Milwaukee Wisconsin opened for service on September 15, 1920, a mere stones throw form the Chicago Milwaukee St. Paul and Pacific railroad station. While the Milwaukee Road had its share of loyal riders, so too did the North Shore, transporting countless shoppers and commuters and tens of thousands of military personnel on weekends between the Great Lakes Training Academy and the cities of Milwaukee and Chicago. Over its 65-year history, the North Shore prided itself on its well-groomed right-of-ways and spit-shined train sets. Widely recognized as the Country’s most well know commuter line, the North Shore outlived all of its interurban predecessors.\r\n\r\nOn this chilly day in Milwaukee, we see an assorted line up of equipment offered by the “Line of Service.” Sitting to the right of the boarding platform is car 764 built by the Standard Steel Car Company in 1930. Donning her original green and crimson enamel paint, she straddles the inspection pit before a run over the Skokie Valley Route to Chicago. Ready to follow is Silverliner 737, one of 27 cars repainted with an artists touch in the late 50’s to resemble the fluted stainless steel cars in use on larger roads. With 38 fast trains per day between the two cities, 10 of them were modern Electroliners like #802, poised to leave in five minutes for a ballast scorching 90 mph run to the Windy City, some 90 miles to the south. The North Shore ceased operations on January 21, 1963 during a raging snowstorm. Both cities have seen many a snowstorm since then but never a railroad like the North Shore Line.\r\n\r\n22 x 28 original acrylic painting was completed in 2005.\r\n\r\nNOTES:\r\nPrint sizes include 1\" border\r\nPlease check the image of the print you are ordering as cropping may vary from size to size.","options":[{"id":16561673,"name":"11x14","price":25.0,"sold_out":false,"has_custom_price":false},{"id":16561675,"name":"12x16","price":30.0,"sold_out":false,"has_custom_price":true},{"id":16561677,"name":"16x20","price":40.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":10.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50164095/-/storep7_11x14.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50164095/-/storep7_11x14.jpg","width":871,"height":684}],"artists":[],"categories":[{"id":2712975,"name":"Prints","permalink":"prints","url":"/category/prints"}]},{"id":5103601,"name":"Old Milwaukee Depots Card Set","permalink":"milwaukee-depots-card-set","position":4,"price":12.99,"default_price":12.99,"tax":0.0,"url":"/product/milwaukee-depots-card-set","status":"active","on_sale":false,"created_at":"2011-12-18T08:59:19.000Z","description":"Enjoy writing a personal note or jotting a special Thank You to fellow train buffs on these note cards featuring the 3 railroad depots that once called Milwaukee home. This card pack features 4 each of The Milwaukee Road, Chicago & North Western and the North Shore Line's land mark depots. Made from the original acrylic painting from Dick Bonkoski's private collection, Included are:  \"Ballast Scorchers of the North Shore\" , \"The 400 calls on Milwaukee\" and \"Second Strings of the Milwaukee Road.\"\r\n\r\nCards have blank insides for plenty of room for writing and are printed on 100# card stock. White envelopes and a sturdy box are included. These cards make a gift to yourself or a friend!","options":[{"id":16561457,"name":"Default","price":12.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/53889057/-/depotcard.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/53889057/-/depotcard.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":2712977,"name":"Cards","permalink":"cards","url":"/category/cards"}]},{"id":5103571,"name":"Winter Rails Card Set","permalink":"winter-rails-card-set","position":5,"price":12.99,"default_price":12.99,"tax":0.0,"url":"/product/winter-rails-card-set","status":"active","on_sale":false,"created_at":"2011-12-18T08:48:16.000Z","description":"Nothing contrasts a  beautiful train better than snow and there is just something about a mighty freight or crack passenger train battling the winter elements!  Any train or history buff will appreciate receiving a personal note from you written on one of 3 different winter scenes from Dick Bonkoski's collection of railroad paintings.  Included are 4 copies of each of these 3 fabulous pieces: \" Passing Glances\" painting featuring the Milwaukee Road's trains at Duplainville Wisconsin, \" Mirrors of Metal\" painting showing the California Zephyr rounding a curve  \"Swansong Of The Flambeau\" featuring the Chicago & North Western bi-levels in Eland Wisconsin.   \r\nThe cards are printed on 100# card stock and include white envelopes and a sturdy box.  These make a super gift to yourself or a friend!","options":[{"id":16561373,"name":"Default","price":12.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/53889225/-/wintercard.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/53889225/-/wintercard.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":2712977,"name":"Cards","permalink":"cards","url":"/category/cards"}]}]