[{"id":4923995,"name":"Lucky Peacock Feather Jewelry, Silk Ribbon Bracelet, Artisan Solid Silver Toggle Clasp, Yoga Jewelry","permalink":"inspirational-quote-jewelry-silver-silk-wrap-bracelet-artisan-jewelry-silver-toggle-clasp","position":1,"price":49.5,"default_price":49.5,"tax":0.0,"url":"/product/inspirational-quote-jewelry-silver-silk-wrap-bracelet-artisan-jewelry-silver-toggle-clasp","status":"active","on_sale":false,"created_at":"2011-11-24T12:23:03.000Z","description":"Feather Jewelry, Peacock Bracelet: The serenity wrap bracelet is fashioned from a hand dyed silk ribbon and artisan silver toggle, the wispy & gently crinkled, with finished edges and seamed ends, a generous 40” or so in length to be wrapped luxuriously around your wrist many times. The unique focal point is a two part bar toggle, exquisitely artisan crafted from a delicate piece of eco-friendly reclaimed silver, 99.9% pure, thin & lightweight for comfort, not chunky or bulky, then oxidized & hand spot polished for a brilliant luster. Dispersed along the ribbon is a pair of shiny disks of fine silver for a little added shimmer & surprise. A lucky peacock feather is embossed below the word “fly” with edges roughly hewn and sporadically pitted for an exquisite rustic luster. Hypnotic & uplifting. Shown in the elegant deep neutral hue of Driftwood.\r\n\r\nIt will sparkle in the sun like a jewel, and with many artisan toggle designs and silk ribbon colors to choose from you can customize yours to compliment your personality perfectly. The toggle shown is strung on the color Driftwood but you may select from a myriad of deliciously rich colors depicted in the last photo and listed below. Please state your preference in the “note to seller” box upon ordering, otherwise, it will be shipped as photographed.\r\n\r\nOrder extra silk ribbons for $6.50 each and you can swap quickly & easily alter your wrap bracelet to match your outfit or mood. Just untie the toggle then restring the silver disks and tie the toggle & bar onto another ribbon. Change with the tides, the wind, the moon phase, at your whim.\r\n\r\nThis particular wrap bracelet is sold but yours will be similar, with an obvious artisan crafted appeal. A versatile, sexy, and distinctive piece of jewelry you’ll want to wear everyday, and so comfortable you will miss it when absent from your wrist. Sent on it’s own exclusive presentation display, the ORIGINAL HappyGoLicky Serenity Bracelet makes a thoughtful and distinctive eco-chic gift. Own one, give one, love one.\r\n\r\nFYI- The difference between \"fine\" silver and \"sterling\" silver is that fine silver is 99.9% pure silver. Sterling is only 92.5% silver with the remaining 7.5% being composed of other metals, usually copper. They look the same, wear & polish the same, but fine silver is more \"pure\" and is, therefore, more costly and often considered more desirable than sterling.\r\n","options":[{"id":16018511,"name":"Default","price":49.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.99,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/68337907/-/Lucky-Peacock-Feather-Jewelry-Silk-Ribbon-Wrap-Bracelet.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/68337907/-/Lucky-Peacock-Feather-Jewelry-Silk-Ribbon-Wrap-Bracelet.jpg","width":570,"height":460}],"artists":[],"categories":[{"id":2649585,"name":"Silk Wrap Bracelets","permalink":"silk-wrap-bracelets","url":"/category/silk-wrap-bracelets"}]},{"id":4923979,"name":"Beach Jewelry, Silk Ribbon Bracelet, Ocean Waves, Surf Wrist Wrap Bracelet","permalink":"love-jewelry-boho-jewelry-silver-silk-wrap-bracelet","position":2,"price":49.5,"default_price":49.5,"tax":0.0,"url":"/product/love-jewelry-boho-jewelry-silver-silk-wrap-bracelet","status":"active","on_sale":false,"created_at":"2011-11-24T12:19:26.000Z","description":"Ocean Jewelry, Beach Bracelet: This surf silk ribbon bracelet is fashioned from a hand dyed pure silk ribbon & silver ocean waves toggle, the ribbon wispy & gently crinkled, with finished edges and seamed ends, a generous 40” or so in length to be wrapped luxuriously around your wrist many times. The unique focal point is a two part bar toggle, exquisitely created from a delicate piece of eco-friendly recycled silver, 99.9% pure, thin & lightweight for comfort, then oxidized & hand spot polished for a brilliant luster. Dispersed along the ribbon is a pair of shiny disks of fine silver for a little added shimmer & surprise. An impression of the sea, rolling ocean waves, the tumbling surf is embedded on the surface. So cool & different. Wear a little bit of the beach. Shown in the outdoor lover's blend called Landscape.\r\n\r\nIt will glisten in the sun like a jewel, and with many silver toggle designs and ribbon colors to choose from you can customize yours to compliment your personality perfectly. The nautical toggle shown is strung on the color Landscape but you may select from a myriad of deliciously rich colors depicted in the last photo and listed below. Please state your preference in the “note to seller” box upon ordering, otherwise, it will be shipped as photographed.\r\n\r\nOrder extra silk ribbons for $6.50 each and you can swap quickly & easily alter your bracelet to match your outfit or mood. Just untie the toggle then restring the disks and tie the toggle & bar onto another ribbon. Change with the tides, the wind, the moon phase, at your whim.\r\n\r\nThis particular beach bracelet is sold but yours will be similar, with an obvious artisan crafted appeal. A versatile, sexy, and distinctive piece of jewelry you’ll want to wear everyday, and so comfortable you will miss it when absent from your wrist. Sent on it’s own exclusive presentation display, the ORIGINAL HappyGoLicky Serenity Bracelet makes a thoughtful and distinctive eco-chic gift. Own one, give one, love one.\r\n\r\nFYI- The difference between \"fine\" silver and \"sterling\" silver is that fine silver is 99.9% pure silver. Sterling is only 92.5% silver with the remaining 7.5% being composed of other metals, usually copper. They look the same, wear & polish the same, but fine silver is more \"pure\" and is, therefore, more costly and often considered more desirable than sterling silver.","options":[{"id":16018451,"name":"Default","price":49.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.99,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/68355857/-/Beach_Jewelry_Silk_Ribbon_Bracelet_Ocean_Waves.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/68355857/-/Beach_Jewelry_Silk_Ribbon_Bracelet_Ocean_Waves.jpg","width":1000,"height":750}],"artists":[],"categories":[{"id":2649585,"name":"Silk Wrap Bracelets","permalink":"silk-wrap-bracelets","url":"/category/silk-wrap-bracelets"}]},{"id":4923959,"name":"Handstamped Love Jewelry, Silk Ribbon Bracelet, Wrist Wrap, Yoga Jewelry Ribbon Bracelet","permalink":"serenity-silver-silk-wrap-bracelet-peacock-feather-jewelry","position":3,"price":49.5,"default_price":49.5,"tax":0.0,"url":"/product/serenity-silver-silk-wrap-bracelet-peacock-feather-jewelry","status":"active","on_sale":false,"created_at":"2011-11-24T12:15:03.000Z","description":"Wrap Bracelet, Handstamped Wrist Wrap: This silver toggle silk wrap bracelet is fashioned from a hand dyed pure silk ribbon, wispy & gently crinkled, with finished edges and seamed ends, a generous 40” or so in length to wind luxuriously around your wrist many times. The unique focal point is a two part bar toggle, exquisitely created from a delicate piece of eco-friendly reclaimed silver, 99.9% pure, thin & lightweight for comfort, then oxidized & hand spot polished for a brilliant luster. Dispersed along the ribbon is a pair of shiny disks of silver for a little added shimmer & surprise. The word “love” is whispered across a romantic vintage floral pattern. Captivating & alluring. Shown in the elegant deep hue of Driftwood.\r\n\r\nIt will sparkle in the sun like a jewel, and with many toggle designs and ribbon colors to choose from you can customize yours to compliment your personality perfectly. The toggle shown is strung on the color Driftwood but you may select from a myriad of deliciously rich colors depicted in the last photo and listed below. Please state your preference in the “note to seller” box upon ordering, otherwise, it will be shipped as photographed.\r\n\r\nOrder extra ribbons for $6 each and you can swap quickly & easily alter your bracelet to match your outfit or mood. Just untie the toggle then restring the disks and tie the toggle & bar onto another ribbon. Change with the tides, the wind, the moon phase, at your whim.\r\n\r\nThis particular bracelet is sold but yours will be similar, with an obvious artisan crafted appeal. A versatile, sexy, and distinctive piece of jewelry you’ll want to wear everyday, and so comfortable you will miss it when absent from your wrist. Sent on it’s own exclusive presentation display, the original HappyGoLicky Serenity Bracelet makes a thoughtful and distinctive eco-chic gift. Own one, give one, love one.\r\n\r\nFYI- The difference between \"fine\" silver and \"sterling\" silver is that fine silver is 99.9% pure silver. Sterling is only 92.5% silver with the remaining 7.5% being composed of other metals, usually copper. They look the same, wear & polish the same, but fine silver is more \"pure\" and is, therefore, more costly and often considered more desirable than sterling.","options":[{"id":16018375,"name":"Default","price":49.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.99,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/68356115/-/love-jewelry-unique-jewelry-silk-wrap-bracelet-by-happygolicky.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/68356115/-/love-jewelry-unique-jewelry-silk-wrap-bracelet-by-happygolicky.jpg","width":570,"height":465}],"artists":[],"categories":[{"id":2649585,"name":"Silk Wrap Bracelets","permalink":"silk-wrap-bracelets","url":"/category/silk-wrap-bracelets"}]},{"id":424584,"name":"Real Feather Jewelry, Pheasant Feather Ring, Eco Friendly Recycled Fine Silver","permalink":"custom-fine-silver-ring-any-quote-any-size","position":4,"price":85.0,"default_price":85.0,"tax":0.0,"url":"/product/custom-fine-silver-ring-any-quote-any-size","status":"active","on_sale":false,"created_at":"2009-10-13T00:19:26.000Z","description":"Feather Ring, Eco Friendly Jewelry: A real pheasant feather was replicated in eco friendly recycled fine silver for this rustic ring, complete with true imperfections in the fibrous strands from battling weather and predators. The feather overlaps for a unique and cool finish, oxidized and hand spot polished to give this recycled silver ring a inimitable rustic luster.\r\n\r\nYour custom recycled silver pheasant feather ring will be like the one pictured- funky, shiny, unpredictable, and obviously hand made just for you. Flip it or spin it to wear the overlap on top, or for a more subtle appearance twist it to show the smoothest part, and you have 2 rings in one. Ideal and rugged for a man, fashionable and unique for a woman, it exudes a unisexy allure. You can feel good about wearing it as it is eco friendly silver which means no new silver was mined.\r\n\r\nSilver ring is a thick band, ~9-11mm at the widest point, or about 3/8\", so please consider going up a half size for comfort.. Please let me know your feather ring size in the \"note to seller\" box upon ordering.","options":[{"id":1687064,"name":"Default","price":85.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.99,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.99,"amount_with_others":0.5,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.99,"amount_with_others":0.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/68356395/-/Real-Feather-Jewelry-Pheasant-Feather-Ring-Eco-Friendly-Recycled-Fine-Silver.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/68356395/-/Real-Feather-Jewelry-Pheasant-Feather-Ring-Eco-Friendly-Recycled-Fine-Silver.jpg","width":570,"height":453}],"artists":[],"categories":[{"id":329043,"name":"Custom Silver Rings","permalink":"custom-silver-rings","url":"/category/custom-silver-rings"}]},{"id":424590,"name":"Angel Wings Ring, Fine Silver with Handstamped Initials, Collage Art","permalink":"vintage-allure-monogram-necklace-in-fine-silver","position":5,"price":85.0,"default_price":85.0,"tax":0.0,"url":"/product/vintage-allure-monogram-necklace-in-fine-silver","status":"active","on_sale":false,"created_at":"2009-10-13T00:24:08.000Z","description":"Angel Wings Ring with Handstamped Initials, Silver Jewelry: A handful of feathery wings replicated in eco friendly recycled fine silver stacked & layered & pressed into a pretty ethereal collage art ring. Lost angel wings, fairy wings, from an owl, swallow, or other bird with special significance to you? You decide the interpretation for this unisex silver ring. Whatever kind you believe this fine silver ring oxidized and hand polished for high contrast will evoke a peaceful & soothing feeling when you see it wrapped around your finger.\r\n\r\nYour custom silver handstamped \"Gathered Wings\" ring will be like the one pictured- funky, shiny, unpredictable, and obviously hand crafted just for you. Flip it or spin it around and you'll have many rings in one. Delightfully unique & unisexy with a hint of vintage tattoo inspiration.\r\n\r\nYour handstamped initials will be hidden scattered in the wings.\r\n","options":[{"id":1687077,"name":"Default","price":85.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.99,"amount_with_others":0.25,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.99,"amount_with_others":0.5,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.99,"amount_with_others":0.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/68356507/-/bird-angel-wings-jewelry-silver-ring.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/68356507/-/bird-angel-wings-jewelry-silver-ring.jpg","width":570,"height":466}],"artists":[],"categories":[{"id":329046,"name":"Monograms & Personalized Gifts","permalink":"monograms-personalized-gifts","url":"/category/monograms-personalized-gifts"}]}]