[{"id":3002033,"name":"The Secrets of Empowerment (Paperback)","permalink":"the-secrets-of-empowerment","position":1,"price":10.99,"default_price":10.99,"tax":0.0,"url":"/product/the-secrets-of-empowerment","status":"active","on_sale":false,"created_at":"2010-12-09T09:50:31.000Z","description":"Charles Gordon: \"If you follow the rules of society you will end up with a JOB--Just Over Broke. It's the nature of the beast.\" If you enjoy the thrill and challenge of thinking and living outside the mind-numbing figurative box, then the Secrets of Empowerment is the book that will propel you into the big league. For those who lack such boldness, the recommendation is that you shut the pages of this book and choose more mainstream reading, with all its comfortable limitations and normality's. As the intrepid go through the pages of Empowerment, they will discover a host of priceless principles which have traditionally been hidden by those in power. The result has been that those in the higher income brackets remain at the top, while those with only a few pennies have remained at the bottom of the earnings league, because of not being privy to the secrets of financial success. For the reader of Empowerment the message is: the dregs do not always have to be swallowed, because there is an alternative. With each key to Empowerment that is used, the fledging entrepreneur will discover he is one step closer to becoming the person he desires, and, of course, richer. In countless books on entrepreneurs the Chinese proverb is quoted, that if you feed a man a fish you feed him for the day, but if you teach him how to fish you feed him for a lifetime. Empowerment has been written to put the champagne and caviar on the table; forget the bread and fish! For anyone thinking about starting their own business, the secrets of empowerment is a MUST READ. It explains everything no course can teach you from someone who has experienced it all. The Secrets of emPOWERment is all you need to turn your life into a success.","options":[{"id":10342639,"name":"Default","price":10.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/29097811/-/tsoe.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/29097811/-/tsoe.jpg","width":280,"height":400}],"artists":[],"categories":[]}]