[{"id":2703317,"name":"Forest Creature - Frustrated Analogue","permalink":"forest-creature-frustrated-analogue","position":1,"price":5.5,"default_price":5.5,"tax":0.0,"url":"/product/forest-creature-frustrated-analogue","status":"active","on_sale":false,"created_at":"2010-08-16T17:24:15.000Z","description":"Blackest Rainbow Records\r\n7 Edits from 2009\r\n\r\nPress Release\r\n\r\nVery pleased to announce the first 'proper' release from this local duo of Ben Moon and Richard Sides, and a very new sound for Blackest Rainbow. Forest Creature has been through many different sounds, starting as a fairly harsh noise experience opening for bands like Wolf Eyes and Jazkamer back when we did shows. They later on incorporated live drums and screwed up vocals, and a purely animal live experience. The duo's sound has progressed more and more over the last year, with different sounds collating to make Forest Creature reach a point where they have their very own sound. Their previous sound would've fitted nicely into the Load Records roster, and then building to sound more like some kind of blend of Black Dice, early Animal Collective and Fuck Buttons. But now over the last few months I've experienced some of their best live performances yet (performed in near total darkness with flickering TV screens and bulbs) they pummel their audience with thumping beats, raging psychedelic synth, broken glitches and clicks, they seemed to have found a definite place that seems to be right for them. Strangely enough some of this material even reminds me of the supreme days of Sheffield's techno and IDM music boom back in the late 80s and early 90s with legends like Autechre, Black Dog, and the hay day of Warp Records best releases. If you're into Black Dice, early Warp Records, Animal Collective and aren't afraid of a little beat here and there then I suggest you check out Forest Creature! Glass mastered pro pressed CD (not CDR) in full colour pro printed CD wallet. \r\n\r\nSome Reviews\r\n\r\nwww.normanrecords.com/records/109998\r\nwww.aquariusrecords.org/bin/search.cgi","options":[{"id":9513792,"name":"Default","price":5.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/26208288/-/forest_creature_-_frustrated_analogue_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/26208288/-/forest_creature_-_frustrated_analogue_cover.jpg","width":236,"height":231}],"artists":[],"categories":[{"id":1614335,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]