[{"id":11466354,"name":"Various Artists - \"Dreamsheep (Volume One)\" limited CDR [SOLD OUT] - DS001","permalink":"various-artists-dreamsheep-vol-one-limited-cdr-sold-out-ds001","position":1,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/various-artists-dreamsheep-vol-one-limited-cdr-sold-out-ds001","status":"sold-out","on_sale":false,"created_at":"2013-05-30T07:52:52.000Z","description":"Listen to this album on Spotify: http://spoti.fi/iai9X8\r\n\r\n<iframe src=\"https://embed.spotify.com/?uri=spotify:album:0NHqJZOYq7SZN8oIKmikwG\" frameborder=\"0\" allowtransparency=\"true\" width=\"400\" height=\"480\"></iframe>\r\n\r\n1\tArea C – Sorcery [4:21]\t\r\n2\tDatashock – Hui Bu Fährt Geisterkarussell\t [6:47]\t\r\n3\tRichard Skelton – Untitled\t[6:57]\t\r\n4\tGianluca Becuzzi & Fabio Orsi – At The End Of The Summer [6:27]\t\r\n5\tRobedoor – Grass Mind [9:53]\t\r\n6\tThe North Sea – Release The Hounds [7:27]\t\r\n7\tBrothers Of The Occult Sisterhood – The Blue God Of India [6:10]\t\r\n8\tHexlove – Instant Whole [5:46]\t\r\n9\tThe Nether Dawn - Orphan Section From The Endless Night [8:45]\r\n\r\nCredits\r\nCompiled By – Valerio Cosi\r\n\r\nNotes\r\nSheeps on the front cover by A. Berghaus (19th century). \r\n\"Dreamsheep (Volume One)\" has been compiled, tracklisted and mastered by Valerio Cosi.\r\n\r\n\r\n\r\nPress release:\r\n\r\nFirst volume in a forthcoming serie of compilations. This one includes guys like Area C, Datashock, Gianluca Becuzzi & Fabio Orsi, Hexlove, Richard Skelton, Robedoor, The North Sea, The Nether Dawn, Brothers Of The Occult Sisterhood. It dives into drones and free-folk territories, offering some of the greatest tracks from the single artists. This compilation is a subtle journey into your mind, made of sound-and-vision ecstasy and monolithic tones. CDR comes in a limited edition of 200 copies.\r\n\r\n\r\nPraise for the album:\r\n\r\n\"Putting compilation albums together is not as easy as any idealist wanting to create such a thing might hope or imagine. I was involved in making a compilation lp once (in the days of Boa Records, run by my friend Gayle and I) and, much as we were proud of the finished result, the process of getting all the material from those who expressed an interest in being included was far more laborious than it should’ve been.\r\nThe other drawback of many a comp is the attitude some people have towards what they supply for such releases: “oh, this isn’t good enough for my album, it’ll do for a compilation” is an approach that detracts from the albums and, I think, doesn’t reflect well on the artists either.\r\nWith those potential pitfalls in mind, I’m pleased to say that Dreamsheep Volume One comes through the minefield with flying colours. When I noted that it was on a label being run by Valerio Cosi, I hoped this would be the case, as he’s one of the most versatile and inspired musicians I’ve come across in the last few years.\r\nDreamsheep opens with Area C’s “Sorcery”, wheezy puffs of organ, overlaid with lilting slide guitar and chiming percussion: a beautiful way to begin. Datashock take the mood to more ominous terrain, with deep bowed strings and a misty building chorus of voices and drones before Richard Skelton (a.k.a. A Broken Consort) takes the texture back to a shimmering baroque sparseness. It hardly surprises me to find Gianluca Becuzzi and Fabio Orsi on an album compiled by Valerio Cosi and their multi-layered electroacoustic “At The End Of The Summer” proves that their inclusion is no “old pals act”! Robedoor are next, with sepulchral melodies in “bottom of the well” reverb flowing neatly into The North Sea’s fine burst of rumbling analogue synth overload, then the soundstage goes acoustic again with the strings, percussion and voices of Brothers of the Occult Sisterhood fading in and fading out as we eavesdrop on their spiritual improv session. Hexlove’s rhythmically complex “Instant Whole” runs backwards, forwards and, it seems, sideways simultaneously before The Nether Dawn complete the cycle with a lovely piece which seems to sit well with the Area C track in bookending the album.\r\nOne of the things I liked best about Dreamsheep is the way the running order flows. There isn’t a duff track on it and it’s a credit to all involved. 9/10 -- John Cavanagh (1 July, 2009)\" \r\n(FOXY DIGITALIS)","options":[{"id":36130308,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/112847406/-/a4053db7e8793842a85d1f7a8a168215b1d5009c.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/112847406/-/a4053db7e8793842a85d1f7a8a168215b1d5009c.jpeg","width":300,"height":300}],"artists":[{"id":205701,"name":"Hexlove","permalink":"hexlove","url":"/artist/hexlove"},{"id":205797,"name":"Gianluca Becuzzi & Fabio Orsi","permalink":"gianluca-becuzzi-fabio-orsi","url":"/artist/gianluca-becuzzi-fabio-orsi"},{"id":205800,"name":"Richard Skelton","permalink":"richard-skelton","url":"/artist/richard-skelton"},{"id":205803,"name":"Brothers Of The Occult Sisterhood","permalink":"brothers-of-the-occult-sisterhood","url":"/artist/brothers-of-the-occult-sisterhood"},{"id":205806,"name":"Datashock","permalink":"datashock","url":"/artist/datashock"},{"id":205809,"name":"Area C","permalink":"area-c","url":"/artist/area-c"},{"id":205812,"name":"Robedoor","permalink":"robedoor","url":"/artist/robedoor"},{"id":205815,"name":"The Nether Dawn","permalink":"the-nether-dawn","url":"/artist/the-nether-dawn"},{"id":205818,"name":"The North Sea","permalink":"the-north-sea","url":"/artist/the-north-sea"}],"categories":[{"id":5419833,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":11466561,"name":"Klangmutationen - \"Liturgie\" limited CDR [SOLD OUT] - DS003","permalink":"klangmutationen-liturgie-limited-cdr-sold-out-ds003","position":2,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/klangmutationen-liturgie-limited-cdr-sold-out-ds003","status":"sold-out","on_sale":false,"created_at":"2013-05-30T08:12:23.000Z","description":"Listen to this album on Spotify: http://spoti.fi/12jDern\r\n\r\n<iframe src=\"https://embed.spotify.com/?uri=spotify:track:3EMTka3Yu5ZYrKBNVFBNP9\" frameborder=\"0\" allowtransparency=\"true\" width=\"400\" height=\"480\"></iframe>\r\n\r\n\r\n1\t\t Liturgie\t20:00\r\n\t\r\nCredits\r\nDrums – Tan Kok Hui\r\nElectric Bass – Robert Gomez (2)\r\nElectric Guitar – Thierry Monnier\r\nTenor Saxophone – Tham Kar Mun, Yandsen\r\nVoice & Bamboo Whistles – Kok Siew Wai\r\n\r\nNotes\r\nThis live set was recorded on the 25th of March 2007 @ the Annexe Central Market, Kuala Lumpur (Malaysia)\r\n\r\n\r\nPress release:\r\n\r\nOne of the most outstanding/uncompromising jazz collectives circulating right now is (without any doubt) Klangmutationen. Coming from the Eastern side of the world, they suddenly remind us of noise legends such as Masayuki Takayanagi, Kaoru Abe and Kousokuya. But you should consider them an exception because they come from Kuala Lumpur, Malaysia, and they play \"organic free metal\" (!). \"Liturgie\" is a black ritual devoted to schizophrenia and otherworldly meditation which clocks at around 20 minutes. It is a burning candle for Shiva. For all you listeners, a final suggestion is to turn off the lights and immerse yourself into this deep black hole. CDR comes in a limited edition of 150 copies.\r\n","options":[{"id":36131076,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/112849782/-/R-1345332-1211452601.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/112849782/-/R-1345332-1211452601.jpeg","width":338,"height":336}],"artists":[{"id":205821,"name":"Klangmutationen","permalink":"klangmutationen","url":"/artist/klangmutationen"}],"categories":[{"id":5419833,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":11466666,"name":"Ryan Jewell/C. Spencer Yeh/Wasteland Jazz Unit - \"Ohio Ghastly Soil\" limited CDR [SOLD OUT] - DS004","permalink":"ryan-jewell-c-spencer-yeh-wasteland-jazz-unit-ohio-ghastly-soil-limited-cdr-sold-out-ds004","position":3,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/ryan-jewell-c-spencer-yeh-wasteland-jazz-unit-ohio-ghastly-soil-limited-cdr-sold-out-ds004","status":"sold-out","on_sale":false,"created_at":"2013-05-30T08:22:12.000Z","description":"Listen to this album on ITunes: http://bit.ly/119ct2s\r\n\r\n\r\n1\t\t Ohio Ghastly Soil\t27:02\t\r\n\r\nCredits\r\nBass, Electronics – C. Spencer Yeh\r\nClarinet [Amplified] – John Rich (3)\r\nDrums, Electronics – Ryan Jewell\r\nSaxophone [Amplified Alto Sax] – Jon Lorenz\r\n\r\nNotes\r\nRecorded with moving microphones at the Art Damage Lodge. \r\nLimited Edition of 200 copies.\r\n\r\n\r\n\r\nPress release:\r\n\r\nSounding like Laddio Bolocko playing Aufgehoben's songs, this amazing quartet shares a seriously mindblowing connection with the huge underground noise scenery in the United States. This half-an-hour free-form session between these Ohio-based dudes is a long electroshock torture which features Yeh (experimental violinist/electronic musician with a highly growing reputation around the world) playing bass here, Jewell (experimental drummer/electronic musician also involved in Pink Reason and Psychedelic Horseshit) on drums/electronic junk and John Rich/Jon Lorenz (Wasteland Jazz Unit) totally immersed in a hyper-amplified and nihilistic sax playing. File under sparkling brutality. CDR comes in a limited edition of 200 copies.\r\n","options":[{"id":36131517,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/112850730/-/R-1345338-1211453323.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/112850730/-/R-1345338-1211453323.jpeg","width":336,"height":350}],"artists":[{"id":205824,"name":"Ryan Jewell","permalink":"ryan-jewell","url":"/artist/ryan-jewell"},{"id":205827,"name":"C. Spencer Yeh","permalink":"c-spencer-yeh","url":"/artist/c-spencer-yeh"},{"id":205830,"name":"Wasteland Jazz Unit","permalink":"wasteland-jazz-unit","url":"/artist/wasteland-jazz-unit"}],"categories":[{"id":5419833,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":11457234,"name":"Ajilvsga - \"Medicine Bull\" CD - DS005","permalink":"ajilvsga-medicine-bull-cd-ds005","position":4,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/ajilvsga-medicine-bull-cd-ds005","status":"active","on_sale":true,"created_at":"2013-05-29T22:47:54.000Z","description":"Listen to this album on Spotify: http://spoti.fi/10vHvc\r\n\r\n<iframe src=\"https://embed.spotify.com/?uri=spotify:album:0Ks3icP5LoEbXvWSJRXDnp\" frameborder=\"0\" allowtransparency=\"true\" width=\"400\" height=\"480\"></iframe>\r\n\r\n\r\n1\t\t Tired Eyes\t9:09\t\r\n2\t\t Big Black Meteoric Star\t21:21\t\r\n3\t\t Rawa\t3:15\t\r\n4\t\t Realm Of Light\t14:23\t\r\n5\t\t Leviathan Vanquished\t10:09\t\r\n\r\n\r\nCredits\r\nArtwork – Danford Mitchell, Valerio Cosi\r\nMastered By – Pete Swanson\r\nPhotography By – Eden Hemming Rose\r\nSounds [All] – Brad Rose, Nathan Young (3)\r\n\r\n℗ © 2008 Dreamsheep Records.\r\nRecorded in Green Country, 2007.\r\nThe catalogue number is incorrectly given as DS006 on the spine.\r\n\r\nBarcode and Other Identifiers:\r\nMatrix / Runout: HILUX-MEDICINE BULL-A20085\r\nMastering SID Code: IFPI LY86\r\nMould SID Code: IFPI AHK05\r\n\r\n\r\n\r\n\r\nPress Release:\r\n\r\nFor those who still haven't had a chance to listen to their music, Ajilvsga is a duo comprised of Nathan Young and Brad Rose (from FoxyDigitalis webzine/label group and The North Sea fame). Ajilvsga are heavy on dynamics, guitars and electronics and they do that in their ownest way. Nicely provided with a doom/black-metal appearance, \"Medicine Bull\" shines like an immediate masterpiece with its unique soundworld carefully shaped for Wiccan nights, cosmic disasters and altered mind states. Magically mastered by Pete Swanson (from Yellow Swans).\r\n\r\n\r\n\r\nPraise for the album:\r\n\r\n\"I've not heard of Ajlvsga before. I can't pronounce it and I realized that I couldn't even read it or write it as I had to copy and paste it in to the review. It's another of those CD's on Dreamsheep which has come in this week which is turning out to be a smart label. It's called 'Medicine Bull' and the band is actually Nathan young and Brad Rose (from North Sea!). This is well dark, dark crackly industrial sounding noises cranking along but hidden underneath layers of darkness, doom and granny slaying are tiny slabs of melody which are keeping my interest enough to keep on ploughing through the CD. It's very gutteral sounding and at times the frequencies are making me feel like I'm gonna shit myself. Nothing new there though (thank heavens for adult nappies). If you're into some cranial pounding then this is something you'll like. Somewhere in between Nadja and the Eraserhead soundtrack. If ever anything sounded like there's demons living in your radiator it's this fucker. Charming.\"\r\n(NORMAN RECORDS - UK)\r\n\r\n\"Listening to this Ajilvsga cd right now and FUCK YEAH this is what I'm talking about. This release is unarguably good and it should have definitely gotten more attention.\r\nAjilvsga have been flooding the world with a loooot of cdrs and cassettes lately, in the usual style of experimental underground these days. This, of course, is a good thing, and it makes a \"proper\" cd release even more anticipated and awesome. And Brad Rose with Nathan Young sure do deliver their greatest jams on this first which Ajilvsga CD on Dreamsheep label run by Valerio Cosi. The album is all usual Ajilvsga, yet performing at their maximum capacity. Its a perfect combination of being really heavy and at the same time pretty, as melodic sounds or tribal rythms emerge from the trademark puddle of heavy buzz and bassy drones, sometimes to turn into an epic blast of beautifull noise (in the vein of the last Yellow Swans stuff) or sometimes just to drown into the mud again. The duo throw in new ideas into every track and it all has a feeling of not a second wasted. Definitely an album that I will return to again. More than one time.\"\r\n(HUM OF THE EARTH blogspot)\r\n\r\n\"Ideatore dell’etichetta Digitalis Industries, della webzine Foxy Digitalis e deux ex machina di North Sea, Brad Rose esordisce su Dreamsheep (la nuova etichetta di Valerio Cosi) con l’impronunciabile quanto affascinante progetto Ajilvsga. Un senso di profonda inquietudine pervade le cinque tracce del disco, che con sottile spirito autoflagellatorio, si dipana tra visione Xela/Ktl, privilegiando atmosfere che sanno di apocalisse imminente.  \r\nNon ci sono spiragli di luce né momenti di rilassamento, in quanto il disco è giocato su suoni perennemente esplosi, portatori di una tensione spasmodica. Particolarmente malsane nel loro incedere Striborg-style l’iniziale “Tired Eyes” e la lunghissima quanto estenuante “Big Black Meteoric Star”. Da far tremare i polsi.\" \r\n(ONDAROCK)\r\n\r\n\"Key subterranean figures Brad Rose and Nathan young team up on this dense, darkly pyschedelic release, clashing together extreme guitar and electronic textures across fivehead-spinning tracks. At its most intense, as on 'Big Black Meteroic Star', the Ajilvsga sound shifts into the domain of Hototogisu and Yellow Swans (in fact, Pete Swanson of the latter outfit is in hand for mastering duties), yet elsewhere 'Realm Of Light' is a thing of peculiar stillness and murky tranquility. Even so, menace is always lurking beneath every surface, meaning 'Rawa' comes across like a distant echo of black metal drone and 'Leviathan Vanquished' manifests itself as a strangely tuneful network of feedback tones. Recommended.\"\r\n(BOOMKAT)\r\n\r\n\"L’occhio/orecchio lungo di Valerio Cosi si dimostra eccellente anche quando non si tratta di comporre musiche o scegliere collaborazioni e/o etichette, quanto di mettere su un proprio angolo di paradiso sotto forma di label. Una delle prime uscite della Dreamsheep è Medicine Bull di Ajilvsga; per chi non li conoscesse, il moniker sotto il quale si nascondono calibri del peso di Nathan Young e Brad Rose. Quest’ultimo dimentica per un momento – per modo di dire vista la sterminata discografia a nome Ajilvsga – le bucoliche lande solitamente toccate con The North Sea e si abbandona ad un grumoso mostro droning dall’appeal ritualistico-black metal e dalla resa funesta e spietata.\r\nBoschi infestati, maschere e cappucci, teschi e magia nera, l’iconografia black d’ordinanza tutta riemergono in questo Medicine Bull tra i flutti disperati di drones sapientemente prodotti da Pete Swanson. E se nel finale, negli struggenti 10 minuti di Leviathan Vanquished si provvede ad un barlume di luce seppur sepolto sotto una cappa di malinconia, nell’incipit del disco – i 21 mortali minuti di Big Black Meteoric Star – non c’è altro che devastazione, implosioni, nichilismo. Per chi scrive, uno dei migliori momenti della discografia a nome Ajilvsga.\"\r\n(SENTIREASCOLTARE)","options":[{"id":36100623,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.5,"amount_with_others":1.5,"country":{"id":23,"name":"Italy","code":"IT"}},{"amount_alone":3.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/112856814/-/Medicine-Bull-cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/112856814/-/Medicine-Bull-cover.jpg","width":427,"height":427}],"artists":[{"id":205716,"name":"Ajilvsga","permalink":"ajilvsga","url":"/artist/ajilvsga"}],"categories":[{"id":5419833,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":11455707,"name":"Hexlove - \"Piją Z Bogiem\" 2xCD - DS006","permalink":"hexlove-pija-z-bogiem-2xcd-ds006","position":5,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/hexlove-pija-z-bogiem-2xcd-ds006","status":"active","on_sale":true,"created_at":"2013-05-29T21:19:19.000Z","description":"Listen to this album on Spotify: http://spoti.fi/12j6vm9\r\n\r\n<iframe src=\"https://embed.spotify.com/?uri=spotify:album:3ddfx7zoUMrQoGY5hSyG98\" frameborder=\"0\" allowtransparency=\"true\" width=\"400\" height=\"480\"></iframe>\r\n\r\n1-1\t\t Rock Yourself Out Chah Body\t\t\r\n1-2\t\t Verse Coarse\t\t\r\n1-3\t\t New Quote Lyar\t\t\r\n1-4\t\t Herb\t\t\r\n1-5\t\t Hickory\t\t\r\n1-6\t\t Gamork\t\t\r\n1-7\t\t Relax, Live\t\t\r\n1-8\t\t Voomers\t\t\r\n1-9\t\t Scared Of Hate\t\t\r\n1-10\t\t Web Circle Spiral Dust\t\t\r\n1-11\t\t The Lake Dies Twice\t\t\r\n1-12\t\t Your Ning And Pressing Play\t\t\r\n1-13\t\t Boss Quiet\t\t\r\n2-1\t\t She Heals Blister\t\t\r\n2-2\t\t I Have Flight\t\t\r\n2-3\t\t Tropical Boom 3\t\t\r\n2-4\t\t Mocking Bird Totem\t\t\r\n2-5\t\t Mahd\t\t\r\n2-6\t\t Tropical Boom 5\t\t\r\n2-7\t\t Grandpa Okonski's Perpetual Motion Magnet Generator\r\n\r\n\r\nPress Release:\r\n\r\nBeefheart or Eno? Magnetic Fields or Tricky? - Zac Nelson (see his releases on Holy Mountain and Temporary Residence...) comes from Illinois and his way to create music is pretty unique. Divived between impressive instrumental sections, gorgeous almost-feminine vocal parts, explosive drum skills and beautiful melodic inventions, Nelson shows the widest musical range and the best inspiration we ever tasted recently in the underground/indie scene. This is the second CD release from him - a wonderful collection of songs, drum-obsessed jams and crazy pop sketches. Here is an absolutely brilliant manifesto of his art.\r\n\r\n\r\n\r\n\r\n\r\nPraise for the album:\r\n\r\n\r\n\"Ant here with a very nice opener from Hexlove. This double CD 'Pija Z Bogiem' is the work of Holy Mountain/ Temporary Residence artist Zac Nelson and it's a most pleasant listening experience. It's strange, backwards indie pop music that is simultaneously experimental and accessible. The vocals on the tracks are really unique using lots of effects and with the processing they take on a genderless ghostly quality. There's a wonderful sense of melody running throughout some of the pieces. What a talented writer and musician this guy is. Some of the tunes really evolve and switch dynamics in gloriously en-expected ways. 'Herb' for example just builds in intensity with the drums going beserk and then lots of great synth sounds and squelches. This is a brilliantly unique body of work but if pushed for any reference points think of the early more experimental Animal Collective vocals, the campfire feel of Akron/ Family, Sun Ra cosmik freak out gear and some primal tribal styles. This balances both dark and light elements to create a magical and tripped out listen. This comes highly recommended on Italian label Dreamsheep.\"\r\n(NORMAN RECORDS - UK)\r\n\r\n\"This loose little gem, filled with spontaneous liberties, speaks in tongues— and makes for a rewarding experience.\r\nThe eclectic Pija Z Bogiem, released on Valerio Cosi's new Dreamsheep label— and which follows in the footsteps of 2008's Knew Abloom on the Holy Mountain label— is a cleverly spastic ride. Its mastermind and sole performer, the loosey goosey Zac Nelson, has managed to create a disjointed affair which continually feels like the music is mining a path of its own, from the subconscious directly to the recording device, entirely fueled by in-the-moment expressions and anxious emotions. It's clear the artist is just waiting to self-implode-explode, but never actually gets there, either deliberately or otherwise— which makes for an instantly rewarding experience.\r\nBecause this double disc feels dramatically spontaneous, there are few ways to easily describe a slippery, translucent album like Pija Z Bogiem. Maybe the fact that California-based Nelson is first and foremost a drummer in both Who's Your Favorite Son, God? and Prints has something to do with it. His unconventional and unformulated tendencies certainly strike a chord, and often unravel like guitar decortications, far away from textbook hallucinations. Overall, many of the tracks totter between manic melodic molasses and restless intuitive jambalaya— from the warm off-kilter psychedelic to the drunkenly rhythmic. Either way, this is worth investigating and discovering for yourself, it really is.\"\r\n(PANPOT.CA)\r\n\r\n\"Già attivo con un disco su Holy Mountain Records, “Knew Abloom”, dell’anno scorso, Zac Nelson aka Hexlove è uno che fa musica pop senza canzoni. Eh sì,  ricordo che nel forum di OndaRock c’era un topic in cui qualcuno chiedeva se fosse mai stato possibile fare musica pop “senza le canzoni”, in riferimento al disco dei Pit Er Pat. \r\nIl buon Nelson ci dimostra che ciò è possibile, come? Utilizzando la ripetizione, gli arrangiamenti e persino le parti melodiche in modo inusuale, creando discrasie e contrasti tra elementi che altrimenti incastrati suonerebbero in tutto e per tutto pop. Spigoli invece di rotondità, frammentazioni invece di continuità, svirgolature quand’anche l’incedere melodioso pare non averne bisogno (ma in realtà ne ha bisogno eccome…). Eppure l’impasto suona gradevole all’ascolto, tanto che i due cd (sì, è un doppio) scivolano via che neanche te ne accorgi.\r\nAlcuni pezzi (“Herb”, Gamork”) poi sono da incorniciare in quanto a inventiva, con l’elettronica usata in modo intelligentemente non invasivo. Se imparerà a dosare meglio le idee (sin troppo debordanti in alcuni frangenti) diventerà un grande.. \r\nGli ultimi e disastrosi Animal Collective dovrebbero imparare qualcosa da questo disco. Ah, dimenticavo, \"Pija Z Bogiem\" è uscito per la Dreamsheep di Valerio Cosi.\" \r\n(ONDAROCK)\r\n\r\n\"Ci sono artisti che sfuggono alle classificazioni e rifuggono dall’essere riconoscibili preferendo percorsi musical-artistici trasversali e misteriosi. Zac Nelson a.k.a. Hexlove fa indubbiamente parte di questa categoria.\r\nAutore di una serie di dischi per etichette come Holy Mountain e Temporary Residence sia in solitario come Hexlove che con altri progetti come Prints e Who’s Your Favorite Son, God?, Nelson sembra essersi ormai stabilizzato con l’attuale moniker. Ciononostante, Nelson ama confondere ulteriormente le acque con altri aka come Faulouah, col quale aveva prodotto lo scorso anno un doppio vinile split, in pratica con se stesso, sdoppiandosi tra i due moniker.\r\nQuesto doppio Pija Z Bogiem vede la luce per Dreamsheep, etichetta di un altro personaggio trasversale e al limite del geniale, Valerio Cosi che i lettori di SA ormai dovrebbero conoscere abbastanza bene. E proprio come Cosi, seppur in ambiti stilistici diversi, Hexlove dimostra maturità invidiabile nella commistione di generi e stili, con un approccio realmente personale e sviluppando un muoversi spastico, al limite dell’autistico tra input diversi e variegati. Quelle di Hexlove sono pop-songs, ma non ortodosse, bislacche, post-moderne, testimonianza di un universo musicale in perenne e irrefrenabile espansione. Prendete Herb come pietra di paragone per l’intero album: french sound a la Air + Spacemen 3 + svisate drum&bass in continua acelerazione/decelerazione che si protrae per 15 minuti, inducendo ad una sorta di trance mutante, metà psych-folk, metà electro-digitale.\r\nGran bel disco. Di quelli che uno si aspetterebbe nelle classifiche di fine anno se solo ci fosse ancora la voglia e il tempo – in tempi di sovraffollamento musicale – per “rischiare” un ascolto impegnativo. Noi abbiamo rischiato senza pentirci assolutamente.\" \r\n(SENTIREASCOLTARE)\r\n\r\n\"As major labels continue to exist behind the times, artists and labels with little capital and lesser reputations are producing some of the most innovative, interesting, and inspiring music. Whether it’s creating a new niche in digital technology or looking to once obsolete formats, Agitated Atmosphere hopes to shed a bit of light and share a bit of information on the up and coming sounds of artists such as Hexlove.\r\nThe music of Zac Nelson -- if the term music is really the best descriptor -- engages the mind like brain freeze. It’s fast, cool, and refreshing but the quicker you slurp it through the crazy straw, the more your skull begins to pound and your senses become dull to everything but the piercing throb of slush and cream invading your temperate tubes. The more you try to fight it, the more it beacons. You could try slowing down on your ice cream based treat but if it melts, then so does the delightful cold taste that was the impetus for seeking this particular sweet. So goes Portland-by-way-of Southern Illinois melodymaker, Nelson -- better known by his menu name, Hexlove.\r\nWith a treasure trove of small releases under his belt, it happens that Piją Z Bogiem, his second proper full-length released via free jazz frontiersman Valerio Cosi’s Dreamsheep label is his most ambitious and skull-pounding mess of Neapolitan, sprinkles, syrup, slush, and nuts to date. Over the course of 20 songs on two discs, Nelson makes a raucous that blends the pop ambition of Ariel Pink and R. Stevie Moore with the far-out compositions of Frank Zappa and Mark Tucker. Piją Z Bogiem succeeds where like-minded contemporaries, such as Quinn Walker’s equally ambitious but not near as perverse double disc Laughter’s An Asshole/Lion Land crashed and burned. Walker was quick to reign in his ambling, choosing to focus on accessibility rather than the art of creation. Nelson dives head first into the loony bin, collecting every bit of dumpster scrap to fashion his music visions. There are times where it will find you rubbing your forehead in anguish, but more often than not Nelson’s ritualistic recordings will create involuntary loss of motor skills in the most delightful and organic way. Piją Z Bogiem is the ultimate mash-up; layers of instrumentation, samples, loops, and drones compete for center stage only to magically meld into one uniform thought. It’s the next evolution of pop. Nelson forgoes pretense in favor of rhetoric and somehow it holds together. There are moments of annoyance, such as “Scared of Hate,” and “Rock Yourself Out Chah Body,” but more often than not Nelson hits the mother of all sundaes. “She Heals Blisters,” “Web Circle Spiral Dust,” “Relax, Live” and the 15-minute “Herb” will all command repeated listens with their knob-turning distortions, isolated vocals, and tribal rhythms. Piją Z Bogiem is the blueprint for the next batch of pop innovators to follow -- if only they can stop the album long enough to create.\" \r\n(Justin Spicer - TINY MIX TAPES / AGITATED ATMOSPHERE)","options":[{"id":36094818,"name":"Default","price":13.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.5,"amount_with_others":1.5,"country":{"id":23,"name":"Italy","code":"IT"}},{"amount_alone":3.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/112742658/-/hexlove-1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/112742658/-/hexlove-1.jpg","width":336,"height":336}],"artists":[{"id":205701,"name":"Hexlove","permalink":"hexlove","url":"/artist/hexlove"}],"categories":[{"id":5419833,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":11457294,"name":"Black Motor - \"Vaarat Vastukset\" CD - DS007","permalink":"black-motor-vaarat-vastukset-cd-ds007","position":6,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/black-motor-vaarat-vastukset-cd-ds007","status":"active","on_sale":true,"created_at":"2013-05-29T22:51:47.000Z","description":"Listen to this album on Spotify: http://spoti.fi/10IHBpx\r\n\r\n<iframe src=\"https://embed.spotify.com/?uri=spotify:album:4E4Ioko9NkITWYpSB4mK5h\" frameborder=\"0\" allowtransparency=\"true\" width=\"400\" height=\"480\"></iframe>\r\n\r\n\r\n1\t\t Yksi Sinulta Puuttuu\r\n                 Written-By – Black Motor (10:59)\t\r\n2\t\t Hard Man Anthem\r\n                 Written-By – Sami Sippola (5:30)\t\r\n3\t\t Aamen\r\n                 Arranged By – Black Motor, Jukka Orma\r\n                 Written-By – Sami Sippola (5:43)\t\r\n4\t\t Vaarat Vastukset \r\n                 Written-By – Ville Rauhala (7:52)\t\r\n5\t\t Alma\r\n                 Written-By – Ville Rauhala (6:06)\t\r\n6\t\t Vainila\r\n                 Written-By – Ville Rauhala (6:57)\t\r\n\r\nCredits\r\nArranged By – Black Motor\r\nDouble Bass, Bells, Voice – Ville Rauhala\r\nDrums, Bells, Gong, Flute [Bamboo], Voice, Artwork By – Simo Laihonen\r\nMixed By [Additional], Recorded By [Additional], Edited By [Additional] – Juha Timonen\r\nMixed By, Recorded By – Jussi Suonikko (tracks: 3, 4, 5, 6), Laura Jaatinen (tracks: 1, 2)\r\nPhotography – Anonymous\r\nPhotography, Mastered By – Jussi Suonikko\r\nSaxophone [Tenor], Saxophone [Mouthpiece], Voice – Sami Sippola\r\n\r\nNotes\r\nRecorded at Pyynikki Hall, Tampere 9 December 2007 (1 & 2) and at Old Väs, Tampere 11 March 2008 (3, 4, 5 & 6).\r\n\r\n\r\nPress release:\r\n\r\nThey hark back to New Thing sounds and Organic Music Society with tons of intelligence and no bad revisionism. They are \"black\" in the ice. They are not free-folk. They are a trio from Tampere (Finland) comprised of Sami Sippola (saxophones), Ville Rauhala (double bass/electric bass) and Simo Laihonen (drums). They revealed their wonderful skills and jazz abilities through a QBICO vinyl in late 2007. They've made the second greatest album, a timeless jazz recording full of sensational moods. They won't let you escape from such tremendous beauty...\r\n\r\nPraise for the album:\r\n\r\n\"It's always nice to start the week off with a bit of chamber jazz. Especially when the chamber's a torture one and it contains a trapped Austrian girl whose mouth has evolved into a plaintively wailing saxophone over the course of many lonely years. Vaarat Vastukset is Black Motors' follow-up to the LP they did a while back on Qbico (look at me pretending I've heard of these before) and it's a pleasantly dour clunk n' scrapealong noodlefest guaranteed to give any listening avants hard-ons. It does brighten up from time to time, taking a more traditional (though still highly freeform) approach to prove they've got the chops to know what the rules are and exactly how they're breaking them.. Although I do always like the idea of punk-jazz played by people with no skill whatsoever. It's a 'recommended' from me, particularly loving the bit towards the end of the first lengthy track where a tribal beat kicks in unexpectedly to form up the chaos.\"\r\n(NORMAN RECORDS - UK)\r\n\r\n\"Given the menacing group name and the cover’s dour processional, I’ve got to say I expected a little more doom and gloom from Black Motor. And while much of the music here does have a chaotic and somewhat sorrowful slant, it is done so in a more refined and traditionally bluesy angle as the unit explores the six original compositions within.\r\nIn fact, Black Motor has little to do with Black Sabbath or Motorhead and everything to do with “Yasmina, a Black Woman.” A trio comprised of Sami Sippola, Ville Rauhala and Simo Laihonen, the group pushes the boundaries of post post-fire improvisational discourse on this disc, mixing equal parts AACM, Albert Ayler and Pharaoh Sanders while infusing their sound with a textural, ritualistic approach that manages to carve out their own corner in the free jazz world.\r\nOne of the units main strengths is their willingness to pull at will from any number of instruments. Ranging from the expected (tenor sax, double bass, drums, voice) to the underused (bells, gong, bamboo flutes) the group explores an open and fertile dialogue driven by more by mood than mode. Perhaps this is no more clearly visible than on the opening “Yksi Sinulta Puutuu,” whose gentle bamboo flutes begin the album atop clattering chimes and a scraping double-bass. It’s an odd combination of sounds, the flute as smooth and fragile as it is and the bass as grating, but each addition serves to amount into a confusing playfulness underlined by Sippola’s screeching sax utterances.\r\nElsewhere the group explores more overtly melodic material, as with “Aamen,” whose saxophone line sounds like a military call that walks the line between Ornette Coleman’s momentum and Ayler’s own marching excursions. At times his tone even resembles early Gato Barbieri, raspy and deep but nimble as well as it bounces along atop Rauhala and Laihonen’s explosive rhythmic backing.\r\nOn the closing “Vainila,” the group once again highlights their strength for subtly stretching improvisational vocabulary as a snaking bass squeal writhes above a dancing drum rhythm and sax bellow. For a group like this it’s tough to say anything new, and indeed this is hardly a redefinition of the forms they’re working in. But these players have such simpatico and are so well versed in their dialogue that it’s tough not to forget how much fun and how listenable this kind of music can be. It is this ability to intermix the more interesting explorative sound excursions with strong compositional material that positions Black Motor as an important and under-known presence in today’s free jazz community.\" \r\n(FOXY DIGITALIS)\r\n\r\n\"Finland. Jazz. Not exactly a combination that was self-evident when I found this assignment in my virtual office tray - Scandinavian neighbors Sweden have a far more notable (fusion) history in this field to my knowledge. But at first listen it becomes rather apparent that the colorful bunch that makes up Black Motor isn't all that intelligible, nor is the brand of jazz they bring on Vaarat Vastukset.\r\nWhile the sax, drums and upright bass are the base of Black Motor's sound, they've expanded their instrumentation with some of the finer weirdling background-fillers such as strings of bells and chimes, flute, chants and mantras. As a whole, this album is one you're not likely to use when you like a jazzy vibe over Sunday brunch; this album is ideal for the late nights, when the level of Jack Daniels drops under it's label and conversations are limited to a few strenuous \"yeahs\" (or other states of low brain-activity). As such, Vaarat Vastukset works very well for those experienced in the field of mind-altering music, with its lengthy episodes of krautesque jazz explorations.\r\nNow don't get me wrong, if the jazz department of your collection only contains a Miles Davis collection box and a Best Of John Coltrane, this might still push your buttons in the right order. Throughout the album, the experimental jazz approach prevails but still offers mellow resting areas and groovy bits of \"drunken rhythms;\" one even encounters some parts the listener could hum along with after a few listens. Some of those intermezzos call the soundtrack Baise Moi to mind, or at least the closing four tracks composed by the hand of Jan Varou.\r\nIn all, if an experimental three quarters of an hour doesn't scare you off and you can handle your jazz, it is well worth checking out this album. The production is as organic and solid as you'd find it on late sixties- early seventies prog or krautrock albums. I realize that this album can take some effort on the listener's behalf at first, but it gains much in depth once you find your way in Black Motor's sonic universe.\"\r\n(THE SILENT BALLET)","options":[{"id":36100731,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.5,"amount_with_others":1.5,"country":{"id":23,"name":"Italy","code":"IT"}},{"amount_alone":3.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/112759122/-/R-1578216-1229780316.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/112759122/-/R-1578216-1229780316.jpeg","width":511,"height":507}],"artists":[{"id":205719,"name":"Black Motor","permalink":"black-motor","url":"/artist/black-motor"}],"categories":[{"id":5419833,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":11455302,"name":"Valerio Cosi - \"Plays Popol Vuh\" [PRE-ORDER] LP - DS009","permalink":"valerio-cosi-plays-popol-vuh-pre-order-lp","position":7,"price":13.5,"default_price":13.5,"tax":0.0,"url":"/product/valerio-cosi-plays-popol-vuh-pre-order-lp","status":"active","on_sale":true,"created_at":"2013-05-29T20:56:44.000Z","description":"","options":[{"id":36093462,"name":"Default","price":13.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.5,"amount_with_others":3.0,"country":{"id":23,"name":"Italy","code":"IT"}},{"amount_alone":11.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/112738230/-/parto.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/112738230/-/parto.jpg","width":690,"height":692}],"artists":[{"id":205695,"name":"Valerio Cosi","permalink":"valerio-cosi","url":"/artist/valerio-cosi"}],"categories":[{"id":5419833,"name":"Albums","permalink":"albums","url":"/category/albums"}]}]