[{"id":5916175,"name":"Sewing Pattern - Tilda Sash Skirt  (Sizes 1 to 8) - PDF Instant Downloadable Sewing Pattern","permalink":"pattern-tilda-sash-skirt-sizes-1-to-8-pdf-instant-downloadable-sewing-pattern","position":2,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/pattern-tilda-sash-skirt-sizes-1-to-8-pdf-instant-downloadable-sewing-pattern","status":"active","on_sale":false,"created_at":"2012-04-12T06:24:24.000Z","description":"Introducing our first sewing pattern release!\r\n\r\nWe are very excited to announce we will now to releasing a small range of sewing patterns available as PDF instant downloads to your computer.\r\n\r\nThis pattern for the 'Tilda Sash Skirt' is one of my favourites from Summer Collection 2011 that ran as our 'Day in the Park' Skirt. A simple drop waist skirt with sash that can be tied at the front, side or back.\r\n\r\nSewing level: beginner to intermediate\r\nSewing time: approx. 1 hour\r\n\r\nPDF Pattern Includes:\r\n*Fabric & haby item requirements to make the skirt in sizes: 1 - 2 Years, 3 - 4 Years, 5 - 6 years, 7 - 8 Years.\r\n*Full tutorial and step-by-step instructions with colour photos.\r\n*Pattern include simple measurements for you to create your skirt pattern pieces, there are no actual pattern pieces to print off and cut out - very easy!\r\n\r\nPlease note: you are purchasing an instant downloadable sewing pattern, not that actual skirt. You will be emailed the link to download the pattern once payment has been processed. You must download and save this pattern to your computer. The pattern can only be downloaded to a maximum of 3 times before the link expires, so please save to your computer. No refunds on sewing patterns.\r\n\r\nCopyright Note: All tillytom sewing patterns are for personal use or for the sale of handmade products in small quantities only by at-home businesses. Commercial use of this pattern or mass-production of this design is strictly prohibited. No part of this pattern may be reproduced, copied or altered in any way, in print form or electronically.","options":[{"id":18944271,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59627347/-/tilda_sash_skirt_photo_listing.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59627347/-/tilda_sash_skirt_photo_listing.jpg","width":750,"height":1000}],"artists":[],"categories":[{"id":3104347,"name":"Sewing Patterns","permalink":"sewing-patterns","url":"/category/sewing-patterns"}]}]