[{"id":6392337,"name":"Entry fee for RGV design contest","permalink":"sign-up-fee-for-rgv-design-contest","position":1,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/sign-up-fee-for-rgv-design-contest","status":"active","on_sale":false,"created_at":"2012-06-07T22:02:12.000Z","description":"Entry fee for contest. If you cannot pay through paypal or credit card you can also contact us to pay in cash or check. \r\n\r\nWhat you will do:\r\n-Create a design that will be put in a graphic tee if you win(1st, 2nd and 3rd place) or if you are an honorable mention it will be created into a poster, wall art or pin. \r\n-The Design can be of any topic; your imagination and creativity are the only things that will limit you.\r\n\r\nThe rules for the contest are simple:\r\n-ONLY 1 design per entry fee. If you wish to add another design please pay separately.\r\n-3 color limit (art or photography accepted)\r\n-size to be 15\" x 20\" or that can be adapted to this size\r\n-Adobe illustrator preferred but any format can be used.\r\n-You pick your choice of print if you win (standard or vintage)\r\n-Only open to RGV, texas. If you can be there when winner is announced then you may participate. \r\n\r\nWhat you will get:\r\n-exposure : Your design will be sold online and by local stores. The website will advertise you as a designer, artist or photographer.\r\n-You will earn  $ from each sale of your design.\r\n-You will then earn the possibility to work with us as long as you wish.\r\n\r\nAfter paying your fee you may upload your work any time at: www.facebook.com/paxclothing\r\n\r\nIf you don't win, don't worry, this will not be our first and only contest. There will be more in the future. Some will be focused in specific topics or like this open to any topic.\r\n\r\nWinner will be announced in a huge event on july after the 20th at McAllen, Texas. \r\n\r\n","options":[{"id":20362343,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/62818839/-/pax_logo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/62818839/-/pax_logo.jpg","width":361,"height":226}],"artists":[],"categories":[{"id":3252907,"name":"Tees","permalink":"tees","url":"/category/tees"}]}]