[{"id":2704125,"name":"Clarisonic Clarisonic Mia Sonic Cleansing System","permalink":"clarisonic-clarisonic-mia-sonic-cleansing-system","position":1,"price":90.0,"default_price":90.0,"tax":0.0,"url":"/product/clarisonic-clarisonic-mia-sonic-cleansing-system","status":"active","on_sale":true,"created_at":"2010-08-17T03:33:14.000Z","description":"All the great benefits of the Clarisonic Classic in a new, smaller size. The perfect compact cleansing system for use at home or on the go. Mia is the new, go-anywhere Sonic Skin Cleansing System in a great compact size. The one-button, one-speed Mia fits your active lifestyle for beautiful, glowing skin wherever life's adventures take you.\r\n\r\nGet super smooth, luminous skin no matter where you travel with Clarisonic Mia Sonic Skin Cleansing System. It gives all the benefits of your favorite Clarisonic Skin Care System in a new, compact size. This unique system is designed to refresh, rejuvenate, and revive a beautiful complexion with each use.\r\n\r\nEach Clarisonic Mia system contains the Gentle Hydro Cleanser (1 fl. oz.), Sensitive Brush Head, compact pLink International Charger, U.S. plug, and the Cordless Clarisonic Mia.\r\n\r\nBenefits:\r\n\r\n    * More than 2x as effective as manual cleansing.\r\n    * 6X more makeup removal.\r\n    * Leaves skin feeling and looking younger and smoother.\r\n    * Increases product absorption.\r\n    * Clarisonic Mia Sonic Cleansing System is gentle enough for use twice daily.\r\n    * Reduces the appearance of fine lines and wrinkles.\r\n    * Helps reduce oily areas, dry skin patches and blemishes.\r\n    * Helps reduce the appearance of visible pores.\r\n    * Clarisonic Skin Care Brush System is waterproof.\r\n    * Brush heads are interchangeable with other Clarisonic Skin Care Systems.\r\n    * Suitable for use with any non-abrasive cleanser.\r\n    * Suitable for all skin types.\r\n    * Used and recommended by skin care professionals.\r\n\r\nYour Clarisonic Mia Skin Care Brush System Includes:\r\n\r\n    * Cordless Clarisonic Mia\r\n    * Compact pLink™ International Charger\r\n    * Sensitive Brush Head\r\n    * Gentle Hydro Cleanser, 1oz trial size\r\n\r\nWho it's for:\r\n\r\n    * Ideal for those of all skin types who want a bright, soft, and beautiful complexion.\r\n \r\nHow to use it:\r\n\r\n    * Please read the Clarisonic User Guide completely before using your Clarisonic Skin Care System. Wet your skin and the brush head with water. Apply cleanser to your skin. Place the brush head on your skin and turn on brush. Using small circular motions and a light amount of pressure, gently cleanse your skin. Use the convenient one minute automatic timer for your face. You may restart the system for an additional cycle if needed.","options":[{"id":9516027,"name":"Pink","price":90.0,"sold_out":false,"has_custom_price":false},{"id":9516028,"name":"Blue","price":90.0,"sold_out":false,"has_custom_price":false},{"id":9516029,"name":"Yellow","price":90.0,"sold_out":false,"has_custom_price":false},{"id":9516030,"name":"White","price":90.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/26084224/-/MiaNewColorsLG-NEW2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/26084224/-/MiaNewColorsLG-NEW2.jpg","width":660,"height":386}],"artists":[],"categories":[{"id":1614726,"name":"Skin Care","permalink":"skin-care","url":"/category/skin-care"}]}]