[{"id":1652881,"name":"Mineral Clay Bath","permalink":"mineral-clay-bath","position":1,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/mineral-clay-bath","status":"active","on_sale":true,"created_at":"2010-02-19T06:13:23.000Z","description":"Clay Mineral Baths nourish the body and soul, baths are particularly nutrient, and your skin will benefit from the soak in a tub of goodies. Mineral Mud Baths are packed full of zeolite minerals, clays, 100% Pure Essential Aromatherapy oils. So soak your worries away in this favourite body treatment.\r\n\r\nMud baths originated hundreds of years ago. It is said that Cleopatra pampered herself in mud baths with mud from the Dead Sea. Today, people flock to spas to immerse themselves in the thick substance that rejuvenates their mind, body and soul. \r\n\r\nA mud bath offers both physical and mental benefits. It detoxifies the skin of chemicals, exfoliates and softens the skin, clears up acne, relieves tension and stress, and has been known to help with arthritis. It also offers relaxation and rejuvenation of the mind and body. \r\n\r\nHealth Benefits\r\nBicarbonate and carbon dioxide gases are thought to increase blood circulation by opening up the blood vessels, and treat hypertension and hardening of the arteries. Increased blood circulation means that more oxygen is delivered to the cells improving their performance. \r\nMineral baths are often recommended when recuperating from surgery. Dissolved mineral salts and sulphur compounds in the mud are used to treat skin inflammations such as eczema and psoriasis, as well as reduce stiffness and inflammation in joints due to osteoarthritis and rheumatoid arthritis.\r\n\r\nFor The Mind\r\nMineral baths may benefit the endocrine system as well, simply by allowing the body to fully relax over a period of time. The adrenal glands produce stress hormones such as adrenaline. Under conditions of chronic stress, they work overtime, which throws the endocrine system out of balance. By soaking away stress the workload of the adrenal glands is decreased, restoring balance to the endocrine system.\r\n \r\nMade from pure 100% aromatherapy essential oils and all natural ingredients derived from mother earth.\r\n\r\nAvailable in the following blends;\r\n\r\nEarth Mineral Clay Bath - 250 grams\r\nA blend of Aussie Pink Spa Minerals, White Clay\r\ninfused with a copious amount of nourishing botanicals such as Rosemary & Dried Walnut Shells, combined with 100% pure essential aromatherapy Cedarwood, \r\nLavender, Angusitifolia, Lemon, Frankincense &\r\nRosemary Oils. \r\n\r\nVitality Mineral Clay Bath - 250 grams\r\nA Blend of minerals and clays with Rosemary & Dried\r\nLavender Buds which is combined with 100% pure \r\nessential aromatherapy Lavender, Mandarin, Patchouli, Peru Balsam & Rose Oils. \r\n","options":[{"id":6031201,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.5,"amount_with_others":3.5,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/15739351/-/Vitality_Mineral_Clay_bath.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/15739351/-/Vitality_Mineral_Clay_bath.jpg","width":1000,"height":750}],"artists":[],"categories":[{"id":1024061,"name":"Mineral Clay Bath","permalink":"mineral-clay-bath","url":"/category/mineral-clay-bath"}]},{"id":1652931,"name":"Bath Milk - Handmade using aromatherapy oils","permalink":"bath-milk-handmade-using-aromatherapy-oils","position":2,"price":11.95,"default_price":11.95,"tax":0.0,"url":"/product/bath-milk-handmade-using-aromatherapy-oils","status":"active","on_sale":true,"created_at":"2010-02-19T06:17:26.000Z","description":"Milk has been used to clean and nourish skin for centuries. It is believed that Cleopatra used to bathe herself in camel’s milk quite frequently. Taking a milk bath is one of the easiest ways to improve the look and feel of your skin almost instantly. Milk bath also contains the added benefits of sea salts, Epsom salts and 100% pure aromatherapy oils.\r\n\r\nFor The Skin\r\nMilk is incredibly beneficial for the skin in many different ways.\r\nIts various ingredients serve a multitude of skin-improving purposes. \r\nMilk also contains fat and proteins that provide the Skin with a softer, suppler feeling. \r\nPart of the reason milk works wonders for skin is because it contains different kinds of acids. Don’t be frightened by the word “acids,” because the kind contained in milk is mild. The alpha hydroxy acid contained in milk, called lactic acid, acts as a gentle cleanser for skin. After having a milk bath, your skin will feel smooth, fresh and supple.\r\n\r\nThis is because milk contains fats and proteins that help in making your skin supple and soft. It has been found that a milk bath can also help in soothing skin irritations caused by skin infections like eczema.\r\n\r\nExfoliation\r\nAnother naturally occurring acid in milk is a beta hydroxy acid which acts is an excellent skin exfoliant. Exfoliation is extremely important when it comes to skin care. Removing the old skin cells makes way for the newer, more vibrant skin underneath to shine through\r\n\r\nStress Relief\r\nA milk bath can help in relaxing and re energizing you, especially with the added benefits of 100% essential and aromatic oils in it. It is for this reason that a milk bath is very common in spas as it relaxes your tired skin.\r\n\r\nA regular use of milk bath can help in improving the quality of your skin as it helps you achieve a soft, radiant and a youthful skin. In addition, this small act of luxury is also a great way to relax and rejuvenate your tired skin and body.\r\n\r\n\r\nMade from pure 100% aromatherapy essential oils and all natural ingredients derived from mother earth.\r\n\r\nAvailable In;\r\n\r\nUplift Bath Milk - 250 grams\r\nA blend of dried Lemon Myrtle, Oatmeal & \r\nAlmonds which is combined with 100% pure essential aromatherapy Ylang Ylang, Sweet Orange, White Grapefruit & Patchouli oils. \r\n\r\nInvigorating Bath Milk - 250 Grams\r\nA Blend with of dried Lavender Buds, Oatmeal & \r\nAlmonds with Lemon, Cedarwood, Petigrain, Sweet \r\nMarjoram, Lavender & Sandalwood Essential Oils.\r\n\r\n\r\nSPEND OVER $50 ON MY PRODUCTS AND RECEIVE FREE POSTAGE IN AUSTRALIA\r\n","options":[{"id":6031641,"name":"Default","price":11.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.5,"amount_with_others":3.5,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":7.5,"amount_with_others":4.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/15739911/-/Invigorating_Bath_Milk.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/15739911/-/Invigorating_Bath_Milk.jpg","width":1000,"height":750}],"artists":[],"categories":[]},{"id":1652961,"name":"Bath Salts - Handmade using 100% aromatherapy oils","permalink":"bath-salts-handmade-using-100-aromatherapy-oils","position":3,"price":9.95,"default_price":9.95,"tax":0.0,"url":"/product/bath-salts-handmade-using-100-aromatherapy-oils","status":"active","on_sale":true,"created_at":"2010-02-19T06:19:42.000Z","description":"Did you know that a simple soak in your bath provides a myriad of health and beauty benefits?? The secret to a beneficial bath lies in the bath salts you add to the water. Bath salts work by softening skin, drawing out impurities and soothing irritation. The benefits of bath salts have been known for centuries with sea salt being used as folk remedies for a variety of health issues, stimulating circulation, lowering blood pressure, relaxing muscles, relieving painful joints and removing toxins such as heavy metals from the body are just a few benefits and teamed with 100% pure essential aromatherapy oils the benefits are endless. \r\n\r\nFor the Skin \r\n\r\n\r\nOne of the biggest advantages of bath salts is their ability to detoxify, exfoliate and soften the skin. Bath salts open up pores for a thorough cleaning and detoxifying of the skin. Skin irritations like insect bites and abrasions are improved after a soak in a bath salt solution. Even more serious conditions such as athlete's foot and eczema experience relief with bath salts. \r\n\r\nFor the Blood \r\n\r\n\r\nAnother important benefit of bath salt is that it improves circulation throughout the body. When the blood is pumping at peak capacity, nutrients in the blood stream can get where they need to go more efficiently. The result is a healthier, more robust body. Increased circulation is also good for the skin, resulting in a healthy glow and a younger looking complexion. Maximizing blood flow also reduces inflammation and helps the body heal faster. To enjoy the full circulatory benefits of bath salts, take a relaxing soak in a salt bath. Take care not to make the water too hot, or it may raise your blood pressure and counter the advantages. \r\n\r\nFor the Muscles and Joints \r\n\r\n\r\nAnother important bath salt benefit is the relaxation factor. Soaking in a warm tub filled with bath salts releases tension in the body so muscles and joints relax. This is great therapy for those suffering with chronic back pain or arthritic conditions. It can also provide relief from sore muscles after a particularly vigorous workout. The key is to make the water as warm as possible and soak for at least 20 minutes at a time. A bath pillow, candles and soft music will complete the de-stressing process. \r\n\r\nFor the Feet\r\n\r\nno one said the benefits of bath salt are limited to the tub. You can also fill a small container of water with dissolved salt and soak your feet. Bath salt helps eliminate foot odour, smooth calluses and soothe conditions like athlete's foot.. \r\n\r\nMade from pure 100% aromatherapy essential oils and all natural ingredients derived from mother earth. \r\n\r\nAvailable In; \r\n\r\nDrifting Bath Salts - 400 grams \r\nA blend with organic Orange peel, Ylang Ylang, Sweet Orange, White Grapefruit & Patchouli pure essential oils. \r\n\r\nRefresh Bath Salts - 400 grams \r\nA blend with Dried Rose Buds & Fresh Rose Petals with 100% pure essential aromatherapy Rose oil. \r\nThis is a soft, sweet feminine mix will leave your skin soft, smooth & refreshed. \r\n\r\nRevitalise Bath Salts - 400 grams \r\nA blend with freshly dried lavender buds & Lavender essential oil. lavender is said to have a relaxing effect on the body, so this is a perfect way to unwind! \r\n\r\nFREE POSTAGE WITHIN AUSTRALIA IF SPENDING OVER $50","options":[{"id":6031971,"name":"Default","price":9.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.5,"amount_with_others":3.5,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":7.5,"amount_with_others":4.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/15740231/-/Drifting_Bath_Salts.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/15740231/-/Drifting_Bath_Salts.jpg","width":1000,"height":667}],"artists":[],"categories":[]},{"id":1653021,"name":"Spa Indulgence Salts - handmade using 100% aromatherapy oils","permalink":"spa-indulgence-salts-handmade-using-100-aromatherapy-oils","position":4,"price":11.95,"default_price":11.95,"tax":0.0,"url":"/product/spa-indulgence-salts-handmade-using-100-aromatherapy-oils","status":"active","on_sale":true,"created_at":"2010-02-19T06:22:03.000Z","description":"The Spa Indulge originates from many upmarket spas around the world, it is wonderfully moisturising with a mix of sea salts and Epsom salts along with 100% pure aromatherapy oils, the spa indulge has a lovely fizz to it and smells fantastic.\r\n\r\nOne of the main components to spa indulge is magnesium sulphate, which is easily absorbed by the skin. This is why soaking in a tub or spa can reap tremendous health rewards, from softening the skin to relieving stress.\r\n\r\nSalts change the osmotic balance of the water, so less water is absorbed and this reduces the “pruning” or “wrinkling” effect of prolonged exposure in the water.\r\n\r\nPain Relief\r\nMagnesium is a natural substance that can reduce inflammation and swelling in stiff joints and sore muscles. \r\nA Spa Indulge salt soak can also relieve the discomfort of minor sprains and bruises.\r\n\r\nExfoliation \r\nSalt is a wonderful ingredient for a skin scrub, and the healing properties of salts make this substance an excellent choice in a Spa Indulge. Exfoliation removes dead, dry skin cells, leaving smoother, younger looking skin underneath.\r\n\r\nFor The Feet \r\nA Spa Indulge soak can be especially beneficial to the feet. First, salt relieves sore, tired feet with a healthy dose of anti-inflammatory magnesium. The formula also effectively removes foot odours and softens the skin and you can eliminate dull, dry skin cells, leaving softer, smoother skin underneath.\r\n\r\nStress Relief \r\nOn top of easing tired muscles and creating a more beautiful complexion, Epsom salt relaxes the body from the outside in. magnesium is absorbed into the body during an Epsom salt bath, which can boost mood enhancing serotonin levels within the body. When the body is under stress, magnesium levels are depleted, so replenishing the body's supply is one of the first steps on the road to de-stressing and renewing the body.\r\nA long soak in a warm tub will also help relax muscles and provide mental relief from the day's pressures.\r\n\r\n100% Pure Indulgence\r\n\r\nMade from pure 100% aromatherapy essential oils and all natural I ingredients derived from mother earth.\r\n\r\nAvailable In;\r\n\r\nSensual Spa Indulgence - 250 grams\r\nA blend with Lavender, Mandarin, Patchouli, \r\nPeru Balsam ,Rose Oil, Dried Rose Buds & Petals.\r\n\r\nPure Bliss Spa Indulgence - 250 grams\r\nA blend with Cedarwood, Lavender, Angusitifolia, \r\nLemon, Frankincense & Rosemary Oils, dried \r\nCalendula Petals and lavender Buds.\r\n\r\nBorneo Relax Spa Indulgence - 250 grams\r\nA blend with Coconut, Lavender, Mandarin, \r\nPatchouli & Yarrow Oils combined with Dried \r\nRose Buds & Coconut.\r\n\r\nFREE POSTAGE ON SALES OVER $50 WITHIN AUSTRALIA","options":[{"id":6032021,"name":"Default","price":11.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.5,"amount_with_others":3.5,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":7.5,"amount_with_others":4.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/15740711/-/Pure_Bliss_Spa_Salts.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/15740711/-/Pure_Bliss_Spa_Salts.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":1024231,"name":"Spa Indulgence Salts","permalink":"spa-indulgence-salts","url":"/category/spa-indulgence-salts"}]}]