[{"id":4592829,"name":"Frances Ruffelle - Imperfectly Me CD","permalink":"frances-ruffelle-imperfectly-me","position":1,"price":8.99,"default_price":8.99,"tax":0.0,"url":"/product/frances-ruffelle-imperfectly-me","status":"active","on_sale":true,"created_at":"2011-10-08T19:28:00.000Z","description":"Imperfecly Me - featuring:\r\n# 01 Lucky Day\r\n# 02 It's All Right With Me\r\n# 03 Love Me For What I Am\r\n# 04 Hit Me With A Hot Note\r\n# 05 Alabama Song\r\n# 06 What Now My Love? - Et Maitenant\r\n# 07 Mr Monotony\r\n# 08 Do It Again\r\n# 09 Slap That Bass\r\n# 10 Before I Open My Mouth\r\n# 11 Mood Indigo \r\n\r\n\r\nAll songs performed by Frances Ruffelle\r\nProduced, recorded and mixed by Andy Strange\r\nExcept 'Lucky Day' produced by Jimmy Napes/Andy Strange\r\nAdditional recordings by Paul Fawcus\r\nMusical arrangements by David Barber\r\nMusical direction by Andrew Jarrett\r\nMastered by Michael Fayne\r\n\r\n\r\nGood news. As careers rise and fall, all around us, at the flick of the TV remote, there’s a place where the song still rules. It’s in the performance-steeped life and times of Frances Ruffelle.\r\n\r\nThe award-winning English vocalist and actress is the youngest and most vivacious entertainment veteran in town, having been in front of audiences just about all her life. Her new album Imperfectly Me is the perfect summation of a singular career, because it’s a set of extraordinary songs that came to life on stage. Even before you play it, the project exudes the ambience of a subtle but powerful perfume. It’s a record imbued with the desire to leave an impression on the room with its appealing aura, born not of airbrushed perfection but an enchantingly earthy realism.These are the songs of Frances Ruffelle’s life. They were created by such giants as Porter, Ellington and Weill, as well as by lesser-appreciated songwriting talents. But they were made hers and before she recorded them they were tried out with a big sound in an intimate setting, the famous Ronnie Scott’s jazz club in London. \r\n“After the gig at Ronnie Scott’s we recorded the album live in an old country house in Italy,” says Frances, “then we’ve gone back to London and added some additional production. But most of the vocals and instruments we’ve kept live, because I like them raw and passionate.”\r\n\r\nIt’s the perfect setting in which to re-appreciate such compositions as What Now My Love, Mood Indigo and Alabama Song, and perhaps to discover the lesser-known delights of Slap That Bass, Love Me For What I Am or Hit Me With A Hot Note. As long as they swing or sway or laugh or cry, as the singer might say in quotation of another track on the album, It’s Alright With Me.\r\n\r\n“I’m not trying to do cool jazz,” she says. “To be honest, I always loved the jazz standards of the great American Songbook and my idea was to re-interpret these classic songs for a new generation and keep them sexy, melancholy and passionate. \r\nI’m doing it because all the songs have good lyrics and stories.”\r\n\r\n“When I’ve liked an artist, it’s usually more to do with their visuals, their performance and their entertainment level. \r\nI fall in love with crazy artists, like Bette Midler, Elvis Presley, Judy Garland. Just absolute star-quality, charismatic artists.”\r\nMaybe it takes charisma to know charisma. Frances was hardly ever going to do anything other than entertain, coming into a family in which her mother, Sylvia Young, was the founder of the celebrated theatre school. \r\n\r\n“I was so much brought up around performing, it was just talked about all the time,” she remembers. “When I was seven years old, I was asked to sing with a jazz band. I never rebelled against it, but I wouldn’t say I was pushed into it either. I guess I was naturally quite good, and things went well for me.” \r\n\r\nThat’s an understatement. She hit the West End for the first time in a Rattigan play, The Sleeping Prince, then got her skates on to join Andrew Lloyd Webber’s Starlight Express before Les Misérables came calling. So great was the impression Frances made that despite a low profile beyond London theatre land, she was invited to reprise her role as Éponine when the musical opened on Broadway. The performance would win her a Tony Award, and the show would remain a big part of her life. \r\n\r\nFrances’ further stage adventures have ranged far and wide, from appearing with Ian Dury in Apples to playing Roxie Hart in Chicago. Her multi-faceted career has also included 2 solo albums Frances Ruffelle (1998) and Showgirl (2004) since 1994’s Fragile. \r\n\r\nBut no album has captured her spirit the way Imperfectly Me does. “I was asked to sing by the BBC Big Band,” she explains, “and it suddenly felt very comfortable with me, so that’s when I eventually got my own big band together. It felt like I was doing something that was true to me, to my upbringing.”\r\n\r\nThe watchwords, as ever in Frances Ruffelle’s vocation, are natural spontaneity. 2011 promises many live performances, and the chance for audiences to get intimate with one of the UK’s most widely-travelled and distinguished performers. \r\n\r\n“I think at one point I wanted to be quite cool,” she smiles. “Now I don’t give a damn. I just want to do what I love. I’m a performer, that’s what I do.” \r\n\r\n","options":[{"id":15026725,"name":"Default","price":8.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44981547/-/imperfectly_me.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44981547/-/imperfectly_me.png","width":468,"height":468}],"artists":[{"id":85777,"name":"Frances Ruffelle","permalink":"frances-ruffelle","url":"/artist/frances-ruffelle"}],"categories":[{"id":2159956,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":4592367,"name":"Holly Lamar - Eagle | V-Neck T-Shirt","permalink":"eagle","position":2,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/eagle","status":"coming-soon","on_sale":false,"created_at":"2011-10-08T16:29:08.000Z","description":"Available November 1.2011 - All Eagle shirts have custom tags. 50/50 poly cotton blend.","options":[{"id":15025399,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/45152797/-/eagle_front.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/45152797/-/eagle_front.png","width":572,"height":572}],"artists":[{"id":85651,"name":"Holly Lamar","permalink":"holly-lamar","url":"/artist/holly-lamar"}],"categories":[{"id":2159962,"name":"Tees","permalink":"tees","url":"/category/tees"}]},{"id":4586355,"name":"Holly Lamar - Eagle CD","permalink":"holly-lamar-eagle","position":3,"price":8.99,"default_price":8.99,"tax":0.0,"url":"/product/holly-lamar-eagle","status":"active","on_sale":true,"created_at":"2011-10-07T15:22:13.000Z","description":"On October 10th 2011 Holly Lamar releases the ‘Charity Single’ titled: Eagle. \r\nAll profits from CD sales and Publishing royalties will go to Wildlife Aid, particularly the Norfolk Botanical Garden and Wildlife Center of Virginia.\r\n\r\nSingle Format - 2 track Single CD. Cardboard sleeve & 12 pane folded poster\r\n\r\nEagle Credits:\r\nHolly Lamar - Vocals\r\nRobbie McIntosh - Guitar\r\nJames Hatcher - Guitar\r\nPaul Beard - Keyboard\r\nPino Palladino - Bass\r\nKarl Brazil - Drums\r\nDean Ross - Strings\r\n\r\nWritten by Holly Lamar & Dean Ross\r\nProduced by Holly Lamar\r\nRecorded, engineered & mixed by Andy Strange\r\nMastered by Michael Fayne\r\nRecorded at British Grove Studios (London) in September 2011\r\nEagle Artwork from photo courtesy of Duane Noblick","options":[{"id":15006209,"name":"Default","price":8.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.26,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44911499/-/eagle1.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44911499/-/eagle1.png","width":468,"height":468}],"artists":[{"id":85651,"name":"Holly Lamar","permalink":"holly-lamar","url":"/artist/holly-lamar"}],"categories":[{"id":2159956,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]