[{"id":10703817,"name":"\"Second Sight-The Fairy \"","permalink":"second-sight","position":1,"price":799.0,"default_price":799.0,"tax":0.0,"url":"/product/second-sight","status":"active","on_sale":false,"created_at":"2013-04-22T18:46:20.000Z","description":"Second Sight -The Fairy \r\n16 x 20\r\nOriginal Oil on Canvas\r\n\r\nI named this piece \"Second Sight\" after the term used by my Irish family members when someone can see the unseen.\r\n\r\nStory Behind the Painting:\r\n\r\nOnce upon a time I moved into an apartment with my 5 cats that bordered on a wooded ravine. I was experiencing a major life transition so to help me through it, I immersed myself in gardening and painting. I also did not have my TV hooked up, only a stereo. It really did feel like I took myself off the grid and into a creative and healing retreat. \r\n\r\nI noticed soon after moving in that I was not sleeping well and that I could feel strong energy coming out of my bedroom's walk-in closet. I kept waking up, sitting up in bed and staring at it. Then I began to be awakened at night and I would see and hear what seemed to be little children running around laughing. One night they even had red balloons(?) \r\n\r\nI slowly began to get the sense that they were not children at all. I had the sense they  liked my cats, the garden, paintings and me, but they did not want me to see them. They were checking me out for sure.\r\n\r\nIt was confirmed one night when for some reason I woke up suddenly. I did not sit up, but my eyes just popped opened. There I saw a female, sitting on the bed by my shoulder and gazing at me as I slept. When she saw that I was awake, but more amazingly, that  I could see her! \r\n\r\nShe looked all at once startled, surprised and alarmed. She immediately rifted or floated backwards without touching the ground so quickly it looked like special effects in a movie into the closet. There had been others in the room with her but all disappeared at the same time.\r\n\r\nThis is what she looked like; she was the height of a child maybe three feet tall. She had on a gray coat that had a gray furred collar and a gray hat with a grey furred rim, a lot like a Russian military uniform. Her eyes were catlike and her eyebrows very tufted and pronounced. Her ears looked like they may have been pointed. She did not look young, but did not look old either. \r\n\r\nShe inspired me to paint this, and I re-created her face here. The colors represent transparency and how Nature spirits can blend into the natural world around us. Not easily seen except by those with \"Second Sight\" or those they choose to allow to see them.\r\n\r\nI hope you enjoy her energy in this painting as much as I do. Anyone looking to connect deeper to the Nature realm will enjoy the magical energy that this painting creates around us.\r\n\r\n\r\n© Eileen Anglin www.whiterosepath.com","options":[{"id":33565653,"name":"Default","price":799.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":75.0,"amount_with_others":50.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127117191/-/secondsitecopyright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127117191/-/secondsitecopyright.jpg","width":758,"height":1000}],"artists":[{"id":247014,"name":"Eileen Anglin","permalink":"eileen-anglin","url":"/artist/eileen-anglin"}],"categories":[{"id":4971730,"name":"Original Oils","permalink":"original-oils","url":"/category/original-oils"}]},{"id":10305025,"name":"Soul Love","permalink":"soul-love","position":2,"price":2444.0,"default_price":2444.0,"tax":0.0,"url":"/product/soul-love","status":"active","on_sale":false,"created_at":"2013-04-02T16:57:03.000Z","description":"Eileen Anglin\r\n16 x 20 Oil on canvas\r\n\r\nThis is an original oil painting I created to celebrate Love in all it's forms. This painting also speaks to me of platonic love of friends, of soul mates, and of family. \r\n\r\nI feel this piece's image and message comes from a wiser, more loving place, you will feel the energy of that loving acceptance too. In your home, in your office or wherever you choose to bring \"Soul Love\" into your life. A perfect gift for your loved one, a marriage or just to say \"I love you\" to your partner.\r\n\r\nThe Story Behind The Painting:\r\n\r\nI was inspired by the challenges people were facing for same sex equality...while listening to David Bowie's song \"Soul Love.\" \r\n\r\nAfter hearing about the heart-tugging stories on marriage equality,  the David Bowie song \"Soul Love\" came on and it took me into that meditative trance that I can only describe as a download where a completed painting comes into my minds eye. I always know this has been sent to me from the Higher Realms. \r\n\r\n\r\nIt's available in print, invitations and note cards too. \r\n\r\nSoul Love\r\nCopyrighted Images Do Not Copy","options":[{"id":32841538,"name":"Default","price":2444.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":75.0,"amount_with_others":50.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127117644/-/rainbowlovecopyright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127117644/-/rainbowlovecopyright.jpg","width":877,"height":693}],"artists":[{"id":247014,"name":"Eileen Anglin","permalink":"eileen-anglin","url":"/artist/eileen-anglin"}],"categories":[{"id":4971730,"name":"Original Oils","permalink":"original-oils","url":"/category/original-oils"}]}]