[{"id":6067709,"name":"Copper Pyramid for Meditation, Relaxation & Healing (46\" Apex)","permalink":"copper-pyramid-for-meditation-relaxation-healing-46-apex","position":1,"price":145.0,"default_price":145.0,"tax":0.0,"url":"/product/copper-pyramid-for-meditation-relaxation-healing-46-apex","status":"active","on_sale":false,"created_at":"2012-04-30T18:58:42.000Z","description":"Copper portable meditation pyramid. Psychic sanctuary. Meditate in peace. Relax, heal, enlighten. Copper pipes, wire. Collapses to stow away. No assembly needed. Sets up in less than a minute. Start meditating right away.\r\n\r\n<b>Pyramid Dimensions</b>\r\nThis portable, copper meditation pyramid is made of half-inch, six-foot long copper pipes together with copper electrical wire. When set up, the top of the pyramid stands 46 inches above the floor, while the base of the pyramid measures approximately 6.5 feet on each side. At six feet tall, sitting with an erect spine, the top of my head clears the top of the pyramid by 11 inches.\r\n\r\n<b>Portable Pyramid Design</b>\r\nThis pyramid is designed for meditation, relaxation and healing. When set up, this skeleton of copper pipes and wires mirrors the angles of the Great Pyramid of Giza. The portable design allows you to store it away when not in use and set it up in a minute or less as needed. I started out building them entirely out of copper pipes, eventually developing this design for convenience and to hold onto it when moving from place to place. This pyramid was designed for practicality more than to be aesthetically pleasing, though the pyramid shape itself carries a great deal of magnetic appeal. I build each pyramid myself.\r\n\r\n<b>Pyramid Meditation, Healing</b>\r\nThere is a great deal of material written on the power of pyramids. In my own experience, it has been incredible. Developmentally, I have turned to them again and again. The energy of the pyramid is subtle and for a sensitive person, there is no doubt over its influence and value. It is both container and protector energetically. I will find refuge in it from negative thought-forms. I have discovered (and continue to discover) deeper more fundamental truths about myself and life in general. It has healed me both psychically and physically.\r\n\r\n<b>Pyramid Set Up and Cleansing</b>\r\nOpen the package and set up your new pyramid by simply stretching out the wires that form the base. Begin with an energetic cleanse by performing a blessing or smudging with sage (or both), then enter the peaceful realm of the pyramid. Revitalize, tune, and explore the deeper realms of self and awareness. I recommend including crystals and gemstones. Like adding bath salts to a bath, you can affect the nature of your meditation or healing experience. Either sit in your preferred position, or lie down and stretch out. I'm six foot tall and lying diagonally (see picture), the length of my body fits within the pyramid. Add a sleeping bag and sleep under it.\r\n\r\n<b>Shipping Information</b>\r\nShips in a durable PVC tube. Cost of shipping includes container with caps, USPS delivery and signature confirmation. Please allow up to three weeks.\r\n\r\nPlease feel free to ask me any questions.","options":[{"id":19384215,"name":"Default","price":145.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59573791/-/ddddddddddddd.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59573791/-/ddddddddddddd.jpg","width":570,"height":647}],"artists":[],"categories":[{"id":3171973,"name":"Meditation Pyramids","permalink":"meditation-pyramids","url":"/category/meditation-pyramids"}]}]