[{"id":8728037,"name":"Godfather Trilogy","permalink":"godfather-trilogy","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/godfather-trilogy","status":"active","on_sale":false,"created_at":"2012-12-30T19:22:57.000Z","description":"Collection of all three movies of the award-winning trilogy 'The Godfather', directed and co-written by Francis Ford Coppola and based on the successful novel by Mario Puzo. Beginning with 'The Godfather' (1972), in late 1940s New York, Mafia 'Godfather' Vito Corleone (Marlon Brando) gathers his three sons around him for daughter Connie (Talia Shire)'s wedding; the hot-headed Sonny (James Caan), ineffectual Fredo (John Cazale) and war hero Michael (Al Pacino), who chooses to distance himself from the family 'business'. When Vito is shot and wounded for refusing to sanction a rival family's heroin sales on his territory, Sonny temporarily takes over and embarks on bloody gang warfare. This results in him being killed in an ambush, and Michael finds himself nominated to succeed the ailing Vito. The film won three Academy Awards, including Best Picture, Best Actor (Brando) and Best Adapted Screenplay. In 'The Godfather: Part II' (1974), it is 1958 and Michael has now fully embraced the trappings of a mafia boss, leading to conflict with his wife, Kay (Diane Keaton). As he attempts to expand his crime empire, he thinks of his late father Vito's rise to power in New York during the 1920s, but all of Michael's attempts to emulate Vito and do the best for his family only pulls them further apart. Robert De Niro plays the young Vito in flashbacks to his early life. Both a prequel and sequel to the first movie, the film was nominated for eleven Oscars, winning five awards including Best Picture, Best Director and Best Supporting Actor (De Niro). Finally, in 'The Godfather: Part III' (1990), it is 1979, and Michael donates $100 million to the Vatican as a signal that his family intend to go legitimate. Unfortunately, the hot-headed Vincent Mancini (Andy Garcia), illegitimate son of Michael's late brother, Sonny, has taken an interest in both business affairs and Michael's daughter, initiating a violent and bloody power struggle. The film was nominated for seven Oscars, including Best Director, Best Picture and Best Cinematography.\r\n\r\n*Film will be sent via email*\r\n\r\n1080p Resolution HD","options":[{"id":27398258,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/85834709/-/godfather-coll02.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/85834709/-/godfather-coll02.jpg","width":450,"height":395}],"artists":[],"categories":[{"id":4300445,"name":"films","permalink":"films","url":"/category/films"}]},{"id":8727959,"name":"The Hobbit (2012)","permalink":"the-hobbit-2012","position":2,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/the-hobbit-2012","status":"coming-soon","on_sale":false,"created_at":"2012-12-30T19:17:41.000Z","description":"A younger and more reluctant Hobbit, Bilbo Baggins, sets out on a \"unexpected journey\" to the Lonely Mountain with a spirited group of Dwarves to reclaim a their stolen mountain home from a dragon named Smaug.\r\n\r\n*Film will be sent via email*\r\n\r\n1080p Resolution HD","options":[{"id":27398147,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/85834001/-/hobbiut.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/85834001/-/hobbiut.png","width":634,"height":929}],"artists":[],"categories":[{"id":4300445,"name":"films","permalink":"films","url":"/category/films"}]}]