[{"id":12326814,"name":"PUNK+","permalink":"punk","position":1,"price":49.0,"default_price":49.0,"tax":0.0,"url":"/product/punk","status":"active","on_sale":false,"created_at":"2013-07-12T10:57:03.000Z","description":"Sheila Rock's  collection of photographs of a cultural explosion caught in a time capsule.  This limited edition, signed collector's item includes beautiful colour shots of Jordan in SEX and Seditionaries,  Don Letts and Jeanette Lee in Acme Attractions and the original King’s Road Punks in 1976 before mainstream fashion overtook the spirit.  Sheila Rock has an renowned talent for recording spontaneous moments as shown in the previously unseen images she took at rehearsals for ‘the band that never was’ The Moors Murderers, featuring Chrissie Hynde and Steve Strange and other seminal events that shaped the musical landscape for years to come.\r\n \r\nPUNK+ acts as a who’s who of punk bands at the start of their careers – members of The Bromley Contingent become Siouxsie & The Banshees, Chelsea morph into Generation X;  youthful incarnations of The Buzzcocks, The Damned through to sessions with John Lydon as he forms his post-Pistols project Public Image Ltd.   The photos are linked with insightful commentary and interviews from those who were there – Paul Simonon, Don Letts, Jeanette Lee, Steven Severin, Steve Jones, Jon Savage – and of course Sheila herself.\r\n\r\nBound in a red linen hardback, limited to just 2000 copies worldwide, numbered and signed by Sheila. A great gift for any punk aficionado. ","options":[{"id":39105960,"name":"Default","price":49.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":9.5,"amount_with_others":9.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121198317/-/Book_Cover_Low_Res.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121198317/-/Book_Cover_Low_Res.jpg","width":574,"height":768}],"artists":[],"categories":[]}]