[{"id":2658219,"name":"Papaya Kojic Soap","permalink":"papaya-kojic-soap","position":1,"price":7.99,"default_price":7.99,"tax":0.0,"url":"/product/papaya-kojic-soap","status":"active","on_sale":true,"created_at":"2010-07-16T00:51:23.000Z","description":"Kojic acid soap is primarily an exfoliating skin soap that slowly gets rid of pigmentation and dark spots by buffing away the damaged skin cells revealing a whitened and clearer skin. The papaya enzymes in Kojic acid soaps help to break down the top layer of skin cells and peel away damaged skin, revealing the fresh and healthy cells underneath. This soap can be used as a regular bath soap all over the body, as a shaving foam for the face and neck, or just on the face to even out the skin tone.\r\n\r\n\r\nUsing Kojic acid soap on a regular basis may help reduce the appearance of age spots, blackheads/whiteheads, pimples, eliminate or reduce freckles, reduce or eliminate skin discoloration from pregnancy and strengthen cell activity. The soap is used by many Japanese men and women as part of their regular facial regimen so that the skin stays soft and vibrant. Kojic acid also has antibacterial and anti-fungal properties.\r\n\r\n\r\nFOR MAXIMUM RESULT: Leave 1-2 minutes before rinsing thoroughly in the morning and before bedtime. \r\n\r\n\r\nWarnings:\r\nKojic acid soap can be irritating to sensitive skin types and may cause redness, itchiness, inflammation and tenderness. It's important to use only a small amount on the arms as a trial to make sure the skin does not undergo an adverse reaction. Extra moisturizer and skin soothing serums may be necessary after using a Kojic acid soap, as these will replenish lost moisture and help the skin heal faster. People who use Kojic acid soap regularly need to avoid using skincare products that contain salicylic acid, alpha hydroxy or retinol, because these can aggravate the skin. Remember not to over use the product if you experience any discomfort or irritation. \r\n","options":[{"id":9382818,"name":"Default","price":7.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.99,"amount_with_others":1.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25622658/-/c6cb_12.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25622658/-/c6cb_12.jpg","width":500,"height":318}],"artists":[],"categories":[]},{"id":2658228,"name":"Seikisho Mask White","permalink":"seikisho-mask-white","position":2,"price":38.99,"default_price":38.99,"tax":0.0,"url":"/product/seikisho-mask-white","status":"active","on_sale":true,"created_at":"2010-07-16T01:03:09.000Z","description":"A peel-off, airtight black mask that effectively removes dirt and impurities to dramatically increase skin’s clarity and radiance. It also suppresses melanin production and prevents the formation of aging spots and freckles.\r\n\r\nSuppresses melanin production to prevent sun spots.\r\n\r\nTaking about 1 inch from the tube at a time apply a thick even layer to clean skin, avoiding the hairline, eye, and lip area. Wait 20 minutes or when completely dry, peel off gently from the outside in.\r\n\r\nHerbal Extracts: Coix Seed Extract, Angelica Extract, Moutan Bark Extract, Japanese Coptis Extract, Artemisia Capillaris Extract\r\n\r\n75mL/2.7 oz. \r\n","options":[{"id":9382847,"name":"Default","price":38.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25622758/-/seikisho_maskwhite.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25622758/-/seikisho_maskwhite.jpg","width":142,"height":287}],"artists":[],"categories":[]},{"id":2658231,"name":"Sekkisei White Liquid Wash ","permalink":"sekkisei-white-liquid-wash","position":3,"price":48.99,"default_price":48.99,"tax":0.0,"url":"/product/sekkisei-white-liquid-wash","status":"active","on_sale":true,"created_at":"2010-07-16T01:05:17.000Z","description":"Sekkisei White Liquid Wash \r\n\r\nA milky texture forms a rich, thick foam that envelops the skin and washes away dirt and impurities without stripping essential oils. \r\n\r\nApply 1-2 pumps into a wet palm, work into lather with lukewarm water. Wash gently over face and rinse well. \r\n\r\nHerbal Extracts: Rubus Suavissimus Leaf Extract, Coix Seed Extract, Akebi Extract, Angelica Root Extract, Scutellaria Baicalensis Root Extract \r\n\r\n140ml/4.7 oz \r\n","options":[{"id":9382850,"name":"Default","price":48.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25622802/-/sekkisei_liqwash.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25622802/-/sekkisei_liqwash.jpg","width":100,"height":290}],"artists":[],"categories":[]},{"id":2658237,"name":"Shiseido Bio-Performance Super Corrective Serum ","permalink":"shiseido-bio-performance-super-corrective-serum","position":4,"price":99.0,"default_price":99.0,"tax":0.0,"url":"/product/shiseido-bio-performance-super-corrective-serum","status":"active","on_sale":true,"created_at":"2010-07-16T01:11:26.000Z","description":"Reveal timeless skin in just one day. Specially formulated with a revolutionary new exclusive ingredient, Bio-Corrective Complex, this intensive serum prompts regenerative powers inherent in the skin and works to restore skin’s ability to produce collagen, elastin, and hyaluronic acid. Delivers powerful results and visible improvement from the first application. Time-fighting benefits intensify with daily use, bringing radiance and smoothness to aging skin. Apply each morning and evening after softening and before moisturizing the skin. \r\n","options":[{"id":9382874,"name":"Default","price":99.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25622850/-/_6001806.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25622850/-/_6001806.jpg","width":600,"height":920}],"artists":[],"categories":[]}]