[{"id":213985,"name":"InstantDiminish Anti-Aging Serum","permalink":"instantdiminish-anti-aging-serum","position":1,"price":65.0,"default_price":65.0,"tax":0.0,"url":"/product/instantdiminish-anti-aging-serum","status":"active","on_sale":false,"created_at":"2009-01-09T09:02:09.000Z","description":"InstantDIMINISH is the strongest, most potent Anti-Aging serum on the market today!\r\n\r\nThe secret to understanding how InstantDIMINISH works so well is in the active ingredients. First, only the four most effective all-natural substances go into InstantDIMINISH. While there are other good active ingredients out there, these four when combined together, have a synergistic effect producing both short term and long term permanent results when used for a 3-6 month period. Now lets look at the active ingredients:\r\n\r\n- 25% Acetyl Hexapeptide - 3 (AH3)\r\n- 15% Palmitoyl Pentapeptide - 3 (PP3)\r\n- 15% Gamma Aminobutyric Acid (GABA)\r\n- 20% Hyaluronic Acid (Hyaluronon) (HA)\r\n\r\nYou get 4 powerful ingredients --- pumped into the serum at maximum levels --- that help you fight fine lines and wrinkles... get rid of age spots... firm up sagging skin... wipe away crows feet... give your skin a more radiant, plumper appearance and take years off your complexion.\r\nSo there you have it: InstantDIMINISH has virtually no fillers. Other products have between 2% and 20% active ingredients. InstantDIMINISH contains a full 75% of these amazing compounds.\r\n\r\nInstantDIMINISH is also very affordable at just a fraction of the cost in comparison to plastic surgery and injections without the pain and recovery periods. Our product has permanent effects with continual use and when used on a regular basis, can actually delay and prevent new wrinkles from forming.","options":[{"id":935066,"name":"Default","price":65.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1494307/-/instantdeminish.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1494307/-/instantdeminish.jpg","width":200,"height":311}],"artists":[],"categories":[{"id":190775,"name":"Beauty Products","permalink":"beauty-products","url":"/category/beauty-products"}]}]