[{"id":12824,"name":"Game of the Day FAQ","permalink":"game-of-the-day-faq","position":3,"price":999.99,"default_price":999.99,"tax":0.0,"url":"/product/game-of-the-day-faq","status":"active","on_sale":false,"created_at":"2007-02-11T10:48:40.000Z","description":"<div> \nSome of the more popular questions and facts about Game of the Day are posted here…\n\n \n\nQ: <i>Why would I purchase the Game of the Day FAQs for $999.99?</i>\n\n \n\nA: Presumably you wouldn’t, unless you find them really, really valuable. The structure of this e-commerce site requires a price for every product. Previously when I had these types of “information-only” products priced at .01, people “bought” them. The new price point tends to prevent this type of error.\n\n \n\nQ: <i>I like the prices of the games, but how can I save on shipping?</i>\n\n \n\nA: Like many other “Deal of the Day” sites, we offer one game a day (and a bonus game at <span><span class=\"caps\">GCO</span></span>) at great prices. <span><span class=\"caps\">UNLIKE</span></span> other Deal of the Day sites, however, we DO allow combined shipping.\n\n \n\nQ: <i>Okay, tell me about combined shipping then.</i>\n\n \n\nA: Upon your request, we will hold shipment of your item(s) for you to add additional games. When you checkout with your second, third, fourth, fifth and as many additional games as you want at Google Checkout, you simply enter coupon code “comboship3” and $3.00 is magically whisked away from each order.\n\n \n\nQ: <i>I notice that I can’t add more than one item at a time at the Google site. Where is my shopping cart?</i>\n\n \n\nA: It’s in the Costco parking lot with the front wheels pushed up over the curb because someone was too lazy to return it to the cart corral. The current transaction engine at Google Base does not provide off-the-shelf shopping cart. We have worked around that by using the coupons for combined shipping.\n\n \n\nQ: <i>I keep hearing about something called a “Game-A-Thon”. What is it and why do I care about it?</i>\n\n \n\nA: During a Game-A-Thon, over relatively short intervals, different games are offered. If you miss it the first time, you may get a second chance at it, so be sure to also check the “second chance” items. If an item is marked as “last chance,” this is your signal that if you were on the fence before, this is your “last chance”. Hence the name.\n\n \n\nQ: <i>At other sites, I can get multiple copies of the same game shipped for the same shipping cost! How do I do that on Game of the Day?</i>\n\n \n\nA: Instead of providing you the capability to only buy multiple copies of the same game, we allow you to buy as many games… the same or different… as you want. We can offer this flexibility because we ship from a single warehouse. During the aforementioned “Game-A-Thon,” the coupon code “game5” is activated. This deducts $5.00 from the cost of the 2nd and subsequent orders during the Game-A-Thon. Since the shipping charge ranges from $4-7, this means your shipping charge could actually be a rebate of $1.00 (card games) up to $2.00 for larger games.\n\n \n\nQ: <i>The title of the listing page shows one price, but the cart and text at the bottom shows a price $2.00 higher? Which is correct, and why are they different?</i>\n\n \n\nA: The bigcartel site uses paypal, whereas the Google checkout site uses, logically enough, Google checkout. Currently, <span><span class=\"caps\">GCO</span></span> charges no transaction fee and we pass that savings on to you. We also provide savings back to loyal customers using the paypal site, so we issue a $2.00 refund to prior customers who buy through the bigcartel site.\n\n \n\nQ: <i>Is combined shipping possible if I am using the Paypal option at bigcartel?</i>\n\n \n\nA: Yes, but it comes in the form of a refund to your paypal account. Bigcartel does not currently have a coupon option. This is another reason we prefer <span><span class=\"caps\">GCO</span></span>.\n\n \n\nQ: <i>I sometimes see “Phantom” objects during Game-A-Thons. It looks like they are there, but I can’t buy them.</i>\n\n \n\nA: Drink another one! Actually, sometimes the Google page does not refresh as quickly as we would like. Especially when Thank You priced items are bought by multiple people after they are sold out. Just send an email to:\n\n&nbsp;<a href=\"mailto:eric.gameoftheday@gmail.com\">eric.gameoftheday@gmail.com</a>\n\nif you spot a problem. Sometimes there is something we need to fix on our side (no Buy button).\n\n \n\nQ: <i>Speaking of Thank You priced items, what is that? How do you make money on those?</i>\n\n \n\nA: Thank You items are priced below our cost. Hence the “Thank You” name. So how do we make money? Simple. Volume. (Apologies to <span><span class=\"caps\">SNL</span></span>’s “Change Bank” spoof commercial).\n\n \n\nQ: <i>Is there any place where I can post questions or comments about the stuff offered at Game of teh Day? Or about how much I love Game of the Day?</i>\n\n \n\nA: Between frenzied moments of pounding the “buy” button, you can also share your experiences on the Game of the Day blog, conveniently located at:\n\n \n\n<a linkindex=\"4\" href=\"http://gameoftheday.blogspot.com/\">http://gameoftheday.blogspot.com</a>&nbsp;\n\n \n\nQ: <i>Why do you run Game-A-Thons concurrently with Tangathons?</i>\n\n \n\nA: We have noticed that some Tangathons “bog” down when snow globes, tool kits, refurbished broccoli, and the like are offered up for hours at a time. We like to keep you entertained during those long between times. Besides which, with our combined shipping, you can often get Tanga’s game offerings for a little less at Game of the Day.\n\n \n\nQ: <i>I see items listed with small quantities. What’s up with that?</i>\n\n \n\nA: Sometimes we only have a few copies of the game to start with. We also fulfill orders from the same stock at our other storefronts (for much higher prices, by the way) so we only have a few to sell at our aggressive GotD prices.\n\n \n\nQ: <i>How do I get to your main Google page?</i>\n\n \n\nA: Click on this link to be teleported there now!\n\n \n\n<a linkindex=\"5\" style=\"color: brown;\" href=\"../../search?authorid=1580994&amp;hl=en&amp;gl=US\">Game of the Day Google page</a> \n \n</div>\n\n&nbsp;\n\n","options":[{"id":135613,"name":"Default","price":999.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/26427/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/26427/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":20916,"name":"Today's Game","permalink":"todays-game","url":"/category/todays-game"}]},{"id":15175,"name":"Game-A-Thon is ON!!Total $150 during this Game-A-Thon, get a $10 Rebate!","permalink":"game-a-thon-is-on-total-150-during-this-game-a-thon-get-a-10-rebate","position":5,"price":999.99,"default_price":999.99,"tax":0.0,"url":"/product/game-a-thon-is-on-total-150-during-this-game-a-thon-get-a-10-rebate","status":"active","on_sale":false,"created_at":"2007-03-08T11:45:45.000Z","description":"<i><b>Game-A-Thon On!</b></i>\n\nThat&#8217;s right, the promised Game-A-Thon is on <b>right here, right now.</b> We&#8217;re going to be offering up several steaming platefuls of gaming goodness over the next several days, so I hope you are all well rested! All the deals are right here:\n<a linkindex=\"4\" href=\"http://base.google.com/base/search?authorid=1580994&amp;hl=en&amp;gl=US\">http://base.google.com/base/search?authorid=1580994&amp;hl=en&amp;gl=US</a>\n\n \n\nThat&#8217;s easy to remember, is it not? Ok, maybe not. That&#8217;s what bookmarks are for. If I see that Google is slow to &#8220;Publish&#8221; some of the pages, I&#8217;ll also list them on the front page of the blog.\n\n<a linkindex=\"5\" href=\"http://gameoftheday.blogspot.com\">http://gameoftheday.blogspot.com</a>\n\n<i><b>Anything new this time around?</b></i>\n\nYes. We are bringing back the prizes for winners of this &#8216;Thon. The top prize winner will be announced and will definitely be a prize worth winning. Of course, as usual, we don&#8217;t ask you to pay for shipping of your &#8220;free&#8221; item (how tacky!) Second and third place will also receive prizes. Win, place and show&#8230;&nbsp;<i><b>&nbsp;</b></i>\n\nAlso, some items will drop in price until sold. Keep your eyes open! How low can it go? How long can you wait before it gets snatched by someone else? Oh, the agony. <i><b>\n</b></i>\n\n<i><b>What about the $10 cash-back if I hit $150? Does that still apply?</b></i>\n\nYes.\n<i><b>Are there any super-secret special coupon codes?</b></i>\n\nYes.\n\n<i><b>Are you going to tell us what they are?</b></i>\n\nIf I did, they would not be a secret, would they? Oh all right, the coupon code &#8220;game5&#8221; will save you $5.00 bucks on combined shipping. Remember, you can <i><b>only use this coupon for your second and subsequent purchases. Your first purchase is ineligible.</b><b>&nbsp;</b></i>\n\n<i><b>Are you going to honor requests made at the blog?</b></i>\n\nI will try, as long as they don&#8217;t feel too unsavory.<i><b>&nbsp;</b></i><i><b> </b><b>&nbsp;</b></i>\n\n<i><b>&nbsp;</b></i><i><b><a linkindex=\"6\" href=\"https://www.blogger.com/comment.g?blogID=6713347544254825154&amp;postID=8470256023244398873\">The Game-A-Thon Blog Entry!</a></b></i>\n\n\n","options":[{"id":137290,"name":"Default","price":999.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42140/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42140/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":20916,"name":"Today's Game","permalink":"todays-game","url":"/category/todays-game"}]}]