[{"id":14224569,"name":"Shell ","permalink":"abdi-farah","position":1,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/abdi-farah","status":"active","on_sale":false,"created_at":"2013-10-16T21:33:45.000Z","description":"Abdi Farah has created <i>Shell</i>, a series of three line and aquatint etchings on 11x14\" paper. Each order receives one of the three prints, each picturing the bust of a varsity athlete from a local high school. The series is part of Farah’s ongoing investigation into the aesthetics and ritual of New Orleans high school football culture. The heads are obscured by helmets and appear against stark black. The deep background immediately conjures the night sky of the celebrated Friday night games--now known in pop-culture lexicon as Friday Night Lights. At the same time, Farah likens the darkness to the promise and uncertainty ever-present in these young men’s lives as a result of their participation in the game, where a standout performance or routine injury can decide their futures.\r\n\r\nBorn and raised in Baltimore, Maryland, Farah moved to New Orleans in 2011 as part of a yearlong residency hosted by the St. Roch Community Church. After graduating with a BA from the University of Pennsylvania, Farah joined the inaugural cast of <i>Work of Art: The Next Great Artist</i>, a reality television competition that he eventually won in 2010. As part of his prize, Farah was awarded a solo exhibition at the Brooklyn Museum. His work has been exhibited at the Baltimore Museum of Art; the Corcoran Gallery of Art in Washington, DC; the National Museum of Women in the Arts in Washington, DC; the Margulies Collection at the Warehouse in Miami; and Staple Goods Gallery and Collective in New Orleans.\r\n\r\n<i>Shell</i> is available in a beautiful custom-built black frame with white matte for $150 or unframed for $80. Please allow extra delivery time for framed pieces. ","options":[{"id":45947040,"name":"Unframed","price":80.0,"sold_out":false,"has_custom_price":false},{"id":46052967,"name":"Matted and Framed","price":150.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125979003/-/abdi_thedrop_02_small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125979003/-/abdi_thedrop_02_small.jpg","width":1725,"height":2100},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125979012/-/abdi_thedrop_03_small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125979012/-/abdi_thedrop_03_small.jpg","width":1725,"height":2100},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125978991/-/abdi_thedrop_01_small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125978991/-/abdi_thedrop_01_small.jpg","width":1725,"height":2100}],"artists":[{"id":241077,"name":"Abdi Farah","permalink":"abdi-farah","url":"/artist/abdi-farah"}],"categories":[{"id":6338568,"name":"CURRENT","permalink":"current","url":"/category/current"}]},{"id":14224527,"name":"Lake Peigneur","permalink":"sophie-t-lvoff","position":2,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/sophie-t-lvoff","status":"active","on_sale":false,"created_at":"2013-10-16T21:32:05.000Z","description":"Sophie T. Lvoff has created <i>Lake Peigneur</i>, an edition of 100 9x12\" salted paper prints. The salted paper process was invented by William Henry Fox Talbot in 1833 while on his honeymoon in Lake Como. Lvoff has used this antiquated process to create a fittingly romantic image of Lake Peigneur in Iberia Parish, Louisiana. Despite the lake’s pastoral appearance, it was the site of a disastrous drilling accident in 1980, triggering a violent maelstrom that permanently altered the lake’s ecosystem and transformed it from freshwater to saltwater. Lvoff has printed the photograph in quadrants, a reference to the site’s own fractured history, as well as to <i>Profondeurs de la terre ou paysage</i>, a 1930 work by René Magritte. Each print has been hand-coated and will thus exhibit unique tones and markings as part of Lvoff’s exploration of the now-obsolete technique.\r\n \r\nLvoff is a photographer and member of Good Children Gallery. Born in New York and raised in the Northeast, she one day picked up and moved to New Orleans, having never even visited. Her picturing of the South emerges from a legacy of American street photographers that includes Walker Evans, William Eggleston, and Stephen Shore. Lvoff received her MFA from Tulane University and her photographs have been shown in galleries and museums throughout the world, most recently at Howard Greenberg Gallery in New York.\r\n\r\n<i>Lake Peigneur</i> is available in a beautiful custom-built black frame with white matte for $150 or unframed for $80. Please allow extra delivery time for framed pieces. \r\n","options":[{"id":45946938,"name":"Unframed","price":80.0,"sold_out":false,"has_custom_price":false},{"id":46053009,"name":"Matted and Framed","price":150.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125978916/-/salt-original-WEB.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125978916/-/salt-original-WEB.jpg","width":2160,"height":1624}],"artists":[{"id":241074,"name":"Sophie T. Lvoff","permalink":"sophie-t-lvoff","url":"/artist/sophie-t-lvoff"}],"categories":[{"id":6338568,"name":"CURRENT","permalink":"current","url":"/category/current"},{"id":6345732,"name":"FEATURED","permalink":"featured","url":"/category/featured"}]},{"id":14224344,"name":"Chair Stack","permalink":"bob-snead","position":3,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/bob-snead","status":"active","on_sale":false,"created_at":"2013-10-16T21:23:44.000Z","description":"Bob Snead has created <i>Chair Stack</i>, a digital drawing on layered transparency film. The image and technique are adapted from “Bedfellows,” his recent solo exhibition at the Isaac Delgado Fine Arts Gallery in New Orleans. Based on a scene from Snead’s mother’s home, a tower of overflowing baskets and cardboard boxes perches precariously atop an ornately upholstered chair. A jumble of pattern and color, both the composition and process mimic the seemingly haphazard, often chaotic rhythms of domestic life. And as in life, through the controlled layering and balance of the near-electric hues, an unexpected harmony emerges.\r\n\r\nSnead is a native of Charleston, South Carolina, where he attended the College of Charleston. He started Redux Contemporary Art Center in 2002 with a group of fellow graduates and remained its founding director until 2005. After receiving his MFA in painting and printmaking in 2007 from Yale University, Snead traveled North America in a converted city transit bus as part of the itinerant artist collective Transit Antenna. He has exhibited with Jack Tilton Gallery and Deitch Projects in New York, and closer to home at the Ogden Museum of Southern Art, Jonathan Ferrara Gallery, and May Gallery in New Orleans. He is currently a managing member of Press Street in New Orleans.\r\n\r\n<i>Chair Stack</i> includes an 8x10\" white coroplast frame that is ready to hang. ","options":[{"id":46053081,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125978466/-/bob.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125978466/-/bob.jpg","width":648,"height":930}],"artists":[{"id":241068,"name":"Bob Snead","permalink":"bob-snead","url":"/artist/bob-snead"}],"categories":[{"id":6338568,"name":"CURRENT","permalink":"current","url":"/category/current"}]},{"id":11241594,"name":"Untitled (After Vuitton)","permalink":"brett-labauve","position":7,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/brett-labauve","status":"active","on_sale":false,"created_at":"2013-05-19T03:08:01.000Z","description":"Brett LaBauve created <i>Untitled (after Vuitton)</i>, an edition of 100 glass etchings. Part of an ongoing exploration into desire, LaBauve mines the canons of high art and fashion to produce his own brand of “faux luxury.” The etched image for THE DROP combines a bust of Venus with an inverted Louis Vuitton logo—a nod to bootleg markets and the artist’s own punk rock roots. The glass object can be hung or laid flat, imposing “faux luxury” on any surface, and comes with a pair of white gloves.\r\n \r\nOriginally from the small Southwest Louisiana town of Hackberry, LaBauve studied painting and printmaking at McNeese State University in Lake Charles and imaging at the University of New Orleans. His work has appeared in group exhibitions at Good Children Gallery, the Contemporary Arts Center, and the UNO Campus Gallery in New Orleans. He is the creator of <i>Bouffant Bouffant</i>, a web-based design project and self-described \"design/party machine,\" that includes hand-printed t-shirts and one-night pop-up shops, parties, and installations. \r\n","options":[{"id":35376372,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125241645/-/untitled_after_vuitton.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125241645/-/untitled_after_vuitton.jpg","width":1210,"height":1200},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/110589693/-/May_LaBauve_LV-Glass-Angle.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/110589693/-/May_LaBauve_LV-Glass-Angle.jpg","width":1000,"height":667},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/110590017/-/May_LaBauve_LV-Glass-sq.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/110590017/-/May_LaBauve_LV-Glass-sq.jpg","width":667,"height":667}],"artists":[{"id":237741,"name":"Brett LaBauve","permalink":"brett-labauve","url":"/artist/brett-labauve"}],"categories":[{"id":5335854,"name":"MAY 2013","permalink":"may-2013","url":"/category/may-2013"}]},{"id":11241582,"name":"WOFORO","permalink":"bottletree","position":8,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/bottletree","status":"active","on_sale":false,"created_at":"2013-05-19T03:07:03.000Z","description":"<br> Bottletree created, <i>WOFORO</i>, an edition of 100 archival C-prints. Digitally manipulated, <i>WOFORO</i> unites a photograph and its inverse to transform an everyday streetlight into a contemporary Rorschach test. The photograph(s), taken at the intersection of Oretha Castle Haley Boulevard and Martin Luther King, Jr. Boulevard in New Orleans, is superimposed by a West African <i>adinkra</i>. While the artist uses various <i>adinkra</i> symbols throughout his practice, the <i>Woforo dua pa a</i> speaks to support, cooperation, and encouragement. Literally, it means, “When you climb a good tree, you are given a push.” \r\n\r\nBottletree (aka Jerald L. White) is an artist and advocate. Before joining the arts community, White worked as a grassroots organizer, attorney, and environmental policymaker in New Orleans and Washington, D.C.  He is a member of Press Street, a literary and visual arts collective, and founder of the Charitable Film Network, a diverse group of media-makers dedicated to community service.  \r\n\r\n","options":[{"id":46018530,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/110589885/-/May_Bottletree-crop.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/110589885/-/May_Bottletree-crop.jpg","width":931,"height":775}],"artists":[{"id":237747,"name":"Bottletree","permalink":"bottletree","url":"/artist/bottletree"}],"categories":[{"id":6345732,"name":"FEATURED","permalink":"featured","url":"/category/featured"},{"id":5335854,"name":"MAY 2013","permalink":"may-2013","url":"/category/may-2013"}]},{"id":11241573,"name":"New","permalink":"cristina-molina","position":9,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/cristina-molina","status":"active","on_sale":false,"created_at":"2013-05-19T03:05:48.000Z","description":"Cristina Molina created <i>New</i>, a deconstructed artist’s book in an edition of 100. Housed in a specially designed envelope, the work consists of eight archival C-prints with original text. Loosely based on Molina’s own trek to New Orleans from South Florida with her father, <i>New</i> presents a recent arrival’s image of the city alongside a shifting filial relationship. Together the photographs and text describe change in its many layers of disorientation and possibility.\r\n \r\nMolina is Assistant Professor of New Media and Animation at Southeastern Louisiana University. Drawing upon a background in psychology, her multimedia works frequently address the ways in which people experience space. She received her MFA in Art and Technology from the University of Florida and participated in the Sub30 Residency at Proyecto 'ace in Buenos Aires, Argentina. Her works have been exhibited in New Orleans, Buenos Aires, and throughout her home state of Florida.\r\n\r\n","options":[{"id":35376306,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/110589585/-/May_Molina.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/110589585/-/May_Molina.jpg","width":1000,"height":647}],"artists":[{"id":237750,"name":"Cristina Molina","permalink":"cristina-molina","url":"/artist/cristina-molina"}],"categories":[{"id":5335854,"name":"MAY 2013","permalink":"may-2013","url":"/category/may-2013"}]},{"id":10254742,"name":"Marais Canopy","permalink":"hannah-chalew","position":10,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/hannah-chalew","status":"active","on_sale":false,"created_at":"2013-03-30T18:01:54.000Z","description":"For January, Hannah Chalew created <i>Marais Canopy</i>, an edition of 100 digital prints embellished with hand-painted laser-cut vellum. The prints reflect the close observation that is the hallmark of Chalew’s drawings of post-Katrina landscapes. While devoid of people, her depictions of blighted spaces are rooted in a profound need to record human interactions and her own presence. Collapsing experiences of an empty lot and a viny roof on Marais Street, the image suggests the loss of one house and the new ecosystem poised to replace it.\r\n\r\nBorn and raised in New Orleans, Chalew returned to the city in 2009 after graduating from Brandeis University. Her drawings, sculptural installations, and architectural interventions explore the nexus of nature, the built environment, and everyday life. She is one of the founders of T-Lot, an artist-run studio and installation space located in the St. Claude Arts District. She is represented by Jonathan Ferrara Gallery in New Orleans.\r\n\r\n","options":[{"id":32087944,"name":"Unframed","price":80.0,"sold_out":false,"has_custom_price":false},{"id":46393905,"name":"Matted and Framed","price":150.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100767604/-/hannah-final.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100767604/-/hannah-final.jpg","width":490,"height":376}],"artists":[{"id":237762,"name":"Hannah Chalew","permalink":"hannah-chalew","url":"/artist/hannah-chalew"}],"categories":[{"id":6345732,"name":"FEATURED","permalink":"featured","url":"/category/featured"},{"id":4414082,"name":"JANUARY 2013","permalink":"january-2013","url":"/category/january-2013"}]},{"id":10254700,"name":"Mowing the Lawn","permalink":"avery-lawrence","position":11,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/avery-lawrence","status":"active","on_sale":false,"created_at":"2013-03-30T18:00:02.000Z","description":"For January, Avery Lawrence created <i>Mowing the Lawn</i>, an edition of 100 hand-pulled silkscreen prints on paper. Tucked into artist-designed envelopes, the prints imagine a 9-part storyboard for a forthcoming short film. The tricolor palette of kelly green, egg yolk, and burnt sienna prematurely recalls the sweltering New Orleans summer. In the long shadows of the afternoon sun, simple lawn maintenance is transformed into a Sisyphean task. \r\n\r\nFor several years, Lawrence has been creating videos, performances, and related suites of objects that explore the poetry of repetitive tasks. His multidisciplinary projects, presenting loosely structured but visually rich narratives informed by memory and nostalgia, have won him the Scope Foundation Award (2011) and the Art Takes Miami competition (2012). He has exhibited at Parse Gallery, New Orleans; 1708 Gallery, Richmond; and Heiner Contemporary, Washington, DC; and his films were included in the Virginia Film Festival in 2012.  \r\n\r\n","options":[{"id":32087824,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100767088/-/avery-final-1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100767088/-/avery-final-1.jpg","width":543,"height":660},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100767184/-/avery-final-2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100767184/-/avery-final-2.jpg","width":507,"height":660}],"artists":[{"id":237777,"name":"Avery Lawrence","permalink":"avery-lawrence","url":"/artist/avery-lawrence"}],"categories":[{"id":4414082,"name":"JANUARY 2013","permalink":"january-2013","url":"/category/january-2013"}]},{"id":10254718,"name":"Toothpicker","permalink":"grissel-giuliano","position":12,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/grissel-giuliano","status":"active","on_sale":false,"created_at":"2013-03-30T18:00:55.000Z","description":"For January, Grissel Giuliano created <i>Toothpicker</i>, an edition of 100 archival pigment prints. A collector of scientific models, natural specimens, and just plain oddities, Giuliano has assembled a dreamlike still life consisting of a military hygiene handbook, a vial of yellowing teeth, and a tragicomic set of interlocking dentures. Situated against a weathered backdrop complete with pencil scrawl, the recognizable artifacts exceed known systems, arriving at seemingly personal and inscrutable new classifications. \r\n\r\nWith a B.S. in Animal Science from the University of Vermont, Giuliano uses photography to foreground a deep interest in contemporary and historical taxonomies. Committed to the creative possibilities of medium-format film, Giuliano has worked with a dedicated printer, Cameron Wood, for four years. She has had solo exhibitions at Coup d'Oeil Art Consortium in New Orleans and has also exhibited at the Ogden Museum of Southern Art, New Orleans; the Contemporary Arts Center, New Orleans; and the Center for Fine Art Photography, Fort Collins. \r\n\r\n","options":[{"id":32087869,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100767400/-/grissel-final.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100767400/-/grissel-final.jpg","width":490,"height":490}],"artists":[{"id":237765,"name":"Grissel Giuliano","permalink":"grissel-giuliano","url":"/artist/grissel-giuliano"}],"categories":[{"id":4414082,"name":"JANUARY 2013","permalink":"january-2013","url":"/category/january-2013"}]},{"id":10254673,"name":"NOMAN RIVER","permalink":"robert-c-tannen","position":13,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/robert-c-tannen","status":"active","on_sale":false,"created_at":"2013-03-30T17:58:01.000Z","description":"For November, Robert C. Tannen created <i>NOMAN RIVER</i>, an edition of 100 digital prints. The prints combine a NASA image of the Mississippi/Missouri watershed with text drawing from Oscar Hammerstein’s lyrics for the song “Old Man River.” Together they form a narrative of the historical abuses within the Mississippi River Valley, which continue today, albeit with very different consequences. A magnifying glass allows for closer inspection, in line with Tannen’s call for greater recognition of the environmental crises now afflicting the region.\r\n\r\nRobert C. Tannen has lived in New Orleans since the 1960s, making him among the first conceptual artists in the city. Tannen’s work encompasses a range of media from the monumental to the mundane. Nick Stillman best characterized Tannen's wildly diverse practice in familiar terms on Pelican Bomb, “To summarize Tannen’s art to the uninitiated: Rauschenberg’s sense of the poetry of objects sandwiched between Buckminster Fuller’s refusal of impossibility and Robert Smithson’s ambition to organize that which defies systemic thinking.”\r\n\r\n","options":[{"id":32087782,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100766752/-/january-archive.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100766752/-/january-archive.jpg","width":381,"height":490}],"artists":[{"id":237774,"name":"Robert C. Tannen","permalink":"robert-c-tannen","url":"/artist/robert-c-tannen"}],"categories":[{"id":6345732,"name":"FEATURED","permalink":"featured","url":"/category/featured"},{"id":3833465,"name":"NOVEMBER 2012","permalink":"november-2012","url":"/category/november-2012"}]},{"id":10254640,"name":"Swamp Realness","permalink":"nina-schwanse","position":14,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/nina-schwanse","status":"active","on_sale":false,"created_at":"2013-03-30T17:56:50.000Z","description":"For November, Nina Schwanse created the video work <i>Swamp Realness</i>. An edition of 100, each DVD is housed in a hand-painted camouflage case. Spoofing the reality TV preoccupation with authentic cultures, particularly the “Swamp People” of Louisiana’s Cajun country, Schwanse performs dual roles as a British actress and her born-on-the-bayou character. Her footage combines green-screen interviews with on-location filming to create a work that is equal parts real, unreal, and surreal. \r\n\r\nIn her videos, performances, and web-based projects, Nina Schwanse assumes a range of characters. Literally donning a host of faces, costumes, and personalities, she frequently probes hackneyed gender roles and expectations, particularly in relation to Southern identity, often by means of unpredictable conduct, inane juxtaposition, and utter confusion.\r\n\r\n","options":[{"id":32087713,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100766476/-/nina-drop.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100766476/-/nina-drop.jpg","width":490,"height":374}],"artists":[{"id":237768,"name":"Nina Schwanse","permalink":"nina-schwanse","url":"/artist/nina-schwanse"}],"categories":[{"id":3833465,"name":"NOVEMBER 2012","permalink":"november-2012","url":"/category/november-2012"}]},{"id":10254613,"name":"Glykophilousa (tender kisses)","permalink":"anastasia-pelias","position":15,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/anastasia-pelias","status":"active","on_sale":false,"created_at":"2013-03-30T17:54:50.000Z","description":"For November, Anastasia Pelias created 100 unique paintings on acrylic panels with wooden supports. Using the painterly vocabulary of her large abstract canvases, these small works in industrial paint translate their humanness not through scale but rather through feel. The orange and red palette recalls the jewel tones of Greek icons, and like religious objects, these intimate paintings can be hung on the wall but also held in the hand.\r\n\r\nAnastasia Pelias is known for abstract paintings that harness the power of pure color and light, drawing on two concurrent lineages—the highly saturated streets of New Orleans and the sun-soaked shores of Greece. Pelias mines aspects of her cultural heritage, memory, and experience to create works that are human in their scale and expressive in their simplicity.\r\n\r\n","options":[{"id":32087656,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100766104/-/pelias-drop.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100766104/-/pelias-drop.jpg","width":490,"height":490}],"artists":[{"id":237771,"name":"Anastasia Pelias","permalink":"anastasia-pelias","url":"/artist/anastasia-pelias"}],"categories":[{"id":3833465,"name":"NOVEMBER 2012","permalink":"november-2012","url":"/category/november-2012"}]},{"id":10254583,"name":"Untitled (Man and Worm)","permalink":"dave-greber","position":16,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/dave-greber","status":"active","on_sale":false,"created_at":"2013-03-30T17:53:37.000Z","description":"For September, Dave Greber created 100 lenticular prints. Once the domain of Cracker Jack boxes and gas station displays, the trippy lenses get the metaphysical treatment in the artist's imagining of the interaction of a man and a lowly worm.\r\n\r\nDave Greber's hallucinogenic video installations dance between cosmic dreams and technological nightmares. He arrived in New Orleans in 2005 with every intention of pursuing a career in media production, producing documentaries for nonprofits and regional commercials. Before long, he found himself instead creating site-specific installations for galleries and museums, but he hasn't forgotten his media roots. His works often feel like bizarre commercials, advertising divine intervention and human self-realization. \r\n","options":[{"id":32087614,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100765828/-/Greber.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100765828/-/Greber.jpg","width":350,"height":445}],"artists":[{"id":237780,"name":"Dave Greber","permalink":"dave-greber","url":"/artist/dave-greber"}],"categories":[{"id":3536451,"name":"SEPTEMBER 2012","permalink":"september-2012","url":"/category/september-2012"}]},{"id":10474300,"name":"Ludwig","permalink":"miss-pussycat","position":17,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/miss-pussycat","status":"active","on_sale":false,"created_at":"2013-04-11T02:01:23.000Z","description":"For September, Miss Pussycat created two photographs, each an edition of 50. Shot within a set crafted for her most recent feature film, her beloved handmade puppets have taken a trip to the fictional Bath-Bath Art Museum. Surrounded by masterpieces, including works made by Miss Pussycat and her father, the puppets embark on another magical adventure.\r\n\r\nMiss Pussycat is best known for her fantastical puppet performances, where fuzzy friends dance, play in bands, and save the world. Founder of Pussycat Caverns and the Spellcaster Lodge, she is a master of creating her own surreal universes full of underwater dance clubs and supernatural hair salons. Hers is a spiritual utopia where gooey Hubig's pies are a weapon against evil and every day is a party at the center of the earth. \r\n\r\n","options":[{"id":32810110,"name":"Unframed","price":80.0,"sold_out":false,"has_custom_price":false},{"id":46393947,"name":"Matted and Framed","price":150.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/102960232/-/Pusscat-2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/102960232/-/Pusscat-2.jpg","width":500,"height":398}],"artists":[{"id":237756,"name":"Miss Pussycat","permalink":"miss-pussycat","url":"/artist/miss-pussycat"}],"categories":[{"id":3536451,"name":"SEPTEMBER 2012","permalink":"september-2012","url":"/category/september-2012"}]},{"id":10254517,"name":"Starla Marla","permalink":"miss-pussycat-vs-1","position":18,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/miss-pussycat-vs-1","status":"active","on_sale":false,"created_at":"2013-03-30T17:49:59.000Z","description":"For September, Miss Pussycat created two photographs, each an edition of 50. Shot within a set crafted for her most recent feature film, her beloved handmade puppets have taken a trip to the fictional Bath-Bath Art Museum. Surrounded by masterpieces, including works made by Miss Pussycat and her father, the puppets embark on another magical adventure.\r\n\r\nMiss Pussycat is best known for her fantastical puppet performances, where fuzzy friends dance, play in bands, and save the world. Founder of Pussycat Caverns and the Spellcaster Lodge, she is a master of creating her own surreal universes full of underwater dance clubs and supernatural hair salons. Hers is a spiritual utopia where gooey Hubig's pies are a weapon against evil and every day is a party at the center of the earth. \r\n\r\n","options":[{"id":33302266,"name":"Unframed","price":80.0,"sold_out":false,"has_custom_price":false},{"id":46393845,"name":"Matted and Framed","price":150.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100765264/-/Pusscat-1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100765264/-/Pusscat-1.jpg","width":500,"height":398}],"artists":[{"id":237756,"name":"Miss Pussycat","permalink":"miss-pussycat","url":"/artist/miss-pussycat"}],"categories":[{"id":6345732,"name":"FEATURED","permalink":"featured","url":"/category/featured"},{"id":3536451,"name":"SEPTEMBER 2012","permalink":"september-2012","url":"/category/september-2012"}]},{"id":10254556,"name":"Untitled (99 FEMA Trailers)","permalink":"keith-duncan","position":19,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/keith-duncan","status":"active","on_sale":false,"created_at":"2013-03-30T17:51:37.000Z","description":"For September, Keith Duncan created 100 unique paintings, which together form his installation <i>99 FEMA Trailers</i>. Dispersed by THE DROP, no two paintings are alike, incorporating individual details and found wallpaper.\r\n\r\nKeith Duncan's paintings weave together contemporary Louisiana history with the stories of his childhood in Plaquemines Parish, Louisiana. He is a folk artist in the truest sense--translating the tales and experiences of the people around him into imagery. Drawing on quilt-making traditions, he frequently incorporates textiles into his canvases. He unabashedly explores Southern identity, particularly African-American life, in all its comforts, struggles, and contradictions. \r\n\r\n","options":[{"id":32087560,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100765540/-/Duncan.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100765540/-/Duncan.jpg","width":500,"height":363}],"artists":[],"categories":[{"id":3536451,"name":"SEPTEMBER 2012","permalink":"september-2012","url":"/category/september-2012"}]}]