[{"id":2847697,"name":"Try State Magazine Issue 3. Fall 2010","permalink":"try-state-magazine-issue-3-fall-2010","position":1,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/try-state-magazine-issue-3-fall-2010","status":"active","on_sale":false,"created_at":"2010-11-08T02:45:18.000Z","description":"TRY STATE MAGAZINE: Issue 3 features work by: Michael Alago, bolang, Michal Boothe, Coke Brown, Jr., Quar Brown, Walt Cessna, Sergio Delgado, Dipiriri, Tobias Feltus, Federico Forlani, Diego Garcon, Frank Aron Gardso, Luca Guarini, Holtom, Naruki Kukita, Bruce LaBruce, Joshua Mainprize, Gregory Moon, Sylvain Norget, Rob Ordonez, Kris Pithalua, Gio Black Peter, Ves Pitts, Michael Puff, Brian Riley, Robbeyond, Ryan Scott, Robert Smith, Solarixx, Christopher Stribley, Rob Torres, Gerry Visco, Jim Wilkinson, and Jessica Yatrofsky.    \r\nTRY STATE MAGAZINE, an independent biannual publication designed for an alternative audience, truly has their finger on the pulse of contemporary art. It is a curated showcase of the world’s most interesting artists and photographers. \r\nWhat distinguishes TRY STATE from other magazines is its sleek and minimalist design. Far from the congested look of magazines of this type, the format is designed to truly showcase the works. With Issue Three, TRY STATE MAGAZINE continues to position itself as the paramount art and photography magazine for today's contemporary art lovers.   \r\n\r\ngo to our website  HTTP://TRYSTATEMAGAZINE.BLOGSPOT.COM for more","options":[{"id":9938539,"name":"Default","price":13.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":3.95,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":10.95,"amount_with_others":10.95}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27568833/-/TRY_STATE_issue_3_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27568833/-/TRY_STATE_issue_3_cover.jpg","width":462,"height":640}],"artists":[],"categories":[{"id":234858,"name":"magazine","permalink":"magazine","url":"/category/magazine"},{"id":1625658,"name":"photo","permalink":"photo","url":"/category/photo"},{"id":1625710,"name":"art","permalink":"art","url":"/category/art"}]},{"id":410007,"name":"Try State Magazine: Issue 2. Fall 2009","permalink":"try-state-magazine-issue-2-fall-2009","position":2,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/try-state-magazine-issue-2-fall-2009","status":"active","on_sale":false,"created_at":"2009-09-28T05:34:56.000Z","description":"Cover Image is censored on this page due to content.  Copies do not have blue stripe.\r\n\r\nTry State Magazine does it again.  Issue two is even better.  Contributors include\r\nCover: Sylvain Norget\r\nBack Cover: Portrait of Madonna, Caroline Torem Craig\r\nSean Cannon\r\nRyan Pfluger\r\nAlejandro Caspe\r\nMarkus Bollingmo\r\nIggy Berlin\r\nRico JC\r\nAzrul Dwi\r\nWalter Cessna\r\nAlbert Madaula\r\nRichard Haines\r\nOlivier Valsecchi\r\nLauren Ezersky\r\nRobbeyond\r\nChristopher Summerfield\r\nVes Pitts\r\nBolang\r\nGio Black Peter\r\nMax Steele\r\nMichael Epps\r\nMJ Styles\r\nCaleb Iida\r\nAdriano Batista\r\nAustin Young\r\nVaughn Michaels\r\nAlexandra Gibson\r\nMark Doering\r\nDiego Ciccone\r\nRobert Adams\r\nInterview with Martha Davis of the \"MOTELS\"\r\n\r\n\r\n\"Try State Magazine continues to position itself as the paramount Art and Photography magazine for today's contemporary art lovers. This curated publication brings you the best emerging artists from all over the world.  Boasting an A-List clientele of curators, celebutantes, gallery owners, collectors, celebrities and art aficionados there is no other publication that runs as deep into the scene.  Issue One was an international sensation with amazing reviews and unparalleled recognition, Issue Two goes beyond that!\r\n\r\nHTTP://TRYSTATEMAGAZINE.BLOGSPOT.COM\r\n\r\nThere are not many copies left and this will go into out of print price of 50 dollars soon","options":[{"id":1635532,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":2.95,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":232,"name":"Vatican City State (Holy See)","code":"VA"}},{"amount_alone":10.95,"amount_with_others":7.95}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3354874/-/TRY_STATE_2_stripe_blue_small.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3354874/-/TRY_STATE_2_stripe_blue_small.jpg","width":462,"height":640}],"artists":[],"categories":[{"id":234858,"name":"magazine","permalink":"magazine","url":"/category/magazine"}]},{"id":271606,"name":"Try State Magazine: Issue 1. Spring 2009 - OUT OF PRINT","permalink":"try-state-magazine-issue-1-spring-2009","position":3,"price":50.0,"default_price":50.0,"tax":0.0,"url":"/product/try-state-magazine-issue-1-spring-2009","status":"active","on_sale":false,"created_at":"2009-04-05T21:34:40.000Z","description":"Only a few out of print issues left of issue one\r\n\r\nTRY STATE MAGAZINE : Quality. Art. Trash. Nudes. Fetish. Punk. Music. Fashion Victims.\r\n\r\nTRY STATE MAGAZINE focuses on contemporary art and photography and features the world's most creative, innovative and interesting images available.\r\n\r\nTRY STATE MAGAZINE : contemporary fine art, photography and written works. The layout is a very simple, clean with a stylish format designed to truly showcase the works. Each issue of TRY STATE  includes the columns \"Confessions Of a Fag Hag\" and \"80's Band Worth Rediscovering.\"\r\n\r\nThis premier issue is now available and features cover art by Gio Black Peter, artist and lead musical talent for Black Peter Group.\r\n\r\nTRY STATE MAGAZINE line up for Issue Number One:\r\n\r\nGIO BLACK PETER\r\n\r\nCSABA FALUDI\r\n\r\nROBBEYOND\r\n\r\nSTAURT SANDFORD\r\n\r\nSYLVAIN NORGET\r\n\r\nLUKE GILFORD\r\n\r\nMCKENZIE JAMES\r\n\r\nBOLANG\r\n\r\nLUIGI Y LUCA\r\n\r\nMIKEL MARTON\r\n\r\nAUSTIN YOUNG\r\n\r\nCAROLINE TOREM CRAIG\r\n\r\nCALEB IIDA\r\n\r\nLEE HARVEY ROSWELL\r\n\r\nDRASKO BOGDONOVIC\r\n\r\nVIVIEN AYROLES & STEFANO MARCHIONINI (ENTR'OUVERT) \r\n\r\nADRIANO BATISTA\r\n\r\n*******\r\n\r\nTRY STATE MAGAZINE Issue 1. Spring 2009 \r\n52 pages  (10 pages of color) \r\n6\"x 9\" on white quality paper\r\n\r\n*******\r\n\r\n\"Try State Magazine is the Visionaire of the Zine World, the new limited edition publication crafted by Robert & Robert is sure to gain international recognition with works by the World's most current artists. The sleek design and edgy images - think Marc Jacob ad meets Robert Maplethorpe - leaves us craving more. It is no wonder that pre-publication demand is a virtual who's - who of the A-list Art World. You can visit the preview at http://Trystatemagazine.blogspot.com.\"\r\n\r\n- A. Frick-Thomas\r\n\r\n******\r\n\r\n\"Try State Magazine, the new biannual publication by Robert & Robert has its finger on the pulse of contemporary art. With its sleek & minimalist design it is a curated showcase of the world’s most interesting artists, photographers and writers. What makes Try State so appealing is the layout which truly showcases the work. Far from the congested look of popular rags, each image is not only carefully chosen but also displayed as if it were in a gallery.\r\n\r\nThe combination of established artists including celebrity photographer Austin Young whose credits include Deborah Harry, Margaret Cho and Siouxie Sioux mixed with emerging artist Csaba Faludi ( Budapest) raw fetish type images allows us to follow a journey into bodies, portraits and self exhibition. Some of my favorite internet bloggers and emerging photographers such as Stuart Sandford, Luke Gilford, Sylvain Norget’s Naked Rabbit Project, Robbeyond and Luigi y Luca from Barcelona all contribute, making each turn of the page exciting and naughty.\r\n\r\nThe premiere issue features cover art by Fabulous and talented Gio Black Peter, a young Guatamalan immigrant who continues to stimulate the senses with his visual works, multimedia experimental pieces and musical talent / stage presence. Makes me want to clap my hands and drop my pants.\r\n\r\nTry State is light on the written word, one poem, one musical review ( forgotten eighties band) and the quirky/witty “Confessions of a Fag Hag” is a cornucopia of how to keep your boys entertained while maintaining your own sanity.\r\n\r\nAlmost as impressive as the work is Try State’s contemporary interest list which reads as a modern day Social Registry. The contacts of this desired publication includes fifty of the world’s top Art Collectors, several billionaires and a who’s who of International Gallery Owners, Curators, Editors, Designers, Nightlife Celebutantes and Artists. Try State’s connections run deep into the Scene.\r\n\r\nIn total Try State brings back the excitement of finding my father’s playboy magazine in the in bathroom cabinet. I want to flip through each page quickly to see what is inside, then go through it slowly examining every page, image by image, piece by piece.\r\n\r\nRobert and Robert claim to bring you 'quality, trash, art, nudes, fetish, homos, punks, gossip and fashion victims.' They deliver!\"\r\n\r\n- R.Vita \r\n\r\nHTTP://TRYSTATEMAGAZINE.BLOGSPOT.COM\r\n\r\nDUE TO SOME ADULT CONTENT:\r\nBy purchasing Try State Magazine, you certify that you are 18 years of age or older.\"\r\n","options":[{"id":1142279,"name":"Default","price":50.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":2.95,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":232,"name":"Vatican City State (Holy See)","code":"VA"}},{"amount_alone":10.95,"amount_with_others":7.95}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3409293/-/use_this_ts.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3409293/-/use_this_ts.jpg","width":465,"height":640}],"artists":[],"categories":[{"id":234858,"name":"magazine","permalink":"magazine","url":"/category/magazine"}]}]