[{"id":13101213,"name":"Algaculture System","permalink":"algaculture-system","position":1,"price":295.0,"default_price":295.0,"tax":0.0,"url":"/product/algaculture-system","status":"active","on_sale":false,"created_at":"2013-08-22T01:37:13.000Z","description":"<b>Algaculture System</b>\r\n\r\nThe SURF2™ is the world’s first seaweed cultivator by Santa Monica Filtration. (Check out the <a href=\"http://kck.st/1a07c3o\"><b>KICKSTARTER</b></a> by Santa Monica Filteration) The floating seaweed cultivator is equipped with 150 square cm of rough Green-Grabber ™ and super-red 660 nm LED lighting for optimum seaweed growth. The algaculture system is capable of producing 5 cm thick blocks of seaweed on a weekly basis right from your aquarium. \r\n\r\n<b>Key Benefits</b>\r\n\r\n<ul>\r\n<li>Seaweed Production for Fish Feed </li>\r\n<li>Remove Nitrate & Phosphate</li>\r\n<li>Algae Control</li>\r\n<li>Reduce/Eliminate Water Change</li>\r\n</UL>\r\n\r\n<b>Videos:</b>\r\n<b><a href=\"http://youtu.be/p0kZq88e8Qk \">Unboxing and Installation</a></b>\r\n<b><a href=\"http://youtu.be/LlL1xvll1r0\">Overview: part 1</a></b>\r\n<b><a href=\"http://youtu.be/E6Nc719qgXg\">Overview: part 2</a></b>\r\n<b><a href=\"http://youtu.be/2pxIB7FeJHo\">First harvest at 13 days in saltwater</a></b>\r\n\r\n<b>SURF2 Overview</b>\r\n\r\nThe algaculture system offers drop-in installation, reduction or elimination of water changes and nuisance algae, along with almost no-light and almost no-sound, and possibly most important, one-handed cleaning with no disassembly required. It operates the way the oceans and lakes do, using algae to do all the filtering, and truly can replace all other filters in your aquarium.\r\n\r\nThe SURF2™ is the world's first floating surface Upflow Algae Scrubber® (also called a UAS®). It is also the first Ribbon Scrubber®, which is what allows the algae to be removed from the scrubber with one hand without needing to disassemble anything or take anything to the sink. Simply lift up the lid and pull the algae out. The algae can be fed to fish and other organisms as in the aquarium.\r\n\r\nThis SURF2 floating surface scrubber has over 24 square inches (150 square cm) of extremely rough Green-Grabber™ algal growth surface which can grow up to a 2\" (5 cm) thick block of green hair algae. This is about two full handfuls, and is designed to absorb the nutrients from this much feeding per day: \r\n\r\n2 Frozen cube, or\r\n20 Pinches of flake, or\r\n20 Square inches (125 square cm) of nori, or\r\n5.6 grams of pellets\r\n\r\nThe physical size or number of gallons or liters of water in your tank or sump does not matter. If you feed more than the above amounts, you can get multiple SURF2 units; multiple units are preferred over one larger unit because you can clean one unit per week, and because you'll always have one unit filtering while the other one starts growing again after a cleaning. Multiple SURF2 units are also good for backup.\r\nThe SURF2 starts with two air bubble openings at the bottom, where upflowing air bubbles (from a strong air pump, sold separately) flow up into the growth compartment and bring aquarium water with it. As the bubbles and water enter the growth compartment they rub the algae-attachment ribbons and get blasted by the super-red 660nm LED light. The bubbles then circle around and around inside the growth compartment, rubbing against the ribbons and the Green-Grabber super-rough rock-hard attachment textures as the bubbles rise up to the water surface. This repeated rubbing of bubbles causes algae to start growing on the ribbons and textures; freshwater grows thin stringy algae, and saltwater grows thicker, denser algae. The air then goes out of the top of the unit, quietly and with no salt spray, and the water goes down and out two holes in the bottom, without any bubbles remaining.\r\n\r\nA few features of the SURF2 provide real usefulness and are available on no other algae scrubber. First, the enclosed growth compartment increases the dwell time of the water and bubbles inside the unit so that they rub the algae many times before leaving the compartment. This actually reduces nutrients (nitrate, phosphate) to a level lower than the outside water, which allows greener growth to occur sooner (lower nutrients grows greener algae) inside the unit, especially in high-nutrient aquarium water. In other words, the SURF2 creates a lower-nutrient ecosystem inside itself which is different from the rest of the water in your aquarium. Also, the position of the air bubble inlets (below the growth) causes the bubbles to flow through the growth no matter how thick the growth gets. This is in contrast to waterfall scrubbers, which mostly flow water on the outside of the growth, leaving the inner layers of growth without flow.\r\n\r\nAnother feature which was highly requested was quiet operation. Since the SURF2 does not touch the aquarium glass or sump glass, and since it's made of heavy material surrounded by foam, it is by far the quietest algae scrubber ever made, As a matter of fact it's almost silent (the air pump is usually louder). The thick and heavy gauge plastic growth container is coated internally by even thicker and heaver Green-Grabber textures, and is surrounded on the outside by 1\" (2.5 cm) of closed cell polyethylene foam. This stops virtually all sound from going sideways. And the 1/2\" (12 mm) thick LED lid is filled with super dense but flexible silicone, which absorbs more sound than a rigid structure would, and much more than a non-sealed structure would. Lastly the path that air has to take to get out of the top requires the air to first go sideways towards the foam, and then upwards along the foam; this allows the foam to absorb any remaining sound exactly the way foam absorbs sound in a studio. So while you may hear very muffled bubbling if the filter were next to your bed at night, you will hear nothing if there is any other activity occurring in your house.\r\n\r\nAnother great feature is the elimination of salt spray (for saltwater). Since the air must come up through the narrow space between the LED lid and the foam, all the salt spray remains in the growth compartment where it is washed away by the water. There sometimes is the occasional bubble that comes out the top, but it's practically nothing compared to the splashing of waterfall scrubbers. And if the unit does ever need to be \"washed\", you just push it under the water surface for a few seconds and let water flow over the top; no need to take it to the sink.\r\n\r\nBubble removal is probably the most-requested feature. Any and all algae scrubbers, whether they are upflow, waterfall or horizontal rivers, all have bubbles which must be removed. The internal growth compartment of the SURF2 keeps bubbles inside the almost 2\" deep internal water level, only letting water out of the two small holes at the bottom after the air has escaped out the top. Thus, no bubbles get into the aquarium or sump water; only a little red light, which gets less as growth gets thicker. And of course the quicker you can grow green algae inside the unit, the quicker you will remove nutrients and nuisance algae from your aquarium, and/or the quicker you can supply fresh green seaweed to your livestock.\r\n\r\nThe Green-Grabber algal growth attachment surface is so rough and prickly that is might be the roughest thing you've ever felt. A cactus might be sharper, but that's about it. Rough surfaces are critical for allowing algae to attach and grow and thus provide strong absorption of nutrients. The rock-hard protrusions stick straight out 1 to 3 mm. Previous algae scrubber screens were made from \"slippery\" plastic canvas that is used for sewing and knitting; algae take a long time to attach to it. Green-Grabber growth surfaces are not plastic at all; instead they are rock hard and have jagged rough edges and points (don't let children play with them). Green-Grabber surfaces are so good at grabbing algae and letting it grow that you may start seeing tiny growth spots within hours, instead of days. And the white color of the Green-Grabber surface reflects as much light as possible, allowing lots of light to reflect back to the algae.\r\n\r\nThe main advantage of the SURF2 or any algae scrubber is that if you size and operate it properly, it can be the only filter for your tank, even replacing water changes. It can, however, also be used with other filters. Some other filters such as carbon dosing (Zeo, pellets, etc) may slow down the scrubber, but nothing will really \"hurt\" the scrubber except possibly large amounts of algaecide or copper medications. The SURF2 cannot even dry out, since it's always under water.\r\n\r\nThe SURF2 will run on both 120V and 240V, and comes with a 10 ft (300 cm) power cord with a U.S. plug. If you require a different plug you can get an adapter at any local hardware or travel store, or online, or you can cut off the U.S. plug and install your own plug from a hardware store. It is a simple 2-wire plug.\r\n\r\nComes with 3 ft (90 cm) of dual vinyl airline, but requires a 2-outlet air pump that can pump at least 5.0 total liters per minute (0.2 cfm), which small low-cost pumps cannot do. Pumps that say they can handle 10 or more airstones, or pumps with 2 tubing attachments instead of one, are best..You can have as much air as you like, however; 5.0 lpm pumps are no problem. One powerful pump which works exceptionally well for a low cost is the Fusion 700 from JW Pet. It is quiet and has two outputs which are adjustable by turning the control knob; the two outputs perfectly match the two air inlets on the SURF2  Another even more powerful and completely silent pump, although more expensive and without a control, is the Whisper 300 from Tetra. The Whisper 150 also works but you will need two of them. Make sure to put any pump above the aquarium so that it will not drain any water if it shuts off.\r\n\r\nThe LED lid contains 4 red (660 nm) 3-watt LEDs, which are attached to an aluminum heat sink which is black to reduce heat; it does get warm. The LEDs will give the aquarium or sump a slight red color at night when the aquarium lights are off, but this will occur less as the SURF2 fills with growth. You will need to get a timer so you can run the LEDs for up to 22 hours per day (not 24!). The LEDs never needs replacing.\r\n\r\nThe SURF2 will need to be cleaned (\"harvested\") every 7 to 21 days. Just lift up the LED lid, grab a handful of algae, and pull it out. You can even feed some of the algae to your fish. You do not need to take anything apart, or take anything to your sink.\r\n\r\nThe SURF2 comes with a 60 day warranty: Warranty is for replacement or repair only; not a refund. Costs for shipping back to us are covered if you are in the U.S. Costs for shipping back to us are not covered if you are not in the U.S., however we will pay for shipping back to you. In either case, you will need to ship the entire unit back to us before we can ship a replacement. Warranty is limited to repair or replacement, and does not cover fish loss, personal injury, property loss, or direct, incidental or consequential damage arising from the use of it. The warranty and remedies set forth above are exclusive and in lieu of all others, whether oral or written, express or implied. We specifically disclaim any and all implied warranties, including but not limited to lost profits, downtime, goodwill, damage to or replacement of other equipment and property, and any costs of recovering animals, plants, tanks or other aquarium related items and/or equipment. We are not responsible for special, incidental, or consequential damages resulting from any breach of warranty, or replacement of equipment or property, or any costs of recovering or reproducing any equipment, animals or plants used or grown with this product.\r\n\r\nSURF2 size: 6\" wide by 8\" long by 3\" thick (15 cm wide, 20 cm long, 7.5 cm thick). It requires at least 3\" (7.5 cm) of water to operate in.\r\n\r\n\r\n\r\n","options":[{"id":41818293,"name":"Default","price":295.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123125610/-/algaculture.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123125610/-/algaculture.png","width":1140,"height":1138},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123125619/-/algaculture_surf2_figure1.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123125619/-/algaculture_surf2_figure1.png","width":633,"height":632},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123127032/-/algaculture_surf2_figure2.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123127032/-/algaculture_surf2_figure2.png","width":575,"height":571}],"artists":[],"categories":[]},{"id":8429370,"name":"Grindal Worm","permalink":"grindal-worm","position":2,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/grindal-worm","status":"active","on_sale":false,"created_at":"2012-12-07T20:55:13.000Z","description":"<b>8 oz Live Grindal Worm Culture For Sale</b>\r\n\r\nGrindal Worms, <i>Enchytraeus buchholzi</i>, are annelid worms that are great for feeding fish fry. Grindal worms were first isolated from White Worms by Mrs. Morton Grindal in Solna, Sweden in the 1950’s. Today, Grindal Worms have become one of the most popular live fry foods in both hobby aquarists and aquaculture. The popularity of Grindal Worms is due to their numerous favorable characteristics as a superior live fish food. First of all, Grindal Worms measure approximately half the size of <a href=\"http://www.fishgobble.com/product/white-worm\"><b>White Worms</b></a>. This makes them an ideal candidate for feeding fry that have outgrown smaller foods such as Microworms and Vinegar Eels. Grindal Worms serve as a valuable food source since fry in this stage are still mechanically limited from consuming larger White Worms and other commercial food sources. However, Grindal Worms are not merely a transitional food as they are very nutritious as well. Grindal Worms' nutritional value is superior to many traditional food source for fish fry. In fact, their high protein content have shown to allow achievement of peak growth rates for the development of the most robust specimen. A <a href=\"http://www.fishgobble.com/product/worm-feeder\"><b>worm feeder</b></a> can often times aid in efficient feeding. Another favorable characteristic of Grindal Worms is its prolific nature. When neccessary conditions are satisfied, Grindal Worm cultures can provide an abundance of food for fish fry. Every Grindal Worm produces approximately 1000 offspring in their lifetime. Since Grindal Worms are hermaphroditic, containing both male and female reproductive organs, the entire population is able to produce their individual cocoons which are full of eggs. The preference of relatively warmer temperatures contributes to the prolific nature of Grindal Worms as well. Grindal Worms prefer temperatures in the range of 20 – 30 °C.\r\n\r\n<b>Size</b>\r\n<ul>\r\n<li>Length: 7 mm</li>\r\n<li>Diameter: 0.5 mm</li>\r\n</UL>\r\n\r\n<b>Nutritional Value</b>\r\n<ul>\r\n<li>Protein: 70%</li>\r\n<li>Fat: 14.5%</li>\r\n<li>Minerals: 5.5%</li>\r\n<li>Carbohydrates: 10%</li>\r\n</UL>\r\n\r\n<b>Grindal Worm Culture</b>\r\nGrindal Worms can be cultured in a variety of containers. The container should allow air exchange but prevent other insects from contaminating the culture. Wooden boxes provide great moisture control and air exchange at the same time. However, plastic containers with ventilation holes can also be used. The opening of ventilation holes should not exceed 2 mm to prevent external contamination. An alternative method is to make a larger opening with a sponge or cloth stuffing. Grindal Worms are cultured in a mixture of potting soil and peat moss with a 1:1 ratio. Only organic potting soil without chemical fertilizers should be used. The peat moss is used to aid in moisture retention. The pH of the culture media should be maintained at 6.8 – 7.2. If the culture is too acidic, either decrease the ratio of peat moss or boil it prior to adding it to the mixture. The soil must be maintained moist at all times. If the culture is too dry Grindal Worms will start burrowing deep into the soil in search of moisture. At this point both the growth rate and reproduction rate of Grindal Worms will drop significantly. If the culture is too wet there will be a strong odor due to a lack of oxygen. Wet cultures are highly prone to crashing as well. The optimum soil humidity is 18 – 23%. Alternative soil-less cultures include coconut fiber cultures and sponge cultures. In soil-less cultures, it is necessary to pay special attention to the moisture level. In order to maintain peak production, Grindal Worms should be provided with a constant food source. However, at the same time overfeeding must be avoided in order to maintain a healthy culture. Thus, small frequent feeding is the key. This rule hold true especially for new cultures. The following are some of the food that can be fed to Grindal Worms:\r\n\r\n<ul>\r\n<li>Oatmeal</li>\r\n<li>Bread</li>\r\n<li>Trout Feed</li>\r\n<li>Dry Cat Food</li>\r\n<li>Mashed Potato</li>\r\n<li>Mashed Carrot</li>\r\n<li>Mashed Banana</li>\r\n<li>Boiled Spinach</li>\r\n</UL>\r\n\r\nTo harvest Grindal Worms, place a glass or mesh sheet on top of the food. This will make it possible to swipe the worms off the sheet as the Grindal Worms will climb on it. Mature cultures should be harvested regularly to prevent overcrowding, which can lead to crashing. It is important to regularly monitor and maintain a Grindal Worm culture. The key to a healthy culture is to identity and address problems as quickly as possible. Some of the common issues with Grindal Worm cultures are mites and mold. Grindal Worm mites are very common especially in cultures with a soil based medium. While it can be difficult to completely eliminate mites in a soil based culture, mites population can be controlled effectively through a variety of methods. While manually removing individual mites can be a tedious task, clumps of mite populations can be removed while they are congregating on a food source. Another method of removing mites in Grindal Worm culture is to temporarily flood the entire culture. Mites can be effectively removed from the culture as they float on the surface of the water. For a culture with excessive mites, re-culturing may be a better option. While removal of mites are necessary at times, the key is to control the population of mites by moisture control and  preventing excessive food left over. In order to achieve a completely mite-free Grindal Worm culture, a soil-less culture is more realistic. Another common issue with Grindal Worm culture is mold. Similarly to mites, mold can be controlled by moisture control and preventing excessive food left over.","options":[{"id":26512860,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105409665/-/grindal_worm.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105409665/-/grindal_worm.png","width":802,"height":806}],"artists":[],"categories":[]},{"id":8429391,"name":"White Worm","permalink":"white-worm","position":3,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/white-worm","status":"active","on_sale":false,"created_at":"2012-12-07T20:55:48.000Z","description":"<b>8 oz Live White Worm Culture For Sale</b>\r\n\r\nWhite Worms, <i>Enchytraeus albidus</i>, are commonly cultured by aquarists as a form of live fish food. The wiggling motion of the White Worms in water makes them irresistible to even the pickiest eaters.  The various applicability and acceptance of White Worms has led to its widespread popularity. The first large scale production of Enchytraeus albidus was conducted by the former Soviet Union in the 1940’s. When the high nutritional value of White Worms were discovered, they were readily applied to enhance the increasing efforts in fish culturing. The relative high protein content made the White Worms worthy of a weekly production of up to 300 kilograms, mainly for use as juvenile sturgeon feed. Extensive studies on the nutritional value and cultivation of White Worms were conducted in the former Soviet Union during this period. Today, Enchytraeus albidus are commonly used as a standard test organism in various biological and toxicological studies. Since White Worms are sensitive to chemical contamination and other stress factors, their population level and gene expression is used to determine the effects of stressors on the environment. In the aquaculture industry, White Worms are commonly cultured in various sectors as fish feed. Large scale production is implied to integrate White Worms in formulated fish diets as a quality stock enhancement. Live forms of White Worm are commonly used for feeding smaller specimen or juvenile specimen via <a href=\"http://www.fishgobble.com/product/worm-feeder\"><b>worm feeders</b></a>. Besides fish, White Worms are also used to feed frogs, newts, reptiles, birds, and larger invertebrates.\r\n\r\n<b>Size</b>\r\n<ul>\r\n<li>Length: 20 mm</li>\r\n<li>Diamter: 1 mm</li>\r\n</UL>\r\n\r\n<b>Nutritional Value</b>\r\n<ul>\r\n<li>Protein: 70%</li>\r\n<li>Lipids: 14.5%</li>\r\n<li>Minerals: 5.5%</li>\r\n<li>Carbohydrates: 10%</li>\r\n</UL>\r\n\r\nThe use of White Worm for fish is very extensive. In fact, White Worms are one of the most valuable source of live food for fish and fish fry. The high protein content of White Worms enables peak growth rates for the most robust specimen. The particular size of White Worms makes them suitable for feeding fish that have outgrown smaller fish food such as <a href=\"http://www.fishgobble.com/product/microworm\"><b>Microworm</b></a>, <a href=\"http://www.fishgobble.com/product/brine-shrimp\"><b>Baby Brine Shrimp</b></a>, and <a href=\"http://www.fishgobble.com/product/grindal-worm\"><b>Grindal Worms</b></a>. The White Worms nutritional value consisting of high protein content makes them a great candidate for conditioning fish for breeding conditions. Spawning behavior of various species of fish can be triggered with the aid of White Worms. Since oligochaetes constitute a significant portion of food for fish in the wild, White Worms are a suitable food source to help mimic such natural environments.\r\n\r\n<b>White Worm Culture</b>\r\nEnchytraeus albidus are hermaphroditic, with each individual specimen consisting of both male and female reproductive organs. Each specimen will produce a cocoon filled with eggs. While cocoon produced by younger specimen contain only about 10 eggs, mature specimen will produce cocoon with over 20 eggs. There have been reports of cocoons with up to 35 eggs. The egg filled cocoon hatches in 12 days after fertilization. Within the next 20 days, the newly hatched offspring will start to produce cocoons as well. An average White Worm will produce approximately 1000 eggs in their lifespan. In ideal conditions, White Worms can reproduce very rapidly and increase their population exponentially. In order to establish a successful White Worm culture, it is important to understand the necessary parameters. A White Worm culture care must not be neglected in order to constantly produce a high volume of fish food. Productive cultures can provide an abundance of high quality live fish food and routinely feed an entire fish room. White Worms must be maintained in a cool dark environment. The optimum White Worm culture temperature range is 12 – 21 °C. The higher range of the scale will result in faster maturity. However, production will slow down past 21 °C and the population will decrease with temperatures nearing 30 °C. White Worms will also die at temperatures nearing 0 °C. Wine chillers and small refrigerators can be used to effectively control the temperature of a culture year round. A variety of containers can be used to culture White Worms. One popular option for White Worm cultures are shallow wooden boxes. Wooden materials allow great moisture control and aeration at the same time.  Wooden boxes can be constructed from pine or plywood. Alternative materials such as plastic and Styrofoam containers can be used as well as long as proper drainage and ventilation is provided. The ventilation holes should not exceed 2 mm in order to prevent contamination. An alternative method to small ventilation holes is to provide a larger opening with a sponge or cloth barrier. Since plastic and Styrofoam materials prevent air flow, it is necessary to routinely mix the culture media. Another important component of the culture container is the lid. The lid will prevent contamination of insects such as ants, beetles, flies, and mites. More importantly, the lid will block light as White Worm dislike any form of light. In order to satisfy this condition, transparent containers should be largely avoided unless the culture will remain in a dark environment. White Worm culture media should contain a high portion of organic matter. A pH of 6.8 – 7.2 is considered the optimum range, resulting in peak production levels. White Worms will not survive any acidic soils with pH levels below 5. In order to provide such conditions, there are various types of White Worm culture medium that can be used. The most common type of culture media for a White Worm culture is a soil based media. This consists of a 1:1 mixture of soil and peat moss. Potting soil with any addition of chemical fertilizers, sterilizers, or pesticides should be avoided as it will ultimately be passed onto the fish. Soil with a sandy or clay-like texture should be avoided as it will not provide proper aeration. Light soil with a mixture of coarse material is suitable as it will remain loose under moist conditions and provide adequate air flow. Soil for plant seedlings are specifically designed to maintain moisture and remain loose at the same time. It is recommended to test the acidity of the mixture before application for best results. If the soil pH is acidic, the ratio of the peat moss can be reduced. The acidity can also be reduced by boiling the peat moss prior to adding it into the mixture. The latter method is more favorable as the ratio of the mixture will not be altered. While peat moss can slightly lower the pH of the culture media, it is highly beneficial to the culture as it provides superior moisture retention and control. If the soil in the culture media is from an outdoor source, it should be thoroughly searched for any contamination before adding it to the mixture. Small insects and larvae in the soil should be removed. Since outdoor soil often contains many small organisms such as mites that are difficult to detect to the naked eye, it is recommended to dry the soil out completely to get rid of them. In order to thoroughly dry out the soil, spread the soil out to a thin layer under strong sunlight for a few days. A quick way to get rid of small mites in the soil is the microwave the soil. Purchasing the soil may be easier since soil from hardware stores and garden centers are treated prior to packaging. It is possible to culture White Worms with a soil-less culture media as well. Some of the options for a soil-less culture media include coconut fiber and sponge. The advantage of soil-less culture is the ease of maintaining cleanliness. However, a soil-less culture generally requires more attention and frequent maintenance since it lacks moisture retention. For White Worm cultures, the culture media should be maintained very moist at all times. Thus, the application of an inner surface cover is helpful. The surface cover can make harvesting the White Worms easier as well. Any flat material such as a thin piece of glass or plastic can be gently applied on the surface. The moisture retention is crucial since dry culture media will result in lower production rates and will ultimately result in the culture crashing. However, the moisture level must not be too wet either in order to maintain necessary air flow. A wet culture will produce an anaerobic environment which will also cause the culture to crash very quickly. Thus, a moist culture media with aeration must be maintained at all times. White Worms should be fed at the surface of the culture media for better monitoring of the culture condition and easier harvesting as well. By placing a flat piece of glass or plastic on the feeding surface, the food underneath will maintain the necessary moisture for the White Worm to feed on it. The feeding amount should be relative to the size of the population in the culture. Overfeeding must be avoided as an excess of food can rot and cause a variety of issues. At the same time, White Worm cultures should not be left without food for extended periods of time in order to maintain peak production level. Thus, the key is to provide small frequent feedings. Small frequent feedings are especially important for newly establishing cultures. The type of food can also determine the amounts of food that can be fed. Foods that are prone to rapid deterioration should be fed to only last a couple days. On the other hand, foods less prone to rotting such as dry food can be fed in larger quantity to last longer. The following is a list of food that can be fed to White Worms:\r\n\r\n<ul>\r\n<li>Bread Soaked in Milk/Yogurt</li>\r\n<li>Oatmeal</li>\r\n<li>Trout Feed</li>\r\n<li>Dry Cat Food</li>\r\n<li>Mash Potato</li>\r\n</UL>\r\n\r\nIn order to harvest White Worms lightly place a flat material on the surface of the culture. By placing a source of food under the flat material, White Worms will gather in the area and climb on the surrounding flat surface. In order to harvest, lift the flat material and scrap the worms off the surface.  Alternatively, if a mesh surface is placed on the surface, the White Worms will gather in a mound on the top of the mesh where the food was placed. This method is highly efficient since it make it possible to collect a large amount of White Worms without the soil. It is advisable to feed White Worms in a bare bottom tank. Otherwise, feed slowly through a pipette or a worm feeder.  White Worms will remain alive in underwater for several hours. As with all foods, uneaten White Worms should be removed in order to prevent water pollution. Lastly, one must be careful not to overfeed since fish will greedily feed on White Worms. Regular maintenance is crucial in order to maintain peak production levels in a White Worm culture. Without regular maintenance, a culture can quickly crash resulting from various issues. While examining a White Worm culture, it is important to pay special attention to the moisture level of the culture media. If the soil is too dry, the worms will burrow deep into the soil and ignore the food. When the soil is too wet, aeration of the culture media may be affected. In addition, it is important to regularly monitor the food level and any other irregularity. Some of the common issues with White Worm cultures are mites and mold. White Worm mites are very common especially in cultures with a soil based medium. While it can be difficult to completely eliminate mites in a soil based culture, mites population can be controlled effectively through a variety of methods. While manually removing individual mites can be a tedious task, clumps of mite populations can be removed while they are congregating on a food source. Another method of removing mites in White Worm culture is to temporarily flood the entire culture. Mites can be effectively removed from the culture as they float on the surface of the water. For a culture with excessive mites, re-culturing may be a better option. While removal of mites are necessary at times, the key is to control the population of mites by moisture control and preventing excessive food left over. In order to achieve a completely mite-free White Worm culture, a soil-less culture is more realistic. Another common issue with White Worm culture is mold. Similarly to mites, mold can be controlled by moisture control and preventing excessive food left over.","options":[{"id":26512953,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105409701/-/white_worm.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105409701/-/white_worm.png","width":1000,"height":1000}],"artists":[],"categories":[]},{"id":10520635,"name":"Wingless Drosophila","permalink":"wingless-drosophila","position":4,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/wingless-drosophila","status":"sold-out","on_sale":false,"created_at":"2013-04-13T06:37:06.000Z","description":"<b>Live Wingless Drosophila Culture for Sale</b>\r\n\r\nWingless Drosophila, or wingless fruit flies, are great for feeding various species of fish, reptiles, and amphibians. Measuring approximately 3 mm in length, Drosophila are convenient bite size food for various types of aquarium fish. Many tropical fish, especially top feeders, will appreciate Drosophila since insects consists of a large part of their diet in their natural environment. The ease of culturing and high nutritional value explains the widespread use of Drosophila in hobby fishkeeping and aquaculture. Wingless Drosophila allows ease of maintaining and feeding live fruit flies without escaping insects. A culture of Drosophila can produce an abundance of nutritious food on a continuous basis.\r\n\r\n<b>Nutritional Value</b>\r\n<ul>\r\n<li>Protein: 71.8%</li>\r\n<li>Fat: 21.4%</li>\r\n<li>Minerals: 6.9%</li>\r\n</UL>\r\n\r\n<b>Culturing Wingless Drosophila</b>\r\nCulturing Drosophila requires a container with a ventilated lid and a form of culture media. The ventilated openings on the culture container can be covered with a mesh material or a sponge in order to prevent the Drosophila from escaping. The culture media for fruit flies are readily available commercially. However, a simple oatmeal and yeast culture media can be used to culture the Drosophila as well. A moist culture media must be maintained to allow the reproduction cycle to continue. Optimum reproduction occurs at 70-80 degrees Fahrenheit. \r\n","options":[{"id":32959123,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105409629/-/wingless_drosophila.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105409629/-/wingless_drosophila.png","width":1000,"height":995}],"artists":[],"categories":[]},{"id":12416289,"name":"Brine Shrimp Eggs","permalink":"brine-shrimp-eggs","position":5,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/brine-shrimp-eggs","status":"active","on_sale":false,"created_at":"2013-07-17T10:30:02.000Z","description":"<b>50 grams of Brine Shrimp Eggs for Sale</b>\r\n\r\nBrine shrimp, <i>Artemia</i>, are aquatic crustaceans that are found in saltwater lakes worldwide. Interestingly however, brine shrimp are not found in oceans. The high salinity levels in lakes provide brine shrimps an ecological niche as most fish are unable to survive in such habitats. These primitive arthropods have been so successful throughout their long history of 5.5 million years due to their ability to produce resting eggs, also known as cysts. The cysts are produced when they are faced with unfavorable conditions such as drought and food scarcity. This characteristic is called cryptobiosis, which allows brine shrimp eggs to survive for approximately two years. In fact, under favorable conditions, brine shrimp eggs can remain viable for up to 25 years. As a cyst, brine shrimp are able to survive extreme cold and temporary heat. However, a few hours of exposure to salty water triggers the brine shrimp eggs to hatch into small nauplius. This convenient characteristic and ability to be stored for an extended period of time have lead to its extensive use in aquaculture farming and a variety of fish breeding programs. Their small size, relatively high nutritional value, and ease of operation have also contributed to their popularity. In addition, the small size of the nauplii have proven useful as it allows small fry that are mechanically limited in larger particles of food to feed on a quality source of feed. Feeding instar I nauplii, which are nauplii with the egg yolk reserve still attached to their body, are especially nutritious and suitable to meet the specific dietary requirements of newborn fry. In order to further increase the nutritional value of brine shrimp, bioencapsulating or bio-enhancing by <a href=\"http://www.fishgobble.com/product/green-water-culture\"><b>Spirulina</b></a> 3-4 hours prior to using as feed is effective. However, since <i>Artemia</i> do not start feeding until after their second molt as instar II nauplii, this method is not effective on instar I nauplii. In addition to its increased nutritional value, this method has proved to enhance immunity in livestock by increasing phagocytic activity. Since brine shrimp can be hatched on demand after a one-day incubation period, it can prove to be cost-effective for facility with limited demand. \r\n\r\n<b>Size</b>\r\n<ul>\r\n<li>Diameter of hydrated cysts: 240 microns</li>\r\n<li>Length of Instar I nauplii: 450 microns</li>\r\n</UL>\r\n\r\n<b>Nutritional Value</b>\r\n<ul>\r\n<li>Protein: 55%</li>\r\n<li>Fat: 14%</li>\r\n<li>Minerals: 8.1%</li>\r\n<li>Moisture: 7.0%</li>\r\n</UL>\r\n\r\n<b>Hatching Brine Shrimp</b>\r\n<br>\r\nHatching baby brine shrimp takes approximately 24 to 48 hours. For the optimum hatching rates, use high quality eggs that were stored in an environment free from moisture at a temperature range of 5-10°C. In addition, it is important to provide the cysts with favorable conditions to trigger hatching. The following are the materials required to hatch brine shrimp eggs:\r\n<ul>\r\n<li>Brine shrimp eggs</li>\r\n<li>Marine salt</li>\r\n<li>Dechlorinated water</li>\r\n<li>Hatching cone</li>\r\n<li>Air supply</li>\r\n<li>Light source</li>\r\n</UL>\r\n\r\nPrepare the solution by dissolving 2 tablespoon of salt per gallon of dechlorinated water. The salinity should be at least 15 ppt (parts per thousand) at a gravity of 1.011 measured with a hydrometer. The salinity can be as high as 40 ppt at a gravity of 1.030. Proper pH is also important since low pH can drastically drop the hatch rate. Optimum pH is between 8.0 and 8.5. Baking soda can be added to control the pH. This solution will be set up in a cone shaped container with the narrow end at the bottom. This is to allow all incubating eggs to circulate and aerate. For this purpose, flat bottom hatching vessels are generally not used. Standard 2 liter bottles can be utilized by removing the base and flipping it upside down. In order to provide high oxygen levels to the cysts, it is crucial to have constant and strong aeration. 3 ppm (parts per million) is desirable for optimum hatch rates. A standard airpump and airline tubing setup is sufficient for most setups. The end of the airline tubing must be weighed down or secured to the bottom of the container. Airstones that discharge small bubbles are not recommended as it can result in hatched nauplii to stick to the bubble and die. However, larger bubbles and strong aeration will not damage the nauplii. For the light source, fluorescent lamps or any 60-100 watt bulb placed 3 to 8 inches away from the hatching cone will be sufficient. The light source will aid in raising the temperature to the desired range of 26-28°C. Incubation in the lower temperature range will result in longer hatching time. However, do not exceed temperature above 30°C. Once the aerated saline solution is placed under a light source, add the cysts into the hatching cone. For optimum hatching rates, add 1 gram of brine shrimp egg per liter.  Cysts will hatch in approximately 24 to 48 hours. After hatching brine shrimp, stop the air supply to allow the water to settle. After a couple minutes, the newly hatched nauplii will either settle on the bottom of the hatching cone or congregate near the light source. At this time, the shells can be separated from the nauplii as it will float on the surface. Since the environment for incubating <i>Artemia</i> is also ideal for other bacteria, it is important to rinse the baby brine shrimp with clean fresh or salt water through a fine mesh prior to feeding them to fry. Likewise, equipment used for incubation should also be cleaned and disinfected. Diluted household bleach solution or a light chlorine solution can be used. However, soap should be avoided. Rinse well and air-dry between uses.\r\nThe following summarizes the optimum parameters for hatching baby brine shrimp:\r\n<ul>\r\n<li>Salinity: 15-40 ppt</li>\r\n<li>pH: 8.0-8.5</li>\r\n<li>Temperature: 26-28°C</li>\r\n<li>Aeration: 3 ppm</li>\r\n<li>Stock Density: 1 gram of cyst per liter</li>\r\n</UL> \r\n\r\n<b>Brine Shrimp Life Cycle</b>\r\nBrine shrimp start their year long life cycle as nauplii from either a developing embryo in a mature female or from a dormant cyst. At this very first stage as an instar I nauplii, they measure only 240 microns. As soon as the yolk sac is absorbed, they become instar II nauplii. As the nauplii goes through their series of 14 to 17 molts as a brine shrimp larvae, they shed their old exoskeleton to allow growth. The best growth rate in <i>Artemia</i> can be observed under warm water, stable food source, and high oxygen levels. At such optimum conditions, brine shrimp can develop from a nauplii to an adult in as little as 8 days. In their natural environment however, it is more common for brine shrimp to mature during a longer span of approximately 3 to 6 weeks. Adult female brine shrimp under favorable conditions will go through viviparous reproduction by releasing developing embryos into the water. Viviparous reproduction is common in lower salinity levels. On the other hand, oviparous reproduction occurs under unfavorable condition when salinity level exceeds 150 ppt. The embryo develops into gastrulae, encapsulated in a protective cyst shell. In their natural environments, the hatching mechanism is triggered when the salinity level drops with rainwater and other incoming water source.    \r\n","options":[{"id":39408783,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121412967/-/brine_shrimp_cyst.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121412967/-/brine_shrimp_cyst.png","width":1012,"height":1006}],"artists":[],"categories":[]},{"id":9627047,"name":"Gammarus Shrimp","permalink":"gammarus-shrimp","position":6,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/gammarus-shrimp","status":"active","on_sale":false,"created_at":"2013-02-25T17:09:08.000Z","description":"<b>8 oz Live Gammarus Shrimp Culture For Sale</b>\r\n\r\nGammarus Shrimp, also known as Gammarus Scuds, are freshwater amphipod crustaceans naturally occuring in slow running rivers and lakes measuring approximately 1 cm. They are often found in slow runs over Chara weed, providing a staple preferred food source for trout. Likewise, they are a readily consumed by nearly all aquarium fish. Not only do they provide a great source of protein and roughage to aid in digestion, they are one of the best natural color enhancing food for fish. Trout heavily fed on scuds are known to be not only well fattened, but also the most colorful. Uneaten scuds are known to survive in aquarium condition, providing an occasional opportunistic treat for aquarium fish. In addition, scuds are beneficial in maintaining stable water chemistry as they aid in processing uneaten fish food and decomposing fish waste. They are known to prolong the use of aquarium filter as they feed on the debris on the aquarium filter. Eliminating an established colony of scuds in an aquarium can be difficult without changing the aquarium filter and washing the gravels. Juvenile scuds can be cultured to be fed to smaller fish and fish fry. By simply providing aeration, food, and a dark environment, scuds will readily reproduce to provide a constant source of nutrition rich food.\r\n\r\n<b>Gammarus Shrimp Culture</b>\r\nFor a successful Gammarus Shrimp culture, it is crucial to provide a dark aerated environment. Raising Gammarus Shrimp in such environment can be achieved by either providing a water flow or shallow water with a large surface area. Gammarus Shrimp diet varies widely as they are omnivorous feeders and are not very picky eaters. Breeding Gammarus Shrimp is simple, yet has a few basic requirements. First of all, it is important to provide a source of cellulose in order to breed them effectively. Adding dried Alder leaves and <a href=\"http://www.fishgobble.com/product/green-water-culture\"><b>green water</b></a> is beneficial. Clean water, good aeration, and slightly alkaline water rich in calcium will achieve the highest yield in a scud culture. The optimum temperature for a Gammarus culture is 68-86 degrees Fahrenheit and a pH of 6.8 to 7.5.","options":[{"id":30117975,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105409857/-/gammarus_shrimp.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105409857/-/gammarus_shrimp.png","width":1000,"height":996}],"artists":[],"categories":[]},{"id":9627161,"name":"Daphnia Magna","permalink":"daphnia-magna","position":7,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/daphnia-magna","status":"active","on_sale":false,"created_at":"2013-02-25T17:20:14.000Z","description":"<b>8 oz Live Daphnia Magna Culture for Sale</b>\r\n\r\nDaphnia magna is a small freshwater crustacean that is suitable for feeding various types of fish and other aquatic species. Reaching to up to 5 mm in length, Daphnia magna is one of the largest species of the order Cladocera. Smaller members of this orders are <a href=\"http://www.fishgobble.com/product/daphnia-pulex\"><b>Daphnia pulex</b></a>  and <a href=\"http://www.fishgobble.com/product/moina\"><b>Moina</b></a>. These small crustaceans are collectively referred to as \"water fleas.\" Due to their prolific nature and high nutritional benefit, they are widely used in aquaculture. Not only do fish love these irresistible treats, they are in fact highly beneficial for the fish as well. As a part of a balanced diet, Daphnia provide a great source of roughage for healthy digestion. In addition, the abundance of vitamin A and D especially in live Daphnia enables proper bone production for fish. Lack of it can cause not only stunted growth but also bent spines, which are both commonly observed in aquarium fish. Routinely feeding Daphnia can significantly improve a fish’s color as well.\r\n\r\n<b>Nutritional Value</b>\r\n<ul>\r\n<li>Protein: 66%</li>\r\n<li>Fat: 9.0%</li>\r\n<li>Fiber: 5.0%</li>\r\n<li>Crude Ash: 0.1%</li>\r\n</UL>\r\n\r\n<b>Culturing Daphnia Magna</b>\r\nThe ease of culturing Daphnia magna allows a wide variety of culture methods from small bottle cultures to mass culture in large aquaria as implemented in aquaculture. A simple and relatively stable Daphnia magna culture can be achieved with a bucket set up with a source of aeration. A pH of 7-8 and a temperature of 65-75 degrees Fahrenheit is the optimum setting for Daphnia. Since Daphnia are sensitive to chlorine, all water used in Daphnia culture must be dechlorinated. Furthermore, if the water is soft, harden the water by adding limestone or crushed corals into the water. Daphnia feed on a great variety of food source including bacteria, yeast, and phytoplankton. In fact, Daphnia can survive for a limited period of time on a diet consisting of soley dissolved bakers yeast. However, for a culture intended for long term longevity and optimum nutritional value, a diet of <a href=\"http://www.fishgobble.com/product/green-water-culture\"><b>green water</b></a> should be implemented. \r\n\r\n\r\n\r\n\r\n\r\n","options":[{"id":30118385,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105409929/-/daphnia_magna.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105409929/-/daphnia_magna.png","width":1000,"height":995}],"artists":[],"categories":[]},{"id":10518775,"name":"Daphnia Pulex","permalink":"daphnia-pulex","position":8,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/daphnia-pulex","status":"sold-out","on_sale":false,"created_at":"2013-04-13T03:26:23.000Z","description":"<b>8 oz Live Daphnia Pulex Culture for Sale</b>\r\n\r\nDaphnia pulex is a small freshwater crustacean that is suitable for feeding various types of fish and juvenile fish. Mature specimen of Daphnia pulex measure approximately 1.5 mm in length. Thus, they are larger than <a href=\"http://www.fishgobble.com/product/moina\"><b>Moina</b></a>  but smaller than <a href=\"http://www.fishgobble.com/product/daphnia-magna\"><b>Daphnia magna</b></a>. Being the most widely spread species of the order Cladocera, they provide a staple food source for many fish in their natural environment. Daphnia pulex are found throughout small ponds and various bodies of waters in the Americas, Europe and Australia. Their high nutritional value and ease of cultivation makes them a great candidate as a source of live food for fish and various aquatic organisms.\r\n\r\n<b>Nutritional Value</b>\r\n<ul>\r\n<li>Protein: 66%</li>\r\n<li>Fat: 9.0%</li>\r\n<li>Fiber: 5.0%</li>\r\n<li>Crude Ash: 0.1%</li>\r\n</UL>\r\n\r\n<b>Culturing Daphnia Pulex</b>\r\nIn order to culture Daphnia pulex, it is important to provide a source of light, food, and aeration. The light source for the culture can be either a natural source of light or a artificial lighting. High intensity lighting is desirable as it can allow cultivation of more phytoplankton, which can serve as a source of food. Besides phytoplankton, Daphnia pulex feed on various types of bacteria and yeast. While dissolved bakers yeast can serve as a sole source of food for a limited period of time, the low nutritional value can lead to unstable culture and a lower nutritional value of the specimen itself. For optimum nutritional value, <a href=\"http://www.fishgobble.com/product/green-water-culture\"><b>green water</b></a> should be implemented. Aeration of the culture can be achieved through a simple setup consisting of an air pump and an air stone. A culture consisting of a wide water surface can eliminate the need of aeration, while less specimen density will be supported. Since Daphnia are highly sensitive to chlorine, water used in the culture must be chemically dechlorinated or aged properly. Optimum parameters for Daphnia pulex culture lies between a pH of 7-8 and a temperature of 65-75 degrees Fahrenheit.\r\n","options":[{"id":32954035,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105410169/-/daphnia_pulex.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105410169/-/daphnia_pulex.png","width":1000,"height":995}],"artists":[],"categories":[]},{"id":10517851,"name":"Moina","permalink":"moina","position":9,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/moina","status":"active","on_sale":false,"created_at":"2013-04-13T02:12:17.000Z","description":"<b>8 oz Live Moina Culture For Sale</b>\r\n\r\nMoina are small freshwater crustaceans that are suitable for feeding small fish and fish fry. With mature Moina measuring only 0.5 mm in length, they are smaller than <a href=\"http://www.fishgobble.com/product/daphnia-magna\"><b>Daphnia magna</b></a> and <a href=\"http://www.fishgobble.com/product/daphnia-pulex\"> <b>Daphnia pulex</b></a> . While the use of Moina in American aquaculture is not as widespread as Daphnia sp., Moina constitutes a staple food source of fish fry in oriental aquaculture. In fact, the widespread use of Moina is so extensive that it has replaced the use of Brine Shrimp in various aspects. Newly hatched Moina average 430 micrometers, which is very similar to the size of newly hatched brine shrimp. The ease of culturing and their prolific nature makes Moina a suitable candidate as a food source for various species of fish fry.\r\n\r\n<b>Nutritional Value</b>\r\n<ul>\r\n<li>Protein: 66%</li>\r\n<li>Fat: 9.0%</li>\r\n<li>Fiber: 5.0%</li>\r\n<li>Crude Ash: 0.1%</li>\r\n</UL>\r\n\r\n<b>Culturing Moina</b>\r\nBoth deriving from the order Cladocera, culturing Moina and Daphnia are very similar. However, since Moina can thrive in low oxygen environments and wider water parameters, Moina are relatively easier to culture than Daphnia. Moina's ability to synthesize hemoglobin allows them to thrive in conditions that many other organisms can not survive in. Moina feed on various types of bacteria, yeast, and phytoplankton. A reliable staple food source for Moina is <a href=\"http://www.fishgobble.com/product/green-water-culture\"><b>green water</b></a>. Moina will start reproducing within a week of birth and each female will produce of brood of 4-22 female every other day. Optimum conditions for Moina lies at a pH of 7-8 and a temperature range of 65-75 degrees Fahrenheit. In addition, water used in Moina cultures should be chemically dechlorinated or properly aged. ","options":[{"id":32950786,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105410154/-/moina.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105410154/-/moina.png","width":1000,"height":995}],"artists":[],"categories":[]},{"id":10973124,"name":"Freshwater Copepod","permalink":"freshwater-copepod","position":10,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/freshwater-copepod","status":"active","on_sale":false,"created_at":"2013-05-06T03:29:49.000Z","description":"<b>8 oz Live Copepod Culture for Sale</b>\r\n\r\nFreshwater copepods, <i>Cyclops</i>, constitute a vital part of the aquatic ecosystem. Measuring 0.5 - 3 mm in length, they are suitable for feeding larvae and early juvenile fish of various freshwater species. The extremely abundant copepods are found in nearly every natural freshwater habitat including rivers, lakes and even puddles. While providing a vital source of quality protein and overall nutritional value, copepods also allow accelerated flow of nutrients and minerals as they feed on small fragments of plant material and other aquatic detritus. Thus, copepods are considered one of the most important organisms in an aquatic ecosystem. \r\n\r\n<b>Culturing Freshwater Copepod</b>\r\nSince freshwater copepods are accepting of a wide range of water parameters, cultivation can be achieved with ease. For optimum production however, a consistent source of light, food, and gentle aeration is recommended. Culture container size can be adjusted according to desired output. Optimum parameters for copepod culture lies between a pH of 7-8 and a temperature of 65-75 degrees Fahrenheit. For highest productivity and nutritional value, feeding <a href=\"http://www.fishgobble.com/product/green-water-culture\"><b>green water</b></a>  is recommended. Due to very similar culture requirements, copepods can be cultured in conjunction with other organisms such as <a href=\"http://www.fishgobble.com/product/daphnia-magna\"><b>Daphnia magna</b></a> and various other freshwater crustaceans.\r\n","options":[{"id":34512789,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/107925039/-/freshwater_copepod.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/107925039/-/freshwater_copepod.png","width":1000,"height":1000}],"artists":[],"categories":[]},{"id":9625875,"name":"Green Water Culture","permalink":"green-water-culture","position":11,"price":7.0,"default_price":7.0,"tax":0.0,"url":"/product/green-water-culture","status":"active","on_sale":false,"created_at":"2013-02-25T15:32:10.000Z","description":"<b>4 oz Green Water Culture Powder for Sale</b>\r\n\r\nGreen Water is composed of phytoplankton which is a valuable source of food for fish larvae and fry. Phytoplankton is also used to feed <a href=\"http://www.fishgobble.com/product/daphnia-magna\"><b>Daphnia magna</b></a>, <a href=\"http://www.fishgobble.com/product/brine-shrimp\"><b>Brine Shrimp</b></a>, and <a href=\"http://www.fishgobble.com/product/gammarus-shrimp\"><b>Gammarus Shrimp</b></a>, and rotifer cultures as well. In fact, extensive use of phytoplankton can be observed in various fields of aquaculture. The reason for the wide application of phytoplankton is due to the fact that they compose the base food chain in nature. In aquaculture, the technique of rearing fish larvae with phytoplankton green water culture is called “green water technique.”  The “green water technique” is used in hatcheries due to various benefits which include:\r\n\r\n<ul>\r\n<li>Provide a direct food source for fish larvae and fry</li>\r\n<li>Provide an indirect food source for fish larvae and fry by maintaining nutritional value of live prey organisms</li>\r\n<li>Stablilization of water quality through removal of metabolic waste and produce oxygen</li>\r\n<li>Stimulate non-specific immune system of fish larvae and fry by providing polysaccharides found in algal cell walls</li>\r\n<li>Enhancing the visual contrast through light dispersion for fish larvae and fry with developing perception organs</li>\r\n<li>Microbial control</li>\r\n</UL>\r\n\r\n<b>Green Water Culture Powder</b>\r\nA simple way to utilize the benefits of phytoplankton is to use the Green Water Culture Powder. The dry mix can be dissolved in water to make an instant Green Water solution. The Green Water Culture Powder consists of <i>Arthrospira platensis</i>, commonly known as Spirulina. It contains 70% protein in dry weight and provides vital amino acids for fish larvae and fry. Other beneficial content includes potassium, calcium, zinc, magnesium, manganese, selenium, iron, and phosphorus. It is rich in chlorophyll as well. In addition to feeding fish larvae and fry, the Green Water Culture Powder can be used to feed Daphnia, Brine Shrimp, Gammarus Shrimp, and rotifer cultures. In addition, the high concentration of nutritional value makes Spirulina suitable for bioencapsulation of various live feed such as brine shrimp.\r\n\r\n<b>Culturing Green Water</b>\r\nCulturing green water naturally is possible with a basic setup. Provide the culture with aeration, nutrients, and light. First, add distilled water into a sterile cotainer. Provide aeration with an air pump or a large water surface area. Add ¼ of a boiled lettuce to provide the nutrient necessary for ammonia production. Controlled amounts of pure ammonia can be added as a substitute as well. A strong light source such as sunlight must be provided as well for phytoplankton growth. Maintain a temperature range of 20~24°C, pH 7.5-8.5. Allow the phytoplankton to grow until the water turns green. This process takes approximately two weeks to start. Adding dried algae powder or a live starter culture will speed up the initial process. Since this not a controlled method, it can produce a variety of phytoplankton and bacteria as well. \r\n\r\n","options":[{"id":30114919,"name":"Default","price":7.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105589617/-/green_water_culture.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105589617/-/green_water_culture.png","width":665,"height":670}],"artists":[],"categories":[]},{"id":8436339,"name":"Microworm","permalink":"microworm","position":12,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/microworm","status":"active","on_sale":false,"created_at":"2012-12-08T04:58:13.000Z","description":"<b>Microworm Starter Culture For Sale</b>\r\n\r\nMicroworms, <i>Panagrellus redivivus</i>, are small nematodes that are great for feeding fish fry. They measure at a mere 50 microns in diameter and 2 mm in length. <a href=\"http://www.fishgobble.com/product/walter-worm\"><b>Walter Worm</b></a> and <a href=\"http://www.fishgobble.com/product/banana-worm\"><b>Banana Worm</b></a> are closely related species to Microworms in the phylum Nematoda. Microworms are known as ‘sour paste nematodes’ as well. It was described as Chaos redivivus in 1767 by Linnaeus. They have been cultured by aquarist for a variety of species of fish fry as live food since the 1930’s. Many fry are very picky eaters and will not acknowledge stagnant food. However, the microworms’ wiggling dance underwater makes them irresistible to even the pickiest eaters. Since microworms sink in water, a bare tank is recommended for feeding unless they are consumed immediately. Uneaten microworms will survive submerged in water for approximately 24 hours. For free swimming nematodes, consider <a href=\"http://www.fishgobble.com/product/vinegar-eel\"><b>Vinegar eels</b></a>.\r\n\r\nMicroworm cultures are very simple to start and maintain. Microworms will survive in a wide range of temperatures but will result in the highest yield at 20 to 27 degrees Celsius. At optimum conditions, female microworms will release up to 40 young every day. Microworms can be cultured successfully with simply a container, oatmeal, and yeast. First, add a 3 cm layer of moist oatmeal on the container. Next sprinkle a pinch of yeast on the surface and add a starter culture. It is important to maintain a moist surface on the culture at all times. The culture will be ready to harvest within a few days or until the worms start to crawl up the sides of the container. The worms can be harvested by either swiping the worms off the sides of the container or by skimming off the top layer of the culture with a dense population of worms. The latter method may result in grabbing the culture media along with the worms. In this case, the worms can be cleaned in a separate container with water and fed to the fish with a pipette. More of the smaller juvenile microworms will be collected in the latter method as well compared to the first method.\r\n\r\n<b>Nutritional Value</b>\r\nProtein: 48%\r\nFat: 21%\r\nGlycogen: 7%\r\nOrgainic Acids: 1%\r\nNucleic Acids: 1%","options":[{"id":26533863,"name":"2 oz Culture","price":3.0,"sold_out":false,"has_custom_price":false},{"id":27355367,"name":"8 oz Culture","price":5.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105410097/-/microworm.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105410097/-/microworm.png","width":996,"height":1000}],"artists":[],"categories":[]},{"id":8436363,"name":"Walter Worm","permalink":"walter-worm","position":13,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/walter-worm","status":"active","on_sale":false,"created_at":"2012-12-08T05:00:48.000Z","description":"<b>Walter Worm Starter Culture For Sale</b>\r\n\r\nWalter Worms, <i>Panagrellus Silusioides</i>, were first isolated and cultured when Helmut Walter isolated them in Germany in 2002. They were introduced to California aquarists soon after. They are slightly smaller in comparison to microworms. They are 50 microns in diameter and 1.5 mm in length. Walter worms are irresistible to fish fry due to their constant restless movement underwater. They will survive submerged in water for approximately 24 hours. <a href=\"http://www.fishgobble.com/product/microworm\"><b>Microworm</b></a> and <a href=\"http://www.fishgobble.com/product/banana-worm\"><b>Banana Worm</b></a> are closely related species to Microworms in the phylum Nematoda. For free swimming nematodes, consider <a href=\"http://www.fishgobble.com/product/vinegar-eel\"><b>Vinegar eels</b></a>.\r\n\r\nVery little effort is required to culture walter worms. While accepting of wide range of temperatures, the optimum yield will result at 20 to 27 degrees Celcius. Female walter worms will start producing up to 60 young a day after the fourth day. This will continue for the rest of their lifespan, which is 35 days. Only a container, oatmeal, and yeast is required to culture walter worms. First, add a 3 cm layer of moist oatmeal on the container. Next sprinkle a pinch of yeast on the surface and add a starter culture. It is important to maintain a moist surface on the culture at all times. The culture will be ready to harvest within a few days or until the worms start to crawl up the sides of the container. The worms can be harvested by either swiping the worms off the sides of the container or by skimming off the top layer of the culture with a dense population of worms. The latter method may result in grabbing the culture media along with the worms. In this case, the worms can be cleaned in a separate container with water and fed to the fish with a pipette. More of the smaller juvenile walter worms will be collected in the latter method as well compared to the first method.\r\n\r\n<b>Nutritional Value</b>\r\nProtein: 48%\r\nFat: 21%\r\nGlycogen: 7%\r\nOrganic Acids: 1%\r\nNucleic Acids: 1%","options":[{"id":26533929,"name":"2 oz Culture","price":3.0,"sold_out":false,"has_custom_price":false},{"id":27355415,"name":"8 oz Culture","price":5.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105410373/-/walter_worm.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105410373/-/walter_worm.png","width":996,"height":1000}],"artists":[],"categories":[]},{"id":8436378,"name":"Banana Worm","permalink":"banana-worm","position":14,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/banana-worm","status":"active","on_sale":false,"created_at":"2012-12-08T05:02:40.000Z","description":"<b>Banana Worm Starter Culture For Sale</b>\r\n\r\nBanana worms, <i>Panagrellus nepenthicola</i>, are prolific small nematodes that are great for feeding fish fry. Banana worms (Panagrellus nepenthicola) are not the same organism as parasitic banana nematodes (Helicotylenchus dihystera) that are known to infest banana tree roots. Banana worms are slightly smaller than walter worms and microworms. They measure at 40 microns in diameter and 1.5 mm in length. Despite their small size, they are one of the most prolific nematodes. While banana worms sink in water, their lighter weight allows them drift in the water for a longer time before reaching the base. <a href=\"http://www.fishgobble.com/product/microworm\"><b>Microworm</b></a> and <a href=\"http://www.fishgobble.com/product/walter-worm\"><b>Walter Worm</b></a> are closely related species to Microworms in the phylum Nematoda. For free swimming nematodes, consider <a href=\"http://www.fishgobble.com/product/vinegar-eel\"><b>Vinegar eels</b></a>.\r\n\r\nBanana worms cultures are very simple to start and maintain. Banana worms will survive in a wide range of temperatures but will result in the highest yield at 20 to 27 degrees Celsius. Only a container, oatmeal, and yeast is required to culture banana worms. First, add a 3 cm layer of moist oatmeal on the container. Next sprinkle a pinch of yeast on the surface and add a starter culture. It is important to maintain a moist surface on the culture at all times. The culture will be ready to harvest within a few days or until the worms start to crawl up the sides of the container. The worms can be harvested by either swiping the worms off the sides of the container or by skimming off the top layer of the culture with a dense population of worms. The latter method may result in grabbing the culture media along with the worms. In this case, the worms can be cleaned in a separate container with water and fed to the fish with a pipette. More of the smaller juvenile banana worms will be collected in the latter method as well compared to the first method.\r\n\r\n<b>Nutritional Value</b>\r\nProtein: 48%\r\nFat: 21%\r\nGlycogen: 7%\r\nOrganic Acids: 1%\r\nNucleic Acids: 1%","options":[{"id":26533992,"name":"2 oz Culture","price":3.0,"sold_out":false,"has_custom_price":false},{"id":27355424,"name":"8 oz Culture","price":5.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105410397/-/banana_worm.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105410397/-/banana_worm.png","width":996,"height":1000}],"artists":[],"categories":[]},{"id":8436333,"name":"Vinegar Eel","permalink":"vinegar-eel","position":15,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/vinegar-eel","status":"active","on_sale":false,"created_at":"2012-12-08T04:57:34.000Z","description":"<b>Vinegar Eel Starter Culture For Sale</b>\r\n\r\nVinegar eels, <i>Turbatrix aceti</i>, are small nematodes that are used in the production of vinegars. Their constant whip-like swimming motion makes them irresistible to fish fry. One of the biggest advantages of feeding vinegar eels to fry is that they can survive in water for a long time, allowing fry to feed on them opportunistically. In addition, since Vinegar eels are free swimming, it allows fry to feed on various water levels. Vinegar eels measure 50 microns in diameter and 2 mm in length. Due to their similar size, specimen feeding on Vinegar eels may benefit from an addition of <a href=\"http://www.fishgobble.com/product/moina\"><b>Moina</b></a> in their diet as a valuable source of roughage as well. \r\n\r\n<b>Culturing Vinegar Eel</b>\r\nCulturing vinegar eels require very little effort and there is practically no maintenance. They are accepting of a very wide range of temperatures as well. The only disadvantage is that they do not reproduce as fast as other nematodes such as <a href=\"http://www.fishgobble.com/product/microworm\"><b>Microworms</b></a>, <a href=\"http://www.fishgobble.com/product/walter-worm\"><b>Walter Worms</b></a> and <a href=\"http://www.fishgobble.com/product/banana-worm\"><b>Banana Worms</b></a>.. Vinegar eels produce approximately 50 young every 10 days.  A container with a ventilated lid, distilled water, unpasteurized vinegar, and a slice of apple is required to culture vinegar eels. To start the culture, mix the distilled water and unpasteurized vinegar at a 1:1 ratio. Add the slice of apple for food and the starter culture. There is no maintenance for the culture other than replacing the evaporated water. In order to harvest vinegar eels, a coffee filter can be used to separate the vinegar eels from the vinegar.","options":[{"id":26533857,"name":"2 oz Culture","price":3.0,"sold_out":false,"has_custom_price":false},{"id":27355433,"name":"8 oz Culture","price":5.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105410481/-/vinegar_eel.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105410481/-/vinegar_eel.png","width":998,"height":1000}],"artists":[],"categories":[]},{"id":8436249,"name":"Duckweed","permalink":"duckweed","position":16,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/duckweed","status":"active","on_sale":false,"created_at":"2012-12-08T04:47:35.000Z","description":"<b>Duckweed Starter Culture For Sale</b>\r\n\r\nDuckweed is a natural food source for fish that is highly nutritious. Due to its highly prolific properties, duckweed can prove to be a stable source of food in aquarium and pond environments. The ammonia consumption of duckweed can help stabilized the water conditions as well. Please do not release live plants into natural waterways.","options":[{"id":26533722,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105410517/-/duckweed.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105410517/-/duckweed.png","width":917,"height":903}],"artists":[],"categories":[]},{"id":10130191,"name":"Worm Feeder","permalink":"worm-feeder","position":17,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/worm-feeder","status":"active","on_sale":false,"created_at":"2013-03-24T17:35:28.000Z","description":"<b>Aquatic Worm Feeder For Sale</b>\r\n\r\nWorm feeder for feeding live worms for aquarium fish. The cone worm feeder can be attached inside the aquarium wall with a suction cup or allowed to float freely on the surface. Made of flexible, break-resistant plastic.\r\n\r\n<b>Size</b>\r\nWidth: 2.75 in\r\nHeight: 2.75 in\r\n\r\nThe worm feeder is ideal for feeding a variety of live worms and foods such as <a href=\"http://www.fishgobble.com/product/white-worm\"><b>White Worm</b></a>, <a href=\"http://www.fishgobble.com/product/grindal-worm\"><b>Grindal Worm</b></a>, Microfex worms, Bloodworms, Tubifex worms, Blackworms, <a href=\"http://www.fishgobble.com/product/brine-shrimp\"><b>Brine Shrimp</b></a>, <a href=\"http://www.fishgobble.com/product/daphnia-magna\"><b>Daphnia magna</b></a>, <a href=\"http://www.fishgobble.com/product/daphnia-pulex\"><b>Daphnia pulex</b></a>, <a href=\"http://www.fishgobble.com/product/moina\"><b>Moina</b></a> etc. Other foods such as flake foods and foods in gel form can also be fed through the worm feeder. The worm feeder can help reduce aquarium build-up by slowly dispensing food from a recognizable location for the fish.\r\n","options":[{"id":31699381,"name":"Default","price":4.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/105410529/-/worm_feeder.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/105410529/-/worm_feeder.png","width":1000,"height":991}],"artists":[],"categories":[]}]