[{"id":1563571,"name":"Huichol Indian Beaded Prayer Bowl","permalink":"fantastic-huichol-indian-beaded-mask-with-green-peyote-size-14-beads","position":1,"price":37.0,"default_price":37.0,"tax":0.0,"url":"/product/fantastic-huichol-indian-beaded-mask-with-green-peyote-size-14-beads","status":"sold-out","on_sale":false,"created_at":"2010-02-12T00:29:06.000Z","description":"<h3>\r\nSee our new website www.cosasbonitasoregon.com where we have many more pieces of Huichol art and other fair trade Latin American folk art!  Sign up for our newsletter and receive a 10% coupon to apply toward a purchase! You may also purchase this item here, at our Big Cartel website.\r\n\r\n<p><h3>This beautiful prayer bowl is created using the bottom of a gourd which forms a bowl. The tiny chaquira, or seed beads, are applied by coating the inside of the gourd with a special beeswax mixture. Then the beads are applied one by one using a needle, bringing the vision of the artist to life. The beading is perfect with every bead in place. This can easily be seen by clicking on each image where it will expand, showing the incredible detail of this art. Because smaller size 14 seed beads are used instead of the usual larger size 11, the level of skill and artistry required is extremely high. This gallery-quality bowl will amaze you!\r\n\r\nPrayer bowls have traditionally been used in Huichol ceremonies and hold offerings such as peyote, ceremonial arrows, and \"muvieris\" or prayer sticks. Here the hold the artist's vision in beads.The sacred symbols in this piece are the yellow deer heads and green maize around  the central blue peyote. The symbols signify, respectively, the eyes of spirit and success in life. The use of blue, green, yellow and red is quite crisp and striking. This wonderful bowl will not disappoint!\r\n\r\nThe bowl is 4.25 inches in diameter and an inch deep.\r\n\r\nSeen in real life, this bowl is imbued with the Huichol connection to the spirit world.\r\n\r\nDo not place this art in hot direct sunlight. This may soften the beeswax. Otherwise, with gently handling, this art will stay in perfect shape.\r\n\r\nSEE THE HUICHOL ART PAGE FOR AN INTRODUCTION OF THIS HUICHOL ART.\r\n\r\nFor international shipping, please contact us ask for a quote.","options":[{"id":5757951,"name":"Default","price":37.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.5,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/49921913/-/Bowl6.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/49921913/-/Bowl6.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":128512,"name":"Huichol Beaded Art","permalink":"huichol-beaded-art","url":"/category/huichol-beaded-art"}]},{"id":312948,"name":"Fabulous Huichol Indian Beaded Bison -SOLD","permalink":"small-bead-huichol-indian-beaded-bison-size-14-beads","position":2,"price":120.0,"default_price":120.0,"tax":0.0,"url":"/product/small-bead-huichol-indian-beaded-bison-size-14-beads","status":"sold-out","on_sale":false,"created_at":"2009-06-03T00:26:45.000Z","description":"<h3>\r\nSee our new website www.cosasbonitasoregon.com where we have many more pieces of Huichol art and other fair trade Latin American folk art!  Sign up for our newsletter and receive a 10% coupon to apply toward a purchase! Bison figures are available on our website most of the time.\r\n\r\n<p><h3>This spectacular bison is created using strong shades of red, green, blue, gold and yellow as well as mauve.  A spectacular light blue deer head covers the bison's head as well as as a light blue eagle on the rump. The tiny chaquira, or seed beads, are applied by coating the surface of the wood carving with a special beeswax mixture. Then the beads are applied one by one. The vision of the artist comes to life as the beads are applied. The beading is perfect, with every bead in place. This can easily be seen by clicking on each image where it will expand, showing the incredible detail of this art. This piece is even more amazing in person.\r\n\r\nThe sacred symbols used in this piece are the deer and eagle which denotes a messenger from the gods. There is wonderful beading completely around the carved wooden form, leaving bare only the bottom of the feet! The dimensions are 4.75 inches long, 2 inches wide and 3.25 inches tall.\r\n\r\nWherever this bison is displayed it will imbue the space with the artist's spirit and intention.\r\n\r\nBecause the smaller size 14 beads are used instead of the larger size 11, the level of skill and artistry required is very high. The quality of the carving and beading will amaze you!\r\n\r\nDo not place this art in hot direct sunlight. This may soften the beeswax. Otherwise, with gently handling, this art will stay in perfect shape.\r\n\r\nSEE THE HUICHOL ART PAGE FOR AN INTRODUCTION OF THIS HUICHOL ART.\r\n\r\nFor international shipping, please contact us ask for a quote.","options":[{"id":1294433,"name":"Default","price":120.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.5,"amount_with_others":7.5,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/49918401/-/Bison_1c.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/49918401/-/Bison_1c.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":128512,"name":"Huichol Beaded Art","permalink":"huichol-beaded-art","url":"/category/huichol-beaded-art"}]},{"id":149948,"name":"Huichol Indian Beaded Jaguar Head With Yellow Deer Heads - SOLD","permalink":"small-bead-huichol-jaguar-head-with-yellow-deer-heads-size-14-beads","position":3,"price":125.0,"default_price":125.0,"tax":0.0,"url":"/product/small-bead-huichol-jaguar-head-with-yellow-deer-heads-size-14-beads","status":"sold-out","on_sale":false,"created_at":"2008-09-09T23:41:16.000Z","description":"<h3>\r\nSee our new website www.cosasbonitasoregon.com where we have many more pieces of Huichol art and other fair trade Latin American folk art!  Sign up for our newsletter and receive a 10% coupon to apply toward a purchase! Jaguar heads are available on our website most of the time.\r\n\r\n<p><h3>\r\nThis exquisite jaguar head is a very traditional animal for Huichol artists. The tiny chaquira, or seed beads, are applied by coating the surface of the wood carving with a special beeswax mixture.  Then the beads are applied one by one. The vision of the artist comes to life as the beads are applied.  The beading is perfect with every bead in place.  This can easily be seen by clicking on each image where it will expand, showing the incredible detail of this art.  \r\n\r\n<p><h3>\r\nThe sacred symbols used in this piece are scorpions, peyote and deer symbols respectively symbolizing the protector of the peyote, success in life and messenger from the gods.  Yellow deer symbols adorn each cheek and a fabulous blue/white peyote symbol covers the back of the head. Scorpions surround it  Another large peyote covers the nose.  The dimensions are 3 inches tall, 3.25 inches wide and 4 inches front to back.  \r\n\r\n<p><h3>\r\nSeen in real life this jaguar comes to life and is imbued with the Huichol connection to the spirit world. \r\n\r\n<p><h3>Because the smaller size 14 beads are used instead of the larger size 11, the level of skill and artistry required is very high. The quality of the carving and beading will amaze you!\r\n\r\n<p><h3>\r\nSEE THE FAQ TO YOUR LEFT FOR AN INTRODUCTION OF THIS HUICHOL ART OR CLICK \"BACK TO SITE\" AT THE TOP OF THE PAGE FOR AN IN-DEPTH EXPLANATION OF THESE PARTICULAR HUICHOL INDIANS AND THEIR ART. \r\n\r\n<p><h3>\r\nDo not place this art in hot direct sunlight.  This may soften the beeswax.  Otherwise, with gently handling, this art will stay in perfect shape.\r\n","options":[{"id":687473,"name":"Default","price":125.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":6.0,"amount_with_others":4.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":15.0,"amount_with_others":9.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2325878/-/Jag2front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2325878/-/Jag2front.jpg","width":800,"height":800}],"artists":[],"categories":[{"id":128512,"name":"Huichol Beaded Art","permalink":"huichol-beaded-art","url":"/category/huichol-beaded-art"}]},{"id":2636242,"name":"Exquisite Huichol Indian Beaded Emerald Green Bracelet - Medium to Large Size Wrist","permalink":"exquisite-huichol-indian-beaded-emerald-green-beaded-huichol-bracelet-medium-to-large-size-wrist","position":4,"price":34.0,"default_price":34.0,"tax":0.0,"url":"/product/exquisite-huichol-indian-beaded-emerald-green-beaded-huichol-bracelet-medium-to-large-size-wrist","status":"active","on_sale":false,"created_at":"2010-06-30T02:15:44.000Z","description":"\r\n<h3>\r\nSee our new website www.cosasbonitasoregon.com where we have many more pieces of Huichol art and other fair trade Latin American folk art!  Sign up for our newsletter and receive a 10% coupon to apply toward a purchase! You may also purchase this item here, at our Big Cartel website.\r\n\r\n<h3>\r\nThe workmanship and artistry is exceptional in this two-tone dark and light emerald green bracelet edged in black.  The color combinations are unique and beautiful. The pattern includes small diamonds of gold and rose.  You won't be disappointed in this work of art!  The dimensions are 8 inches from the end of the balls to the end of the loops and just over an inch wide.  This would fit a medium to large wrist.  Be sure to click each of the pictures, which expands for a closer look at the detail.  Also, the middle picture is taken with the bracelet hanging over an edge to give another good view of the colors and detail.\r\n\r\n<p><h3>The bracelets that we carry are very smooth on the skin and extremely durable.  Breakage is never a problem due to the quality of workmanship and strong nylon used.  In the event that it breaks, we will replace it at no charge. The balls are always a perfect size for the loops.  There are two size settings being that the balls may be inserted in the loop or into the triangle that is next to the edge of the bracelet.  If the triangle next to the edge of the bracelet is used the remaining loop can be folded over the ball, finishing off the fastening.\r\n\r\n<p><h3>This three-ball beaded bracelet is made by the same group of Huichol families that create all of the beaded art in our store.  It is meticulously made using needles, not looms. \r\n\r\n<p><h3>\r\nAs is all of our art, it is acquired adhering to fair trade principles.  Our artists are able to remain in their villages and are paid higher than the going rate.  The beads and other supplies are also provided to them.\r\n\r\n<p><h3>\r\nWe purchase basic insurance when we ship which adds a small amount to the shipping cost.\r\n\r\n<p><h3> For international shipping, ask for a quote.","options":[{"id":9318976,"name":"Default","price":34.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":4.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25403507/-/BraceletTurquoiseGold.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25403507/-/BraceletTurquoiseGold.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":128515,"name":"Huichol Beaded Jewelry","permalink":"huichol-beaded-jewelry","url":"/category/huichol-beaded-jewelry"}]}]