[{"id":2555024,"name":"\"RECKLESS ROMANCES\" CD, Autographed or In-Plastic.","permalink":"reckless-romances-cd","position":1,"price":9.99,"default_price":9.99,"tax":0.0,"url":"/product/reckless-romances-cd","status":"active","on_sale":true,"created_at":"2010-05-01T10:44:52.000Z","description":"Are you looking for honest songwriting- written, recorded, and produced by the songwriter himself?... Then you've come to the right place.\r\n\r\nABOUT JOEY: \r\nI'm a former Miami University student who has been hard at work ever since leaving the dorm life behind. During the last two years I have converted my parent's basement into an independent recording studio (you should have seen their faces when they found out what I had done to their house!)  After my parents graciously supported the building of my recording studio, I began to use analog/digital recording to produce my songs. I finally released my first independent album, “Reckless Romances” in May of 2010!  \r\n\r\nWHY INDEPENDENT MUSIC:  \r\nI'm a songwriter who strives to put as much \"honest\" passion into my music as possible.  When I write and sing, I often do so to a \"streaming video clip\" that's playing through my head, reliving my life experiences during each performance.  It's my way of overcoming some of the loss, reminding myself of good times, reflecting upon the different emotions that life has thrown my way, and communicating it to you in a meaningful way.  Anyone can fake passion.  My worst performances and most boring recordings come out when I try and \"fake\" words or melodies that I don't \"feel.\"  In this way, I strive to make honest music, for my sake and yours. \r\n\r\nTruly, the heart of a song is more than \"melodic math,\" or \"notes on a page.\"  Instead, I believe music is a separate \"body\" with a powerful voice- a powerful medium of sonic frequencies that communicates \"life\" in a foreign language spoken by all.  \r\n\r\nMAKING OF \"RECKLESS ROMANCES\":\r\nThe \"Reckless Romances\" album spotlights 14 honest songs.  Each lyric was written by the same heart and mind, each instrument  was performed live (with use of live midi), and each track was mixed and mastered by the original songwriter.  In this way, \"Reckless Romances\" was my brain child, my attempt at creating something organic and personable.  For me, it didn't come out near perfect, but I look forward to attempting richer honesty, purer passion, and better physical \"technique\" on future records.  \r\n\r\nAside from my own work, a close friend and extraordinary drummer, Nate King, drummed throughout many songs on the record, adding his own dynamic feel to the course of many of the songs. Through Nate and I's instrumentation, Reckless Romances came to life featuring 10 tracks plus 4 \"hidden tracks.\"  When I listen, I feel the tracks twist and turn, bridging acoustic tones with driving beats, combining symphonic orchestrations with distorted electric guitar riffs, all intertwined around lyrics and melodies I know to be honest and personal. Many days, frustrating nights, and \"eureka moments\" went into the making of \"Reckless Romances.\"  I'm excited to share it with you!\r\n\r\nPURCHASE=DONATION:\r\nAs a final note, all the money that goes into purchasing the \"Reckless Romances\" album is considered a \"donation\" towards future music projects.  Any profit from the \"Reckless Romances\" album will be better equipment for better recording and CD production costs, not to include Joey's frequent purchase of 24k gold chains, 17\" rims, drug scandals, and money \"thrown in the air.\"  \r\n\r\nTHANK YOU SO MUCH!:\r\nI appreciate your investments in me and my new music on the \"Reckless Romances\" CD.  I would love to correspond with you if you have any feedback, encouragement, questions or suggestions!  Please contact me at JoeyHendrickson@Me.Com or find me on facebook- www.facebook.com/Joey Hendrickson","options":[{"id":9061577,"name":"CD in Plastic (No Autograph)","price":9.99,"sold_out":false,"has_custom_price":false},{"id":9138001,"name":"Front Cover Autographed CD","price":9.99,"sold_out":false,"has_custom_price":false},{"id":9138002,"name":"Back Cover Autographed CD","price":9.99,"sold_out":false,"has_custom_price":false},{"id":9138005,"name":"Inside Panel Autographed CD","price":9.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24831760/-/Reckless-Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24831760/-/Reckless-Cover.jpg","width":439,"height":391}],"artists":[],"categories":[{"id":312916,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":1038671,"name":"\"Reckless Romances\" Pre-Order on December 24, 2009","permalink":"reckless-romances-pre-order","position":2,"price":9.99,"default_price":9.99,"tax":0.0,"url":"/product/reckless-romances-pre-order","status":"sold-out","on_sale":true,"created_at":"2009-12-23T11:42:20.000Z","description":"Excited for the new record, \"Reckless Romances!?\"  Me too!  I have some good news and bad news. The bad news- due to the overload of Christmas orders for CD printing, I won't be able to provide you with the tangible CD until May.  The good news- I've created a way for you to LISTEN NOW, AND* GET THE CD!\r\n\r\nPre-order the \"Reckless Romances\" album NOW, and listen NOW.  I'll personally email you the tracks so you can download them + I'll put a hard copy of \"Reckless Romances\" in your hands in May, and give you handwritten lyrics with the CD, which only the first 25 purchases will receive!\r\n\r\nThank you for your purchase of this pre-order and support of my dreams!  Merry Christmas, and Merry Listening :)\r\n\r\n   - Joey","options":[{"id":3870001,"name":"Reckless Romances Pre-order","price":9.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/9764371/-/recklessromances__small_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/9764371/-/recklessromances__small_.jpg","width":467,"height":701}],"artists":[],"categories":[{"id":312916,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":396376,"name":"1 Week Recording Special","permalink":"5-song-demo-package","position":3,"price":500.0,"default_price":500.0,"tax":0.0,"url":"/product/5-song-demo-package","status":"active","on_sale":true,"created_at":"2009-09-14T09:11:21.000Z","description":"Besides being a songwriter, I've been operating my own studio in Columbus, Ohio since 2008.  As of 2010, I'm a certified audio engineer, and will have produced 15 different projects outside of my own.  I'm currently offering a wide variety of affordable recording packages to songwriters and bands in need of a quality demo project.  Recording rates are $35/hr not including mixing and mastering, but for a limited time I am offering a special price of $500 for a \"1-week recording\" of a 5-song project, INCLUDING mixing and mastering.\r\n\r\nMusicians can schedule recording for 4 hours per day for a 5 day week.  Mixing and mastering will be completed during 4 hour sessions on the weekend, to complete the 7-day process.  After one week, you will complete a fully recorded, mixed and mastered record, with additional outsourcing, mixing, and mastering options available, conditional to the project budget and preferences.\r\n\r\nFor scheduling information, project samples, and/or a full list of studio equipment options, you can contact me at joey@joeyhendrickson.com","options":[{"id":1591441,"name":"1 Week Recording Special","price":500.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[{"id":312916,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]