[{"id":367913,"name":"Three Worlds EP (2005)","permalink":"three-worlds-ep-2005","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/three-worlds-ep-2005","status":"active","on_sale":false,"created_at":"2009-08-12T08:39:15.000Z","description":"Blatherskite's self recorded, independently funded and released 2005 EP sees them grappling with the evolution of their sound which would see cataclysmic fruition on \"Where the Wasteland Ends\" (2009). \r\n\r\nWHAT THEY ARE SAYING: \r\n\r\n\"It's nice to know that there are such kick-ass musicians out there. I never thought I'd find a band whose sound resembles such incendiary bands like meshuggah and tool concurrently... royally fucked\" - Metal M'aggot, Myspace fan\r\n\r\n\"This music is damn cool. I really, really like it.\" - Mike, from \"The Broken Saints\" (German Alt Rock band.\r\n\r\n\"awesome band keep up the great work\" - NATE, Myspace fan\r\n\r\n\"Fucking awesome music\" - Metal Mistress, Myspace fan\r\n\r\n\"yeah ur music is hella cool. I love aussie bands....but u guys are one of my favs. Keep the good shit comin\" - Maria, Myspace fan\r\n\r\n\"hey i gotta say it.....you guys are excellent.i really do luv this sound you have here.dont change , your on the right path\" - Jack, Myspace fan\r\n\r\n\"Just thought I's come here and say that you freaking rock. Love 'Three Worlds' and can't wait to see you come to the gong.\" - Matt, Myspace fan & Street Team leader\r\n\r\nTHREE WORLDS REVIEWS: \r\n\r\n\"Blatherskite is definitely offering something different into the Australia hard rock etc. music scene with their Tool influenced alt rock but it won't be for everyone. For a first effort however, Three Worlds (which was entirely self recorded and produced) shows promise and with a little more experience and some refinement of their craft, it'll be interesting to see what Blatherskite come up with next.\" - Simon Milburn, Metal Forge Magazine\r\n","options":[{"id":1493225,"name":"THREE WORLDS EP (2005)","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2929799/-/three_worlds.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2929799/-/three_worlds.jpg","width":280,"height":280}],"artists":[],"categories":[{"id":296950,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":367944,"name":"Where The Wasteland Ends (2009) PreOrder! Get FREE STUFF!","permalink":"where-the-wasteland-ends-2009-preorder-get-free-stuff","position":2,"price":19.95,"default_price":19.95,"tax":0.0,"url":"/product/where-the-wasteland-ends-2009-preorder-get-free-stuff","status":"active","on_sale":false,"created_at":"2009-08-12T09:42:41.000Z","description":"Well, it was all well and good to have recorded the album, but folks, lets face it, being musicians, we have very little forward planning skills. Indeed, all of our forward planning skills were used up in planning the recording, with none left over for planning what was going to happen afterwards.\r\nIronic, isn't it.\r\n\r\nSo we're asking you for help here... We basically need 20 pre orders to go to print (see, we weren't THAT disorganised...).  If you are one of the lucky 20 to pre order (see, now you're the lucky one) then we'll send you an A2 poster of something awesome when it's ready, probably the album cover or what you see on the myspace page (better resolution for you, of course), or we'll just beat our artist until he draws something awesome for you.  We'll also sign the album, the poster, send you a thank you letter, and pretty much do whatever the hell you want. \r\n\r\nHang on to your receipt and all that, we'll have a copy too, and we'll post you out your copy of the album as soon as it's pressed. Hell, we'll even number and sign it too if that'll get you to do it.\r\n\r\nSo help us out here, and be a friend of Blatherskite.  Because everyone is a friend of a Blatherskite sometime. ","options":[{"id":1493339,"name":"PREORDER","price":19.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2930211/-/PREORDER.gif","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2930211/-/PREORDER.gif","width":170,"height":170}],"artists":[],"categories":[{"id":296950,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]