[{"id":7414119,"name":"Nick Modern feat. Ray Uptown - Talking Binary / Intention - APT001","permalink":"001","position":1,"price":3.99,"default_price":3.99,"tax":0.0,"url":"/product/001","status":"active","on_sale":false,"created_at":"2012-10-01T20:37:39.000Z","description":"Adapt proudly presents the first of our releases 'Talking Binary' by Nick Modern feat. Ray Uptown.\r\n\r\nA collaboration between the UK and the States, 'Binary' hits you with heavy low end kicks and bass that shake even the most reinforced of structures. Heavily modulated midrange attacks the arrangement while a chunky wooden rimshot leads the march.\r\n\r\nRay Uptown's aggressive vocal rides on top of the mix, barking orders with phrases and hooks that are twisted and distorted with Nick Modern's post production.\r\n\r\nFeaturing 'Intention' as the flip, this again shows another side to the works of the pair, with a more east coast approach to the tonality and stance of the B side.\r\n\r\nThis download package includes :\r\n\r\nA : Talking Binary\r\nB : Intention\r\nC : Talking Binary (Instrumental)\r\nD: Intention (Instrumental)\r\n\r\nFull release Artwork.\r\nPromotional Poster.\r\nCreative Writing.\r\nPromotional Video. (720p)\r\nFacebook Banner.","options":[{"id":23441743,"name":"MP3 (320)","price":3.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128375154/-/Adapt_6.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128375154/-/Adapt_6.jpg","width":1280,"height":1280}],"artists":[{"id":143115,"name":"Nick Modern","permalink":"nick-modern","url":"/artist/nick-modern"}],"categories":[{"id":3762725,"name":"Music","permalink":"music","url":"/category/music"}]},{"id":12490941,"name":"Nick Modern & Sektion - Precision / Bad Request - APT002","permalink":"nick-modern-precision-apt002a-promo","position":2,"price":3.99,"default_price":3.99,"tax":0.0,"url":"/product/nick-modern-precision-apt002a-promo","status":"active","on_sale":false,"created_at":"2013-07-21T14:27:04.000Z","description":"'Every man has to have a code...'\r\n\r\nFollowing up on 'Talking Binary', we are pleased to present APT002. Hard stepping beats and heavily distorted tones provide the sonic landscape of 'Precision', as Nick Modern returns to his drum & bass roots, showcasing new techniques in distortion, dynamics and synthesis.\r\n\r\nIn the fields of science, engineering, industry, and statistics, the accuracy of a measurement system is the degree of closeness of measurements of a quantity to that quantity's actual (true) value. The precision of a measurement system, also called reproducibility or repeatability, is the degree to which repeated measurements under unchanged conditions show the same results. Although the two words precision and accuracy can be synonymous in colloquial use, they are deliberately contrasted in the context of the scientific method.\r\n\r\n'The 4xx class of status code is intended for cases in which the client seems to have erred. Except when responding to a HEAD request, the server should include an entity containing an explanation of the error situation, and whether it is a temporary or permanent condition. These status codes are applicable to any request method. User agents should display any included entity to the user.'\r\n\r\n'400 Bad Request - The request cannot be fulfilled due to bad syntax.'\r\n\r\nNick Modern follows up on 'Precision' with Tom Dordoy aka Sektion providing backup for the covert operation known as 'Bad Request'. Flowing with corrupt code ripped from Cyberspace, 'Bad Request' assaults the midrange with squelchy and decending tones. Sharp and percussive hits strike out the beat, breaking apart rogue data with pinpoint accuracy.\r\n\r\nForthcoming APT002, 'Bad Request' fills the B side slot, providing an abstract and different approach from the relentless assault of 'Precision'.\r\n\r\nPackage contains :\r\n\r\nHD Music Video\r\nPromotional Art.\r\nCreative Writing.\r\nMP3 files of the tracks.\r\nWAV files of the tracks.\r\n\r\nAdapt. Survive. Divide. Conquer.","options":[{"id":39692421,"name":"Default","price":3.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128375166/-/Adapt_5.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128375166/-/Adapt_5.jpg","width":1280,"height":1280}],"artists":[{"id":143115,"name":"Nick Modern","permalink":"nick-modern","url":"/artist/nick-modern"}],"categories":[{"id":3762725,"name":"Music","permalink":"music","url":"/category/music"}]},{"id":13575195,"name":"Nick Modern & Crime.wav - Erosion / Logic Bomb - APT003","permalink":"nick-modern-crime-wav-erosion-logic-bomb-apt003","position":3,"price":3.99,"default_price":3.99,"tax":0.0,"url":"/product/nick-modern-crime-wav-erosion-logic-bomb-apt003","status":"active","on_sale":true,"created_at":"2013-09-15T14:24:33.000Z","description":"'Erosion refers to errors in computer data that occur during writing, reading, storage, transmission, or processing, which introduce unintended changes to the original data. Computer storage and transmission systems use a number of measures to provide data integrity, or lack of errors.\r\n\r\nIn general, when data corruption occurs, the file containing that data may become inaccessible, and the system or the related application will give an error. For example, if a Microsoft Word file is corrupted, when a person tries to open that file with MS Word, they may get an error message, thus the file would not be opened. Some programs can give a suggestion to repair the file automatically (after the error), and some programs cannot repair it. It depends on the level of corruption, and the built-in functionality of the application to handle the error. There are various causes of the corruption.'\r\n\r\nNick Modern continues the assault with the distorted glitch fest known as 'Erosion'. Packets of data slowly being corrupted cry for release as a relentless beat code hammers it's way through the system. Percussive attacks turn up the bitrate, with the drum section winding it's way through the piece whilst relentless sub and midrange movements degrade and reform.'\r\n\r\n'A logic bomb is a piece of code intentionally inserted into a software system that will set off a malicious function when specified conditions are met. For example, a programmer may hide a piece of code that starts deleting files (such as a salary database trigger), should they ever be terminated from the company.\r\nSoftware that is inherently malicious, such as viruses and worms, often contain logic bombs that execute a certain payload at a pre-defined time or when some other condition is met. This technique can be used by a virus or worm to gain momentum and spread before being noticed. Some viruses attack their host systems on specific dates, such as Friday the 13th or April Fool's Day. Trojans that activate on certain dates are often called \"time bombs\".\r\nTo be considered a logic bomb, the payload should be unwanted and unknown to the user of the software. As an example, trial programs with code that disables certain functionality after a set time are not normally regarded as logic bombs.'\r\n\r\nLogic Bomb forms the B side of our third release, APT003, with Nick Modern collaborating with Crime.wav in Seattle. Transferring data packets of illegal waveforms, the pair formed the huge destructive tones of 'Logic Bomb', bringing forth neo-tribalistic tones amongst half-stepping beats for the masses to march to.'\r\n\r\nPackage contains :\r\n\r\nPromotional Artwork.\r\n1080p Music Video.\r\nMP3 files of the tracks.\r\nWAV files of the tracks.\r\n\r\nAdapt. Survive. Divide. Conquer.","options":[{"id":43519251,"name":"Default","price":3.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128375175/-/Adapt_6.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128375175/-/Adapt_6.jpg","width":1280,"height":1280}],"artists":[{"id":143115,"name":"Nick Modern","permalink":"nick-modern","url":"/artist/nick-modern"}],"categories":[{"id":3762725,"name":"Music","permalink":"music","url":"/category/music"}]},{"id":15003891,"name":"Complex Things Made Simple","permalink":"complex-things-made-simple","position":4,"price":30.0,"default_price":30.0,"tax":0.0,"url":"/product/complex-things-made-simple","status":"active","on_sale":true,"created_at":"2013-11-21T15:56:30.000Z","description":"We are proud to present the first in our series of softsynth patches and presets. Utilizing Native Instrument's 'Massive', Nick Modern has put together a collection of over 100 carefully synthesised sounds, ranging from lush pads, deep sub bass, glitched out mids and more. All of the synth's effects and macro functions have been utilized to full effect, bringing a third dimension to intense sound design found within. This pack will be available exclusively on the Adapt site, and pre-orders are currently being placed.","options":[{"id":48699894,"name":"Default","price":30.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128376138/-/Adapt_Corrupt.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128376138/-/Adapt_Corrupt.jpg","width":1280,"height":1280}],"artists":[{"id":143115,"name":"Nick Modern","permalink":"nick-modern","url":"/artist/nick-modern"}],"categories":[{"id":6718926,"name":"Patches","permalink":"patches","url":"/category/patches"}]}]