[{"id":4513789,"name":"REPRESENT - a novel by David L.","permalink":"represent-a-novel-by-david-l","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/represent-a-novel-by-david-l","status":"active","on_sale":true,"created_at":"2011-09-27T02:15:56.000Z","description":"Trenton “Innocent” Barnes receives a life sentence for his role in the execution of a rival enemy.  With the help from his family, he is determined not to let that stop him.\r\n\r\nEnter youngest sibling Prentice who has a promising future, getting ready to graduate from college and plays football for a local semi-pro team.  Unfortunately for Prentice, he has been given the sole responsibility by his brother and ailing father to not only take over the family business, but convince his newly-acquired crew and enemies that he is up to the challenge.  Choices have been made.  Sides have been chosen.  What will be the end result?\r\n","options":[{"id":14787427,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44208115/-/Represent_Front_Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44208115/-/Represent_Front_Cover.jpg","width":415,"height":641}],"artists":[],"categories":[{"id":2476927,"name":"Books","permalink":"books","url":"/category/books"}]},{"id":4513783,"name":"MY LIFE IS A MOVIE - a novel by David L.","permalink":"my-life-is-a-movie-a-novel-by-david-l","position":2,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/my-life-is-a-movie-a-novel-by-david-l","status":"active","on_sale":true,"created_at":"2011-09-27T02:14:53.000Z","description":"Kayla Brown is living the classic struggle for acceptance and respect at the crossroads of her life: the upcoming senior spring dance, graduation, and a new love in her life that everyone seems to dislike. Her circle of friends include Tamika, clearly her opposite in every conceivable way, and Donovan, Tilden High School's star athlete as well as Tamika's boyfriend. \r\n\r\nKayla's journey as she encounters dating, family drama, and tragedy clearly demonstrate how choices dramatically impact one's immediate future and the lives of those around them. She also believes the world revolves around her and very much like a critically-acclaimed movie, everyone should be paying attention to her every move! \r\n\r\nThe overall theme of the book strategically shifts from playful to cautionary with each passing page. As in real life, Kayla, Tamika, and Donovan are engrossed in drama, danger, and at times, misfortune. Decisions are ultimately made, and as result, repercussions are inevitable. More importantly, see how each central character deals with their individual misfortune and the unexpected in their own unique way.","options":[{"id":14787415,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44209811/-/My_Life_Is_A_Movie_-_Front_Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44209811/-/My_Life_Is_A_Movie_-_Front_Cover.jpg","width":178,"height":280}],"artists":[],"categories":[{"id":2476927,"name":"Books","permalink":"books","url":"/category/books"}]},{"id":4513769,"name":"CHALK OUTLINE CONFESSIONS - a novel by David L.","permalink":"chalk-outline-confessions-by-david-l","position":3,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/chalk-outline-confessions-by-david-l","status":"active","on_sale":true,"created_at":"2011-09-27T02:13:08.000Z","description":"Francine Styles receives a visit from two detectives one fateful night announcing her husband’s death.  She later finds out his killer is a man he has been having an affair with.  Now she is on a mission to end the lives of men also leading double lives.  \r\n\r\nWitness each murder firsthand as even Francine’s trusted psychiatrist is nothing more than a helpless pawn in her quest for revenge.  Law enforcement is unable to pinpoint her whereabouts or deduce who is next in her line of victims and she is referred to as “The Revlon Killer” – a name given to her because of the way she seduces her victims before killing them in cold blood! ","options":[{"id":14787387,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44207923/-/COC_Remix_-_Front_Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44207923/-/COC_Remix_-_Front_Cover.jpg","width":414,"height":630}],"artists":[],"categories":[{"id":2476927,"name":"Books","permalink":"books","url":"/category/books"}]},{"id":4513749,"name":"OVER YOUR DEAD BODY  - a novel by David L.","permalink":"over-your-dead-body-a-novel-by-david-l","position":4,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/over-your-dead-body-a-novel-by-david-l","status":"active","on_sale":true,"created_at":"2011-09-27T02:11:42.000Z","description":" makes a financially successful, happily married man want to kill his wife? What makes that man turn into a fugitive and leave town with his two children? What if you were his best friend and witnessed his steady decline from family man to stone-cold criminal? Would you turn him in or support his every decision?\r\n\r\nThese are just a few of the questions that must be resolved in the life of Preston Price. Like all relationships, sometimes there are problems that need to be addressed. During one fateful night after returning home from his co-worker's apartment, Preston's wife Janelle accuses him of adultery. There is just one catch: Preston has remained faithful up to this stage of their marriage. Underlying feelings of contempt and disdain quickly form as both Janelle and Preston allow outside influences to get the best of them as their failing marriage continue to spiral downward. A game of cat and mouse ensues as Preston and Janelle become engrossed in battle with their children as the ultimate prize.\r\n\r\nNo one is safe as each character utilizes their entire array of wit, cunning, and deviousness to dispel the other's reputation. With each passing chapter, Preston becomes more determined to vindicate his image and exact revenge on his wife. With nothing else to lose, everyone becomes expendable in his eyes and consequently, all intended participants become \"chess pieces\" in what is considered the game of his life.","options":[{"id":14787353,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/44208203/-/OYDB_-_Front_Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/44208203/-/OYDB_-_Front_Cover.jpg","width":647,"height":1000}],"artists":[],"categories":[{"id":2476927,"name":"Books","permalink":"books","url":"/category/books"}]}]