[{"id":138129,"name":"Military Steampunk Goggles-Real Leather and Brass","permalink":"military-steampunk-goggles-real-leather-and-brass","position":1,"price":69.0,"default_price":69.0,"tax":0.0,"url":"/product/military-steampunk-goggles-real-leather-and-brass","status":"active","on_sale":false,"created_at":"2008-08-14T00:18:45.000Z","description":"Steampunks, when you picture yourself, do you see someone sharply saluting, uniformed and rugged? Heads turning to see the one dedicated to serving, an adventurer with a cause? Perhaps, you are a veteran, traveling like Quartermain with some lingering dedication to the service you once held. Or maybe your role takes you to an auxillary stance, supporting that which is bigger than yourself while still selflessly giving.\r\n\r\nThese goggles feature brass chevrons on the side, made to compliment your military themed attire. Created entirely by hand from real leather and brass (no plastic parts to bend, break or peel), this is a one of a kind piece.\r\n\r\nThe goggles start with a creamy leather body, which is accented with a black trim and thick matching black leather strap which closes with an adjustable buckle. The chevrons are featured on either side, and are real vintage pieces from WWII. The nosepiece adjusts with a metal core that can be bent to shape better to your face. Finally, finishing the piece off is are gray lenses, which will tint your vision much like sunglasses.\r\n\r\nPlease note that these are costume accessories, and not meant to be worn for eye protection.\r\n\r\nTo see some of my other goggle work, please visit http://waywarddreams.deviantart.com/gallery/","options":[{"id":644628,"name":"Default","price":69.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/799787/-/il_430xN_29155882.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/799787/-/il_430xN_29155882.jpg","width":430,"height":370}],"artists":[],"categories":[{"id":134502,"name":"Goggles","permalink":"goggles","url":"/category/goggles"}]},{"id":159457,"name":"Exquisite Embellished Lace Parasol","permalink":"exquisite-embellished-lace-parasol","position":2,"price":75.0,"default_price":75.0,"tax":0.0,"url":"/product/exquisite-embellished-lace-parasol","status":"active","on_sale":false,"created_at":"2008-09-30T06:04:46.000Z","description":"In the last century, ladies would hang their detailed parasols out the windows of their carriages as a sign of their wealth and prestige. In this latter century, you too can use a slightly updated version of this flamboyant yet useful accessory.\r\nStarting with a lace base, a color palette of burgandies, maroons, white, and golds float float in the web. A total of 6 different trims are used from the fringe on the outside to the tasseled cording around the goldtoned point. A scattering of understated domed tops and sparkles highlights the surface.\r\nPerfect for a formal occasion like prom, backgrounds for photography, or Christmas. Accent your character for a cosplay, steampunk, or LARP. Not only will you add to you look, you'll keep the sun and it's harmful rays off your face and shoulders.","options":[{"id":723238,"name":"Default","price":75.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":13.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/987277/-/parasol1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/987277/-/parasol1.jpg","width":1000,"height":1000}],"artists":[],"categories":[]}]