[{"id":6913627,"name":"jemek jemowit - zemsta","permalink":"jemek-jemowit-zemsta","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/jemek-jemowit-zemsta","status":"active","on_sale":false,"created_at":"2012-08-08T18:58:33.000Z","description":"Having grown up in West Berlin with a Polish background, Jemek now works as a One-Man-Band, \r\nDJ and Conceptual artist who has toured mostt of Europe. Still influenced by the creative input of \r\nnon-hip West Berlin, his eastern extravagance guarantees a thrill of ecstasy and long nights. His \r\nragged beats are produced with the legendary Groovebox MC-303, and with R’n’R, Acid House \r\nand EBM, add up to an explosive mix of Electrosound. The music and lyrics are drawn by a\r\nlove-hate relationship to his Polish roots that he refers to as »Postpatriotic«. After his first release \r\n»Wave and Groom« his debut album »Zemsta« (Polish for »Vengeance«) was released in 2011 by \r\nthe Fabrika Records (Greece).\r\n\r\nYear after the LP premiere ZEMSTA is re-released on CD in Oficyna Biedota - 100 hand number copies. Premiere date is 1-09-2012 and we will start shipping the orders few days before this date.","options":[{"id":21918491,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/67849219/-/zemsta_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/67849219/-/zemsta_cover.jpg","width":520,"height":519}],"artists":[],"categories":[{"id":3293861,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":6347343,"name":"demolka - demolka","permalink":"demolka-demolka","position":2,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/demolka-demolka","status":"active","on_sale":false,"created_at":"2012-06-02T19:48:28.000Z","description":"DEMOLKA (Demolition) is a project which was founded...  too late. The debut record is to come out on 27th April 2012, oddly enough, bearing in mind the fact that according the the May's calendar, the world is due to come to an end this year. Hence, only a couple of months will be left for us to relish biomechanical quivering of their beats. Electro Punk, with the lyrics placed in cyberpunk dystopias, could become an electryfing proposition for the last generation of the world's public. Still the question is: do the humanoids really dream about electryfing hits? It is difficult to give an answer and DEMOLKA will not manage to conquer futuristic discos as there is no future ahead... \r\n\r\nIn the meantime, during a moment which lasts several dozens of mintues, you will feel like the sound-astronauts, jetted into the Outerspace. As the creatures of unknown origin, unable to be classified by a group of scientists working for multcorporations and exploating the Universe. Watch out for another spring plague of rockets straight from the Orion galaxy... and what if, provided that you got the code, you were to set out on a journey with Rocket and Processor themselves? You will be able to cross the rings of Saturn before the wave of radioctive rays, being the debris of the destroyed planet, gets You! \r\n\r\nToday DEMOLKA is a duo: Dziewczyna Rakieta (Rocket Girl),  vocalist and Grzegorz J. Fajngold (Procesor Plus, 19 Wiosen) - composer. \r\n\r\nTracklist:\r\n01. Ja / Nie ja (I/Not-Me)\r\n02. Cos (Something)\r\n03. Linia (Line)\r\n04. Szkarlatny Swit (Crimson Dawn)\r\n05. Swieto Wiosny (Rocket Plague)\r\n06. DR \r\n07. Zing Bang Punk\r\n08. Kosmos (The Universe Vanishes)\r\n09. Osobliwosc (Oddity)\r\n10. Probowka (The Test-Tube)\r\n11. Demolka (Demolition)\r\n\r\nThe CD comes in a colorful digipack with 10-pages booklet with lyrics in both polish and english. Shipping costs included.\r\n\r\nIf you are interested in digital version of this release you can find it here: http://routenote.com/r/biedota/5051813844287","options":[{"id":20220131,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/62335431/-/cover_small.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/62335431/-/cover_small.jpeg","width":350,"height":350}],"artists":[],"categories":[{"id":3293861,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]