[{"id":14569344,"name":"Gisele Scales \"2 Think\" CD","permalink":"gisele-scales-2-think-cd","position":1,"price":24.95,"default_price":24.95,"tax":0.0,"url":"/product/gisele-scales-2-think-cd","status":"active","on_sale":false,"created_at":"2013-11-02T06:41:01.000Z","description":"Ex-Midnight Oil Electric violinist & vocalist Gisèle Scales describes her sound as colourful, happy, inspiring, electro rock pop. Her brand of genre-defying electric violin dance music will not only move your body, it will also challenge your mind. \r\n\r\nElectric violinist & multi-lingual vocalist Gisèle Scales has been invading indie music circles throughout the US & Japan with her solo debut \"2 Think\". Having album credits with Midnight Oil, Eurogliders, Jeannie Lewis, and the European No.1 single “Mother Egypt” by Vega, Gisèle has come up with a dance CD that not only demands you boogie your ass off, but also lifts you up to the exciting possibility of a world at peace. Gisèle is now joined on stage by her multi-talented 18 yr old son Oliver on drums.\r\n\r\n\"Great & original sounds! Big love 4U Gisele\"- Serge Gainsbourg \r\n\"Hi Gisele...I really like your music\"- Carole Bayer Sager\r\n“Talented!” – Rihanna\r\n\"Luv ur music xox\"- Australian Idol\r\n\"Really great. Energetic stuff. Beautiful sounding violin. Love the anthem. Great message. Can't believe it's just you LOL!\" - spank248 on YouTube\r\n\"Just had a listen to your music - what a funky clever chickie you are! This time last week I was in Paris. You transported me! Gotan Project meets Catherine Deneuve's vocals in Malcolm McClaren's Paris.\" - Claudia Chan Shaw ABCTV\r\n“You are a very soulful player, and I hope one day to hear some more of this recording” – Joe Dolce\r\n\"You amaze me with your talent and endeavour....I'm loving listening to all that beautiful music you're making!\"- Peter Garrett\r\n\r\n“Wow! Yoko Ono gets it on with Test Department, Kronos Quartet, Jean Luc Ponty and Paul Oakenfold, and musical cherubs are everywhere!” – Musictrax Japan  \r\n","options":[{"id":47181894,"name":"Default","price":24.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126869328/-/Gisele_Scales_Cover_Art_front.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126869328/-/Gisele_Scales_Cover_Art_front.JPG","width":550,"height":553}],"artists":[],"categories":[{"id":6565323,"name":"Albums","permalink":"albums","url":"/category/albums"}]}]