[{"id":3793146,"name":"Aquaterra, Ocean, Silver Leaf Jasper & Crazy Agate Pendant","permalink":"aquaterra-ocean-silver-leaf-jasper-crazy-agate-pendant","position":1,"price":79.99,"default_price":79.99,"tax":0.0,"url":"/product/aquaterra-ocean-silver-leaf-jasper-crazy-agate-pendant","status":"active","on_sale":false,"created_at":"2011-05-22T10:30:11.000Z","description":"Ocean Jasper (Orbicular Jasper)\r\nOcean Jasper (also called Orbicular Jasper) is an unusual jasper found only at a remote location on the coast of Madagascar that can only be mined at low tide! The colors vary widely - including white, green, pink, red, black, blue. The wild polka dots, wavy lines, multi colored floret patterns of Ocean Jasper make this a gorgeous and exciting stone. \r\n\r\nThe positive vibrations of Ocean Jasper make it a stone of joy.\r\nStimulates solar plexus, heart and throat chakras \r\nIncreases expression of love in words and actions \r\nGently brings into focus the positive aspects of one's life \r\nBrings relaxation and cooperation to the home or workplace \r\n\r\nThis powerful stone lifts negativity so one can fully appreciate blessings.\r\n\r\nThis beautiful stone is now mined out and its availability becomes more rare. Get yours now.\r\n","options":[{"id":12679810,"name":"Default","price":79.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36955788/-/076.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36955788/-/076.JPG","width":1000,"height":249}],"artists":[],"categories":[]},{"id":3793124,"name":"Bronzite & Moss Agate Gem Necklace w/ Bronzite Pendant","permalink":"bronzite-moss-agate-gem-necklace-w-bronzite-pendant","position":2,"price":119.0,"default_price":119.0,"tax":0.0,"url":"/product/bronzite-moss-agate-gem-necklace-w-bronzite-pendant","status":"active","on_sale":false,"created_at":"2011-05-22T10:18:13.000Z","description":"\r\nBronzite Meaning\r\nBronzite is believed to give a sense of certainty when goal-setting and help the wearer take control of his of her decisions. It is used to encourage good behavior and help dispel restlessness.\r\n\r\nBronzite's high energy yield makes a very good gemstone for the fast pace of current society. This gemstone allows one to work under pressure during difficult tasks. Its vibrations in allowing one to have a sense of certainty in goal-setting comes from its ability to allow one to see the entire picture and not be discouraged by the distractions and tasks before reaching the goal.\r\n\r\nThose that have the need to deal with people daily (for example, hotel managers, hostesses, etc.) will find Bronzite a useful stone in maintaining courtesy even at most difficult times. \r\n\r\nBronzite's strong energies aids one in facing challenging decisions. The vibrations help one sort out the benefits and bad consequences facing each decision. This powerful gemstone is believed to be greatly beneficial in meditation to help one sort through their decisions. \r\n\r\nKnown to be beneficial in opening the root chakra, and balancing the Sacral Chakra.\r\n\r\n \r\n \r\nVIEW Bronzite JEWELRY > \r\n\r\nThe Importance of Gemstone Jewelry in our High Tech World:\r\nToday's high-tech world makes it necessary for one to wear gemstone jewelry. We live in a world with a chaotic energy field, created by electronics around us. Modern conveniences such as cell phones, computers and microwaves emit radiation and electromagnetic waves that interfere with our bodies' magnetic fields. Fortunately, nature has given us the gift of gemstones, whose organic energies help us return to our natural healthy state. However, gemstones need to be worn in order for us to gain the full benefits of its energies, as its energies are extended to approximately 1 foot. Gemstone jewelry is the most convenient way to maintain bodies magnetic field, without invasive medical procedures. It is the most stylish, easiest way to maintain your health, restoring bodily, mental, spiritual health to its perfect natural state.\r\n\r\nBronzite History\r\nToday, Bronzite is found in areas of the USA, Austria, England, South Africa, India, Labrador, Norway, and Greenland.\r\n\r\n\r\n","options":[{"id":12679770,"name":"Default","price":119.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36955308/-/030.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36955308/-/030.JPG","width":1000,"height":849}],"artists":[],"categories":[]},{"id":3793090,"name":"Pietersite Gem Necklace","permalink":"heart-bead-designs","position":3,"price":219.0,"default_price":219.0,"tax":0.0,"url":"/product/heart-bead-designs","status":"active","on_sale":false,"created_at":"2011-05-22T09:53:27.000Z","description":"Pietersite sometimes known as Tempeststone; was discovered by Sid Pieters from Namibia, South Africa. This stone has come to represent the movement and chaos that breaks up those energy patterns which are resistant to change. The energy of Pietersite is very forceful and jolts us into personal change. It enhances courage, tenacity, and ability to maintain or create what is yours. Emotionally, Pietersite helps to relax, and release deep emotions in a calmer way. Physically, Pietersite balances body fluids, improves nutrition, helps with gastrointestinal functions, and helps the endocrine glands, balances female hormones, alleviates PMS and menopause symptoms. Pietersite is also excellent for improving memory. \r\n\r\n","options":[{"id":12679642,"name":"Default","price":219.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36955124/-/025.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36955124/-/025.JPG","width":1000,"height":522}],"artists":[],"categories":[]}]