[{"id":321622,"name":"6 Bars of Soap","permalink":"6-bars-of-soap","position":1,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/6-bars-of-soap","status":"active","on_sale":false,"created_at":"2009-06-13T15:39:47.000Z","description":"Choose any six bars of my handmade shea butter soap from those listed below. \r\n\r\nCucumber Wasabi Cilantro - A refreshing spa-like fragrance with top notes of grapefruit and lime, middle notes of fresh cucumber, guava, and passionfruit, and base notes of wasabi, cilantro, and fern. A truly unique scent!\r\n\r\nSweet Temptation - This Victorias Secret duplicate fragrance is a sexy, citrusy blend of pineapple, peach, Brazilian orange, and lemon combined with Egyptian jasmine, musk, and amber. One of my new favorites that you're sure to love!\r\n\r\nLavender Oatmeal - Lavender has been popular since ancient times. It is used in aromatherapy to help alleviate anxiety, stress, and tension. It has a calming, soothing effect on the mind, body, and spirit. My lavender oatmeal soap is made with pure Bulgarian Lavender Essential Oil, shea butter, organic oatmeal, oat flour, and coconut milk. This soap has all the wonderful properties of a milk soap without the use of animal milk! 100% Vegan!\r\n\r\nRosemary Mint with Goats Milk - This herbal soap features a brisk, invigorating aromatherapy blend of essential oils including Rosemary, Peppermint, Bergamot, and Lemon. Fresh, clean, and the perfect wake-me-up in the shower! Made with skin-loving cocoa & shea butters, it leaves your skin soft and supple. Goats milk adds to the rich, creamy lather.\r\n\r\nOatmeal Milk & Honey - Goats milk and honey yield a mild and extremely moisturizing soap with the gentle scrubbing power of finely ground oats and a warm, comforting fragrance. Mellow and soothing, this soap is the \"comfort food\" of bath bars. Oatmeal, goats milk, honey and all-natural ingredients make this a mild, fabulous soap for special skin: yours.\r\nDye and fragrance free.\r\n\r\nSweet Orange Patchouli - My Sweet Orange & Patchouli Soap combines the deep, natural scent of Indonesian Dark Patchouli essential oil with the fruity essence of Sweet Orange. This is a scent loved by both men and women alike.\r\n\r\nGardener's Soap - Just what your hard-working hands have been asking for - a mild, freshly scented soap with pumice to gently clean while shea butter soothes your skin. Perfect for mechanics and cooks, too! Scented with an uplifting blend of essential oils including rosemary, lemon, lime, and peppermint. Topped with calendula petals. As pretty as it is functional!\r\n\r\nPure & Simple - Formulated to be gentle on sensitive skin, this soap is made with 12% shea & cocoa butters. Free of perfumes, dyes, and additives, this creamy white bar will leave your skin feeling fresh and clean, never dry or irritated.\r\n\r\nHoney Almond - This is a wonderful combination of sweet, golden honey and classic almond. Made with real organic honey for mounds of moisturizing lather. \r\n\r\nChocolate Cream Pie - Now you can have your dessert without the calories! My Chocolate Cream Pie soap is made using real dark cocoa powder, coconut cream, and the most delectable chocolate fragrance! You'll think you've died and gone to heaven!\r\n\r\nManuka Honey & Lavender with Goat's Milk - Sweet smelling Manuka Honey comes together with the soothing essence of Lavender in this wonderfully moisturizing soap bar. Made with skin-loving cocoa & shea butters, it leaves your skin soft and supple. Goats milk adds to the rich, creamy lather and is great for your skin!\r\n\r\nSandalwood & Vanilla - An exotic harmony of warm, woodsy sandalwood and sweet, creamy vanilla. This combination is sure to appeal to both men and women alike. \r\n\r\nJapanese Cherry Blossom - Oriental and sensual, Japanese Cherry Blossom is a well-rounded blend of pink Japanese Cherry blossoms and fragrant mimosa flower petals, with warm base notes of vanilla, tonka bean, and oriental woods.\r\n\r\nCreamy Coconut - This is what all you coconut lovers have been longing for! A true coconut scent in a creamy, ivory colored bar. Not overly sweet, and you won't smell like suntan oil! Just the fresh, clean scent of coconut meat. Made with coconut cream and shea butter for a truly luxurious bathing experience!\r\n\r\nPlease include your choices at checkout.\r\n\r\n\r\n\r\n","options":[{"id":1328491,"name":"Default","price":25.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2483677/-/any_eight_soaps.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2483677/-/any_eight_soaps.jpg","width":430,"height":322}],"artists":[],"categories":[{"id":267607,"name":"Soap","permalink":"soap","url":"/category/soap"}]},{"id":324910,"name":"Set of Four Essential Oil Soaps","permalink":"set-of-four-essential-oil-soaps","position":2,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/set-of-four-essential-oil-soaps","status":"active","on_sale":false,"created_at":"2009-06-18T00:12:30.000Z","description":"1. Rosemary Mint with Goats Milk ~ This herbal soap features a brisk, invigorating aromatherapy blend of essential oils including Rosemary, Peppermint, Bergamot, and Lemon. Fresh, clean, and the perfect wake-me-up in the shower! \r\n\r\nIngredients: Olive Oil, Coconut Oil, Soybean Oil, Sodium Hydroxide, Goats Milk, Distilled Water, Shea Butter, Cocoa Butter, Castor Oil, Essential Oils\r\n\r\n2. Bulgarian Lavender & Oatmeal ~ Lavender has been popular since ancient times. It is used in aromatherapy to help alleviate anxiety, stress, and tension. It has a calming, soothing effect on the mind, body, and spirit. My lavender oatmeal soap is made with pure Bulgarian Lavender Essential Oil, shea butter, organic oatmeal, oat flour, and coconut milk.\r\n\r\nIngredients: Olive Oil, Coconut Oil, Soybean Oil, Sodium Hydroxide, Coconut Milk, Distilled Water, Shea Butter, Oatmeal, Oat Flour, Castor Oil, Lavender Essential Oil\r\n\r\n3. Sweet Orange & Indonesian Patchouli ~ This lovely soap combines the deep, natural scent of Indonesian Dark Patchouli essential oil with the fruity essence of Sweet Orange. This is a scent loved by both men and women alike.\r\n\r\nIngredients: Olive Oil, Coconut Oil, Soybean Oil, Sodium Hydroxide, Coconut Milk, Distilled Water, Shea Butter, Castor Oil, Essential Oils, Activated Charcoal Powder, Mica\r\n\r\n4. Gardener's Soap ~ Just what your hard-working hands have been asking for - a mild, freshly scented soap with pumice to gently clean while shea butter soothes your skin. Perfect for mechanics and cooks, too! Scented with an uplifting blend of essential oils including rosemary, lemon, lime, and peppermint. Topped with calendula petals. As pretty as it is functional!\r\n\r\nIngredients: Olive Oil, Coconut Oil, Soybean Oil, Distilled Water, Sodium Hydroxide, Coconut Milk, Shea Butter, Castor Oil, Essential Oil, Pumice, Botanicals\r\n\r\nEach bar weighs a minimum of 4.5 ounces and will come individually boxed and labeled. \r\n ","options":[{"id":1339366,"name":"Default","price":18.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[],"artists":[],"categories":[{"id":267607,"name":"Soap","permalink":"soap","url":"/category/soap"}]}]