[{"id":14275920,"name":"SOLOVAIR derby boot 8 eye (cherry red) uomo-donna","permalink":"solovair-derby-boot-8-eye-cherry-red-uomo-donna","position":1,"price":185.0,"default_price":185.0,"tax":0.0,"url":"/product/solovair-derby-boot-8-eye-cherry-red-uomo-donna","status":"active","on_sale":true,"created_at":"2013-10-19T08:58:06.000Z","description":"DISPONIBILI IN TUTTI I NUMERI DAL 36 AL 44 (3/5 al 9/5)\r\n\r\nLa NPS, Northamptonshire Productive Society, è una cooperativa che dal 1881 produce calzature a Wollastone in Inghilterra, l'unica ancora esistente. Il loro marchio Solovair è legato storicamente alle famose Dr. Martens, una storia che pochi conoscono, tipicamente British. Eravamo alla ricerca di un'azienda legata alle produzioni artigianali con un vero bagaglio di storia alle spalle per riportarla a quello che erano gli antichi splendori introducendo magari qualche contenuto in più nel design. Noi cercavamo Hawkins, un pregiato marchio di calzature famoso negli anni '80 che usava la stessa suola air-cushioned ma dalla forma molto più classica. La NPS ha acquistato le forme della Hawkins e ha riprodotto il classico scarponcino Hawkins, famoso tra gli Skinhead.\"\r\nOriginalmente le Dr. Martens furono le scarpe della working class, poi vennero adottate dai primi movimenti Skinhead nella seconda metà degli anni '60 come simbolo di appartenenza alla vera classe sociale operaia in opposizione ai borghesi hippies. Uno stile influenzato dai mod inglesi e i bad boy giamaicani (che aveva poco in comune con gli schieramenti di estrema destra a cui oggi sono associati); ascoltavano reggae, R&B e soul ed erano riconoscibili dai capelli rasati, le bretelle, i jeans arrotolati e naturalmente gli anfibi Dr. Martens. Ma per chi voleva le scarpe basse c'erano anche le classiche derby inglesi, sempre con la suola in gomma, come ad esempio le Hawkins. \r\nPer 35 anni NPS produsse le Dr. Martens sotto licenza, con il nome Dr Martens by Solovair. Quando la Dr. Martens spostò la produzione nel 2003, le loro strade si divisero e la NPS continuò l'attività con un prodotto di nicchia. Infatti l'unico negozio dove era possibile trovare gli anfibi Solovair era il negozio di Camden, mitico punto di riferimento per Skinhead e Punk.\" Proprio quel negozio, il British Boot Company di Camden Town a Londra (una volta conosciuto come HOLTS), è passato alla storia per aver venduto per primi al mondo l'anfibio sul finire degli anni '50. Negli anni '70 la storia dell'anfibio si legò al rock e ai punk, diventando un simbolo di ribellione contro ogni tipo di establishment. In quegli anni il negozio di Camden Town divenne la mecca degli gli Skinhead e i Punk rocker che volevano acquistare il loro paio di stivali. Tra i clienti abituali c'erano i THE CLASH e i SEX PISTOLS che usavano firmare i loro nomi sul muro del negozio. Fin quando nel corso anni '80 iniziò ad entrare nel guardaroba di ognuno, divenne moda, ed esplose negli anni '90 con successo crescente fino ad oggi.\r\nSOLOVAIR ha scelto i pellami che sono in gran parte italiani, minimo 1,7/ 1,8 millimetri quindi sono molto resistenti. C'è anche un supporto in legno per l'arcata plantare, che la rende molto comoda. Noi abbiamo disegnato un campionario un po' più classico, una scarpa inglese con il fondo in gomma, inoltre è possibile personalizzare i pellami e i colori di ogni modello. Ed è Made in England 100%, le macchine che usa Solovair hanno minimo 50 anni, sono macchine storiche...un prodotto non finto ma di contenuto.\"\r\n\r\nE così l'anfibio, da simbolo della controcultura, è diventato un classico intramontabile.","options":[{"id":46152357,"name":"Default","price":185.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":23,"name":"Italy","code":"IT"}},{"amount_alone":15.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126112518/-/EightEyeDerbyMain.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126112518/-/EightEyeDerbyMain.jpg","width":490,"height":490}],"artists":[],"categories":[{"id":3135489,"name":"Footwear","permalink":"footwear","url":"/category/footwear"}]}]