[{"id":5142773,"name":"Deposit for a Custom Doll ","permalink":"custom-doll-deposit","position":1,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/custom-doll-deposit","status":"sold-out","on_sale":false,"created_at":"2011-12-27T20:18:10.000Z","description":"This listing is for a deposit for custom AppleTreeHouse Doll to be completed by February 21, 2012.\r\n\r\nYou can choose the size (8 or 12 inch), the skin tone (Photo 2 is the mocha skin tone, Photo 3 is the peach skin), hair colors (I have many art yarns in stock and am happy to provide photos), eye color, boy or girl.  \r\n\r\nThe balance will be due upon completion before the doll is shipped, the deposit is not refundable.  Finished prices are $95 for an 8 inch doll and $165 for a 12 inch doll.  Photos are of dolls previously created, each doll is one of a kind and cannot be duplicated exactly.  To see more of my dolls, please visit my Flickr stream:\r\n\r\nhttp://www.flickr.com/photos/44088093@N06/\r\n\r\nPlease e-mail appletreehouse (at) att (dot) net with any questions.\r\n\r\nThank you!\r\n\r\n\r\n\r\n\r\n","options":[{"id":16699711,"name":"Deposit for a 12 inch Doll","price":45.0,"sold_out":false,"has_custom_price":false},{"id":16704347,"name":"Deposit for an 8 inch Doll","price":40.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50498707/-/securedownload4.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50498707/-/securedownload4.jpg","width":720,"height":606}],"artists":[],"categories":[]},{"id":3061253,"name":"Custom Li'l Lovey","permalink":"custom-li-l-lovey","position":2,"price":28.0,"default_price":28.0,"tax":0.0,"url":"/product/custom-li-l-lovey","status":"sold-out","on_sale":false,"created_at":"2010-12-24T03:33:58.000Z","description":"What is a Li'l Lovey? It is the softest, sweetest, first companion doll to love and cuddle ♥\r\n\r\nA Custom Li'l Lovey is made from cotton knits that I have or from a t-shirt sent by you!  You also get to choose the skin tone and eye color.  \r\n\r\nLi'l Lovey is about 11 inches from top of the head to tip, about 14 inches from \"hand to hand\",  and is made from the softest, natural materials. The body can be made from any cotton knit fabric I have on hand or a  t-shirt that you would like to use (I need at least 1/2 yard of fabric), the hat can be from the same shirt, a complimentary knit, or buttery soft cotton velour.\r\n\r\nThe head is firmly stuffed with pure eco-wool that will warm up as it is held. Wool is naturally anti-bacterial and anti-microbial and resists dust mites. Wool also has the amazing ability to absorb scent, so if Mom or Dad gives a cuddle to a Li'l Lovey then gives it to a little one to snuggle, the Li'l Lovey will smell lovingly familiar. The eyes and mouth are hand embroidered cotton floss. Li'l Lovey can also be wet on the knotted parts and put in the freezer to give a little relief to sore gums when teething. ♥\r\n\r\nAs with all toys, please supervise with kids who are under 3 and / or still put things in their mouths. Please check often for signs of wear that may make it unsafe. All seams are double stitched for added durability. The Li'l Lovey can be washed with delicate soap and laid flat to dry.\r\n\r\nAfter purchase, I will contact you to make arrangements.  Please feel free to e-mail me with any questions!\r\n\r\nThanks for stopping by Apple Tree House ♥\r\n","options":[{"id":10509009,"name":"Default","price":28.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.0,"amount_with_others":8.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50499155/-/securedownload5.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50499155/-/securedownload5.jpg","width":615,"height":720}],"artists":[],"categories":[]}]