[{"id":53296,"name":"Aragorn Necklace - Tolkien - Spell Cast Gems(tm) Elven Magic Jewelry - Medieval - Fantasy - Filigree","permalink":"aragorn-necklace-tolkien-spell-cast-gems-tm-elven-magic-jewelry-medieval-fantasy-filigree","position":1,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/aragorn-necklace-tolkien-spell-cast-gems-tm-elven-magic-jewelry-medieval-fantasy-filigree","status":"active","on_sale":false,"created_at":"2007-11-15T11:26:02.000Z","description":"This Spell Cast Gems&#8482; &#8220;ARAGORN&#8221; necklace is:\n\n\t*Lord of the Rings Elven jewelry, designed in a medieval, vintage fantasy setting, with filigree.\n\n\tThis necklace has Spell Cast Gems&#8482; magic crystal energy for increased mental focus. It is also an astrological talisman and an amulet &#8211; please contact Seller for details.\n\n\tOriginal art: each item featured in this webpage is handmade and unique.\n\n\tThe reverse side of the pendant has a unique magic spell on composite gold leaf &#8211; this spell design will not be repeated on another item.\n\n\tCentral focal point is a vivid green Looking Glass Pendant&#8482;(I manufacture these).\n\n\tThis listing also includes optional gemstone engraving and healing energywork.\n\n\tMaterials include oxidized brass chain, toggle clasp, genuine aventurine beads, silver foil beads, emerald matte glass beads, clear green glass beads, composite gold leaf, and toxic-free jeweler&#8217;s synthetics.\n\n\tNecklace length is adjustable; it can be work as a choker and measures app. 20 inches total length; pendant is app.1 5/8 inches in diameter.\n\n\t<span class=\"caps\">ABOUT</span> <a href=\"</p\"><span class=\"caps\">ARAGORN</span></a>&gt;\n\n\n\tIn Tolkien&#8217;s writings, King Aragorn was a descendant of Lord Elrond Half-elven&#8217;s twin brother and the first king of Númenor. Aragorn&#8217;s father was killed by Orcs when Aragorn was a child. He was raised by Elrond in Rivendell. Aragorn was tall, and had elven wisdom as well as foresight. He was humble and self-sacrificing, a healer, and a powerful military commander and warrior. He had impressive powers for a man partly because he was Isildur&#8217;s heir.\n\n\tWhen Sauron was defeated, Aragorn was crowned King of Arnor, the thirty-fifth King of Gondor, and the first High King of the Reunited Kingdom. Aragorn married the Elf Princess, Arwen, Elrond&#8217;s daughter, and ruled the Kingdom of Gondor and Arnor until the 120th year of the Fourth Age. He died at the age of 210. Arwen died of a broken heart.\n\n\t<span class=\"caps\">METAPHYSICAL</span> and <span class=\"caps\">ASTROLOGICAL EFFECTS</span>, and <span class=\"caps\">PERSONAL EXPERIENCES</span> with this item: A talisman or spiritual tool will choose and find its rightful owner. This necklace, with its magic spell, is designed as a healing amulet and a talisman. Details concerning the design and effects of the necklace will be sent to the buyer upon purchase, with instructions for care and uses of the item. Please send me email for details: spellworker@sbcglobal.net.\n\n\tCopyrights and Trademarks: The seller reserves all copyrights, trademarks, and intellectual property rights with respect to this item, including the design of the item, designs on the item, and photos of the item. Please see my Profile for further information.\n\n\t<span class=\"caps\">SHIPPING WORLDWIDE</span>. PAYMENT <span class=\"caps\">METHODS</span>: PAYPAL <span class=\"caps\">PREFERRED</span>. (c) 2007 spellworker.com\n\n","options":[{"id":269292,"name":"Default","price":60.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.4,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/107528/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/107528/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":60881,"name":"Jewelry","permalink":"jewelry","url":"/category/jewelry"}]},{"id":53307,"name":"Queen Olympias Necklace - Alexander the Great - Ancient Greece - Spellworker(tm) Goddess Jewelry","permalink":"queen-olympias-necklace-alexander-the-great-ancient-greece-spellworker-tm-goddess-jewelry","position":2,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/queen-olympias-necklace-alexander-the-great-ancient-greece-spellworker-tm-goddess-jewelry","status":"active","on_sale":false,"created_at":"2007-11-15T11:48:55.000Z","description":"This Queen Olympias, Mother of Alexander the Great, necklace is:\n\n\t*Spellworker&#8482; Goddess Jewelry;\n*specially designed for Spell Cast Gems&#8482; magic crystal healing energy for the intellect.\n\n\tIt is also an astrological talisman and an amulet (please contact Seller for details).\n\n\tThe central focal point is a beautiful large aquamarine, faceted, set with a square antiqued filigree; two aventurines adorn the sides\n\n\tThis listing also includes optional gemstone engraving and healing energy work.\n\n\tMaterials include genuine aventurine beads, silver foil beads, composite gold leaf, genuine aquamarine, oxidized brass chain, toggle clasp, gold-tone chain, antiqued filigree, and gunmetal chain\n\n\tNecklace length is adjustable; it can be work as a choker and measures app. 20 inches total length; pendant is app.1 5/8 inches in diameter\n\n\t<span class=\"caps\">ABOUT QUEEN OLYMPIAS</span>, MOTHER <span class=\"caps\">OF ALEXANDER THE GREAT</span>:\n\n\tHistorically, Queen Olympias, Mother of Alexander the Great of Macedon, has been greatly maligned. She had a reputation for being a beautiful, scheming sorceress or witch. She was, however, a woman of great strength and assertiveness for her time. Perhaps only a person like Queen Olympias could have given birth and raised a person like Alexander the Great.\n\n\tThe only surviving portrait of her is a coin of that time period. One thing is clear: Olympias had to fight, for what she felt was right, in a very chauvinistic society.\n\n\t<span class=\"caps\">METAPHYSICAL</span> and <span class=\"caps\">ASTROLOGICAL EFFECTS</span>, and <span class=\"caps\">PERSONAL EXPERIENCES</span> with these <span class=\"caps\">GEMS</span>: A talisman or spiritual tool will choose and find its rightful owner. This necklace is an amulet and a talisman. Details concerning the design, effects, and characteristics of the necklace will be sent to the buyer upon purchase, with instructions for care and uses of the item. Please send me email:  spellworker@sbcglobal.net.\n\n\tCopyrights and Trademarks: The seller reserves all copyrights, trademarks, and intellectual property rights with respect to this item, including the design of the item, designs on the item, and photos of the item. Please send me email for more information. The trademarks spellcastgems&#8482;, Spellworker&#8482;, Spell Worker&#8482;, spellworker&#8482;, spell worker&#8482;, spell cast gems&#8482;, Spell Cast Gems&#8482;, Spellcastgems(tm, and SpellCastGems&#8482; are trademarks of the Seller.\n\n\t<span class=\"caps\">SHIPPING WORLDWIDE</span> &#8211; please contact seller for shipping costs if buyer is outside the U.S.. <span class=\"caps\">PAYMENT METHODS</span>: PAYPAL <span class=\"caps\">PREFERRED</span>. (c) 2007 spellworker.com\n\n","options":[{"id":269362,"name":"Default","price":60.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.4,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/107541/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/107541/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":60881,"name":"Jewelry","permalink":"jewelry","url":"/category/jewelry"}]},{"id":53308,"name":"Galadriel Necklace - Tolkien - Elven Magic Jewelry - Spell Cast Gems(tm) Charged Quartz","permalink":"galadriel-necklace-tolkien-elven-magic-jewelry-spell-cast-gems-tm-charged-quartz","position":3,"price":108.0,"default_price":108.0,"tax":0.0,"url":"/product/galadriel-necklace-tolkien-elven-magic-jewelry-spell-cast-gems-tm-charged-quartz","status":"active","on_sale":false,"created_at":"2007-11-15T11:53:10.000Z","description":"About Galadriel &#8211; Tolkien Elven Necklace:\n\n\t<ul>\n\t<li>this is a fantasy elven faerie pagan necklace</li>\n\t\t<li>It his a Spell Cast Gems&#8482; crystal magic necklace for relationships. It has been carefully designed for self-confidence, and to strengthen positive experiences</li>\n\t\t<li>this necklace is also an astrological amulet and a talisman (ask Seller for details)</li>\n\t\t<li>it includes optional custom engraving on the gemstones</li>\n\t\t<li>materials: specially selected <span class=\"caps\">CHARGED</span> clear quartz pieces, aurora borealis crystal beads, silver foil beads in gold and silver</li>\n\t\t<li>it can be worn as a choker, adjustable length</li>\n\t</ul>\n\n\n\t<span class=\"caps\">ABOUT GALADRIEL</span>, ELF <span class=\"caps\">QUEEN AND SORCERESS</span>:\n\n\tGaladriel, also known as the Lady of the Golden Wood of Lothlorien, was the most powerful Elf in Middle-earth during the Third Age. Galadriel was very wise. She had knowledge of growing things and crafts. Galadriel had great intuition and could read others&#8217; minds. Although strong-willed, she was very kind, compassionate, and merciful. The beauty of Galadriel was indescribable. Her long, flowing, golden hair had silver highlights, and it resembled the light of the Two Trees of Valinor.\n\n\t<span class=\"caps\">METAPHYSICAL</span> and <span class=\"caps\">ASTROLOGICAL EFFECTS</span>, and <span class=\"caps\">PERSONAL EXPERIENCES</span> with these <span class=\"caps\">GEMS</span>: A talisman or spiritual tool will choose and find its rightful owner. Please send me email for more information: spellworker@sbcglobal.net.\n\n\tCopyrights and Trademarks: The seller reserves all copyrights, trademarks, and intellectual property rights with respect to this item, including the design of the item, designs on the item, and photos of the item. Please send email for details.\n\n\t<span class=\"caps\">SHIPPING WORLDWIDE</span>. PAYMENT <span class=\"caps\">METHODS</span>: PAYPAL <span class=\"caps\">PREFERRED</span>. (c) 2007 spellworker.com\n\n","options":[{"id":269364,"name":"Default","price":108.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.4,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/107542/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/107542/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":60881,"name":"Jewelry","permalink":"jewelry","url":"/category/jewelry"}]}]