[{"id":111351,"name":"SACHA Face Powder Palette","permalink":"sacha-face-powder-palette","position":1,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/sacha-face-powder-palette","status":"active","on_sale":true,"created_at":"2008-06-06T00:13:02.000Z","description":"<a href=\"http://s107.photobucket.com/albums/m314/empressmissmatch4i/?action=view&current=sachablacklogo2.png\" target=\"_blank\"><img src=\"http://i107.photobucket.com/albums/m314/empressmissmatch4i/sachablacklogo2.png\" border=\"0\" alt=\"Photobucket\"></a>\r\n\r\n<a href=\"http://s107.photobucket.com/albums/m314/empressmissmatch4i/?action=view&current=testerkits-1.jpg\" target=\"_blank\"><img src=\"http://i107.photobucket.com/albums/m314/empressmissmatch4i/testerkits-1.jpg\" border=\"0\" alt=\"Photobucket\"></a>\r\n12 Shades of Sacha Powders on one convenient 12\"x6\" inch professional palette. Great for makeup artists.  Regular price $100!!! \r\n\r\n \r\nTest foundation along your jaw line - not on your hand and definitely not on the inside of your wrist. View it under different light settings. It must match the natural color of your neck.\r\n\r\nAfter you put on your foundation you need to follow with a yellow based face powder to get that sophisticated matte look. Face powders are an essential step in your makeup routine. They are available in either compact or loose form. \r\n\r\nIt is important to set your foundation with a loose powder. This helps to keep your foundation in place.\r\n\r\nSacha's Translucent Powders are light in texture providing a sheer, natural finish. They are lightly tinted and work best with Sacha's yellow-based foundations.\r\n\r\nThe basic idea is, if you use a translucent powder over your foundation or concealer, it will set your makeup without adding too much extra color.\r\n\r\nOpen your mouth when applying foundation to expose the neck area and eliminate an obvious line at the jaw line.\r\n","options":[{"id":541676,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/560423/-/foundation.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/560423/-/foundation.jpg","width":56,"height":110}],"artists":[],"categories":[{"id":51106,"name":"Powder","permalink":"powder","url":"/category/powder"}]},{"id":111456,"name":"SACHA Lipstick Palette","permalink":"sacha-lipstick-palette","position":2,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/sacha-lipstick-palette","status":"active","on_sale":true,"created_at":"2008-06-06T04:40:45.000Z","description":"<CENTER><a href=\"http://s107.photobucket.com/albums/m314/empressmissmatch4i/?action=view&current=sachablacklogo2.png\" target=\"_blank\"><img src=\"http://i107.photobucket.com/albums/m314/empressmissmatch4i/sachablacklogo2.png\" border=\"0\" alt=\"Photobucket\"></a>\r\n\r\n<a href=\"http://s107.photobucket.com/albums/m314/empressmissmatch4i/?action=view&current=lipstick-1.jpg\" target=\"_blank\"><img src=\"http://i107.photobucket.com/albums/m314/empressmissmatch4i/lipstick-1.jpg\" border=\"0\" alt=\"Photobucket\"></a>\r\n24 shades of Sacha Lipstick that lasts all day! 12\"x6\" inch professional palette.  Cream, matte and frosted lipstick shades that look amazing on all skin tones.  Great for makeup artists or the lady with a lot of looks. Regular price $100!!!\r\n\r\nChoose a lipstick, which reflects your personal psyche. Use a lip brush when applying lipstick. It will not only help define the contours of your mouth, but also helps to control the amount of color that is applied.\r\n\r\nApplying powder lightly over the lips before applying lipstick helps it to stay on longer.\r\n\r\nUse Sacha's Vitamin E Stick under your lipstick to condition and protect your lips from becoming chapped and dry.\r\n\r\nUse Sacha Lip Gloss alone to give a light, natural but finished look or over your lipstick to enhance its color.\r\n\r\nFor easy lipstick stain removal, apply glycerin to affected area and wash as usual.\r\n\r\n","options":[{"id":542299,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/561302/-/lipstick_palette.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/561302/-/lipstick_palette.jpg","width":58,"height":110}],"artists":[],"categories":[{"id":51107,"name":"Lipstick","permalink":"lipstick","url":"/category/lipstick"}]},{"id":112341,"name":"SACHA Eyeshadow Palette","permalink":"sacha-eyeshadow-palette","position":3,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/sacha-eyeshadow-palette","status":"active","on_sale":true,"created_at":"2008-06-09T05:11:03.000Z","description":"<a href=\"http://s107.photobucket.com/albums/m314/empressmissmatch4i/?action=view&current=sachablacklogo2.png\" target=\"_blank\"><img src=\"http://i107.photobucket.com/albums/m314/empressmissmatch4i/sachablacklogo2.png\" border=\"0\" alt=\"Photobucket\"></a>\r\n\r\n<a href=\"http://s107.photobucket.com/albums/m314/empressmissmatch4i/?action=view&current=eyeshadow-1.jpg\" target=\"_blank\"><img src=\"http://i107.photobucket.com/albums/m314/empressmissmatch4i/eyeshadow-1.jpg\" border=\"0\" alt=\"Photobucket\"></a>\r\nWhile there are rigid rules when it comes to foundations, it is with your eye color that you can allow your creative side to take flight.  28 colors to choose from on one convenient 12\"x6\" inch professional palette.\r\n\r\nYour eyes are the focal point of your face. Be sure that your eye makeup techniques and choice of colors are most flattering to your eye shape and color.\r\nWith eye color you can create the illusion of new shapes and sizes. Always keep in mind that light colors highlight and dark colors shrink or recede.\r\n\r\nPowder eyeshadows come in singles or color coordinated duos, trios or quads. Try to find eye shadows that are highly pigmented. Simply put, you want the shade you see in the container to be the color you see on your eyes.  All Sacha eye makeup is highly pigmented. The shade you see in the container is what you will see on your eyes. \r\n\r\n\r\nWhen applying eyeshadow sweep the lightest shade over the entire area from lash line to brow. This shade will be your base color and is to your eye, what your foundation is to your face. It will hold your color and prevent creasing.\r\n\r\nAfter applying your base color, apply a medium shade on the lower lid. This is the part of the eye that most women apply eyeshadow. Blend into your base shade.\r\nA third color can then be added. Use a deep, dark shade to create depth. Apply this shade along the lash line, and at the outer corner of the eye, emphasizing the crease of the eye and brow bone. Blend well. This is your accent shade and when used can create a more defined eye.\r\n\r\nHow you apply this contour shade can help eyes look bigger, smaller, wider set or closer together. The key is to blend so well that attention is still drawn to your eye, not your eye makeup.\r\n\r\nFor eye shadow that looks “just applied” for hours, first, base your eyelid with a neutral concealer or SACHA Kamaflage Cover Cream which closely matches your natural skin tone. Next, apply a neutral shade of eye shadow or a color nearest your skin color over the concealer. The process of the powder adhering to the cream will create a smudge resistant base for your eye shadow. It will last forever.\r\n\r\nReally high quality powder eyeshadows such as Sacha's color-rich eye shadows can be used wet or dry. Dampen your brush or applicator and create your own liquid eyeliner in any of Sacha’s vibrant colors. Wet application of these eyeshadows serves to intensify the color.\r\n\r\nADVANCED EYE MAKEUP TIPS: When applying eyeshadow to the crease of the eye, keep your eyes open and slightly tilt your head backward. This will enable you to better see the shape you are creating and allowing the shadow to go into the crease.\r\n\r\nADVANCED EYE MAKEUP TIPS: For more mature skin use iridescent shades sparingly.\r\n\r\nADVANCED EYE MAKEUP TIPS: If you have puffy eyelids do not use iridescent or frosted shadows in light colors or white. Use softer, matte colors.\r\n\r\n\r\n\r\n","options":[{"id":545178,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/570454/-/eyemakeup.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/570454/-/eyemakeup.jpg","width":58,"height":110}],"artists":[],"categories":[{"id":51108,"name":"Eyeshadow","permalink":"eyeshadow","url":"/category/eyeshadow"}]},{"id":112360,"name":"SACHA Blush Palette","permalink":"sacha-blush-palette","position":4,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/sacha-blush-palette","status":"active","on_sale":true,"created_at":"2008-06-09T06:10:14.000Z","description":"Sacha's exquisite blush adds warmth or color to the face. The look most women want to achieve is that of a warm, natural glow. 15 shades on a 12\"x6\" inch professional palette.\r\n\r\nBlushers are available in powder, cream or liquid and in a wide variety of tones. Liquid and cream blush should be applied before powder. Generally most women prefer to use a powder blush as it is much easier to apply. \r\n\r\nFor easy application, sweep blush downward from the ear to mid-cheek, beginning in line with the top of the ear and ending at the end of the apple of your cheek. It is best to choose colors that are close to your skin tone. \r\n\r\n \r\n\r\nDraw an imaginary line downwards from the center of the eye.\r\n\r\n\r\nThis is the furthest point on the cheek where blush should be applied.\r\n\r\nApply blush along cheekbone from hair line downwards to avoid ending up with a heavy \"blob\" of color on the cheek. \r\n\r\nAlways remember less is best.\r\n\r\n\r\nBe sure to do the blush test. Once you are done with your entire makeup stand back, look in the mirror. Check to see if your face is ‘balanced’. You should have on just enough blush to make you look as though you are blushing. If you have on any more than that you need to tone it down.\r\n\r\n\r\nTo soften blush apply some powder over your blush. In the evening you have a little more liberty and so you could go a bit heavier according to the look you wish to achieve. \r\nWhen applying blush use a darker shade to contour your face and \"lift\" your cheekbones. We recommend light colors of Sacha Cosmetics blush to highlight. \r\nUse your blush brush to apply blush with small half-moon shaped strokes moving from your hairline to your cheek bones. Do not apply close to the nose. Keep your blush on the cheek bones. \r\nIf you have sallow skin, pick a foundation that disappears on your face. To counteract your skin tone choose a pink or rosy blush. \r\nFor a very natural look, apply blush on the cheekbones and eyelids matching the color of the lipstick. \r\nTo tone down blush, apply a dusting of powder on top to subdue the color. \r\nNever overdo your blush application, tap excess blush off your brush before applying. \r\nUse a very small amount of blush for mid-day makeup touchup. The oil from your skin will grab color and intensify it.\r\n\r\n\r\nInvest in a big fluffy blush brush just as makeup artists use. It will give you a soft, even blush of color.\r\n\r\n\r\nApply blush after powder for smooth, even look with no streaking.\r\n\r\n\r\nGlow Without Blushing. When you just want to add warmth to the skin instead of a standard blush color like rose, peach or plum, use a light to medium bronzing powder in place of blush.\r\n\r\n\r\nWhen you wear blush, DO find a color that is not too red for your skin tone since you will look sunburned. \r\n","options":[{"id":545525,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/584116/-/blush.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/584116/-/blush.jpg","width":57,"height":108}],"artists":[],"categories":[{"id":51109,"name":"Blush","permalink":"blush","url":"/category/blush"}]},{"id":114256,"name":"SACHA Kamaflage Cream Foundation Palette","permalink":"sacha-kamaflage-cream-foundation-palette","position":5,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/sacha-kamaflage-cream-foundation-palette","status":"active","on_sale":true,"created_at":"2008-06-13T23:21:11.000Z","description":"<a href=\"http://s107.photobucket.com/albums/m314/empressmissmatch4i/?action=view&current=sachablacklogo2.png\" target=\"_blank\"><img src=\"http://i107.photobucket.com/albums/m314/empressmissmatch4i/sachablacklogo2.png\" border=\"0\" alt=\"Photobucket\"></a>\r\n\r\n<a href=\"http://s107.photobucket.com/albums/m314/empressmissmatch4i/?action=view&current=testerkits-1.jpg\" target=\"_blank\"><img src=\"http://i107.photobucket.com/albums/m314/empressmissmatch4i/testerkits-1.jpg\" border=\"0\" alt=\"Photobucket\"></a>\r\n12 Shades of Sacha Powders on one convenient 12\"x6\" inch professional palette.  Great for makeup artists.  Also great for tattoo and scar coverage but light enough for everyday and media makeup jobs. Regular price $100!!!\r\n\r\n \r\nTest foundation along your jaw line - not on your hand and definitely not on the inside of your wrist. View it under different light settings. It must match the natural color of your neck.\r\n\r\n\r\nDampen your cosmetics sponge to create a sheer finish.\r\n\r\n\r\nFor a great makeover you must start with the right foundation. Whereas eye shadow, lipstick, and blusher accent the face, it is the foundation that sets the tone for a woman's appearance. Sacha's foundations are all yellow-based. If you are like most women, you have yellow-based skin and must wear a yellow-based foundation. Our Sacha Foundations are available in cream, liquid, or dual activ (powder and foundation in one). Test foundation on the jaw line or forehead.\r\n\r\n\r\nIf you want your foundation to look sheer, apply it with a sponge. For more coverage apply it with your fingertips. Professional makeup artists prefer using a makeup brush as this will apply and blend the foundation beautifully.\r\n\r\n\r\nTap foundation on with sponge or finger. Your skin will look luminous, yet natural.\r\n\r\n\r\nTo give the skin a dewy finish, moisten a gauze pad or wash cloth in astringent and gently pat your already made up face. The astringent (witch hazel is perfect) will remove the matte look of makeup, while leaving the skin radiant.\r\n\r\n\r\nOpen your mouth when applying foundation to expose the neck area and eliminate an obvious line at the jaw line.\r\n\r\n","options":[{"id":551451,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/643465/-/foundation.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/643465/-/foundation.jpg","width":56,"height":110}],"artists":[],"categories":[{"id":116037,"name":"Cream Foundation","permalink":"cream-foundation","url":"/category/cream-foundation"}]}]