[{"id":12851241,"name":"Tablet Windows 8 Wacom  Motion Computing LE1700 2GB TABLET PC  WACOM DIGITAL ","permalink":"motion-computing-le1700-2gb-ram-30hd-tablet-core2-duo-anywhere","position":1,"price":247.0,"default_price":247.0,"tax":0.0,"url":"/product/motion-computing-le1700-2gb-ram-30hd-tablet-core2-duo-anywhere","status":"active","on_sale":true,"created_at":"2013-08-08T15:03:22.000Z","description":"12.1 inch Windows Tablet PC that is really useful. Writing in the LE1700 screen feels almost like writing with pen and paper, thanks to the rubber digitizer pen, which has easy contours and Cross pen.\r\nThe pen has its best form to ensure accuracy Motion LE1700 a Wacom digitaliador 256 levels of pressure, acts as if a pencil eraser or a pencil ..\r\nMagnesium and Carbon fiber, like the solid feel, is well balanced.\r\n\r\nThe screen 12 \"It feels comfortable to write notes, and more pleasant to the drawing.\r\nThe versatility of a professional tablet appears endless, using Office, Onenotes Microsoft - 'ink-digital' Idonea to draw even dare draw more,\r\n\r\nTablet PC where there really is brightness.!\r\n \r\nWriting on the LE1700's screen feels almost like writing with pen and paper, thanks to the rubberized digitizer stylus, which has the contours and easy grip of a Cross pen. The stylus has better form on the Motion LE1700's stylus  ensuring you . The stylus's top acts as an eraser, like on a pencil. An included tether lets you attach the stylus to the tablet so that you won't lose it\r\n\r\n -The versatile LE1700 is a semi-rugged tablet PC that is the ultimate productivity tool for professionals Product Description Motion LE1700 Core 2 Duo L7400 1.6 GHz - 12.1\" TFTDimension\r\n\r\n-screen Anywehre\r\n\r\n-Embedded Security Trusted Platform Module (TPM) Security Chip , fingerprint reader\r\n\r\n-SIM card slot 3G/HSDPA mobile broadband service level hard\r\n\r\n-PC Card slotPcmecia SD Card slot, SIM card slot 3G/HSDPA mobile broadband option Hard, WIFI BLUETOOTH 2X USB FingerReader Infrared\r\n\r\n- It has a good 12.1 inch Colour Touch Screen (pen operated) TFT display and Intel Core 2 Duo L9400 1.86Ghz processor (L9400) and fitted with a 2GB of memory, and 30HD so it?s game for just about anything, currently running Windows 8 Pro .\r\n\r\n-Microsoft office 2013 Evaluate , the Drawing professional suite Sketchbook\r\n\r\n- Its internet ready with Internally is a built in network card, Wireless Wi Fi card card fitted and ready to use, to connect it to network, be it hard wired or Wireless as well as mobile phones etc. It has all the usual ports and infrared. Units are used condition, All the devices are working and correctly and ready Power Supply , stylus Pen Original Motion Computing  \r\n\r\nThe magnesium and cabon fiber frame give it very solid feel while keeping the weight down, it is well balanced across ,The rounded edges also make it very comfortable  Picking it up one handed hold one arm to write with the other \r\n\r\nWhile the ports and buttons sure are convenient to have, tablet buttons including escape, function, a 4-way directional button with enter in the middle, a button to bring up the dashboard, and screen rotate,The 12” 4:3 screen is really nice. It feels just right for writing notes, and is nicer to draw.\r\n\r\nVideo playback is good, especially  how strong the speakers .\r\n Movie watching on this is definitely enjoyable.\r\nsound and Speakers these are some of the loudest speakers in a mobile device \r\n\r\n internet runs perfectly fine . While OneNote  it runs fine once it’s going also app ArtRage on it  the performance to be  good  Most tools kept up  ,and all equipment with windows the platform highly  productive  you’d have a cool, near silent device.\r\n\r\n\r\nUniversali & da CompuTablet  bring you news  Limited-Time Offers \r\nWe're on Facebook \r\nhttps://www.facebook.com/universal.uk\r\n\r\n\r\n","options":[{"id":40969632,"name":"_","price":247.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":19.0,"amount_with_others":0.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":9.99,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":21.9,"amount_with_others":0.0},{"amount_alone":17.0,"amount_with_others":0.0,"country":{"id":36,"name":"Spain","code":"ES"}},{"amount_alone":17.0,"amount_with_others":0.0,"country":{"id":23,"name":"Italy","code":"IT"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128797278/-/le1700_front1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128797278/-/le1700_front1.jpg","width":800,"height":510}],"artists":[],"categories":[]}]