[{"id":14518803,"name":"Mr. Mustache Shaving Soap","permalink":"mr-mustache-shaving-soap","position":1,"price":8.5,"default_price":8.5,"tax":0.0,"url":"/product/mr-mustache-shaving-soap","status":"active","on_sale":false,"created_at":"2013-10-30T22:01:44.000Z","description":"This shaving soap is made with a combination of oils and super moisturizing shea butter and I have also added kaolin clay for added slip to give you a luxurious shaving experience. It is scented with lavender and orange essential oils, both of which are calming to the skin and the senses.\r\n\r\nTry it in a mug with a shaving brush or all on its own. I use it on my legs and it is wonderful! Perfect gift for a guy, or a girl who loves dudes with staches! \r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Kaolin Clay, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan","options":[{"id":47001255,"name":"Default","price":8.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126738213/-/mustache.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126738213/-/mustache.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6548904,"name":"Facial, Body Soap","permalink":"facial-body-soap","url":"/category/facial-body-soap"},{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14518701,"name":"The Search is OVER Lip Balm","permalink":"the-search-is-over-lip-balm","position":2,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/the-search-is-over-lip-balm","status":"active","on_sale":false,"created_at":"2013-10-30T21:57:51.000Z","description":"Since I was 11 years old I have been obsessed with lip balm. Every trip to the drugstore included a lip balm or gloss purchase. I've tried well over 100, maybe 200? I purchased a French honey balm that was over $20. Twice. Because it was the best I had found...but that was four years ago. \r\n\r\nIn 2009 I started making my own stuff, tinkering around with more exotic ingredients, and finally I have done it- I have made the perfect lip balm! My search is over. It is slightly glossy, not too hard, easy to apply, instantly gets rid of my dry cracks, lasts more than a few hours, has no taste, and just feels great on. \r\n\r\nI hope that you try it and agree- and if you are anything like me you can stop searching! \r\n\r\nNote: This is not strongly flavored, it has a slight orange smell but not much flavor at all. I really focused on moisturizing and making my lips feel great.\r\n\r\nHere are some nice things people are saying about the lip balm: \r\n\r\nThe search IS over! Great stuff! This lip balm is not gooey. The stick is solid, but not overly hard. On your lips, the balm is not sticky or slippery -- it's just right. It feels light and soothing. And it stays on.\r\n\r\nNot waxy, not sticky or too shiny, this lip balm really is the perfect winter healer. It arrived just as I came back from a week of skiing and healed my distressed skin in one day. And it came with an adorable sample of her soaps! XX thanks!\r\n\r\nLove this balm, the search REALLY is over!\r\n\r\nGreatest lip balm EVER. It's a fact.\r\n\r\nLip balm tubes are awesome!\r\n\r\nHow do I get some lip balm? Need to set up a direct refill queue for this household...\r\n\r\nLove your lip balm\r\n\r\n\r\n\r\nThanks for looking!","options":[{"id":47000946,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126738003/-/lip.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126738003/-/lip.jpg","width":570,"height":763}],"artists":[],"categories":[]},{"id":14501250,"name":"Perfume Oil, over 200 scents available, lush dupes","permalink":"perfume-oil-over-200-scents-available","position":3,"price":3.5,"default_price":3.5,"tax":0.0,"url":"/product/perfume-oil-over-200-scents-available","status":"active","on_sale":false,"created_at":"2013-10-30T03:07:04.000Z","description":"This listing is for any one of my fabulous fragrances- go nuts! *new scents added often!* Please add note in paypal which scent you prefer (scents are listed above)\r\n\r\nPlease see my scents at the links listed above. A lot of these are dupes, contact me if you have questions. \r\n\r\nI know it is tough to buy scents online so here is a chance to try a 1.2 mL sample of fragrance. \r\n\r\nPlease write in the notes to seller at checkout which scent/s you would like. This listing is for one glass vial which will equal about 8 to 10 applications. If you are interested in than one I also have listings for five and ten.\r\n\r\nThese are pure essential oils or fragrance oils blended with fractionated coconut oil and vitamin E. Coconut oil has no fragrance but feels light and silky on the skin. I hand pour each vial fresh for every order. My fragrances contain no alcohol, and the perfume has a nice staying power. They are great to slip in your purse or makeup bag too!\r\n\r\nPlease test a small area of skin for sensitivity. All of my products are safe for skin but some people may find they have reactions to certain essential or fragrance oils.\r\n\r\n\r\nPlease note, I have many scents to choose from. **Just ask me if you would like a scent you do not see here, I can likely get it, also custom orders may take 4-5 days.** \r\nI would also be happy to do a custom blend, just ask! ","options":[{"id":46946400,"name":"1 sample","price":3.5,"sold_out":false,"has_custom_price":false},{"id":46946403,"name":"5 samples","price":17.5,"sold_out":false,"has_custom_price":true},{"id":46946406,"name":"10 samples","price":35.0,"sold_out":false,"has_custom_price":true},{"id":46946409,"name":"5 mL","price":8.0,"sold_out":false,"has_custom_price":true},{"id":46946412,"name":"10 mL","price":13.0,"sold_out":false,"has_custom_price":true},{"id":46946415,"name":"1 ounce","price":22.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126693405/-/single_perfume.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126693405/-/single_perfume.jpg","width":570,"height":760},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126731121/-/rollers.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126731121/-/rollers.jpg","width":570,"height":760}],"artists":[],"categories":[{"id":6543282,"name":"Perfume","permalink":"perfume","url":"/category/perfume"}]},{"id":14502159,"name":"Travel Size Solid Shampoo and Conditioner, solid bars","permalink":"travel-size-solid-shampoo-and-conditioner-solid-bars","position":4,"price":14.0,"default_price":14.0,"tax":0.0,"url":"/product/travel-size-solid-shampoo-and-conditioner-solid-bars","status":"active","on_sale":false,"created_at":"2013-10-30T03:59:51.000Z","description":"Ready to ship! \r\n\r\nHere are my legendary travel size shampoo and conditioner bars, so happy together in one listing! \r\n\r\nThese shampoo bars are packed with butters and proteins to nourish your hair while cleansing. They are SLS free and great for color treated or more delicate/sensitive hair and scalp. The conditioner bars are packed with butters, oils, and proteins to nourish your hair. They are great for softening, detangling, controlling frizz, enhancing shine, you name it! They are also great for color treated hair.\r\n\r\nPlease note the size before buying, these are meant for travel or to try before committing to the large bars. I do have large (4 to 5 ounce) bars as well.\r\n\r\n\r\nBoth were developed because for years I was buying salon shampoos and conditioners that cost more than $20 for one tiny bottle. Then last year I tried a solid shampoo bar and conditioner bar from a store. Their sales girls really raved about them, so I thought why not? I really liked the concept (smells awesome, great for travel, no plastic bottles, it lasts FOREVER) but the shampoo bar was drying to my hair and scalp and stripped the color. Turns out this store uses SLS as their main cleansing agent- it is cheap and I’m pretty sure that is why many companies use it- even in dish detergent and floor cleaner! I use **SLSA- which may sound similar, but they are very different. More about that below. The conditioner bar did smell nice, but was not very easy to use, it was too hard to really \"glide\" over my hair and my hair didn’t look or feel very conditioned after using it.\r\n\r\nSo I did a ton of testing and research and came up with my own shampoo and conditioner bars. The cleansing agents I use for the shampoo bars are naturally derived from coconuts. The bar lathers up quickly and wonderfully and the smell is fantastic. You just rub it across your head, focusing more on scalp, and massage in. Most importantly, my hair has never looked or felt better! Worth noting, this is not a bar of soap- it is what is called a syndet bar. Many people are selling soap and calling it a shampoo bar or conditioning shampoo- check listings carefully! The ***pH level of regular soap is not good for hair. More about that below too! \r\n\r\nFor the shampoo I used a fragrance that has complex floral notes with the sweet essence of honey at the very heart. Truly unique and one of my favorites. Top notes: ylang ylang, orange blossom. Middle notes: jasmine, rose. Bottom notes: lily, lilac, honey. *Please note- I have added blue colorant so that you can tell the shampoo bar from the conditioner bar. \r\n\r\nThe conditioner bar has actually been my most popular item, people LOVE it! And I can’t blame them- it is simple, smells great, and works perfectly for all hair types. Just swipe it over hair, this time focusing on the middle to ends of the hair, and rinse with warm water. \r\n\r\nThe conditioner is made with a scent that combines juicy tropical fruits; hints of floral; with bottom notes of earthy patchouli. Top notes: rosewood, tuberose. Middle notes: clove, coconut. Bottom notes: cedarwood, patchouli. This is one of my favorite scents ever! \r\n\r\nAlso, a tip that I've learned: everything will last longer if it is kept outside of the direct spray of the shower and drained after every use. I have 6 soap drainers, and counting, in my shower right now! \r\n\r\nThese are very unique bars- super convenient for travel, each bar weighs about .7 to .9 ounces. I can tell you from experience, you do not want to get patted down by a TSA agent. And they last FOREVER! Try it and you will never go back to bottles again- I sure won’t! \r\n\r\n------------------------------------------------------------------------------------------------------------------------\r\n\r\nHere are some nice things said about the bars: \r\n\r\nOk. I first used Emily's Shampoo/conditioner on a trip to the UK. My hair was lovely the entire trip. Upon getting back to the US I thought I'd try and find something that I thought was a little cheaper and more 'natural'. Boy did I make a mistake! Cheap, yes. More natural, yes. My hair (and the rest of my family's hair) hated every one we tried! All I can say is Blech! So after much soul-searching, as I am a major penny-pincher by both necessity and nature, I asked Emily to make a special order for me. And of course, she hit it out of the park! She even put colors in them to make them pretty as well as smell good! Other stuff may be cheaper but her stuff is better! And her customer service and communication is outstanding. I need to tell you that I have long, thin-ish hair that has been colored for the last several years. The Shampoo- one word. AMAZING! It has the most luxurious and silky lather of any shampoo I've ever tried and that includes some seriously pricey upscale salon stuff. It cleans the oils from my scalp without over-drying the ends as most shampoos do. The Conditioner- It makes my hair silky without being slimey or weighed down. I can run a large-tooth comb through my long hair while still in the shower and not damage it at all. And here's the best part for me. My back does not break out from it! And yes, my hair looks lovely again, even in our current hot and humid climate! To sum it up, just buy the darn stuff!\r\n\r\nAbsolutely amazing! Beautiful packaging perfect fregrance and the shampoo and conditioner are way better than shampoos I used to spend 60$ on!!!! Quick shipping! I will definetly buy again and recommend to Others!\r\n\r\nI think I found my new shampoo bar. I LOVE your product! It doesn't take much of that yummy lather to give my scalp a good cleaning, and my hair feels so soft and clean, and it's actually manageable! Whenever I use store-bought shampoo I have a hard time styling my hair, but it's a breeze with your bar. Thank you so much!\r\n\r\nThis stuff is amazing. I won't buy another bottle of shampoo again. Perfect for travel. Smells wonderful. Many thanks!!\r\n\r\nIn love with this shampoo and conditioner. I was able to get a great lather with the shampoo bar and it left my hair feeling super clean. The conditioner was beyond amazing I was shocked how well it was able to moisturize my hair and how shiny and soft it feels. I am completely obsessed with your products and have already placed an order for more.\r\n\r\nI love these shampoos. This time I tried a different combo--coconut shampoo and the origional conditioner. Emily was great to split it for me plus she added a sample white tea and ginger. They are all lovely but that is the winner for my next large bar.\r\n\r\nsuper duper creamy and natural solid conditioner and shampoo... and larger too... extra credit on that :) love your items.. \r\n\r\nFirst off, the shampoo is much larger than I expected! It barely fits in my palm, which is a good thing, so I'm hoping it will last a loooong time. Second, I ordered the scent 'Sugar Fairy' and oh my goodness...my hair smells like a candy shop. It's so sweet and yummy. I even sprayed on some Garnier shine spray over top (which doesn't smell too great) and you can still smell the Sugar Fairy scent. I LOVE it! Thank you so much Emily!\r\n\r\nThe shampoo bar works great and lathers up very well. They both smell amazing and I will return for larger sizes. Thanks!!\r\n\r\nUGGGG!!!! I LOVE THIS CONDITIONER SO MUCH! It is so wonderful! Thank you :-)\r\n\r\nTo be honest I bought the travel size because I didn't have high hopes of it working. I've used other shampoo bars and my hair was crunchy and weird feeling. I used this last night and my hair is like silk! I will definitely be getting the large size! Thank you.\r\n\r\nyour products are so gentle. My hair used to like be falling out and fading and it looks and smells beautiful all the time and my hair isn't frizzy. Thank god I found you. I can't believe I ever spent 40$ on salon shampoo that never worked!!!!!\r\n\r\nI wanted to tell you how pleased I am with both the shampoo and conditioner bar now that I've had a few days to use them. My hair comes out really soft and fragrant, despite our extremely hard water. I went one step further with the conditioner bar, based on something I read, and I use it as a lotion bar after my bath, while my skin was still wet. I've been having a really hard time with extremely dry skin, and I'm happy to say it is now under control. Thanks again for the excellent products and excellent customer service.\r\n\r\nTwo words: Sexual chocolate. This is the best thing I have EVER used in my hair. I have the type of unruly, dull frizzy hair no one can tame, but this smoothed out my hair, gave it intense shine, and smells good enough to eat. I had a fun time trying out diff methods to try and use the shampoo bar, as I had never used one before. As far as size goes, these are massive and going to last me many moons. I honestly wanted to eat the conditioner bar it smelled so good. Its day two and my hair is still clean and shiny. I will never go back to using regular shampoo, and Im going to force everyone I know to try out Emilys soaps. Dear sweetest most awesomest seller in the universe, please don't ever stop making these! :P\r\n\r\nI absolutely adore your shampoo bar set. I got 2 travel sets before a series of long trips this summer and they were perfect for travel and even better for my hair. I have been soo stoked, that is till I ran out. I thought I would finish some old bottles I had around and lets just say I need these soon.\r\n\r\nThe shampoo and conditioner is great, leaves my hair soft and shiny! I always get nice comments about the great scent as well (especially from a few very critical noses). \r\n\r\ni tried your solid shampoo and conditioner and now i am so addicted that i have to get a set for my bff to try (at least one of the perfumes is for her too) thank you for making such awesome products, i look forward to receiving all this great stuff!\r\n\r\nLove this set! The conditioner kinda reminds me of incense. Smells great. My hair is very soft after I use them. Will be back for more!\r\n\r\nI'm sending this note to let you know how much I really like your products. The hair bar is AMAZING! I hoped to like it, and it was even better than I expected - gentle, yet totally cleans my hair, leaving my hair feeling clean AND full. Really love it. Also, the conditioner is great (not heavy or oily at all for my hair), and I've been using the pat o butter and lip balm, both which I seem to be semi-addicted to. Thanks for the great products!\r\n\r\nThis is exactly the kind of transaction that deserves positive feedback. Emily does a GREAT job of explaining what goes into her products in detail. I had wanted to try a syndet bar for some time (I have been using my homemade soap on my hair - yikes) and didn't know enough about the bar's ingredients to try one until I read her descriptions. She communicated w/ me quickly on shipping and this order came to me super fast! Oh yeah - I used both bars tonight on my hair and they work great and feel wonderful! Don't let the size of these bars fool you - they will last a long time. Wonderful lather of the shampoo and silky feel of the conditioner. Thank you Emily!\r\n\r\nI have been trying out solid and natural shampoos/conditioners over the last few months, and this is the first one that I have tried that really feels good. All of the others have left my hair feeling gunky, crunchy, or stripped, and this leaves me feeling clean and conditioned. I will definitely be getting more in the future!\r\n\r\nThank you soo much for developing this product to perfection. I love that this product is so environmentally friendly as well. Soo many pluses.\r\n\r\nWow! Wow! Wow! What more is there to say? I never used a shampoo or conditioner bar before and I'm sold! I love this! My hair looks and feels great. The shampoo lathers up amazingly and I couldn't believe how conditioning the bar is. I could comb through my extremely long hair with ease after a shower (and that is not usual). I'm so glad I tried this!\r\nI'll definitely be back for more!!\r\n\r\nMy shampoo/conditioner bars are STILL going strong - I seriously use them every day and they probably have another month left! I think I got them right after July 4th, good stuff! (this comment is dated 9/14 and from a dude who purchased the travel size bars, just fyi)\r\n\r\nWOW. PERFECT products. I have used solid shampoos from other sellers but this one is truly fantastic. Suds wonderfully and the scent (nag champa) is perfection. I have used Lush's \"Jungle\" solid conditioner and HATE it. The smell is slightly off-putting, it doesn't sufficiently condition, and it even pulls my hair during application. This solid conditioner is PERFECTION!!! Doesn't tug on my hair, smells fantastic, and leaves my hair detangled (my hair is curly) and moisturized. THANK YOU!\r\n\r\nI received my order quickly and everything was packaged so wonderfully. My shampoo and conditioner smell lovely and they're going to make my trip over seas in a couple weeks much simpler. Thanks for the great communication and the free sample!\r\n\r\nSo I have to say: I absolutely love the solid shampoo and conditioner! I waited a week from receiving the bar set, so I could write a thoughtful review if I liked it. So far they are fantastic! I have long, thin finicky hair and I usually use an absence amount of products to style it. When I use the solid shampoo I have noticed I don't have to use as much product. My hair now maintains volume, is manageable, and has a nice healthy shine. The conditioner is deceptively amazing. When I first saw it I was a little bit skeptical. I live in a fairly dry climate and my thin hair tends to get really knotty. The conditioner lets me run a comb through my hair in the shower without a war breaking out between me and my knots. As long as Emily is willing to make her products I will be buying. Also, Emily was quick to communicate with me and super quick to send. All in all a great experience, I couldn't ask for more :)\r\n\r\n\r\nThank you so much! I LOVE LOVE LOVE the conditioner bar. I won't ever go back to using anything else. One thing I for sure noticed is that my hair isn't as oily at the end of the day, so I am able to go a day between washings ; which, as a mother of a B U S Y two year old, certainly is a blessing!!\r\n\r\nI used the solid shampoo and conditioner this morning. I DIE. So good. Thanks lady!\r\n\r\nLOVE the Conditioner bar! Works great! fast shipping also!\r\n\r\nI am a big fan of both the shampoo and conditioner bars. They're easy to use and work very well.\r\n\r\nLove them will definitely be buying the larger size my hair is clean soft and smells super good! My hair is happy:) Thank You\r\n\r\nThe Jungle Jane scent is wonderful. The bar worked great!\r\n\r\nGreat communication! Smells wonderful! Thanks! :)\r\n\r\nI love these bars. so convenient for my dry curly hair..Smells so good and was quick delivery. Thank you.\r\n\r\nThanks! Just used this and my hair feels great! It smells great too.\r\n\r\nThanks so much -love them... also thanks for the extras... Great customer service.\r\n\r\nFast shipping. Great little conditioner- love it. Plus, it smells just like the one from Lush.\r\n\r\nGreat little bar- works well on my hair\r\n\r\nI'll definitely be back for more!!\r\n\r\nAgain, my favorite shampoo. No more bottles for me! You've got me hooked on this stuff.\r\n\r\nGreat little bar- works well on my hair & smells just like the Lush one... Yum!\r\n\r\nThis makes my hair feel amazing!!! I am going to buy another bar soon and perhaps sample a shampoo bar too, I can tell you put a lot into your products.\r\n\r\nCarefully packaged. Quick shipment. Smell delightful and are fabulous!\r\n\r\nI cant say enough good things about these bars. Amazing seller, always great communication, always great products. Thank you! \r\n\r\nSmells phenomenal. My hair feels great. Pretty impressed with your conditioner bar as it is really hard to find a nice one that actually works. Well done.\r\n\r\nIt took me a few days to get used to using a bar of shampoo, now I know to get my hair really wet first, and it lathers like crazy! Smells great! Love it! \r\n\r\nI ordered your Nag Champa travel shampoo bar and Conditioner bar and I love it!\r\n\r\nI loved the syndet conditioning bar. it really does work.\r\n\r\nI wasn't sure how much to rub on my hair, but I did good cause while rinsing, my hair had the smooth slick feeling, and after blow-drying, I like the results.. this is super-cool for traveling. Thanks! Will buy from again soon.\r\n\r\nIt made his hair less frizzy when it was humid.\r\n\r\nLovely stuff! Has a great scent and is very travel friendly!\r\n\r\nI have been hooked on this stuff since my first wash.\r\n\r\nI freaking love your product!\r\n\r\nlove, love.love this stuff! Want more!\r\n\r\nwasn't sure if I'd like this or not, so I purchased the mini size. I took it with me on vacation and fell in love with it! I love the scent of both the shampoo and conditioner, and it cleansed and conditioned my hair beautifully. I was a little worried in the shower after rinsing out the conditioner because my hair didn't feel very well conditioned but I was able to run a comb through it easily and when my hair dried my curls looked amazing!!! I kind of thought it was the weather in Hawaii but I'm still using it at home in the midwest and my hair is still looking fabulous. I will be back to buy a full size of the conditioner for sure.\r\n\r\nSo I have to say: I absolutely love the solid shampoo and conditioner! I waited a week from receiving the bar set, so I could write a thoughtful review if I liked it. So far they are fantastic! I have long, thin finicky hair and I usually use an absence amount of products to style it. When I use the solid shampoo I have noticed I don't have to use as much product. My hair now maintains volume, is manageable, and has a nice healthy shine. The conditioner is deceptively amazing. When I first saw it I was a little bit skeptical. I live in a fairly dry climate and my thin hair tends to get really knotty. The conditioner lets me run a comb through my hair in the shower without a war breaking out between me and my knots. As long as Emily is willing to make her products I will be buying. Also, Emily was quick to communicate with me and super quick to send. All in all a great experience, I couldn't ask for more :)\r\n\r\nI'll admit, I ordered the small size because I wasn't sure the bars were going to work. I was SO wrong! The scent is delightful, the shampoo lathers extremely well, and the conditioner leaves my hair soft and manageable. I'll definitely be ordering the larger sizes next time and I'll never go back to liquid shampoo and conditioner. THANK YOU Emily!!\r\n\r\nLove it, never using retail shampoo and conditioner again! Super convenient for travel too :)\r\n\r\nLOVE LOVE LOVE LOVE LOVE!!!!!!!!!!!!!!!!!!!!!! Soapily! Love your stuff!!\r\n\r\nSmells amazing and made my hair very soft! I'm glad i tried the small one first but I know next time will be the full size bar! Thank you so much!\r\n\r\nThe perfect size for travel. Thanks so much!\r\n\r\nAgain, my favorite shampoo. No more bottles for me! You've got me hooked on this stuff.\r\n\r\nThis is the best solid conditioner I've ever tried! Of course, I've only tried this and one other one, but still! I put it on my hair and clip it up while I wash my body, then I rinse it out and apply and clip again while I wash my face. Two (sometimes three) applications does the trick for my super dry hair, and I've seen less frizzies! Thanks so much, Emily! :)\r\n\r\n\r\n\r\n------------------------------------------------------------------------------------------------------------------------\r\n\r\n**Here is more info about SLS and the pH of hair:\r\nWhat are SLS's? They are surfactants or surface active agents. \r\nWhat does that mean? Surfactants may act as detergents, wetting agents, emulsifiers, foaming agents, and dispersants. So basically, they are a necessity in order to make products that you use on your body, in your washing machine, in your dishwasher, in dish soap, etc.\r\nSodium Laureth Sulfate (SLS), sodium lauryl sulfate (SLES), and sodium lauryl sulfoacetate (SLSa) are ingredients that sound and look similar, but are completely different.\r\nSLS: has a small molecular structure and therefore, penetrates the skin easily. SLS, as well as its close relative SLES, are esters of sulfuric acid. Both are known skin irritants. \r\nSLES: might be somewhat less irritating than SLS, it is unable to be metabolized by the liver, which means its effects are much more long lasting. These are generally used in dish detergent, laundry detergent, and other harsh detergents that are used on a day-to-day basis, and also on items not used on skin.\r\nSLSa: is derived from coconut oils. SLSa is a safe, skin friendly cleanser that offers rich lather without the irritation potential of some of the other good foamers. Because the molecular size of this surfactant is large it doesn’t penetrate the skin or the mucous membranes, so it does not cause the skin irritation as other sulfates, making it an excellent choice for gentle cleansing products.\r\nWhy are SLS or SLES used? The simple answer is that they are cheap. In so many commercial formulations and ingredients, the bottom line is money. Commercial companies are in this to make money, which leaves the consumer with a cheap, well-disguised and well-advertised product. As a consumer you have a choice, and you came to the right place! Handmade goods by etsy artisians are truly superior. \r\n\r\n***As mentioned, this is not a bar of soap- it is what is called a syndet bar. Many people are selling soap and calling it shampoo- check listings carefully! The pH of body or facial soap is not good for hair. Shampoos are generally around pH 6.0, whereas soaps tend to the alkaline, over 8.0 (some soaps can be even pH 10). This means cold processed soaps are not pH balanced for our hair. After shampooing with products out of the right pH range, the cuticle of our hair doesn't lie down, and this can lead to abrasion between the hairs. This is a serious cause of mechanical hair damage, and once you have damage, it's hard to repair it, even with the most intense conditioners.\r\n\r\nSoap isn’t as soluble in hard water as most surfactants. Soap molecules in hard water are converted by double decomposition to form insoluble non-foaming salts like lime, calcium, or magnesium salts of fatty acids. This isn't a big deal on your skin, but it can lead to build up on your hair, leaving it looking dull and feeling kinda crunchy. They won't foam well if there are metal ions in your water - and most water contains metal ions - and they won't foam well in the presence of sebum. Given these properties, soap isn't going to remove all the stuff you've put on your hair and you won't get a feeling of being clean (or, ironically, your hair might feel too squeaky clean, which isn't a good thing).\r\n\r\n------------------------------------------------------------------------------------------------------------------------\r\n\r\nAnd here are the ingredients: I know, I am very thorough- but this is your lovely hair we are talking about! :) \r\n\r\nShampoo Bar\r\nContains: Sodium Cocoyl Isethionate (SCI), Sodium Lauryl Sulfoacetate (SLSA), Sodium Methyl Oleoyl Taurate (SMO Taurate), Cocamidopropyl Betaine, Stearic Acid, Emulsifying Wax, Incroquat CR, Cocoa Butter, Mango Butter, Pink Himalayan Sea Salt, Hydrolyzed Soy Protein, Panthenol, Dimethicone, Vitamin E, Fragrance and/or Essential Oils, Colorant. \r\n\r\nNow what are all of these things? Here is a description of what each ingredient does for the hair: \r\n\r\nSodium Cocoyl Isethionate (SCI), considered exceptionally mild for skin, hair, and eyes, and is particularly tolerant to hard water. It leaves behind a great skin feel - usually described as \"silky\" - and creates really lovely foam, bubbles, and lather. SCI is great for every skin or hair type. Provides gentle cleansing and the creamy after feel. \r\n\r\nSodium Lauryl Sulfoacetate (SLSA) is an excellent foaming, bubbling, and lathering surfactant. It offers great cleaning and detergent properties.Derived from coconut and palm oils, it is a safe, skin friendly cleanser that offers rich lather without the irritation potential of some other cleansers. Because the molecular size of this surfactant is large it doesn't penetrate the skin, so it does not cause irritation.\r\n\r\nSodium Methyl Oleoyl Taurate (SMO Taurate) is mild to skin and hair, provides tons of lather in hard or soft water, gives a silky soft after-feel to skin and hair \r\n\r\n\r\nCocamidopropyl Betaine is a mild, natural surfactant derived from coconut oil. It used to boost and stabilize foam and improve viscosity in shampoo \r\n\r\nStearic Acid is a fatty acid derived from natural sources used to thicken and stabilize formulations. It will impart a soft feel to lotions and creams.\r\n\r\newax is an emulsifier and thickener.\r\n\r\nIncroquat CR imparts manageability and conditioning to hair. A good detangler, anti-static, great softener. \r\n\r\n\r\nCocoa Butter is recommended for treatment of chapped skin and lips, and as a daily moisturizer to prevent dry, itchy skin. It is great for trapping in moisture, it stays on the skin and acts as a barrier. \r\n\r\nMango Butter is very creamy butter, less greasy than some other butters and very emollient.\r\n\r\nPink Himalayan Sea Salt, contains a full spectrum of 84 minerals and trace elements. It is an unrefined, unprocessed \"raw\"salt that's hand-mined.\r\n\r\nHydrolyzed Soy Protein offers a reduction in static buildup and flyaway, improved manageability after shampooing, is a shine enhancer, provides protective colloid functions coating skin and hair.\r\n\r\nPanthenol builds a thin moisture film on the surface of hair and makes it shine without oil or greasiness. In addition, it can penetrate the cuticle of the hair and bring moisture into the cortex. It gives good manageability and pliability to hair. Provides shine. It’s strengthening properties are well-known and widely used. Also known for it's anti-inflammatory properties.\r\n\r\nDimethicone improves wet and dry combing, increases shine, improves hair feel (softness), reduces static charge, and works as a humidity resistor.\r\n\r\nVitamin E, nourishes, moisturizes and helps regenerate the skin.This vitamin oil helps improve elasticity and helps promote healing of damaged skin.\r\n\r\nFragrance and/or essential oils, make you smell yummy!\r\n\r\nColorant, so we can tell shampoo from conditioner. Blue for shampoo- it rhymes! \r\n\r\n\r\n\r\nConditioner Bar: \r\nContains: Incroquat CR, Behentrimonium Methosulfate (and) Cetyl Alcohol (and) Butylene Glycol (BTMS 50), Cetyl Alcohol, Cocoa Butter, Mango Butter, Avocado Oil, Sweet Almond Oil, Apricot Kernal Oil, Honeyquat, Hydrolyzed Soy Protein, Olive Oil PEG-7 Esters, Lecithin (soy), Panthenol, Dimethicone, Vitamin E, and Fragrance and/or Essential Oils\r\n\r\nNow what are all of these things? Here is a description of what each ingredient does for the hair: \r\n\r\nIncroquat CR imparts manageability and conditioning to hair. A good detangler, anti-static, great softener. \r\n\r\nBTMS-50 is a great detangler for hair, and is gentle enough for leave-on skin care.It produces mild and elegant emulsions that provide a soft, powdery, persistent after-feel on the skin and leave hair silky smooth and tangle-free.\r\n\r\nCetyl alcohol is naturally derived from vegetable oil. This fatty alcohol is used as an emollient and to give emulsions more stability, body, and viscosity. \r\n\r\nCocoa Butter is recommended for treatment of chapped skin and lips, and as a daily moisturizer to prevent dry, itchy skin. It is great for trapping in moisture, it stays on the skin and acts as a barrier. \r\n\r\nMango Butter is very creamy butter, less greasy than some other butters and very emollient.\r\n\r\nAvocado Oil is good for sensitive, dehydrated, cracked, and maturing skin. High in Vitamins A, B1, B2, B5, minerals, protein, lecithin, and fatty acids. Improves skin elasticity.\r\n\r\nSweet Almond Oil is an excellent emollient and softener. It is lubricating, but not penetrating. Good for skin that is very dry or inflamed.Rich in essential fatty acids, vitamins A, B1, B2, B6, and E.\r\n\r\nApricot Kernal Oil is good for all skin types. This penetrates quickly without an oily feeling. \r\n\r\nHoneyquat adsorbs water, penetrates the hair shaft for more conditioning. It offers better wet combing and conditioning, as well as the reduction of static build-up on dry hair.\r\n\r\nHydrolyzed Soy Protein offers a reduction in static buildup and flyaway, improved manageability after shampooing, is a shine enhancer, provides protective colloid functions coating skin and hair.\r\n\r\nOlive Oil PEG-7 Esters is used as an emollient, lubricant, anti-irritant, solubilizer, and thickener.\r\n\r\nLecithin (soy) is a moisturizer, emollient, and protector. It acts as a humectant to bring water to our skin. It increases moisture retention in hair. It is an anti-oxidant, and can help boost the efficacy of Vitamin E and Vitamin C as anti-oxidants.\r\n\r\nPanthenol builds a thin moisture film on the surface of hair and makes it shine without oil or greasiness. In addition, it can penetrate the cuticle of the hair and bring moisture into the cortex. It gives good manageability and pliability to hair. Provides shine. It’s strengthening properties are well-known and widely used. Also known for it's anti-inflammatory properties.\r\n\r\nDimethicone improves wet and dry combing, increases shine, improves hair feel (softness), reduces static charge, and works as a humidity resistor.\r\n\r\nVitamin E nourishes, moisturizes and helps regenerate the skin.Helps improve elasticity and helps promote healing of damaged skin.\r\n\r\nFragrance and/or essential oils make you smell yummy! Absolutely love! Very moisturizing better than salon brand conditioners. Perfect for travel or home.\r\n","options":[{"id":46949394,"name":"Lady Godiva and Jungle Jane","price":14.0,"sold_out":false,"has_custom_price":false},{"id":46949511,"name":"Lavender ","price":14.0,"sold_out":false,"has_custom_price":false},{"id":46949514,"name":"Honey I Washed the Kids","price":14.0,"sold_out":false,"has_custom_price":false},{"id":46949517,"name":"Rock Star","price":14.0,"sold_out":false,"has_custom_price":false},{"id":46949520,"name":"Eucalyptus Spearmint","price":14.0,"sold_out":false,"has_custom_price":false},{"id":46949523,"name":"Rose Jam","price":14.0,"sold_out":false,"has_custom_price":false},{"id":46949526,"name":"Karma","price":14.0,"sold_out":false,"has_custom_price":false},{"id":46949529,"name":"Grapefruit Lime","price":14.0,"sold_out":false,"has_custom_price":false},{"id":47001480,"name":"travel shampoo bar only- add note in paypal which scent you prefer (scents are listed above)","price":7.0,"sold_out":false,"has_custom_price":true},{"id":47001483,"name":"travel conditioner bar only-  add note in paypal which scent you prefer (scents are listed above)","price":7.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126695616/-/sm_shampoo_cond.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126695616/-/sm_shampoo_cond.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6543567,"name":"Shampoo and Conditioner","permalink":"shampoo-and-conditioner","url":"/category/shampoo-and-conditioner"}]},{"id":14502267,"name":"Large Solid Shampoo and Conditioner Bars, you pick scent ","permalink":"large-solid-shampoo-and-conditioner-bars-you-pick-scent","position":5,"price":38.0,"default_price":38.0,"tax":0.0,"url":"/product/large-solid-shampoo-and-conditioner-bars-you-pick-scent","status":"active","on_sale":false,"created_at":"2013-10-30T04:09:41.000Z","description":"These new larger bars are the same formula as my travel size bars, after several requests I have made them bigger, and so happy together in one listing! \r\n\r\nNow, best of all- you PICK THE SCENT, all scents listed above, just list what you would like at check out, you can even mix and match!\r\n\r\nPLEASE NOTE: These bars require at least 7-8 days of production time. They are custom made and must cure a bit before I ship. These bars ship priority mail. See scents at the very bottom of listing. \r\n\r\nThese shampoo bars are packed with butters and proteins to nourish your hair while cleansing. They are SLS free and great for color treated or more delicate/sensitive hair and scalp. The conditioner bars are packed with butters, oils, and proteins to nourish your hair. They are great for softening, detangling, controlling frizz, enhancing shine, you name it! \r\n\r\nBoth were developed because for years I was buying salon shampoos and conditioners that cost more than $20 for one tiny bottle. Then last year I tried a solid shampoo bar and conditioner bar from a store that rhymes with blush. Their sales girls really raved about them, so I thought why not? I really liked the concept (smells awesome, great for travel, no plastic bottles, it lasts FOREVER) but the shampoo bar was drying to my hair and scalp and stripped the color. Turns out this store uses SLS as their main cleansing agent- it is cheap and I’m pretty sure that is why many companies use it- even in dish detergent and floor cleaner! I use **SLSA- which may sound similar, but they are very different. More about that below. The conditioner bar did smell nice, but was not very easy to use, it was too hard to really \"glide\" over my hair and my hair didn’t look or feel very conditioned after using it.\r\n\r\nSo I did a ton of testing and research and came up with my own shampoo and conditioner bars. The cleansing agents I use for the shampoo bars are naturally derived from coconuts. The bar lathers up quickly and wonderfully and the smell is fantastic. You just rub it across your head, focusing more on scalp, and massage in. Most importantly, my hair has never looked or felt better! Worth noting, this is not a bar of soap- it is what is called a syndet bar. Many people are selling soap and calling it a shampoo bar or conditioning shampoo- check listings carefully! The ***pH level of regular soap is not good for hair. More about that below too! \r\n\r\nThe conditioner bar has actually been my most popular item, people LOVE it! And I can’t blame them- it is simple, smells great, and works perfectly for all hair types. Just swipe it over hair, this time focusing on the middle to ends of the hair, and rinse with warm water. \r\n\r\nAlso, a tip that I've learned: everything will last longer if it is kept outside of the direct spray of the shower and drained after every use. I have 6 soap drainers, and counting, in my shower right now! \r\n\r\nThese are very unique bars- still very convenient for travel, each bar weighs about 4 to 5 ounces. And they last FOREVER! I have long thick hair, often skip a day between washing, and each bar lasts roughly 2-3 months. Try it and you will never go back to bottles again- I sure won’t! \r\n\r\n------------------------------------------------------------------------------------------------------------------------\r\n\r\nHere are some nice things said about the bars: \r\n\r\nOk. I first used Emily's Shampoo/conditioner on a trip to the UK. My hair was lovely the entire trip. Upon getting back to the US I thought I'd try and find something that I thought was a little cheaper and more 'natural'. Boy did I make a mistake! Cheap, yes. More natural, yes. My hair (and the rest of my family's hair) hated every one we tried! All I can say is Blech! So after much soul-searching, as I am a major penny-pincher by both necessity and nature, I asked Emily to make a special order for me. And of course, she hit it out of the park! She even put colors in them to make them pretty as well as smell good! Other stuff may be cheaper but her stuff is better! And her customer service and communication is outstanding. I need to tell you that I have long, thin-ish hair that has been colored for the last several years. The Shampoo- one word. AMAZING! It has the most luxurious and silky lather of any shampoo I've ever tried and that includes some seriously pricey upscale salon stuff. It cleans the oils from my scalp without over-drying the ends as most shampoos do. The Conditioner- It makes my hair silky without being slimey or weighed down. I can run a large-tooth comb through my long hair while still in the shower and not damage it at all. And here's the best part for me. My back does not break out from it! And yes, my hair looks lovely again, even in our current hot and humid climate! To sum it up, just buy the darn stuff!\r\n\r\nAbsolutely amazing! Beautiful packaging perfect fregrance and the shampoo and conditioner are way better than shampoos I used to spend 60$ on!!!! Quick shipping! I will definetly buy again and recommend to Others!\r\n\r\nI absolutely adore your shampoo bar set. I got 2 travel sets before a series of long trips this summer and they were perfect for travel and even better for my hair. I have been soo stoked, that is till I ran out. I thought I would finish some old bottles I had around and lets just say I need these soon.\r\n\r\nThank you soo much for developing this product to perfection. I love that this product is so environmentally friendly as well. Soo many pluses.\r\n\r\nIn love with this shampoo and conditioner. I was able to get a great lather with the shampoo bar and it left my hair feeling super clean. The conditioner was beyond amazing I was shocked how well it was able to moisturize my hair and how shiny and soft it feels. I am completely obsessed with your products and have already placed an order for more.\r\n\r\nI love these shampoos. This time I tried a different combo--coconut shampoo and the origional conditioner. Emily was great to split it for me plus she added a sample white tea and ginger. They are all lovely but that is the winner for my next large bar.\r\n\r\nsuper duper creamy and natural solid conditioner and shampoo... and larger too... extra credit on that :) love your items.. \r\n\r\nThis stuff is amazing. I won't buy another bottle of shampoo again. Perfect for travel. Smells wonderful. Many thanks!!\r\n\r\nFirst off, the shampoo is much larger than I expected! It barely fits in my palm, which is a good thing, so I'm hoping it will last a loooong time. Second, I ordered the scent 'Sugar Fairy' and oh my goodness...my hair smells like a candy shop. It's so sweet and yummy. I even sprayed on some Garnier shine spray over top (which doesn't smell too great) and you can still smell the Sugar Fairy scent. I LOVE it! Thank you so much Emily!\r\n\r\nThe shampoo bar works great and lathers up very well. They both smell amazing and I will return for larger sizes. Thanks!!\r\n\r\nUGGGG!!!! I LOVE THIS CONDITIONER SO MUCH! It is so wonderful! Thank you :-)\r\n\r\nI wanted to tell you how pleased I am with both the shampoo and conditioner bar now that I've had a few days to use them. My hair comes out really soft and fragrant, despite our extremely hard water. I went one step further with the conditioner bar, based on something I read, and I use it as a lotion bar after my bath, while my skin was still wet. I've been having a really hard time with extremely dry skin, and I'm happy to say it is now under control. Thanks again for the excellent products and excellent customer service.\r\n\r\nTwo words: Sexual chocolate. This is the best thing I have EVER used in my hair. I have the type of unruly, dull frizzy hair no one can tame, but this smoothed out my hair, gave it intense shine, and smells good enough to eat. I had a fun time trying out diff methods to try and use the shampoo bar, as I had never used one before. As far as size goes, these are massive and going to last me many moons. I honestly wanted to eat the conditioner bar it smelled so good. Its day two and my hair is still clean and shiny. I will never go back to using regular shampoo, and Im going to force everyone I know to try out Emilys soaps. Dear sweetest most awesomest seller in the universe, please don't ever stop making these! :P\r\n\r\nThis is exactly the kind of transaction that deserves positive feedback. Emily does a GREAT job of explaining what goes into her products in detail. I had wanted to try a syndet bar for some time (I have been using my homemade soap on my hair - yikes) and didn't know enough about the bar's ingredients to try one until I read her descriptions. She communicated w/ me quickly on shipping and this order came to me super fast! Oh yeah - I used both bars tonight on my hair and they work great and feel wonderful! Don't let the size of these bars fool you - they will last a long time. Wonderful lather of the shampoo and silky feel of the conditioner. Thank you Emily!\r\n\r\nAgain, my favorite shampoo. No more bottles for me! You've got me hooked on this stuff.\r\n\r\nI'm sending this note to let you know how much I really like your products. The hair bar is AMAZING! I hoped to like it, and it was even better than I expected - gentle, yet totally cleans my hair, leaving my hair feeling clean AND full. Really love it. Also, the conditioner is great (not heavy or oily at all for my hair), and I've been using the pat o butter and lip balm, both which I seem to be semi-addicted to. Thanks for the great products!\r\n\r\nSo I have to say: I absolutely love the solid shampoo and conditioner! I waited a week from receiving the bar set, so I could write a thoughtful review if I liked it. So far they are fantastic! I have long, thin finicky hair and I usually use an absence amount of products to style it. When I use the solid shampoo I have noticed I don't have to use as much product. My hair now maintains volume, is manageable, and has a nice healthy shine. The conditioner is deceptively amazing. When I first saw it I was a little bit skeptical. I live in a fairly dry climate and my thin hair tends to get really knotty. The conditioner lets me run a comb through my hair in the shower without a war breaking out between me and my knots. As long as Emily is willing to make her products I will be buying. Also, Emily was quick to communicate with me and super quick to send. All in all a great experience, I couldn't ask for more :)\r\n\r\nI think I found my new shampoo bar. I LOVE your product! It doesn't take much of that yummy lather to give my scalp a good cleaning, and my hair feels so soft and clean, and it's actually manageable! Whenever I use store-bought shampoo I have a hard time styling my hair, but it's a breeze with your bar. Thank you so much!\r\n\r\nThe shampoo and conditioner is great, leaves my hair soft and shiny! I always get nice comments about the great scent as well (especially from a few very critical noses). \r\n\r\nMy shampoo/conditioner bars are STILL going strong - I seriously use them every day and they probably have another month left! I think I got them right after July 4th, good stuff! (this comment is dated 9/14 and from a dude who purchased the travel size bars, just fyi)\r\n\r\nWow, such a large amt that will last forever. I love it and my hair loves it. Thank you so much!\r\n\r\nWow! Wow! Wow! What more is there to say? I never used a shampoo or conditioner bar before and I'm sold! I love this! My hair looks and feels great. The shampoo lathers up amazingly and I couldn't believe how conditioning the bar is. I could comb through my extremely long hair with ease after a shower (and that is not usual). I'm so glad I tried this!\r\nI'll definitely be back for more!!\r\n\r\nLove this set! The conditioner kinda reminds me of incense. Smells great. My hair is very soft after I use them. Will be back for more!\r\n\r\ni tried your solid shampoo and conditioner and now i am so addicted that i have to get a set for my bff to try (at least one of the perfumes is for her too) thank you for making such awesome products, i look forward to receiving all this great stuff!\"\r\n\r\nCarefully packaged. Quick shipment. Smell delightful and are fabulous!\r\n\r\nSmells phenomenal. My hair feels great. Pretty impressed with your conditioner bar as it is really hard to find a nice one that actually works. Well done.\r\n\r\nI cant say enough good things about these bars. Amazing seller, always great communication, always great products. Thank you!\r\n\r\nyour products are so gentle. My hair used to like be falling out and fading and it looks and smells beautiful all the time and my hair isn't frizzy. Thank god I found you. I can't believe I ever spent 40$ on salon shampoo that never worked!!!!!\r\n\r\nWOW. PERFECT products. I have used solid shampoos from other sellers but this one is truly fantastic. Suds wonderfully and the scent (nag champa) is perfection. I have used Lush's \"Jungle\" solid conditioner and HATE it. The smell is slightly off-putting, it doesn't sufficiently condition, and it even pulls my hair during application. This solid conditioner is PERFECTION!!! Doesn't tug on my hair, smells fantastic, and leaves my hair detangled (my hair is curly) and moisturized. THANK YOU!\r\n\r\nI received my order quickly and everything was packaged so wonderfully. My shampoo and conditioner smell lovely and they're going to make my trip over seas in a couple weeks much simpler. Thanks for the great communication and the free sample!\r\n\r\nThank you so much! I LOVE LOVE LOVE the conditioner bar. I won't ever go back to using anything else. One thing I for sure noticed is that my hair isn't as oily at the end of the day, so I am able to go a day between washings ; which, as a mother of a B U S Y two year old, certainly is a blessing!!\r\n\r\nI have been trying out solid and natural shampoos/conditioners over the last few months, and this is the first one that I have tried that really feels good. All of the others have left my hair feeling gunky, crunchy, or stripped, and this leaves me feeling clean and conditioned. I will definitely be getting more in the future!\r\n\r\nThis makes my hair feel amazing!!! I am going to buy another bar soon and perhaps sample a shampoo bar too, I can tell you put a lot into your products. \r\n\r\nWhat you can't tell is that this bar is easily twice the size of a LUSH bar. Buy two and you are money ahead!\r\n\r\nI used the solid shampoo and conditioner this morning. I DIE. So good. Thanks lady!\r\n\r\nLOVE the Conditioner bar! Works great! fast shipping also!\r\n\r\nTo be honest I bought the travel size because I didn't have high hopes of it working. I've used other shampoo bars and my hair was crunchy and weird feeling. I used this last night and my hair is like silk! I will definitely be getting the large size! Thank you.\r\n\r\nThe Jungle Jane scent is wonderful. The bar worked great!\r\n\r\nGreat communication! Smells wonderful! Thanks! :)\r\n\r\nI love these bars. so convenient for my dry curly hair..Smells so good and was quick delivery. Thank you.\r\n\r\nThanks! Just used this and my hair feels great! It smells great too.\r\n\r\nThanks so much -love them... also thanks for the extras... Great customer service.\r\n\r\nFast shipping. Great little conditioner- love it. Plus, it smells just like the one from Lush.\r\n\r\nGreat little bar- works well on my hair\r\n\r\nI'll definitely be back for more!!\r\n\r\nGreat little bar- works well on my hair & smells just like the Lush one... Yum!\r\n\r\nIt took me a few days to get used to using a bar of shampoo, now I know to get my hair really wet first, and it lathers like crazy! Smells great! Love it! \r\n\r\nI ordered your Nag Champa travel shampoo bar and Conditioner bar and I love it!\r\n\r\nI loved the syndet conditioning bar. it really does work.\r\n\r\nIt made his hair less frizzy when it was humid.\r\n\r\nLovely stuff! Has a great scent and is very travel friendly!\r\n\r\nok so it has been a good 3 wks since I purchased and have been using the shampoo and conditioner bars and I am so glad that I reordered this it has made my hair so soft and shiny I will never use regular shampoo and conditioner again\r\n\r\nPerfect for travelling! My hair gets tangled when a comb just looks at it, so I usually need extra detangler. This shampoo and conditioner actually leave my hair fairly snarl-free, so I don't have to pack the extra detangler and conditioner. Yay for reducing the baggage!!!!\r\n\r\nOh yeah. Better 'n Lush. Great solid shampoo. Love this stuff.\r\n\r\nI wasn't sure how much to rub on my hair, but I did good cause while rinsing, my hair had the smooth slick feeling, and after blow-drying, I like the results.. this is super-cool for traveling. Thanks! Will buy from again soon.\r\n\r\nOUR FAVORITE BAR SHAMPOO AND CONDITIONER EVER!!! For real. Great seller, too.\r\n\r\nI've used this twice and am in love thank you, I'll be coming back again soon:)\r\n\r\nYummy frothy solid shampoo bar that gives squeaky clean results with one wash! I'll be back.\r\n\r\nI have been hooked on this stuff since my first wash.\r\n\r\nI freaking love your product!\r\n\r\nlove, love.love this stuff! Want more!\r\n\r\nwasn't sure if I'd like this or not, so I purchased the mini size. I took it with me on vacation and fell in love with it! I love the scent of both the shampoo and conditioner, and it cleansed and conditioned my hair beautifully. I was a little worried in the shower after rinsing out the conditioner because my hair didn't feel very well conditioned but I was able to run a comb through it easily and when my hair dried my curls looked amazing!!! I kind of thought it was the weather in Hawaii but I'm still using it at home in the midwest and my hair is still looking fabulous. I will be back to buy a full size of the conditioner for sure.\r\n\r\nSo I have to say: I absolutely love the solid shampoo and conditioner! I waited a week from receiving the bar set, so I could write a thoughtful review if I liked it. So far they are fantastic! I have long, thin finicky hair and I usually use an absence amount of products to style it. When I use the solid shampoo I have noticed I don't have to use as much product. My hair now maintains volume, is manageable, and has a nice healthy shine. The conditioner is deceptively amazing. When I first saw it I was a little bit skeptical. I live in a fairly dry climate and my thin hair tends to get really knotty. The conditioner lets me run a comb through my hair in the shower without a war breaking out between me and my knots. As long as Emily is willing to make her products I will be buying. Also, Emily was quick to communicate with me and super quick to send. All in all a great experience, I couldn't ask for more :)\r\n\r\nI'll admit, I ordered the small size because I wasn't sure the bars were going to work. I was SO wrong! The scent is delightful, the shampoo lathers extremely well, and the conditioner leaves my hair soft and manageable. I'll definitely be ordering the larger sizes next time and I'll never go back to liquid shampoo and conditioner. THANK YOU Emily!!\r\n\r\nLove it, never using retail shampoo and conditioner again! Super convenient for travel too :)\r\n\r\nLOVE LOVE LOVE LOVE LOVE!!!!!!!!!!!!!!!!!!!!!! Soapily! Love your stuff!!\r\n\r\nSmells amazing and made my hair very soft! I'm glad i tried the small one first but I know next time will be the full size bar! Thank you so much!\r\n\r\nThe perfect size for travel. Thanks so much!\r\n\r\nAgain, my favorite shampoo. No more bottles for me! You've got me hooked on this stuff.\r\n\r\nThis is the best solid conditioner I've ever tried! Of course, I've only tried this and one other one, but still! I put it on my hair and clip it up while I wash my body, then I rinse it out and apply and clip again while I wash my face. Two (sometimes three) applications does the trick for my super dry hair, and I've seen less frizzies! Thanks so much, Emily! :)\r\n\r\n\r\n\r\n------------------------------------------------------------------------------------------------------------------------\r\n\r\n**Here is more info about SLS and the pH of hair:\r\nWhat are SLS's? They are surfactants or surface active agents. \r\nWhat does that mean? Surfactants may act as detergents, wetting agents, emulsifiers, foaming agents, and dispersants. So basically, they are a necessity in order to make products that you use on your body, in your washing machine, in your dishwasher, in dish soap, etc.\r\nSodium Laureth Sulfate (SLS), sodium lauryl sulfate (SLES), and sodium lauryl sulfoacetate (SLSa) are ingredients that sound and look similar, but are completely different.\r\nSLS: has a small molecular structure and therefore, penetrates the skin easily. SLS, as well as its close relative SLES, are esters of sulfuric acid. Both are known skin irritants. \r\nSLES: might be somewhat less irritating than SLS, it is unable to be metabolized by the liver, which means its effects are much more long lasting. These are generally used in dish detergent, laundry detergent, and other harsh detergents that are used on a day-to-day basis, and also on items not used on skin.\r\nSLSa: is derived from coconut oils. SLSa is a safe, skin friendly cleanser that offers rich lather without the irritation potential of some of the other good foamers. Because the molecular size of this surfactant is large it doesn’t penetrate the skin or the mucous membranes, so it does not cause the skin irritation as other sulfates, making it an excellent choice for gentle cleansing products.\r\nWhy are SLS or SLES used? The simple answer is that they are cheap. In so many commercial formulations and ingredients, the bottom line is money. Commercial companies are in this to make money, which leaves the consumer with a cheap, well-disguised and well-advertised product. As a consumer you have a choice, and you came to the right place! Handmade goods by etsy artisians are truly superior. \r\n\r\n***As mentioned, this is not a bar of soap- it is what is called a syndet bar. Many people are selling soap and calling it shampoo- check listings carefully! The pH of body or facial soap is not good for hair. Shampoos are generally around pH 6.0, whereas soaps tend to the alkaline, over 8.0 (some soaps can be even pH 10). This means cold processed soaps are not pH balanced for our hair. After shampooing with products out of the right pH range, the cuticle of our hair doesn't lie down, and this can lead to abrasion between the hairs. This is a serious cause of mechanical hair damage, and once you have damage, it's hard to repair it, even with the most intense conditioners.\r\n\r\nSoap isn’t as soluble in hard water as most surfactants. Soap molecules in hard water are converted by double decomposition to form insoluble non-foaming salts like lime, calcium, or magnesium salts of fatty acids. This isn't a big deal on your skin, but it can lead to build up on your hair, leaving it looking dull and feeling kinda crunchy. They won't foam well if there are metal ions in your water - and most water contains metal ions - and they won't foam well in the presence of sebum. Given these properties, soap isn't going to remove all the stuff you've put on your hair and you won't get a feeling of being clean (or, ironically, your hair might feel too squeaky clean, which isn't a good thing).\r\n\r\n------------------------------------------------------------------------------------------------------------------------\r\n\r\nAnd here are the ingredients: I know, I am very thorough- but this is your lovely hair we are talking about! :) \r\n\r\nShampoo Bar\r\nContains: Sodium Cocoyl Isethionate (SCI), Sodium Lauryl Sulfoacetate (SLSA), Sodium Methyl Oleoyl Taurate (SMO Taurate), Cocamidopropyl Betaine, Stearic Acid, Emulsifying Wax, Incroquat CR, Cocoa Butter, Mango Butter, Pink Himalayan Sea Salt, Hydrolyzed Soy Protein, Panthenol, Dimethicone, Vitamin E, Fragrance and/or Essential Oils, Colorant. \r\n\r\nNow what are all of these things? Here is a description of what each ingredient does for the hair: \r\n\r\nSodium Cocoyl Isethionate (SCI), considered exceptionally mild for skin, hair, and eyes, and is particularly tolerant to hard water. It leaves behind a great skin feel - usually described as \"silky\" - and creates really lovely foam, bubbles, and lather. SCI is great for every skin or hair type. Provides gentle cleansing and the creamy after feel. \r\n\r\nSodium Lauryl Sulfoacetate (SLSA) is an excellent foaming, bubbling, and lathering surfactant. It offers great cleaning and detergent properties.Derived from coconut and palm oils, it is a safe, skin friendly cleanser that offers rich lather without the irritation potential of some other cleansers. Because the molecular size of this surfactant is large it doesn't penetrate the skin, so it does not cause irritation.\r\n\r\nSodium Methyl Oleoyl Taurate (SMO Taurate) is mild to skin and hair, provides tons of lather in hard or soft water, gives a silky soft after-feel to skin and hair \r\n\r\nCocamidopropyl Betaine is a mild, natural surfactant derived from coconut oil. It used to boost and stabilize foam and improve viscosity in shampoo \r\n\r\nStearic Acid is a fatty acid derived from natural sources used to thicken and stabilize formulations. It will impart a soft feel to lotions and creams.\r\n\r\newax is an emulsifier and thickener.\r\n\r\nIncroquat CR imparts manageability and conditioning to hair. A good detangler, anti-static, great softener. \r\n\r\nCocoa Butter is recommended for treatment of chapped skin and lips, and as a daily moisturizer to prevent dry, itchy skin. It is great for trapping in moisture, it stays on the skin and acts as a barrier. \r\n\r\nMango Butter is very creamy butter, less greasy than some other butters and very emollient.\r\n\r\nPink Himalayan Sea Salt, contains a full spectrum of 84 minerals and trace elements. It is an unrefined, unprocessed \"raw\"salt that's hand-mined.\r\n\r\nHydrolyzed Soy Protein offers a reduction in static buildup and flyaway, improved manageability after shampooing, is a shine enhancer, provides protective colloid functions coating skin and hair.\r\n\r\nPanthenol builds a thin moisture film on the surface of hair and makes it shine without oil or greasiness. In addition, it can penetrate the cuticle of the hair and bring moisture into the cortex. It gives good manageability and pliability to hair. Provides shine. It’s strengthening properties are well-known and widely used. Also known for it's anti-inflammatory properties.\r\n\r\nDimethicone improves wet and dry combing, increases shine, improves hair feel (softness), reduces static charge, and works as a humidity resistor.\r\n\r\nVitamin E, nourishes, moisturizes and helps regenerate the skin.This vitamin oil helps improve elasticity and helps promote healing of damaged skin.\r\n\r\nFragrance and/or essential oils, make you smell yummy!\r\n\r\nColorant, so we can tell shampoo from conditioner. Blue for shampoo- it rhymes! \r\n\r\nConditioner Bar: \r\nContains: Incroquat CR, Behentrimonium Methosulfate (and) Cetyl Alcohol (and) Butylene Glycol (BTMS 50), Cetyl Alcohol, Cocoa Butter, Mango Butter, Avocado Oil, Sweet Almond Oil, Apricot Kernal Oil, Honeyquat, Hydrolyzed Soy Protein, Olive Oil PEG-7 Esters, Lecithin (soy), Panthenol, Dimethicone, Vitamin E, and Fragrance and/or Essential Oils\r\n\r\nNow what are all of these things? Here is a description of what each ingredient does for the hair: \r\n\r\nIncroquat CR imparts manageability and conditioning to hair. A good detangler, anti-static, great softener. \r\n\r\nBTMS-50 is a great detangler for hair, and is gentle enough for leave-on skin care.It produces mild and elegant emulsions that provide a soft, powdery, persistent after-feel on the skin and leave hair silky smooth and tangle-free.\r\n\r\nCetyl alcohol is naturally derived from vegetable oil. This fatty alcohol is used as an emollient and to give emulsions more stability, body, and viscosity. \r\n\r\nCocoa Butter is recommended for treatment of chapped skin and lips, and as a daily moisturizer to prevent dry, itchy skin. It is great for trapping in moisture, it stays on the skin and acts as a barrier. \r\n\r\nMango Butter is very creamy butter, less greasy than some other butters and very emollient.\r\n\r\nAvocado Oil is good for sensitive, dehydrated, cracked, and maturing skin. High in Vitamins A, B1, B2, B5, minerals, protein, lecithin, and fatty acids. Improves skin elasticity.\r\n\r\nSweet Almond Oil is an excellent emollient and softener. It is lubricating, but not penetrating. Good for skin that is very dry or inflamed.Rich in essential fatty acids, vitamins A, B1, B2, B6, and E.\r\n\r\nApricot Kernal Oil is good for all skin types. This penetrates quickly without an oily feeling. \r\n\r\nHoneyquat adsorbs water, penetrates the hair shaft for more conditioning. It offers better wet combing and conditioning, as well as the reduction of static build-up on dry hair.\r\n\r\nHydrolyzed Soy Protein offers a reduction in static buildup and flyaway, improved manageability after shampooing, is a shine enhancer, provides protective colloid functions coating skin and hair.\r\n\r\nOlive Oil PEG-7 Esters is used as an emollient, lubricant, anti-irritant, solubilizer, and thickener.\r\n\r\nLecithin (soy) is a moisturizer, emollient, and protector. It acts as a humectant to bring water to our skin. It increases moisture retention in hair. It is an anti-oxidant, and can help boost the efficacy of Vitamin E and Vitamin C as anti-oxidants.\r\n\r\nPanthenol builds a thin moisture film on the surface of hair and makes it shine without oil or greasiness. In addition, it can penetrate the cuticle of the hair and bring moisture into the cortex. It gives good manageability and pliability to hair. Provides shine. It’s strengthening properties are well-known and widely used. Also known for it's anti-inflammatory properties.\r\n\r\nDimethicone improves wet and dry combing, increases shine, improves hair feel (softness), reduces static charge, and works as a humidity resistor.\r\n\r\nVitamin E nourishes, moisturizes and helps regenerate the skin.Helps improve elasticity and helps promote healing of damaged skin.\r\n\r\nFragrance and/or essential oils make you smell yummy!\r\n","options":[{"id":46949808,"name":"add note in paypal which scent you prefer (scents are listed above)","price":38.0,"sold_out":false,"has_custom_price":false},{"id":47001531,"name":"shampoo bar only","price":19.0,"sold_out":false,"has_custom_price":true},{"id":47001534,"name":"conditioner bar only ","price":19.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":6.0,"amount_with_others":4.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126724599/-/large_shampoo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126724599/-/large_shampoo.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6543567,"name":"Shampoo and Conditioner","permalink":"shampoo-and-conditioner","url":"/category/shampoo-and-conditioner"}]},{"id":14513949,"name":"THE Spray Moisturizing Spray Detangler ","permalink":"the-spray-moisturizing-spray-detangler","position":6,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/the-spray-moisturizing-spray-detangler","status":"active","on_sale":false,"created_at":"2013-10-30T18:22:33.000Z","description":"THE spray is a two-in-one product. I love my twofers! \r\n\r\nPlease add note in paypal which scent you prefer (scents are listed above)\r\n\r\nTHE spray is both a moisturizing and a detangling spray that is light and and improves both wet and dry combability. I also mist it all over my body as a moisturizing perfume spray. The mist is super fine so it dries really quickly. It contains coconut-based conditioners, glycerin, and fatty acids, which are all excellent for both skin and hair. It can be used on all hair and skin types.\r\n\r\nI can customize in any scent listed below, just include the scent in the notes to seller box when you checkout. All of my scents are listed above. \r\n\r\nHere are some nice things said about THE spray:\r\n\r\nWe are hooked! I love how smooth this stuff makes my daughter's hair. She loves the detangling part (she has really long hair that gets quite tangled and static-y). She also loves the scent (absinthe) and tells people to smell her head. We are very happy repeat customers who plan on continuing to repeat this purchase in the future. :)\r\n\r\nlove the hair detangler they work AWESOME.they work sooo good on my hair and the scent stays all day my hair feels so silky and smells delicious got lush rose jam type and 1000 kisses.both smell divine...and seller is very very nice\r\n\r\nFantastic!!!!!!!!! Love this spray,weightless yet moisturizing and doesn't leave a residue when you apply it to dry hair. It's perfect!!!!\r\n\r\nGREAT!!!!!!!!!!!!! The scent is amazing...Thanks\r\n\r\nFantastic! I use this on my daughter's long, straight hair and it not only makes brushing easier, it leaves her hair with just the right amount of shine so her blonde looks golden. Added bonus - it also seriously improved the smell of her hockey helmet! ;)\r\n\r\nThank you! Smells great and seller was very nice about changing the ingredients a bit to better suit my needs.\r\n\r\nFANTASTIC!!!!!! Love the Meditation scent!!!\r\n\r\nThis spray works great. Love the way it makes my hair feel.\r\n\r\nvery nice, love the scent and detangles with ease. Thanks!\r\n\r\nContains: Water, Incroquat CR, Behentrimonium Methosulfate, Cetyl Alcohol, Butylene Glycol, Cetyl Alcohol, Cocoa Butter, Mango Butter, Avocado Oil, Sweet Almond Oil, Apricot Kernal Oil, Honeyquat, Hydrolyzed Soy Protein, Olive Oil PEG-7 Esters, Soy Lecithin, Panthenol, Dimethicone, Vitamin E, and Fragrance and/or Essential Oils \r\n\r\n*new and improved, same ingredients as my solid bar, just with water added :)*\r\n\r\nPlease test a small area of skin for sensitivity. All of my products are safe for skin but some people may find they have reactions to certain essential or fragrance oils.\r\n\r\nI would also be happy to do a custom blend, just convo me! ","options":[{"id":46985883,"name":"1 oz","price":6.0,"sold_out":false,"has_custom_price":false},{"id":46985886,"name":"2 oz","price":10.0,"sold_out":false,"has_custom_price":true},{"id":46985889,"name":"4 oz","price":16.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126725271/-/spray.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126725271/-/spray.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6543567,"name":"Shampoo and Conditioner","permalink":"shampoo-and-conditioner","url":"/category/shampoo-and-conditioner"},{"id":6547689,"name":"Lotion","permalink":"lotion","url":"/category/lotion"},{"id":6548349,"name":"Other Hair","permalink":"other-hair","url":"/category/other-hair"}]},{"id":14513805,"name":"Creme de la Creme Body Butter ","permalink":"creme-de-la-creme-body-butter","position":7,"price":3.5,"default_price":3.5,"tax":0.0,"url":"/product/creme-de-la-creme-body-butter","status":"active","on_sale":false,"created_at":"2013-10-30T18:16:59.000Z","description":"This is absolutely the thickest, most luxurious body butter that I've ever seen or felt. And I've seen a lot! This wonderful cream is made with shea butter, cocoa butter, jojoba oil, green tea, Vitamin E, and other natural skin nurturing ingredients.\r\n\r\nPlease add note in paypal which scent you prefer (scents are listed above)\r\n\r\nYou can tell from the picture how luxurious and thick this butter is. It has the texture of a buttercream frosting. And you get to be the cupcake :) It melts right in to your skin and lasts for hours and hours. When I was mixing this up I couldn't stop smiling- no more dry elbows for this girl! \r\n\r\nThis is a sample size jar. All of my fragrances are listed above. A lot of these fragrances are dupes, contact me if you have questions. \r\n\r\nNice things said about the butter: \r\n(sample size) The tiny tub is adorable and just the right size for testing the scent and stashing in my purse. I love the body butter. It is the richest, creamiest, butteriest lotion I have ever tried. Wonderful! I am thrilled!\r\n\r\nI love everything about this product: the great customer service, accessibility of the seller, the wonderful non-greasy feel, the way it fixes my super dry sensitive skin insanely fast, the smell, everything. I will most definitely keep shopping here and recommend this product and the soaps VERY highly.\r\n\r\nThanks for the large lotion! Seriously no ones lotion is as moisturizing! I tan a lot and have to use your lotion in the am and pm. It smells do good number one and two I hold my tan much longer! I've tried tons of lotions no ones compares!!! It's not watery or just beautifully smelling it does it's moisturizing job! Thanks for the little goodies too. You're the absolute best. I'll be back soon to order my other favorites: sugar cubes for exfoliation and hair products. You rock!\r\n\r\nNow for the fun part, what scent do you want? I have over 200 to choose from, and if you don't see if here I may be able to get it for you, just ask! You can also get this unscented, if you have sensitive skin. Just let me know your preference in the notes section when you check out. ","options":[{"id":46985388,"name":"sample size ","price":3.5,"sold_out":false,"has_custom_price":false},{"id":46985391,"name":"2 ounce","price":12.0,"sold_out":false,"has_custom_price":true},{"id":46985394,"name":"4 ounce ","price":22.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126724914/-/lotion.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126724914/-/lotion.jpg","width":570,"height":760}],"artists":[],"categories":[{"id":6547689,"name":"Lotion","permalink":"lotion","url":"/category/lotion"}]},{"id":15248253,"name":"Pretty in Pink Custom Made Luxury Shea Butter Soap: You choose scent ","permalink":"pretty-in-pink-custom-made-luxury-shea-butter-soap-you-choose-scent","position":8,"price":7.0,"default_price":7.0,"tax":0.0,"url":"/product/pretty-in-pink-custom-made-luxury-shea-butter-soap-you-choose-scent","status":"active","on_sale":false,"created_at":"2013-12-01T20:12:03.000Z","description":"This soap is the prettiest pink swirled with a tiny bit of yellow. Okay, maybe it is \"pretty in pinkish-coral\", but that just doesn't have the same ring to it. Either way, the color turned out just gorgeous.\r\n\r\nPlease see my scent list below, I have over 200 to choose from! Just write in the notes section what scent/s you would like when checking out.\r\n\r\nThis luxury soap is made with shea butter. It is extremely creamy and has a very silky lather. It is vegan and detergent free. The soap is custom made for you, and then cut into a rustic block weighing between 3 and 4 ounces. Everyone that tries this soap falls in love with it! \r\n\r\nI can also customize the color, just convo me.\r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan\r\n\r\n\r\nPlease note, I have many scents to choose from. **Contact me if you would like a scent you do not see here, I can likely get it. Custom orders take 2-5 days. \r\n","options":[{"id":49562601,"name":"Default","price":7.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128608863/-/custom_soap.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128608863/-/custom_soap.jpg","width":570,"height":760}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":15248055,"name":"Lemon Chamomile Tea Soap","permalink":"lemon-chamomile-tea-soap","position":9,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/lemon-chamomile-tea-soap","status":"active","on_sale":false,"created_at":"2013-12-01T20:06:10.000Z","description":"I created this soap because I love the calming effect of chamomile tea. If I can't sleep, I always brew a cup. I thought that the flowers were pretty and along with the tea would have a very mild exfoliating effect, and added a bit of lemon oil for fragrance. It is like a ray of sunshine in my morning shower. This soap contains luxurious shea butter for super soft skin. It is also very pretty in my soap dish! \r\n\r\nThis soap is vegan. Each round weighs about 2 to 3 ounces. Please let me know if you have any questions, and custom orders are always welcome. \r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan","options":[{"id":49562115,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128608380/-/lemon_chamomile.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128608380/-/lemon_chamomile.jpg","width":570,"height":760}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14536140,"name":"Robot Soap","permalink":"robot-soap","position":10,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/robot-soap","status":"active","on_sale":false,"created_at":"2013-10-31T17:29:12.000Z","description":"This could quite possibly be the cutest soap on the planet. Kids and adults alike squeal with joy when they see our friend Mr. Robot. A certain celebrity bought ten of these at a recent craft show, so in my mind they are now famous :)\r\n\r\nThis listing is for two (2) robot soaps, in either blue, gray, or pink. Blue is scented with bubble gum, pink with cotton candy, and gray with woods and citrus. Please list scent and color in notes at checkout. If you do not list a scent and color I will default to blue robots that smell like bubblegum. Smurfbots, if you will.\r\n\r\nThis luxury soap is made with shea butter. It is extremely creamy and has a very silky lather. It is vegan and detergent free. The robots are custom made for you, and weigh roughly 1 ounce each. Everyone that tries this soap falls in love with it! \r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan","options":[{"id":47063130,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126783108/-/robot.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126783108/-/robot.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14802501,"name":"Calm the Hell Down Balm","permalink":"calm-the-hell-down-balm","position":11,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/calm-the-hell-down-balm","status":"active","on_sale":false,"created_at":"2013-11-12T21:07:01.000Z","description":"So today in yoga while we were chilling out, maxing, relaxing at the end of class my instructor came over and gave us each a little whiff of lavender. It was heavenly. \r\n\r\nThat is where I got the idea for this balm. Keep it in your purse for those OMG moments on the subway. Keep it at your desk for those I hate everything and everyone moments at work. Keep it in the car for those holy crap this is insane moments in traffic. You get the idea. Anytime you are stressed, put a little bit of this on your wrists and inhale. deeply. insta-calm. You need this in your life.\r\n\r\nIt is made of beeswax, sweet almond oil, sweet almond butter, safflower oil, cocoa butter, lavender essential oil, and vitamin e.","options":[{"id":47975637,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127463106/-/photo_1.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127463106/-/photo_1.JPG","width":1224,"height":1632},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127463124/-/photo_2.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127463124/-/photo_2.JPG","width":1224,"height":1632},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127463139/-/photo_3.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127463139/-/photo_3.JPG","width":1224,"height":1632}],"artists":[],"categories":[{"id":6543282,"name":"Perfume","permalink":"perfume","url":"/category/perfume"},{"id":6547689,"name":"Lotion","permalink":"lotion","url":"/category/lotion"}]},{"id":14515671,"name":"Spray on Dry Oil ","permalink":"spray-on-dy-oil","position":12,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/spray-on-dy-oil","status":"active","on_sale":false,"created_at":"2013-10-30T19:30:45.000Z","description":"This is a quick absorbing dry oil that not only smells great, but softens your skin too! Perfect for summer when you don't want any heavy moisturizers.\r\n\r\nPlease add note in paypal which scent you prefer (scents are listed above)\r\n\r\nContains Safflower, Jojoba, and Vitamin E oils to pamper skin. It is my barrier against the harsh elements! \r\n\r\nSpray on pulse points or all over the body for a slight glow and silky feel. The oil leaves your skin scented, and soaks in nicely, and is never greasy or oily to the touch. I also mist a tiny bit in my hair to add condition and shine.\r\n\r\nThis listing is for a two (2) ounce bottle, I also have one (1) ounce bottles available.\r\n\r\n\r\nContains: cyclomethicone, safflower oil, jojoba oil, vitamin e oil, fragrance and/or essential oil.\r\n\r\nComments so far:\r\nSmells and feels lovely. I can't get enough of your tuberose scent!\r\n\r\nWonderful body sprays, that are moisturizing with scents that linger all day. Thank you again for the tuberose perfume, it's one of my favorites!\r\n\r\nGreat seller & product! This is my second purchase from Soapily, I'm sure there'll be more :)\r\n\r\nLOVE THIS!!! The dry oil softens your skin and the scent lasts a long time! Thank you so much for accommodating my shipping request! Fast shipping-great seller!!!\r\n\r\n\r\n\r\nPlease test a small area of skin for sensitivity. All of my products are safe for skin but some people may find they have reactions to certain essential or fragrance oils.\r\n\r\n\r\nPlease note, I have many scents to choose from. **Convo me if you would like a scent you do not see here, I can likely get it, also custom orders may take 4-5 days.** ","options":[{"id":46991490,"name":"1 ounce","price":8.0,"sold_out":false,"has_custom_price":false},{"id":46991493,"name":"2 ounces","price":13.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126729528/-/dry_oil.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126729528/-/dry_oil.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6547689,"name":"Lotion","permalink":"lotion","url":"/category/lotion"},{"id":6548292,"name":"Dry Oil","permalink":"dry-oil","url":"/category/dry-oil"}]},{"id":14515740,"name":"Sea Salt Spray- Boho Beach Goddess ","permalink":"sea-salt-spray-boho-beach-goddess","position":13,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/sea-salt-spray-boho-beach-goddess","status":"active","on_sale":false,"created_at":"2013-10-30T19:36:03.000Z","description":"You know how sexy your hair looks after a day frolicking in the ocean? It's pretty amazing what sea salt can do, especially for those of us with any kind of wave to our hair. I made this spray because I wanted to enhance the wave in my own hair and I was tired of buying overpriced salon products when I knew I could do better myself! I scented this with my coveted coconut beach fragrance, so you can smell like the beach too!\r\n\r\nI added lots of moisturizing ingredients (Aloe Vera Juice, Argan Oil, Vitamin E) to counteract the drying effects of the sea salt. But do remember, sea salt has a ton of natural minerals from the sea which are good for our hair. I also added a bit of Magnesium Sulfate (epsom salt), which is said to be more gentle on the hair and is also packed with natural minerals. \r\n\r\nTo use: shake well, then simply mist over hair and scrunch into waves. Simple as can be! \r\n\r\nThis spray comes in a 2 ounce spritzer bottle and contains: Aloe Vera Juice, Water, 100% pure Argan oil, Sea Salt, Magnesium Sulfate, vitamin E, fragrance oil. Absolutely love! Very moisturizing better than salon brand conditioners. Perfect for travel or home.","options":[{"id":46991679,"name":"1 ounce","price":8.0,"sold_out":false,"has_custom_price":false},{"id":46991682,"name":"2 ounces","price":12.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126729807/-/sea_salt.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126729807/-/sea_salt.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6548349,"name":"Other Hair","permalink":"other-hair","url":"/category/other-hair"}]},{"id":14536089,"name":"Mustache Soap, custom colors available ","permalink":"mustache-soap-custom-colors-available","position":14,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/mustache-soap-custom-colors-available","status":"active","on_sale":false,"created_at":"2013-10-31T17:27:10.000Z","description":"I mustache, who would not love this soap? Handlebar fans unite! I like to call these smurf staches because of the lovely blue color :)\r\n\r\nThis listing is for two (2) mustache soaps, in either blue, gray, pink, or brown. Blue and pink are scented like cotton candy, gray and brown like woods and citrus. Please list color in notes at checkout. If you do not list color I will default to blue staches that smell like cotton candy.\r\n\r\nThis luxury soap is made with 5% shea butter. It is extremely creamy and has a very silky lather. It is vegan and detergent free. The soap is custom made for you, and weighs roughly .5 ounce each. Everyone that tries this soap falls in love with it! \r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan","options":[{"id":47062974,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128696664/-/holiday_mustache.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128696664/-/holiday_mustache.jpg","width":570,"height":763},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128697081/-/more_mustaches.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128697081/-/more_mustaches.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14516748,"name":"Dry Shampoo Powder, one more snooze in the morning! ","permalink":"dry-shampoo-powder-one-more-snooze-in-the-morning","position":15,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/dry-shampoo-powder-one-more-snooze-in-the-morning","status":"active","on_sale":false,"created_at":"2013-10-30T20:25:54.000Z","description":"This is a great thing to have on hand if you are like me and like to hit the snooze button more than once, or if you are going camping, or if you have sensitive hair that you would rather not shampoo daily. Just apply a little bit throughout scalp (focusing on the roots of the hair that frames the face) and rub with fingers. You can also apply to a boar-type bristle brush and brush thoroughly. It's nice for all hair types, and I’ve found that my hair looks fuller after using. You could even carry it in your bag for an end of the day refresher. I have pictured the brown, which is also great at covering a few grey roots, and one that has no added color, best for those with light hair. If you would like red or any other color, convo me and we can set up a custom listing. \r\n\r\nThe hair powder is very concentrated and comes in a 0.5 ounce bottle with a tiny applicator nozzle (think eye drops) so you can get the powder exactly where you want it and not all over your sink. \r\n\r\nThe brown is highly pigmented, so you do have to be careful about not getting it on a light colored shirt, etc. \r\n\r\nHere are some nice things said about the dry shampoo:\r\n\r\nSo... Emily's dry shampoo is fabulous- and i ought to know because i have tried so very many. I am the sort of person who dry shampoo doesn't work for. My hair is very fine and begins to look greasy about 18 hours after my last shampoo. But there are so many morning when not having to wash and blowdry my hair means nearly an hour of extra sleep. I turned to etsy reviews and found \"one more snooze\". It arrived 24 hours after my last wash, so I tried it and wow. No grease, no weird residue, no flakes of strange substances... It looked like I had just washed and styled my hair. So completely worth it!\r\n\r\nThis is ingenious. I hated the fact that dry shampoo made me look like I had gray roots. This stuff gives my hair a nice subtle color boost and enough lift to get through an extra day before shampooing.\r\n\r\nI LOVE your hair powder..my favorite one by far!! Even better than Bumble and Bumble! This is my 3rd order:)\r\n\r\nI love this product. I use very, very few hair products and I love this one!! It makes my hair look great when I run out of time to wash. Perfect.\r\n\r\nI love this dry shampoo. It gives me voluminous hair and I love it. Thank You!\r\n\r\nlove as always--3rd order\r\n\r\nLove this stuff! Thank you so much! Will be back for more!\r\n\r\nOmg just tried it today and I love it! It works perfectly! And the color you did for me is perfect! I have tried many dry shampoos but this is the best one! So excited! Telling everyone! :-)\r\n\r\njust received the product and am excited to try it out -- thanks for the quick, friendly correspondence, and thanks also for the sample -- it smells great!\r\n\r\nDelightful and not disappointing! Infinitesimally-grained powder, the container filled to the brim. . .I'll most certainly purchase this product again!\r\n\r\nthe dry shampoo is a lifesaver!\r\n\r\nThank you!!!!!!!!!!!!! I love I love!!!!!!!!!!!!\r\n\r\nLovely stuff! Has a great scent and is very travel friendly!\r\n\r\nI LOVE this product!!! This is my second bottle! \r\n\r\nJoke's on me--I tried getting a drug store dry shampoo because I ran out of yours and was in a pinch. That other stuff was the worst! Yours is the best! Thanks for being awesome! \r\n\r\nIt is amazing and love the applicatior which is why I chose it over all the other ones on Etsy. Like that you have the brunette shade as well. thank you!\r\n\r\nThe perfect solution. You must try it! Thanks Emily.\r\n\r\n\r\n\r\nI scent it with lavender and it contains: cornstarch, arrowroot powder, sodium bicarbonate, french green clay, cocoa powder (brown ONLY), vitamin e, lavender essential oil, and iron oxide and/or mica for extra rich color (brown ONLY). \r\n\r\nI am now making a red dry shampoo. The ingredients used for that are the above plus one or more of the following: beet root powder, acai berry powder, hibiscus flower powder, and/or alkanet root powder.","options":[{"id":46994724,"name":"White","price":8.0,"sold_out":false,"has_custom_price":false},{"id":46994727,"name":"Brown","price":8.0,"sold_out":false,"has_custom_price":false},{"id":46994730,"name":"Black","price":8.0,"sold_out":false,"has_custom_price":false},{"id":46994733,"name":"Red","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126732552/-/dry_poo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126732552/-/dry_poo.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6543567,"name":"Shampoo and Conditioner","permalink":"shampoo-and-conditioner","url":"/category/shampoo-and-conditioner"},{"id":6548349,"name":"Other Hair","permalink":"other-hair","url":"/category/other-hair"}]},{"id":14518773,"name":"Holiday Lump of Coal Soap, comes with stocking. For anyone who has been naughty...or nice! ","permalink":"holiday-lump-of-coal-soap-comes-with-stocking-for-anyone-who-has-been-naughty-or-nice","position":16,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/holiday-lump-of-coal-soap-comes-with-stocking-for-anyone-who-has-been-naughty-or-nice","status":"active","on_sale":false,"created_at":"2013-10-30T22:00:09.000Z","description":"How did the whole coal in your stocking tradition get started? I know over the years I've gotten it (yes, I've been naughty). It is cute, but not practical. Well, here you have it, a cute and practical coal option- soap! And it smells just delicious- like cotton candy! \r\n\r\nYou will receive two (2) lumps of coal, for a total weight of 2.5 ounces. You will also receive the adorable stocking in the photo. \r\n\r\nI encourage you to order now, Christmas can sneak up on you! \r\n\r\nI can also ship directly to the naughty person in your life, please send me a conversation. \r\n\r\nChristmas gift wrap and note cards can also be purchased in my shop for an additional fee of $1.50. Listing will be added soon.\r\n\r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Fragrance and/or Essential Oil, Mica (for sparkle and color).\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan","options":[{"id":47001114,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126738111/-/coal.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126738111/-/coal.jpg","width":570,"height":762}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14518647,"name":"Moisturizing Styling Pomade","permalink":"moisturizing-styling-pomade","position":17,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/moisturizing-styling-pomade","status":"active","on_sale":false,"created_at":"2013-10-30T21:55:58.000Z","description":"All-natural pomade for styling the hair. Made with beeswax and moisturizing coconut oil. Gives your hair great hold and shine. Scented with a small amount of cedarwood essential oil for a natural, earthy smell. 2 ounce container. \r\n\r\nDirections: Use a pea size amount (or smaller, depending on amount of hair) to define curls, add texture and definition, and boost moisture and shine. \r\n\r\nContains: beeswax, coconut oil, vitamin E, cedarwood essential oil.","options":[{"id":47000817,"name":"Default","price":12.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126737892/-/pom.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126737892/-/pom.jpg","width":570,"height":760}],"artists":[],"categories":[{"id":6548349,"name":"Other Hair","permalink":"other-hair","url":"/category/other-hair"}]},{"id":14517204,"name":"Annie Hall Charcoal Soap","permalink":"annie-hall-charcoal-soap","position":18,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/annie-hall-charcoal-soap","status":"active","on_sale":false,"created_at":"2013-10-30T20:50:18.000Z","description":"This soap is inspired by one of my all time favorite movies and by my sometimes oily skin, sometimes sensitive (ie crazy) skin. I use it about every other day. \r\n\r\nMy charcoal soap contains a high amount of activated charcoal, which is great for oily skin. Activated charcoal is known for its detoxifying properties. It has been said to unclog pores, and to remove impurities (think of the charcoal filter in your brita pitcher) and to remove surface dead skin cells.\r\n\r\nThis bar is unscented as not to aggravate already irritated skin. This listing is for a large bar, weighing roughly 5 ounces. I also have a smaller facial bar, which weighs around 2-3 ounces.\r\n\r\nSome nice things said recently about the bar: \r\n\r\nHi, I just received your items! Although I'm going to give them a shot on the morrow, I was so excited that I washed my face right away with the Annie Hall Charcol bar. I don't have Oily or Dry skin, but I am absolutely in love with the way my face feels right now. \r\n\r\nPS your charcoal soap kicks butt, compared to the LUSH charcoal soap!\r\n\r\n\r\nContains: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Purified Water, Sodium Hydroxide (saponifying agent), Activated Charcoal, Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein","options":[{"id":46996671,"name":"facial bar","price":6.0,"sold_out":false,"has_custom_price":false},{"id":46996674,"name":"body bar","price":9.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126791955/-/charcoal_soap.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126791955/-/charcoal_soap.jpg","width":570,"height":762}],"artists":[],"categories":[{"id":6548904,"name":"Facial, Body Soap","permalink":"facial-body-soap","url":"/category/facial-body-soap"}]},{"id":14517696,"name":"Moustache Wax for the Discerning Gentlemen","permalink":"moustache-wax-for-the-discerning-gentlemen","position":19,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/moustache-wax-for-the-discerning-gentlemen","status":"active","on_sale":false,"created_at":"2013-10-30T21:16:26.000Z","description":"This mustache wax is made of beeswax, castor oil, and vitamin e. \r\n\r\nNothing artificial, no crazy scents here. \r\n\r\nGuaranteed to keep your mustache shiny, happy, and exactly where you want it.","options":[{"id":46998210,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126735381/-/wax.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126735381/-/wax.jpg","width":570,"height":762}],"artists":[],"categories":[]},{"id":14518155,"name":"Bacon Soap","permalink":"bacon-soap","position":20,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/bacon-soap","status":"active","on_sale":false,"created_at":"2013-10-30T21:35:53.000Z","description":"So get this, vegan bacon soap. Oh the irony. \r\nPerfect for any bacon lover, this soap smells like the real deal- hickory smoked bacon. But not in a gross greasy way, more of a woodsy smoky scent. \r\nAlso available scented with vanilla, perhaps for that vegetarian friend that you swore you saw nibbling on bacon at brunch the other day...\r\n\r\nYou will receive four strips of bacon, in total about 4 oz of soap. \r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan","options":[{"id":46999557,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126736653/-/bacon.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126736653/-/bacon.jpg","width":570,"height":645}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14518299,"name":"Hey Girl Ryan Gosling Soap","permalink":"hey-girl-ryan-gosling-soap","position":21,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/hey-girl-ryan-gosling-soap","status":"active","on_sale":false,"created_at":"2013-10-30T21:41:25.000Z","description":"Hey girl I know how much you love the smell of my favorite tshirt so you can keep it. I was just out chopping some wood to build us a fire, and I drew you a bath with lavender oil because I know it is your favorite. I’ll shampoo your hair while you relax. I am also baking us some spice cookies. I know how you love my cookies. You know how I do.\r\n\r\nSo this “Blue Valentine” soap inspired by RyGo’s incredible hotness makes skin buttery soft. Made with super moisturizing shea butter, and scented how I believe Ryan would smell after chopping wood, building a fire, drawing a lavender bath, and mixing up some spiced cookies. It is incredible, believe me!! The next best thing to having his favorite tshirt. Or him.\r\n\r\nAnd ladies, when or your dude shower with it, close your eyes, and think of the notebook. Or Lars and the Real Girl, if that is your thing :)\r\n\r\nGreat gift for anyone who loves Ryan Gosling!\r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan","options":[{"id":46999956,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126737019/-/rygo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126737019/-/rygo.jpg","width":570,"height":760}],"artists":[],"categories":[{"id":6548904,"name":"Facial, Body Soap","permalink":"facial-body-soap","url":"/category/facial-body-soap"},{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14518371,"name":"David Bowie Soap","permalink":"david-bowie-soap","position":22,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/david-bowie-soap","status":"active","on_sale":false,"created_at":"2013-10-30T21:45:08.000Z","description":"So I've been meaning to make Bowie soap for quite a while. And this is the ONLY one I could find out there! \r\n\r\nSmells like Bowie: patchouli and baby powder, with a hint of goblin and sparkle. \r\n\r\nHandmade by me, as always. While watching Labyrinth. Dance magic dance...\r\n\r\n___________________________________________________________________________\r\n\r\nThis luxury soap is made with shea butter. It is extremely creamy and has a very silky lather. It is vegan and detergent free. The soaps are custom made for you, and weigh roughly 1.8 ounces each. Everyone that tries this soap falls in love with it! \r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan\r\n\r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.","options":[{"id":47000199,"name":"Default","price":12.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126737247/-/bowie.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126737247/-/bowie.jpg","width":570,"height":760}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14518446,"name":"Deep Conditioning Treatment Bar  ","permalink":"deep-conditioning-treatment-bar","position":23,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/deep-conditioning-treatment-bar","status":"active","on_sale":false,"created_at":"2013-10-30T21:47:30.000Z","description":"I have made this a limited edition item, only available after mid-September because of it's low melting point. It will be shipped in a plastic container- if it is soft when it reaches you pop it in the refrigerator for about 2 hours and it should firm right back up!\r\n\r\nThis is a deep conditioning bar made with cocoa butter, Hawaiian macadamia nut oil, Hawaiian kukui nut oil (I bought both of these oils when i was in Hawaii!), argan oil, vitamin E, and lovely fragrance oil that takes you straight to the beach. It is scrumptious. Dare I say it is one of my favorite products to date?\r\n\r\nThis bar is inspired by my recent trip to Hawaii. Many of the ingredients came from there too! There are so many wonderful sights and smells there, and I wanted to capture that in something that I needed in my day-to-day life. In the winter my hair can get pretty dry, so this bar was born.\r\n\r\nIt is very easy to use- the bar melts at body temperature so just rub it between the palms of the hands and coat ends of hair with the oil- then leave in for as long as you like, preferably half hour or longer. I have left it in overnight. Like so many of my products, I like to use them in different ways. So I use this as a pomade on dry ends as well as a body oil, on my hands, and it gives a great sheen to the legs. It can also be used as a massage oil. A little goes a long way. The smell is beyond fantastic- I can not stop sniffing myself, and many others have agreed that it is addictive! \r\n\r\nThe bar is roughly one ounce. In higher temperatures it may get a bit melty, so keep that in mind when storing it. You can put it in the fridge to firm it up a bit if needed. Also, if you have a nut allergy this likely is not for you. Thanks for looking!\r\n\r\n\r\nAnd a few wonderful customers had this to say about them, as well as some other products: \r\nI now have a new obsession with the Soapily fragrance oils! This seller really knows her stuff when it comes to quality perfumes - the most beautiful smells you could ever imagine. The lotion bar was fantastic and as always, the conditioner bars are perfect. But I must say, my most coveted product is the Deep Conditioning Bar. I can't get enough of the dreamy smell and the bar consistently leaves my hair feeling silky and manageable. There are numerous ways to use it. As a leave-in conditioner, silky pomade, and an awesome lotion for your hands and body. This bar is the BEST invention ever!\r\n\r\nThese little balls are AWESOME!!!! I just ♥ them!!!! Thanks so much!!! I wish you had a 16 oz jar of this stuff!!!! I slid a little across my c-section scar ( yes, I just had a baby) and the discomfort is relieved immediately. Leaves the rest of my body feeling soft and nourished, and my hair smells and looks wonderful!!! The smell is intoxicating...THX AGAIN!!\r\n\r\nMy family has been on my butt to go blonde again for my upcoming wedding. So finally I gave into the pressure and did it. Problem is, it FRIED my hair. . YOUR CONDITIONER IS AMAZING!!!!!\r\nMy hair and I thank you.\r\n\r\nwhen it's cold and snowy just close your eyes and sniff. I would not be surprised to find sand between my toes. This is a great product. Thanks\r\n\r\nOMG. The smell is intoxicating and it conditions like a dream. I cannot sing my praises loud enough. Everyone around me has heard about this stuff. Thank you sooo much.\r\n\r\nit smells soo good and is one of the best solid deep conditioners I have ever used! I will be getting more while this excellent product still is in stock. I have such soft yummy hair it smells great and feels really soft and fresh and feels really healthy. Fast shipping will be back without a doubt:) Absolutely love! Very moisturizing better than salon brand conditioners. Perfect for travel or home.","options":[{"id":47000388,"name":"Default","price":13.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126737415/-/deep_treat.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126737415/-/deep_treat.jpg","width":570,"height":760}],"artists":[],"categories":[{"id":6543567,"name":"Shampoo and Conditioner","permalink":"shampoo-and-conditioner","url":"/category/shampoo-and-conditioner"},{"id":6548349,"name":"Other Hair","permalink":"other-hair","url":"/category/other-hair"}]},{"id":14518548,"name":"Chill Pill Soap","permalink":"chill-pill-soap","position":24,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/chill-pill-soap","status":"active","on_sale":false,"created_at":"2013-10-30T21:51:22.000Z","description":"Take a chill pill, man. \r\n\r\nThese adorable soaps are scented with pure lavender essential oil, which does have a nice calming effect. This is a perfect stocking stuffer, gag gift, gift for a holiday exchange, guest soap, gift for a bride (or bridezilla), coworker, boss, you name it. \r\n\r\nThis luxury soap is made with shea butter. It is extremely creamy and has a very silky lather. It is vegan and detergent free. You will receive two (2) soaps, each soap weighs one ounce. Everyone that tries this soap falls in love with it! \r\n\r\nI encourage you to order now, the holidays can sneak up on you! \r\n\r\nI can also ship directly to the stressed out person in your life, please send me a conversation. \r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan","options":[{"id":47000580,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126737634/-/chill.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126737634/-/chill.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]},{"id":14518614,"name":"Dreidel Soap for Hanukkah ","permalink":"dreidel-soap-for-hanukkah","position":25,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/dreidel-soap-for-hanukkah","status":"active","on_sale":false,"created_at":"2013-10-30T21:54:05.000Z","description":"Celebrate 8 crazy nights of Chanukkah with this fun soap, shaped just like the dreidel we all remember playing! Great for children, teachers, friends, as party favors, a gift for your favorite Rabbi, or in a guest bathroom. \r\n\r\nYou get 4 blue dreidel soaps with the familiar scent of bazooka joe bubble gum that we all know and love! Priority shipped in the US. \r\n\r\n\r\nAll my soaps are formulated without:\r\n\r\n• Sulfates or Phthalates • Parabens or Formaldahydes \r\n• Animal bi-products or testing • GMO or Triclosan\r\n\r\nIf you would like a different scent and/or color, please convo me.\r\n\r\nINGREDIENTS: Coconut Oil, Palm Oil, Castor Oil, Safflower Oil, Glycerine (kosher, of vegetable origin), Shea Butter, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (from berries, moisturizer), Sorbitan Oleate (botanically sourced emulsifier), Soybean Protein, Titanium Dioxide (mineral whitener used in opaque soaps), Fragrance and/or Essential Oil, Colorant.","options":[{"id":47000745,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126737760/-/dreidel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126737760/-/dreidel.jpg","width":570,"height":763}],"artists":[],"categories":[{"id":6549312,"name":"Cutesy Soap","permalink":"cutesy-soap","url":"/category/cutesy-soap"}]}]