[{"id":10484476,"name":"Miss November/Khmer Calendar","permalink":"miss-november","position":1,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/miss-november","status":"active","on_sale":false,"created_at":"2013-04-11T15:08:02.000Z","description":"Channa\r\nBorn in November at seven months prematurely, Channa was destined to be Miss November. Although Channa is 1st generation Khmer American, she takes total pride of her culture and the traditions. Started at an early age, she has always been interested in her own culture specifically the Arts Academy. Luckily for her, she had a grandfather who was a master musician by the name of Yinn Ponn. He led the Long Beach-based Pin Peat orchestra for many years before his passing. Channa was recruited by her grandfather to play a simple instrument called the “Chun”. She performed with her grandfather and his orchestra for several years before finding other interests. It was during her orchestra days that she grew to love her culture mainly through arts.\r\n \r\nNow in her adult life, Miss November has accomplished many goals that would make us proud to call her Khmer. She is an Alumni of the University of Phoenix Online with three college degrees under her belt. She finished off her last program in October 2011 receiving her Masters in Criminal Justice. While her 7 years in Phoenix, she continued her love for art by dancing for a company called Encore Dance Center, EDC. She enjoyed performing at many charity events all over the Valley with her solid team. Since becoming a mom, she has retired from dance and is now a fitness enthuses. Applying the same drive she has for life into her workouts, she is showing no signs of every having a baby. We are proud to have Channa as our Miss November.","options":[{"id":32842867,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/103062760/-/November-Watermark.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/103062760/-/November-Watermark.jpg","width":1000,"height":773}],"artists":[],"categories":[]},{"id":10484398,"name":"Miss. September/Khmer Calendar","permalink":"miss-september","position":2,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/miss-september","status":"active","on_sale":false,"created_at":"2013-04-11T15:02:36.000Z","description":"Born in the city by the Bay, San Francisco California, Our Miss September \"Neary\" was raised in Long Beach Ca. She is currently a college student pursuing a Bachelor's in nursing. In her spare time she likes to design and sew her own dresses. She credits her upbringing to her supportive Khmer family and great friends. A southern California girl who is full of life, her favorite quote from her sister is \"there is never a dull moment with us\"","options":[{"id":32842393,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/103058212/-/September-Watermark.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/103058212/-/September-Watermark.jpg","width":1000,"height":773}],"artists":[],"categories":[]},{"id":10429111,"name":"Miss. April of Khmer Calendar","permalink":"miss-april","position":3,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/miss-april","status":"active","on_sale":false,"created_at":"2013-04-09T00:58:05.000Z","description":"Jessica (Jess) \r\nWith April being the most important month on the Khmer Calendar, choosing Miss April was no easy task. In the hunt for our perfect Miss April, we wanted someone whose looks went beyond mere beauty; someone who can hold her own; someone who gives as much as she takes. Someone who is as strong as the city’s buildings she lived in, but yet also soft and gentle as the rice fields and palm trees that resembles the same country her parents are from.\r\n\r\nA girl who is (at first glance) American as hamburgers and fries; however, within her core – where her heart is, her DNA screams Khmer. Our perfect Miss April 2013-2014 carries herself with the strength of a Khmer woman.  Born in Portland, ME and resided in Long Beach, CA at the age of 5,  Miss April has always been one to test the waters and take risks.  She experienced this first hand growing up with a really strict father.  No nail polish and no makeup as a teen, but now her skills in those areas are impeccable. Miss April developed a big appetite for tattoos as a teenager and enjoys doing makeup and hair on her spare time. She stands for what she believes in and has no problem voicing her opinion. Her friends say she's been misjudged by many based on her appearance, but truly she's an old fashion kinda gal who's wholesome, genuine and a hopeless romantic who enjoys quiet nights at home. She currently manages an office in Huntington Beach for 7 years and works at a night bar in Gardena. Jessica’s work ethics and beauty combined makes up an admirable Khmer woman.","options":[{"id":32662579,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/102567136/-/April-Watermark.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/102567136/-/April-Watermark.jpg","width":1000,"height":773}],"artists":[],"categories":[]},{"id":10428862,"name":"Our Cover Girl, Miss August","permalink":"our-cover-girl-mrs-august","position":4,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/our-cover-girl-mrs-august","status":"active","on_sale":false,"created_at":"2013-04-09T00:40:22.000Z","description":"Paula a Long Beach Native with Khmer DNA\r\nOur Cover girl was born in America to parents who were Survivors of the  Killing Fields and Concentration Camps of Cambodia. Because of her parents struggles she has never forgotten her heritage. She is proud of her Khmer culture. \r\nPaula is as smart as she is beautiful, a collage grad with lips and hips to die for. A hard working career girl with beauty and brains, she represents the ideal modern Khmer American woman of this generation. And that is  why she is our Cover Girl","options":[{"id":32661778,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/102565876/-/August-Watermark.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/102565876/-/August-Watermark.jpg","width":1000,"height":773}],"artists":[],"categories":[]},{"id":10428814,"name":"The ladies of Khmer Calendar","permalink":"the-ladies","position":5,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/the-ladies","status":"active","on_sale":true,"created_at":"2013-04-09T00:37:25.000Z","description":"A Calendar for 2013-2014 with a Khmer theme, which starts the Year in April 2013 and ends it in April 2014... \r\nWhat you are getting when you purchase this Calendar is a dream that became an obsession, turned into an idea, and now with the help of some very strong and beautiful Khmer woman, became a reality. Part of the proceeds from the sale of this Calendar will go towards Cambodian Fine Arts Heritage Relief Foundation (a non profit organization that teaches little boys and girls ancient dances from our country)","options":[{"id":32661682,"name":"buy for2 for $30 or 3 for $40","price":19.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/102566128/-/March-Watermark.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/102566128/-/March-Watermark.jpg","width":1000,"height":773}],"artists":[],"categories":[]}]