[{"id":199555,"name":"Leere Vodkaflasche","permalink":"leere-vodkaflasche","position":1,"price":22.99,"default_price":22.99,"tax":0.0,"url":"/product/leere-vodkaflasche","status":"active","on_sale":true,"created_at":"2008-12-08T14:21:52.000Z","description":"Einfacher Text\r\n\r\nSie erinnern sich. Der Blindtext-Fall im vorigen Jahr. Nun will Karl noch nach Canossa. Und Claudia heiratet zur Busse Copperfield. Jeden Morgen entzünden sie eine Kerze. Jeden Nachmittag ist eine Runde Rosenkranz fällig. Zur Heiligen Marie. Weil Karl mit dem Zopf der Claudia mit dem Smile optisch nette Koran-Typo aufs Mieder hat sticken lassen. Heiliger Blindtext am Busen.\r\nBumm. Da läßt der Mullah nicht mit sich scherzen. Blindtext killt Chanel, Islam erklärt Karl den Krieg, das Abendland zittert. Der Blindtext-Fall ist geboren. Die Geschichte des Blindtextes und seiner Texter wird aufgeblättert. Endlich. Was wissen Sie über Blindtext? Katholischen nimmt man für Kochbücher, evangelischen für Bauhausmöbelprospekte, hebräischer wird in Hollywood verfilmt, atheistischer ist für Procter & Gamble Waschmittel, arabischer ist nicht. Und weiter? Zu wem beten Karl und Claudia jeden Tag als Buße für ihre Blindtext-Sünde? Zu ihr. Zur Heiligen Marie Antoinette. Madame ging schön aufs Schafott. Welch eine Haltung. Sie weiß, sie kriegt den Kopf ab. Aber vorher pudert sie ihn noch, beißt sich auf die Lippen von wegen Lippenrot, kneift sich in die Wangen von wegen Wangenrot. Und sie weiß, sie wird den Kopf verlieren. Oben ab. Und es stört die Marie nicht. Diese Haltung verehren die Blindtexter. Du weißt, du wirst gecuttet. Aber du gibst alles. Sainte Marie, steh uns bei. The english call it the holy attitude of SM.\r\nDes Blindtexters Heiliges Tier ist das Schwein. Es atmet und furzt, frißt und säuft, um verwurstet zu werden. Wie ähnlich doch dem Blindtext, der nur entsteht, um zerlegt zu werden. Was sagt der Art Director zu Faust? ... denn alles, was entsteht, ist wert, daß es zugrunde geht ...","options":[{"id":884282,"name":"Default","price":22.99,"sold_out":false,"has_custom_price":false},{"id":884283,"name":"01","price":22.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1364389/-/ralf-02-fun.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1364389/-/ralf-02-fun.jpg","width":600,"height":800}],"artists":[],"categories":[{"id":179863,"name":"Ohne Alkohol","permalink":"ohne-alkohol","url":"/category/ohne-alkohol"}]}]