[{"id":106773,"name":"The Contents of a Searching Mind","permalink":"the-contents-of-a-searching-mind","position":1,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/the-contents-of-a-searching-mind","status":"active","on_sale":true,"created_at":"2008-05-23T09:44:06.000Z","description":"The Contents of a Searching Mind is about growing up, living life, being confused and searching for understanding. This is a book that almost anyone can relate to. It is told through journal entries, poetry, song lyrics and letters and stories. We all have a past and it made us who we are, but it does not have to define what we will become. The Contents of a Searching Mind is a journey through the mind of Jordan Elliott Perili and the life he has lived as he sees it. This is his first published work and it is not going to be his last. Here is an excerpt from the book that will probably give you a better general idea of what it is about: \r\n\r\n<i>“I didn’t write the life I’ve lived; my life wrote me. I am not a writer; I am a piece of literature. My skin cells turn like the pages in a book. My eyes are the covers to my life, like a library of references. My words are spoken in fonts and letters and punctuation and faulty grammar. My mouth is like a typewriter that is slowly running out of ink. The paper is jammed and I am not quite sure how to fix it. \r\n\r\nMy mind is a broken compass in search of a new direction. \r\nMy heart plays like the ribbon in a cassette tape. Sometimes it gets tangled in the spindle encased in plastic. Side A is done, as the tape flips over. Side B seems to be speaking through cracked lips. My feet connect to the ground like a subway train on steel rails; I am electric. I am a slave to my minds daily commuters; thoughts.”</i>\r\n\r\nThe Contents of a Searching Mind is the story of someone searching for what it truly means to be alive. \r\n\r\n","options":[{"id":525235,"name":"Default","price":13.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/518926/-/flyer-for-store.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/518926/-/flyer-for-store.jpg","width":275,"height":343}],"artists":[],"categories":[]}]