[{"id":3258677,"name":"Custom 12\" Waldorf Doll Designed by You!","permalink":"custom-12-waldor-doll-designed-by-you","position":1,"price":125.0,"default_price":125.0,"tax":0.0,"url":"/product/custom-12-waldor-doll-designed-by-you","status":"active","on_sale":false,"created_at":"2011-02-09T05:16:52.000Z","description":"This doll is just an example of what your special creation could look like.  I'd love to work with you to create a one of kind 12\" doll to your specifications.  All dolls are made from 100% cotton interlock and stuffed with pure clean wool. Their wool hair is part of a crochet cap that is securely stitched to the doll's head for durablity. Typically several types of yarn are used for each doll and accent pieces are added for that finishing touch. The features are embroidered with DMC threads. All dolls come with a custom outfit (shirt and pants OR dress and leggings AND shoes) unless indicated. Clothing is easy for little hands to take on and off. Dolls are reccomended for children 3 and over, use your discretion. Dolls will arrive in a cloth bag with care instructions. Freckles or beeswax blush can be added to any doll at no additional charge. Message me with your specifications (colors, gender, hair, eyes, skin, clothing). Please contact me with any questions. Thank you for looking!\r\n\r\nPlease click on \"All About Chamomile Creations\" in the right column for additional information.","options":[{"id":11086525,"name":"Default","price":125.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":13.0,"amount_with_others":8.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31625045/-/ChamomileJanuary2011_bike.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31625045/-/ChamomileJanuary2011_bike.jpg","width":728,"height":1000}],"artists":[],"categories":[{"id":1876831,"name":"Crumpettes","permalink":"crumpettes","url":"/category/crumpettes"}]},{"id":3258609,"name":"12\" Waldorf Boy Doll: Shamrock Sweetie","permalink":"12-waldorf-boy-doll-shamrock-sweetie","position":2,"price":100.0,"default_price":100.0,"tax":0.0,"url":"/product/12-waldorf-boy-doll-shamrock-sweetie","status":"active","on_sale":false,"created_at":"2011-02-09T04:58:03.000Z","description":"I handcrafted this sweet Waldorf Doll from 100% cotton fabrics and pure clean wool. He would be a perfect gift for someone special with a March birthday!  I also think he would look super cute in an Easter Basket.   His head is hand sculpted and embroidered with durable DMC threads. His funky wool hair is part of a crochet cap that is carefully stitched to her head and embellished with two additonal kinds of yarn and hand styled. He'll arrive wearing a white ribbed undershirt, shamrock print matinee jacket, custom embroidered vintage denim jeans, and green felt boots. All clothes are easy for little ones to take on and off. Reccomended for ages 3 and over. Arrives packaged in cloth bag with care instructions. Purchase includes surprise accessory!\r\n\r\nPlease click on \"All About Chamomile Creations\" in the right column for shipping and custom order information.  Thank you for looking!","options":[{"id":11086337,"name":"Default","price":100.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31624269/-/body.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31624269/-/body.JPG","width":1000,"height":996}],"artists":[],"categories":[{"id":1876831,"name":"Crumpettes","permalink":"crumpettes","url":"/category/crumpettes"}]},{"id":3254105,"name":"16\" Waldorf Doll: Cupcake Cutie with Mix and Match Wardrobe","permalink":"16-waldorf-doll-cupcake-cutie-with-mix-and-match-wardrobe","position":3,"price":129.0,"default_price":129.0,"tax":0.0,"url":"/product/16-waldorf-doll-cupcake-cutie-with-mix-and-match-wardrobe","status":"active","on_sale":true,"created_at":"2011-02-08T10:29:40.000Z","description":"I handcrafted this sweet Waldorf Doll from 100% cotton fabrics and pure clean wool.  She would be a perfect birthday gift for someone special!  Her head is hand sculpted and embroidered with durable DMC threads.  Her funky wool hair is part of a crochet cap that is carefully stitched to her head and embellished with two additonal kinds of yarn.  It is finger combable and easy to style in braids, ponytails, pigtails...use your imagination!  She'll arrive wearing her 6 piece mix and match wardrobe.  Her 100% cotton wardrobe includes pink undies, lavender leggings, cupcake print twirl skirt, green sleeveless shirt with custom cupcake applique, vintage pink chenille cardigan sweater, and black suede boots.  All clothes are easy for little ones to take on and off.  Reccomended for ages 3 and over.  Arrives packaged in cloth bag with care instructions.  Purchase includes surprise accessory!\r\n\r\nPlease click on \"All About Chamomile Creations\" in the right column for shipping and custom order information.  Thank you for looking!","options":[{"id":11072529,"name":"Default","price":129.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":14.0,"amount_with_others":10.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31578289/-/DONE.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31578289/-/DONE.JPG","width":1000,"height":996}],"artists":[],"categories":[{"id":1876829,"name":"ChamomileKids","permalink":"chamomilekids","url":"/category/chamomilekids"}]}]