[{"id":15563904,"name":"AdvoCare Spark Energy Drink","permalink":"advocare-spark-energy-drink","position":1,"price":51.95,"default_price":51.95,"tax":0.0,"url":"/product/advocare-spark-energy-drink","status":"active","on_sale":false,"created_at":"2013-12-15T00:29:50.000Z","description":"AdvoCare Spark® Energy Drink mix is a unique multi-nutrient system that's designed to provide nutritionally advanced, long-lasting energy and enhanced mental focus.* Its 21 vitamins, minerals and nutrients work synergistically to give you healthy, balanced energy without making you jittery like other caffeinated beverages.*\r\n\r\nSpark's unique combination of ingredients gives you fast-acting energy and B-vitamins enhance your body's natural energy-sustaining processes.*\r\n\r\nFor mental focus and clarity, the neuroactive amino acids in Spark help sharpen your mental focus and alertness by supporting your brain's ability to efficiently transmit messages within the nervous system.* With seven refreshing flavors and only 45 calories per serving, Spark gives you a lift that lasts for hours.*\r\n\r\nIs this you?\r\n\r\nSomeone who has trouble waking up or feels \"energy slumps\" throughout the day\r\nSomeone who can't work up enough energy to live life the way you want\r\nSomeone who is looking for a more nutritious alternative to coffee, soda or other energy drinks\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•Blend, shake or stir contents of one pouch or level scoop into 8 fluid ounces of water or the beverage of your choice.\r\n•For a pitcher, stir four scoops into 32 fluid ounces of water or the beverage of your choice.\r\n•Consume 1 to 3 times per day, preferably between meals.\r\n\r\n\r\nCaution: Children and pregnant or nursing women should consult a healthcare professional prior to use.\r\n\r\nNot for use by persons who are sensitive to caffeine or choline.\r\nKEY INGREDIENTS\r\n\r\nB-vitamin complex (thiamine, riboflavin, niacin, vitamin B-6, vitamin B-12 and pantothenic acid), taurine, L-tyrosine, choline, caffeine, GABA (gamma-aminobutyric acid)","options":[{"id":50617257,"name":"Cannister/Cherry","price":51.95,"sold_out":false,"has_custom_price":false},{"id":50617260,"name":"Cannister/Citrus","price":51.95,"sold_out":false,"has_custom_price":false},{"id":50617263,"name":"Cannister/Fruit Punch","price":51.95,"sold_out":false,"has_custom_price":false},{"id":50617266,"name":"Cannister/Grape","price":51.95,"sold_out":false,"has_custom_price":false},{"id":50617269,"name":"Cannister/Mandarin Orange","price":51.95,"sold_out":false,"has_custom_price":false},{"id":50617272,"name":"Cannister/Strawberry Mango","price":51.95,"sold_out":false,"has_custom_price":false},{"id":50617275,"name":"Cannister/Pink Lemonade","price":51.95,"sold_out":false,"has_custom_price":false},{"id":50617278,"name":"Cannister/Watermelon","price":51.95,"sold_out":false,"has_custom_price":false},{"id":50619648,"name":"Pouches/Cherry","price":22.95,"sold_out":false,"has_custom_price":true},{"id":50619651,"name":"Pouches/Citrus","price":22.95,"sold_out":false,"has_custom_price":true},{"id":50619669,"name":"Pouches/Fruit Punch","price":22.95,"sold_out":false,"has_custom_price":true},{"id":50619666,"name":"Pouches/Grape","price":22.95,"sold_out":false,"has_custom_price":true},{"id":50619663,"name":"Pouches/Mandarin Orange","price":22.95,"sold_out":false,"has_custom_price":true},{"id":50619660,"name":"Pouches/Strawberry Mango","price":22.95,"sold_out":false,"has_custom_price":true},{"id":50619657,"name":"Pouches/Pink Lemonade","price":22.95,"sold_out":false,"has_custom_price":true},{"id":50619654,"name":"Pouches/Watermelon","price":22.95,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":7.95,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129403128/-/A2095.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129403128/-/A2095.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15575196,"name":"Advocare Muscle Fuel","permalink":"advocare-muscle-fuel","position":2,"price":42.95,"default_price":42.95,"tax":0.0,"url":"/product/advocare-muscle-fuel","status":"active","on_sale":false,"created_at":"2013-12-15T19:22:27.000Z","description":"AdvoCare® Muscle Fuel is a unique, single-product solution that supports multiple muscle metabolic processes and helps maintain and restore energy during and after physical activity.* Its 28 vitamins, minerals, botanicals and other energy-producing intermediates synergistically enhance physical performance and endurance.* It also supplies essential muscle-gaining components during and after physical activity, helps reduce oxidative stress, facilitates workout recovery, maximizes training benefits, and helps you take your workout to the next level.* And it contains essential nutrients to fight age-related muscle atrophy.* \r\n\r\nIs this you?\r\nSomeone who wants to gain the most benefit from your workouts \r\nAn athlete who wants optimal support for sports performance \r\nSomeone who wants to further enhance physical performance and endurance \r\nSomeone who wishes to slow age-related muscle atrophy\r\nDIRECTIONS\r\n\r\n•For ages 18 and older.\r\n•Blend, shake or stir the contents of one pouch into 8 fluid ounces of water. May adjust water to suit taste.\r\n•Consume 15-30 minutes prior to exercise or strenuous activity.\r\n\r\nCAUTION: This product is not intended for women who are pregnant or nursing or for those under 18 years of age.\r\nKEY INGREDIENTS\r\n\r\nCreatine, D-ribose, calcium pyruvate, L-arginine, glycine, L-citrulline, vitamin A, vitamin C, vitamin B-12, folic acid, pantothenic acid (B-5), magnesium, zinc, chromium, sodium, potassium, green tea extract, caffeine \r\n\r\nCAUTION: This product is not intended for women who are pregnant or nursing or for those under 18 years of age.","options":[{"id":50662494,"name":"10 Servings","price":42.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129431514/-/P4422.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129431514/-/P4422.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15564567,"name":"Rehydrate","permalink":"rehydrate","position":3,"price":57.95,"default_price":57.95,"tax":0.0,"url":"/product/rehydrate","status":"active","on_sale":false,"created_at":"2013-12-15T01:21:54.000Z","description":"Rehydrate Electrolyte Replacement Drink provides the necessary nutrients to maintain proper metabolism and delay the onset of fatigue. It hydrates your body by re-establishing your electrolyte balance with its superior formulation. Rehydrate Drink has a low glycemic index that produces a more gradual insulin response and is isotonic, thus providing rapid gastric emptying and rapid rehydration. Furthermore, this drink helps support the body’s energy cycle and provides carbohydrate fuel necessary for energy production.\r\n\r\nUnlike other sports drinks, Rehydrate Electrolyte Replacement Drink includes antioxidants, carbohydrates, electrolytes, a powerful patented ingredient known as Sustamine™ and other nutrients that effectively promote optimal hydration and recovery. Rehydrate Drink has a 1:1 ratio of sodium and potassium, two of the most vital electrolytes that are lost when we sweat. Rehydrate Drink helps prevent cramping by providing calcium, magnesium and L-glutamine to support the contraction and relaxation phases of the muscles.\r\n\r\nSustamine™ (L-Alanyl-L-Glutamine) \r\nSustamine is a dipeptide of the amino acids, L-alanine and L-glutamine. This dipeptide enhances electrolyte and water absorption as well as promoting higher serum bioavailability and absorption of L-glutamine, compared to L-glutamine alone. It plays an important role in enhancing the immune system, muscle protein synthesis and energy production through gluconeogenesis. \r\nThis amazing sports drink also helps sustain carbohydrate energy by including chromium in its unique formulation, strengthening endurance at any activity level. Furthermore, the antioxidants in Rehydrate Drink help fight the effects of free radicals, and the amino acids support blood flow throughout the cardiovascular system. Rehydrate Electrolyte Replacement Drink provides a complete spectrum of ingredients for hydration that far exceeds other leading sports drinks, making it a superior choice for the serious or casual athlete.\r\n\r\nThe updated formula now has just 40 calories, fewer carbohydrates and improved solubility, making it easier to mix on the go.\r\n\r\nIS THIS YOU? \r\n•Someone who wants to sustain hydration and energy during physical activity \r\n•Someone who wants a superior sports drink \r\n•Someone who wants to enhance your exercise regimen \r\n•Someone who wants a healthy drink for everyday use \r\nDIRECTIONS\r\n\r\n•For ages 4 and older.\r\n•To prepare, shake or stir contents of one pouch or scoop into 8 fluid ounces of water.\r\n•Drink liberally before, during and after physical activity.\r\nKEY INGREDIENTS\r\n\r\nL-arginine, calcium, magnesium, sodium, potassium, chromium, thiamine (B-1), Sustamine™\r\n\r\n(Sustamine™ is a registered trademark of Kyowa Hakko Bio Co., Ltd. www.sustamine.com\r\n","options":[{"id":50619804,"name":"Cannister/Fruit Punch","price":57.95,"sold_out":false,"has_custom_price":false},{"id":50619807,"name":"Cannister/Mango Pineapple","price":57.95,"sold_out":false,"has_custom_price":false},{"id":50619810,"name":"Pouches/Fruit Punch","price":19.95,"sold_out":false,"has_custom_price":true},{"id":50619813,"name":"Pouches/Mango Pinapple","price":19.95,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":7.95,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129404952/-/A2414.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129404952/-/A2414.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15564654,"name":"Rehydrate Gel","permalink":"rehydrate-gel","position":4,"price":21.95,"default_price":21.95,"tax":0.0,"url":"/product/rehydrate-gel","status":"active","on_sale":false,"created_at":"2013-12-15T01:27:46.000Z","description":"Rehydrate Gel is an electrolyte replacement energy gel designed to help you enjoy activity at your highest level. With a light lemon flavor and just 80 calories, this portable pouch is easy to use and carry during the most strenuous exercise. Whether you want to boost, replenish or recover, Rehydrate Gel provides the electrolytes and carbohydrates you need to help you get the most out of any run, workout, swim or ride. \r\n\r\nElectrolyte balance is crucial when enduring intense physical activity. Rehydrate Gel releases Sequential Carbs, which are carbohydrates your body uses in three stages, allowing you to benefit from immediate and sustained energy. \r\n\r\n1.Boost your energy before a strenuous or enduring activity to get a great head start. It’s always best to minimize the chances of your body being depleted of valuable nutrients by staying ahead. \r\n2.Replenish your body during exercise to achieve your best effort. Take Rehydrate Gel during activity to replace the electrolytes and carbs that have been burned.\r\n3.Recover efficiently. Recovery is vital for endurance athletes and important for anyone who lives an active lifestyle.\r\nIS THIS YOU? \r\n•Endurance athletes (runners, cyclists, swimmers, triathletes, etc.)\r\n•Team sport athletes (baseball, soccer, tennis, basketball, etc.)\r\n•Anyone desiring a great source of electrolytes and carbohydrates\r\nDIRECTIONS\r\n\r\nBoost - 1 pouch 15 minutes before activity \r\nReplenish - 1-2 pouches for every hour of activity \r\nRecover - 1 pouch immediately after activity \r\n\r\nAlways drink plenty of water when exercising.\r\nKEY INGREDIENTS\r\n\r\nMagnesium, Sodium, Potassium, L-Glutamine\r\n","options":[{"id":50620044,"name":"10 Servings","price":21.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.95,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129405099/-/A1403.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129405099/-/A1403.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15575148,"name":"Post Workout Recovery","permalink":"post-workout-recovery","position":5,"price":49.95,"default_price":49.95,"tax":0.0,"url":"/product/post-workout-recovery","status":"active","on_sale":false,"created_at":"2013-12-15T19:20:06.000Z","description":"Post-Workout Recovery Sports Drink contains more than 30 vitamins, minerals and other nutrients that support the muscles' metabolic processes in recovery and helps minimize occasional soreness after workouts. Post-Workout Recovery combines the muscle-supporting nutrition used by hundreds of professional and world-class athletes across the United States. Post-Workout Recovery helps enhance physical performance and endurance while supplying essential components for muscle repair and gain during and after physical activity. The unique blend of high-quality protein combined with glucose polymers and other carbohydrates, gives the body energy and structural support. \r\n\r\nPost-Workout Recovery also contains branched-chain amino acids to support muscle recovery, growth and endurance. Finally, the antioxidants present in this advanced sports drink help the body ward off free radicals that are commonly produced as a result of exercise. \r\n\r\nIs this you?\r\nSomeone who wants to minimize the soreness experienced after exercising \r\nSomeone who is looking for better muscle recovery \r\nSomeone who wants to enhance your current exercise and/or weightlifting program \r\nSomeone who wants to gain lean muscle mass\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•Blend, shake or briskly stir contents of one pouch into 10 fluid ounces of water or the beverage of your choice.\r\n•For short-term recovery, consume within one hour following a workout.\r\n•For long-term recovery, consume in the evening.\r\n•For additional benefit, consume Post-Workout Recovery Sports Drink within one hour before a workout.\r\nKEY INGREDIENTS\r\n\r\nSoy protein powder, branched-chain amino acids (BCAA), chromium, casein (modified), medium-chain triglycerides, creatine, gamma-oryzanol, vanadium (vanadyl sulfate), calcium, magnesium, zinc, sodium, potassium, eleuthero root, carbohydrates\r\n\r\nEndorsers\r\n \r\nSteve & Deb Manni \r\nJason Witten\r\nJason Witten Aric Almirola\r\nAric Almirola Catherine Whitehill\r\nCatherine Whitehill Ryan Tannehill\r\nRyan Tannehill \r\n \r\n  \r\n","options":[{"id":50662359,"name":"Pouches/Chocolate","price":49.95,"sold_out":false,"has_custom_price":false},{"id":50662362,"name":"Cannister/Chocolate","price":79.95,"sold_out":false,"has_custom_price":true},{"id":50662365,"name":"Cannister/Vanilla","price":79.95,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129431208/-/P3361.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129431208/-/P3361.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15574959,"name":"Pro 20","permalink":"pro-20","position":6,"price":37.95,"default_price":37.95,"tax":0.0,"url":"/product/pro-20","status":"active","on_sale":false,"created_at":"2013-12-15T19:09:56.000Z","description":"Pro 20 is a well-rounded, superior liquid protein and amino acid supplement.* And, it's not just any protein. The 3 oz. bottle is packed with 20 grams of soluble hydrolyzed protein, which the body can absorb quickly, to support lean muscle mass.*\r\n\r\nUnlike many protein supplements, Pro 20 provides 200 mg of Alpha-GPC, helping increase strength, speed, agility, reaction time, and power and performance.* With just 140 calories, Pro 20 is also packed with B vitamins and electrolytes. The convenient and fast delivery of these superior ingredients facilitates recovery, helping provide increased, sustained energy.* Pro 20 can be used as a pre-workout supplement as well as a recovery product.\r\n\r\nIS THIS YOU?\r\n•Someone who has a busy lifestyle and tight schedule, and needs protein quickly\r\n•Someone looking for a convenient way to take protein before or after a workout\r\n•Someone who needs supplemental consumption of protein that can be taken at any time\r\n•Someone who needs support for lean muscle mass\r\nDIRECTIONS\r\n\r\nDrink one or two bottles per day to supplement your daily protein and calorie needs. Shake gently and drink one before or after your workout to help support recovery and muscle building. Do not exceed three servings per 24 hour period. May be served chilled.\r\n\r\nRefrigerate after opening. For maximum freshness, store product in a cool place.\r\n\r\nNotice: Pregnant or nursing women should consult a healthcare professional prior to use. This product is not intended for those under 18 years of age.\r\nKEY INGREDIENTS\r\n\r\nVitamins B6, B12, A, alpha-GPC, citrulline, L-leucine, sodium, potassium, magnesium, hydrolyzed collagen and whey protein","options":[{"id":50661912,"name":"8 servings","price":37.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129430902/-/P1094.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129430902/-/P1094.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15575253,"name":"Arginine Extreme","permalink":"arginine-extreme","position":7,"price":61.95,"default_price":61.95,"tax":0.0,"url":"/product/arginine-extreme","status":"active","on_sale":false,"created_at":"2013-12-15T19:24:58.000Z","description":"Arginine Extreme combines a substantial amount of L-arginine with other amino acids, B-vitamins and related nutrients scientifically designed to contribute to the body's production of nitric oxide and muscle support.* This unique combination of powerful nutrients nourishes the growth of lean muscle tissue in conjunction with an exercise program and provides targeted nutritional support for the vascular, cardiovascular, reproductive and immune systems.* For athletes and exercisers, great-tasting Arginine Extreme is a premier pre-workout supplement that can help magnify the results of strength training by providing nutrient-delivery support directly to the muscles.* With 2 1/2 grams of L-arginine per serving, plus L-leucine, another important amino acid, you can get better endurance in the weight room and improved stamina during cardio workouts.* Use it with the rest of the Performance Elite product line, especially AdvoCare® Muscle Fuel to help further enhance your results by supporting longer, more vigorous workouts.* \r\n\r\nBut Arginine Extreme isn't just for athletes. Because it feeds the vascular system with many of the nutrients it needs to perform at its best, Arginine Extreme provides cardiovascular nourishment and excellent immune support.* As nitric oxide levels increase, healthy blood flow is easier to maintain. In fact, the ingredients in Arginine Extreme have been shown to help support healthy blood pressure levels and cholesterol levels already in the normal ranges.* \r\n\r\nIs this you?\r\nSomeone who wants to increase the effectiveness of your workouts \r\nAn athlete looking for increased muscle endurance and tolerance\r\nSomeone concerned with your cardiovascular health\r\nSomeone looking for increased support for aerobic activity\r\nDIRECTIONS\r\n\r\nShake or stir the contents of one scoop into 8 fluid ounces of water or the beverage of your choice. For enhanced athletic performance*, consume on an empty stomach 30 minutes before exercise. May take up to three servings per day or at one time. For general health, wellness and cardiovascular support*, consume one scoop two to three times per day. For ages 18 and older.\r\nKEY INGREDIENTS\r\n\r\nL-arginine, L-leucine, L-glutamine, riboflavin, niacin, vitamin B-6, folic acid, biotin, glycine, betaine, taurine \r\n\r\nCAUTION: This product is not intended for pregnant or nursing women or for children under 18 years of age. This product is not for use by persons who are cancer patients or person who have had ocular or brain herpes. High dietary levels of arginine may cause reactivation of latent herpes virus in a few susceptible individuals. If this occurs, discontinue use. \r\n\r\nNOTE: Excessive use of this product may cause flatulence or diarrhea in sensitive individuals.","options":[{"id":50662713,"name":"40 servings","price":61.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129431625/-/P2500.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129431625/-/P2500.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15564750,"name":"O2 Gold Advanced","permalink":"o2-gold-advanced","position":8,"price":38.95,"default_price":38.95,"tax":0.0,"url":"/product/o2-gold-advanced","status":"active","on_sale":false,"created_at":"2013-12-15T01:35:01.000Z","description":"The unique blend of proteins and herbal extracts that comprise the formula for O2 Gold Advanced supplement is specially designed to support, facilitate and enhance a person’s daily physical activities.* O2 Gold Advanced supplement’s powerful ingredients work in combination to help individuals get the most from their activities by optimizing the body’s use of oxygen.* For example, O2 Gold Advanced supplement contains key adaptogens, including an increased amount of Rhodiola rosea, that help increase the resistance to certain types of physical, mental and chemical stress, as well as help optimize many body functions.* Eleuthero root (also known as Siberian ginseng) and golden root extracts found in O2 Gold Advanced supplement have specifically demonstrated impressive restorative properties, as well as the ability to support the body’s immune system.* More notably, these adaptogens have been shown to facilitate oxygen transport, which increases the capacity for physical exertion and for countering the effects of free radicals.*\r\n\r\nBeetroot extract has been added to the O2 Gold Advanced supplement as there is growing research showing that beetroot extract helps to improve physical performance.* \r\n\r\nIn conjunction with the powerful adaptogens, other ingredients in O2 Gold Advanced supplement are involved in the regeneration of adenosine triphosphate (ATP).* Muscle activity is fueled in part by ATP. When the body’s reserve of ATP is depleted, it loses energy and strength. Inosine appears to work by making ATP last longer, thereby providing a safe and effective way to enable the body to utilize oxygen more efficiently.* The result is greater strength, energy, stamina and lean body mass.* The enzyme hydrolyzed whey proteins in O2 Gold Advanced supplement provide the rich source of amino acids and protein that the muscles require for growth and strength.* Enzyme-hydrolyzed whey proteins have had their molecular chains partially disassembled by enzyme actions as a part of the manufacturing process prior to use as an ingredient. This added manufacturing step greatly facilitates digestion of the whey proteins after consumption, speeding up their availability to the body’s metabolic processes and thus speeding the positive results of O2 Gold Advanced supplement.*\r\n\r\nWith its unparalleled formulation, O2 Gold Advanced supplement is an excellent solution for greater energy, endurance and vitality whether you’re a marathon runner, a busy parent or both.* Serious athletes will notice the differences that O2 Gold Advanced supplement brings to their regimen, and casual users will notice the refreshing lift to their energy and liveliness.* Most importantly, O2 Gold Advanced supplement helps you maximize oxygen usage in your body so that you can feel better and perform better.*\r\n\r\nIS THIS YOU? \r\n•Someone who needs to boost your physical activity level\r\n•A casual or elite athlete looking to enhance your training program\r\n•Someone who wants nutrition that will help prevent the effects of stress\r\n•Someone who wants to support your muscle growth and endurance\r\nDIRECTIONS\r\n\r\nFor ages 18 and older.\r\nTake two caplets 60 minutes before exercise or between meals. Use in conjunction with the AdvoCare Performance Elite line.\r\n\r\nCAUTION: \r\nThis product is not intended for pregnant or nursing women.\r\n\r\nKEEP OUT OF REACH OF CHILDREN: \r\nIn case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\nKEY INGREDIENTS\r\n\r\nInosine, Rhodiola rosea, Eleutherococcus, beetroot extract, hydrolyzed whey proteins ","options":[{"id":50620311,"name":"30 Servings","price":38.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.95,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129405318/-/A3502.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129405318/-/A3502.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15575409,"name":"Muscle Strength","permalink":"muscle-strength","position":9,"price":41.95,"default_price":41.95,"tax":0.0,"url":"/product/muscle-strength","status":"active","on_sale":false,"created_at":"2013-12-15T19:33:09.000Z","description":"","options":[{"id":50663082,"name":"20 Servings","price":41.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129431970/-/P3221.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129431970/-/P3221.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15574917,"name":"VO2 Prime","permalink":"vo2-prime","position":10,"price":39.95,"default_price":39.95,"tax":0.0,"url":"/product/vo2-prime","status":"active","on_sale":false,"created_at":"2013-12-15T19:07:06.000Z","description":"VO2 Prime™ is a premier pre-workout bar with innovative ingredients that have been shown to contribute to the body's production of nitric oxide. This convenient, 140-calorie bar gives you the fuel you need to take your workouts to the next level.\r\n\r\nIS THIS YOU?\r\n•Someone looking for a portable pre-workout snack\r\n•Someone who doesn’t like working out on an empty stomach\r\n•Someone who wants to take their workout capacity to a greater level\r\nDIRECTIONS\r\n\r\nConsume bar 60 minutes before physical activity or as a between meal snack.\r\nKEY INGREDIENTS\r\n\r\nBeetroot juice powder, blueberries, cranberries, soy protein\r\n\r\nContains: milk and soy. This product was manufactured in a facility that also processes tree nuts, peanut and egg containing ingredients.","options":[{"id":50661792,"name":"12","price":39.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129430758/-/P6001.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129430758/-/P6001.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15575349,"name":"Nighttime Recovery","permalink":"nighttime-recovery","position":11,"price":24.95,"default_price":24.95,"tax":0.0,"url":"/product/nighttime-recovery","status":"active","on_sale":false,"created_at":"2013-12-15T19:29:09.000Z","description":"To enhance the benefit of your body's natural processes, Nighttime Recovery supplement incorporates a unique combination of adaptogens and other nutrients from around the world to allow your body to more effectively respond to the demands of physical activity.* It naturally supports the production of growth-related hormones, and it enhances energy production, helping the body sustain higher workloads before the onset of fatigue.* The adaptogens in Nighttime Recovery support the body's ability to respond to stress such as physical training.* Nighttime Recovery is most effective when used as part of the Performance Elite system. While other products in the line provide pre-workout support and immediate post-workout recovery, Nighttime Recovery provides enhanced muscle growth and supports muscle repair while you sleep.* It is equally beneficial for non-athletes wanting to nourish and support their muscles.* \r\n\r\nIs this you?\r\nSomeone who regularly exercises or participates in weight training \r\nAn athlete who wants to improve your training regimen \r\nAn aging senior who wants to build and retain muscle mass\r\nDIRECTIONS\r\n\r\n•For ages 18 and older.\r\n•Take the recommended number of caplets according to your weight, and consume on an empty stomach at bedtime.\r\n\r\n\r\nCAUTION: This product is not intended for pregnant or nursing women or for children under 18 years of age. Keep out of reach of children.\r\nKEY INGREDIENTS\r\n\r\nL-ornithine, L-arginine, maca, ashwagandha extract, eleuthero root, saw palmetto extract, wild yam extract, nettles extract, niacin, magnesium, zinc","options":[{"id":50662953,"name":"60 servings","price":24.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129431856/-/P3201.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129431856/-/P3201.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15577263,"name":"Catalyst","permalink":"catalyst","position":12,"price":31.5,"default_price":31.5,"tax":0.0,"url":"/product/catalyst","status":"active","on_sale":false,"created_at":"2013-12-15T21:23:15.000Z","description":"atalyst™ Amino Acid Supplement is a blend of essential branched-chain amino acids and L-glutamine that supplies your body with muscle-building components and sustains your muscles during exercise and reduced calorie intake.* Whether you're trying to lose weight or gain muscle, Catalyst helps repair and protect muscles.* And it works great in conjunction with other AdvoCare® products like Spark™ Energy Drink and one of the Metabolic Nutrition Systems (MNS®). Other amino acids in Catalyst like L-arginine, taurine and betaine help fuel and maintain your muscles to support endurance and strength.* Combined with a healthy diet and exercise, Catalyst helps you retain muscle and reduce fat for a more toned and better defined look.*\r\n\r\nIs this you?\r\nSomeone who needs to preserve muscle, especially when you've restricted your caloric intake\r\nSomeone wanting to improve your fitness regimen by enhancing strength and endurance\r\nSomeone needing an added boost to your current weight-loss program\r\nSomeone who wants to tone, define and preserve your lean body mass\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•Take three capsules between meals or immediately prior to exercise or training.\r\nKEY INGREDIENTS\r\n\r\nBranched-chain amino acids (BCAA), L-glutamine, L-arginine, betaine, taurine\r\n\r\n","options":[{"id":50669031,"name":"30 Servings","price":31.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129436695/-/T2010.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129436695/-/T2010.jpg","width":240,"height":211}],"artists":[],"categories":[]},{"id":15575010,"name":"Muscle Gain","permalink":"muscle-gain-chocolate","position":13,"price":38.95,"default_price":38.95,"tax":0.0,"url":"/product/muscle-gain-chocolate","status":"active","on_sale":false,"created_at":"2013-12-15T19:12:40.000Z","description":"It's nearly impossible to get enough protein from diet alone without also getting excess calories fat and carbohydrates. Muscle Gain® protein shake is a metabolically balanced blend of high-grade proteins that supplies amino acids and other nutrients that are essential to protein synthesis and muscle building in an easy-to-digest formula that includes digestive enzymes like papin and bromelain to improve absorption of protein. Because the muscles also need vitamins and minerals, Muscle Gain contains vitamins C and B-6 and calcium. This advanced formula offers a more comprehensive approach to sports performance than other brands of muscle-building, protein drinks. \r\n\r\nIs this you?\r\nSomeone who wants to add lean muscle mass \r\nSomeone who needs more protein in your diet without excess fats and carbohydrates \r\nAn athlete who needs high-quality protein to aid your training \r\nSomeone who wants to retain lean muscle mass during periods of calorie restriction\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•Blend, shake or briskly stir contents of one pouch into 8 fluid ounces of water or the beverage of your choice\r\n•Add fresh or frozen fruit for a refreshing flavor variety.\r\n\r\n\r\nNOTICE: NOTICE: Use this product as a food supplement only. Do not use for weight reduction.\r\nKEY INGREDIENTS\r\n\r\nProtein blend, carbohydrates, papain, bromelain, vitamin C, thiamine (B-1), riboflavin, pantothenic acid (B-5), calcium, magnesium, branched-chain amino acids","options":[{"id":50662050,"name":"Pouches/Chocolate","price":38.95,"sold_out":false,"has_custom_price":false},{"id":50662053,"name":"Cannister/Chocolate","price":79.95,"sold_out":false,"has_custom_price":true},{"id":50662089,"name":"Cannister/Vanilla","price":79.95,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129430998/-/P4602.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129430998/-/P4602.jpg","width":240,"height":211},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129431085/-/P2601.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129431085/-/P2601.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15574881,"name":"BioCharge","permalink":"biocharge","position":14,"price":42.95,"default_price":42.95,"tax":0.0,"url":"/product/biocharge","status":"active","on_sale":false,"created_at":"2013-12-15T19:04:57.000Z","description":"BioCharge® was originally designed for Baby Boomers, but the benefits of BioCharge can be felt - and seen - by athletes and those looking to increase the intensity of their workouts at the gym.\r\n\r\nBioCharge® is a premier pre-workout and intra-workout supplement designed to improve muscle performance and recovery through a formula of antioxidant rich botanicals combined with B vitamins and branched-chain amino acids (BCAAs).* \r\n\r\nIS THIS YOU?\r\n•Someone concerned about lean muscle mass\r\n•Someone lacking energy\r\n•Someone finding it difficult to recover from exercise and workouts\r\n•Someone sensitive to caffeine\r\nDIRECTIONS\r\n\r\nMix the contents of one stick pack into 4 fluid ounces of water, slightly shake or stir. May adjust amount of water to suit taste.\r\n\r\nCaution:\r\nThis product is not intended for pregnant or nursing women. \r\n\r\nKEEP OUT OF REACH OF CHILDREN.\r\nKEY INGREDIENTS\r\n\r\nVitamins B6 & Vitamin B12, Folic acid, Pantothenic Acid, L-Leucine, Isoleucine, Valine, Taurine, Cat’s Claw (bark - Uncaria tomentosa) extract, Quercetin, Green tea (leaf - Camellia sinensis), Black currant extract (berry - Ribesnigrim), and Grape seed extract","options":[{"id":50661675,"name":"30 stick packs","price":42.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.95,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129430656/-/P4870.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129430656/-/P4870.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15576261,"name":"Meal Replacement Shake","permalink":"meal-replacement-shake","position":15,"price":44.95,"default_price":44.95,"tax":0.0,"url":"/product/meal-replacement-shake","status":"active","on_sale":false,"created_at":"2013-12-15T20:23:12.000Z","description":"When you need to cut calories or you need a nutritious on-the-go meal, grab a Meal Replacement Shake. Meal Replacement Shakes have a 1:1 protein-to-carbohydrate ratio, which studies show supports weight loss and sustained energy. And since they're loaded with 24 grams of easily digestible protein, 26 vitamins and minerals and just 220 calories per serving, you'll satisfy your rumbling tummy, feed your muscles with high-octane fuel and give your body wholesome nutrients for a healthier you. Meal Replacement Shakes also work great as part of the Metabolic Nutrition Systems (MNS®). \r\n\r\nIs this you?\r\nSomeone who wants a nutritious meal on the go\r\nSomeone seeking a balanced, low-calorie meal for your diet and exercise program\r\nSomeone seeking to lose or maintain weight in a healthy manner\r\nSomeone who has limited gastric capacity or requires an easy-to-digest, light meal\r\nSomeone looking for an additional source of protein to supplement your diet\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•Blend, shake or briskly stir contents of one pouch into 9 fluid ounces of cold water until smooth.\r\n•Can be blended with fresh or frozen fruit for flavor variety.\r\nKEY INGREDIENTS\r\n\r\nProtein, calcium, fiber, iron, magnesium, vitamin D, zinc, vitamin A, potassium, riboflavin, vitamin C, vitamin B-12","options":[{"id":50665449,"name":"Chocolate Mocha","price":44.95,"sold_out":false,"has_custom_price":false},{"id":50665452,"name":"Chocolate","price":44.95,"sold_out":false,"has_custom_price":false},{"id":50665455,"name":"Vanilla","price":44.95,"sold_out":false,"has_custom_price":false},{"id":50665458,"name":"Berry","price":44.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129434019/-/T1361.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129434019/-/T1361.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15575547,"name":"AdvoBar AM Apple Cinnamon","permalink":"advobar-am-apple-cinnamon","position":16,"price":29.95,"default_price":29.95,"tax":0.0,"url":"/product/advobar-am-apple-cinnamon","status":"active","on_sale":false,"created_at":"2013-12-15T19:40:24.000Z","description":"AdvoBar™ a.m. Apple Cinnamon provides balanced nutrition and a great taste. Each bar is an excellent source of vitamins and minerals that helps you to start each day on the right track. In addition, each bar is packed with protein to feed your muscles and satisfy you for hours while providing you with a great source of dietary fiber. It has a great light taste and it's easy to carry in your pocket or purse so you can snack on your way to the office or anytime throughout the day.\r\n\r\nIs this you?\r\nSomeone who has a busy lifestyle and tight schedule, and needs a quick snack or meal\r\nSomeone looking for a quick, nutritious meal in the morning without the hassle of preparation time\r\nSomeone who travels frequently or is \"on the go\" and cannot easily predict mealtimes\r\nDIRECTIONS\r\n\r\nFor ages 4 and older.\r\nKEY INGREDIENTS\r\n\r\nVitamin A, calcium, fiber, folic acid, phosphorus, potassium, protein, riboflavin, sodium, thiamine, vitamin B-6, vitamin B-12, vitamin C, zinc, vitamin K, iron.","options":[{"id":50663478,"name":"12 Servings","price":29.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129433797/-/A3612.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129433797/-/A3612.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15575607,"name":"Advocare Slam","permalink":"advocare-slam","position":17,"price":35.95,"default_price":35.95,"tax":0.0,"url":"/product/advocare-slam","status":"active","on_sale":false,"created_at":"2013-12-15T19:42:50.000Z","description":"AdvoCare Slam® - Bowl Game Berry is a powerful, portable energy drink in a tiny, two-ounce bottle. Its unique combination of energy producing nutrients and support for neural processes make it a perfect fit for the person on the go.* And with no sharp drop-off or energy crash, it's great for hours of sustained energy.* Portions are easy to control with Slam, so you can drink the whole bottle or half if you prefer. It's also quick and easy to consume in three amazing flavors. Whether you are a college student, a professional driver, an employee with a deadline or just a person on a road trip who needs to stay awake and focused, Slam is the perfect choice when quick, convenient results are a must.* And unlike many other energy shots you may find at retail stores, Slam actually tastes great!\r\n\r\nIs this you?\r\nSomeone who is always on the go and needs a fast-acting energy boost\r\nSomeone who is looking to facilitate workout performance, enhance sports performance, and increase endurance\r\nEmployees working with tight deadlines\r\nCollege students pulling all-nighters\r\nRecreational and professional road warriors\r\nTravelers coping with jet lag\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•For maximum effect, drink an entire bottle, preferably between meals. \r\n\r\n\r\nCaution: Pregnant or nursing women should consult a healthcare professional prior to use. Not for use by persons who are sensitive to caffeine.\r\n\r\nKeep out of reach of children.\r\n\r\nNote: Niacin may cause temporary skin redness and a warm feeling.\r\n\r\nFor maximum freshness, store product in a cool, dry place. May be served chilled. Refrigeration is not required.\r\nKEY INGREDIENTS\r\n\r\n•B-vitamins (B-6, B-12, niacin, pantothenic acid and folic acid) - B-vitamins are water-soluble vitamins that help us produce and sustain our own energy. As we age, we gradually begin to lose the ability to absorb vitamin B-12. Research has shown that high levels of vitamin B-12 encourage the body to increase its absorption. Vitamin B-12 also helps maintain mental performance and aid in energy production.\r\n•Taurine - Taurine is an amino acid that provides quick energy without over stimulating the body.\r\n•Betaine - This ingredient plays a role in metabolic processes through donation of a methyl group (one carbon metabolism).\r\n•Carnitine - L-Carnitine is essential for the transport of fatty acids into the cellular organelle, mitochondrion, for conversion into energy by oxidation.\r\n•Glycine - Glycine is one of the 20 amino acids commonly found in proteins.\r\n•Glucuronolactone - Glucuronolactone is a normal human metabolite formed from glucose. Its precursor, glucuronic acid, is an important constituent in fibrous and connective tissues of all animals.\r\n•Caffeine - Slam has about the same amount of caffeine as a cup of coffee.","options":[{"id":50663583,"name":"Bowl Game Berry","price":35.95,"sold_out":false,"has_custom_price":false},{"id":50663586,"name":"Power Punch","price":35.95,"sold_out":false,"has_custom_price":false},{"id":50663589,"name":"Strawberry Blast","price":35.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129432405/-/A1082.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129432405/-/A1082.jpg","width":160,"height":141}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15575652,"name":"AdvoBar Meal","permalink":"advobar-meal","position":18,"price":31.95,"default_price":31.95,"tax":0.0,"url":"/product/advobar-meal","status":"active","on_sale":false,"created_at":"2013-12-15T19:44:25.000Z","description":"AdvoBar™ Meal is a perfect solution for on-the-go dieting. These bars pack 16 grams of high-quality, easily-digested protein to help you retain lean muscle and support your metabolism while you cut calories. They're also an excellent source of 18 vitamins and minerals as well as B-vitamins, which help you sustain energy during weight loss. And with just 3 grams of fat and 215 calories, they'll fill you up without fattening you up. They're also a great source of protein to help you sustain energy and gain muscle during your workouts.\r\n\r\nIs this you?\r\nSomeone looking for a convenient, quick and nutritious meal replacement\r\nSomeone restricting calories who wants to maintain muscle mass and support proper metabolism\r\nSomeone who needs additional protein in your diet\r\n","options":[{"id":50663715,"name":"12 Servings","price":31.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129432510/-/A3701.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129432510/-/A3701.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15574830,"name":"AdvoBar Raw","permalink":"advobar-raw","position":19,"price":31.95,"default_price":31.95,"tax":0.0,"url":"/product/advobar-raw","status":"active","on_sale":false,"created_at":"2013-12-15T19:02:00.000Z","description":"AdvoBar™ Raw is a fruit and nut blend that is made from simple, wholesome ingredients.\r\n\r\nProteins\r\nThis simple nutritional bar provides a variety of proteins such as hemp powder and brown rice protein. Hemp powder, containing all eight essential amino acids, is a great source of plant protein. Brown rice protein is rich in minerals, vitamins and fiber. \r\n\r\nNutritious Seeds\r\nAdvoBar™ Raw is composed of three nutritious seeds—chia, hemp and flax. All of these are rich in fiber, and all of these provide protein and monounsaturated fat.\r\n\r\nNuts\r\nAdvoBar™ Raw includes nuts—walnuts, pecans and peanuts—which contain primarily monounsaturated fats. \r\n\r\nSweeteners and Additional Nutrition\r\nAdvoBar™ Raw is sweetened by agave syrup and dates. Flavored simply with fruits and nuts, AdvoBar™ Raw also contains apple pieces and oats which are high in fiber to help ensure a long-lasting feeling of fullness.\r\n\r\nIS THIS YOU?\r\n\r\n•Someone who desires whole foods, clean foods, or minimally processed foods \r\n•Someone searching for a simple on-the-go option \r\n•Someone looking for a bar containing a variety of plant proteins \r\nDIRECTIONS\r\n\r\nFor ages 4 and older.\r\nKEY INGREDIENTS\r\n\r\nChia seed, hemp seed, flax seed, walnuts, pecans, peanuts, apples, oats, agave syrup, dates, hemp powder and brown rice protein.\r\n\r\nContains lightly-toasted nuts.\r\n","options":[{"id":50661468,"name":"12","price":31.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.95,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129430542/-/A3901.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129430542/-/A3901.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15575760,"name":"AdvoBar Snack (Double Chocolate)","permalink":"advobar-snack-double-chocolate","position":20,"price":27.95,"default_price":27.95,"tax":0.0,"url":"/product/advobar-snack-double-chocolate","status":"active","on_sale":false,"created_at":"2013-12-15T19:49:14.000Z","description":"*Bar DOES contain nuts.\r\n\r\nAdvoBar™ Snack\r\nWith 10 grams of protein, the AdvoBar™ Snack, available in a delicious double chocolate flavor, is the perfect solution for anyone when a quick, sweet snack is in order. The AdvoBar™ Snack contains a great balance of protein, carbohydrates and fat and may help slow down the food's digestion and absorption. This helps ensure that the body absorbs all the nutrients, while the craving for something sweet is also satisfied. Each bar combines the right amount of protein with carbohydrates in a convenient snack with only 140 calories and zero trans fats. Now you can satisfy both your sweet tooth and your nutritional needs with the AdvoBar™ Snack!\r\n\r\nIs this you?\r\nSomeone who often craves sweet snacks and is looking for a nutritious alternative\r\nSomeone who needs a convenient and satisfying snack\r\nSomeone who needs a healthy snack bar to incorporate into his&her weight-management and exercise program\r\nDIRECTIONS\r\n\r\n•For ages 4 and older.\r\nKEY INGREDIENTS\r\n\r\nBeta-carotene, biotin, folic acid, oat fiber, pantothenic acid, phosphorus, riboflavin, thiamine, vitamin A, vitamin B-6, vitamin B-12, vitamin C, vitamin D, vitamin E, protein blend","options":[{"id":50664063,"name":"12 Servings","price":27.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129432741/-/A3615.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129432741/-/A3615.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15577464,"name":"AdvoCare Slim","permalink":"advocare-slim","position":21,"price":39.95,"default_price":39.95,"tax":0.0,"url":"/product/advocare-slim","status":"active","on_sale":false,"created_at":"2013-12-15T21:34:41.000Z","description":"For anyone looking for an easy-to-use solution for weight loss and weight management, AdvoCare® Slim™ is the perfect answer.* Combining appetite suppression, energy and metabolic enhancers, this 2 oz. prepared serving not only helps you control your cravings but also promotes fat reduction and an improvement in your body composition.* Altogether, Slim has a synergistic effect, helping you manage your diet and maintain energy while changing your body from within.* It really is a system in a bottle!\r\n\r\nSlim combines two proven ingredients, Svetol® and Super Citrimax®.\r\n\r\nIS THIS YOU? \r\n\r\n•Anyone looking for a healthy weight-loss system that's portable and convenient\r\n•Individuals who need an extra boost of energy\r\n•People who are looking for appetite control \r\n•Anyone with an aversion to pills\r\n•Someone who wants to add another weight-management tool in conjunction with MNS\r\nDIRECTIONS\r\n\r\nFor ages 18 and older\r\n\r\nJust add water to the shoulder of the bottle, recap and shake to mix before drinking.\r\n\r\nKEEP OUT OF REACH OF CHILDREN: In case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\nKEY INGREDIENTS\r\n\r\nThiamine\r\nBiotin\r\nChromium \r\nGreen coffee extract Svetol (fruit - Coffea canephora robusta P.)\r\nGarcinia cambogia fruit extract, Super CitriMax \r\nTaurine\r\nCaffeine\r\nInositol\r\nSvetol® is property of Naturex. Super Citrimax® is property of Pharmachem Laboratories. ","options":[{"id":50669664,"name":"12 Servings","price":39.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129437082/-/T1052.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129437082/-/T1052.jpg","width":157,"height":124}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15577497,"name":"AdvoCare Slim (Caffeine Free)","permalink":"advocare-slim-caffeine-free","position":22,"price":39.95,"default_price":39.95,"tax":0.0,"url":"/product/advocare-slim-caffeine-free","status":"active","on_sale":false,"created_at":"2013-12-15T21:36:51.000Z","description":"For anyone looking for an easy-to-use solution for weight loss and weight management, AdvoCare Slim® is the perfect answer.* Combining appetite suppression, energy and metabolic enhancers, this 2 oz. prepared serving not only helps you control your cravings but also promotes fat reduction and an improvement in your body composition.* Altogether, Slim has a synergistic effect, helping you manage your diet and maintain energy while changing your body from within.* It really is a system in a bottle!\r\n\r\nSlim combines two proven ingredients, Svetol® and Super Citrimax®.\r\n\r\nIS THIS YOU? \r\n\r\n•Anyone looking for a healthy weight-loss system that's portable and convenient\r\n•Individuals who need an extra boost of energy\r\n•People who are looking for appetite control \r\n•Anyone with an aversion to pills\r\n•Someone who wants to add another weight-management tool in conjunction with MNS®\r\nDIRECTIONS\r\n\r\n•For ages 18 and older.\r\n•Just add water to the shoulder of the bottle, recap and shake to mix before drinking.\r\n•For maximum effect consume the contents of two bottles daily. \r\n•Consume one serving 30-45 minutes before breakfast.\r\n•Consume the second serving approximately 2 hours after lunch, preferably mid-afternoon.\r\nCAUTION:Pregnant or nursing women should consult with a healthcare professional prior to use. \r\n\r\nKEEP OUT OF REACH OF CHILDREN: In case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\nKEY INGREDIENTS\r\n\r\nThiamine\r\nBiotin\r\nChromium \r\nGreen coffee extract Svetol (fruit - Coffea canephora robusta P.)\r\nGarcinia cambogia fruit extract, Super CitriMax \r\nTaurine\r\nInositol\r\nSvetol® is property of Naturex. Super Citrimax® is property of Pharmachem Laboratories. ","options":[{"id":50669742,"name":"12 Servings","price":39.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129437163/-/T1062.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129437163/-/T1062.jpg","width":157,"height":124}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15577224,"name":"Carb-Ease Plus","permalink":"carb-ease-plus","position":23,"price":37.95,"default_price":37.95,"tax":0.0,"url":"/product/carb-ease-plus","status":"active","on_sale":false,"created_at":"2013-12-15T21:20:01.000Z","description":"Through three main ingredients, Carb-Ease Plus supplement is a remarkable full-spectrum weight-management product that helps support weight management and body composition and also prevents the breakdown of carbohydrates by inhibiting the digestive enzymes used to break them down.* The body must break down starches and other complex carbohydrates (polysaccharides) into smaller, more usable forms (monosaccharides). Once broken down, the simple glucose molecules can then be transported across the intestinal wall into the bloodstream. Carb-Ease Plus contains ingredients that help inhibit the breakdown of fats and selected carbohydrate molecules so that the body is less likely to absorb them.* It also helps maintain weight and healthy blood glucose levels by reducing the negative effects of excessive carbohydrate consumption.*\r\n\r\nIngredients: \r\nPhase 2® \r\nThis natural extract of white kidney bean helps delay the digestion and absorption of starchy carbohydrates without affecting the digestion of healthy carbohydrates such as fruit and whole grains. Studies show Phase 2 inhibits the activity of the digestive enzyme, alpha amylase, and allows a portion of ingested carbohydrates to pass through the digestive system without being broken down into a form the body can readily utilize.* This process may help reduce the caloric impact of ingested carbohydrate foods.*\r\n\r\nID-alG™ \r\nA brown seaweed extract rich in polyphenols and antioxidants, ID-alG™ helps reduce the absorption of fat, inhibiting lipase and amylase, which are digestive enzymes.* By reducing the body’s fat and carbohydrate assimilations, it may help control caloric intake and reduce fat storage.* Clinical research indicates weight loss primarily as fat loss with contouring body benefits.*\r\n\r\nSvetol™ \r\nSvetol is a non-roasted extract of select decaffeinated green coffee beans which contains a high level and specific ratio of more than twelve cholorgenic acids. These acids help regulate glucose metabolism and support the body’s breakdown of fat reserves for energy.*\r\n\r\nDIRECTIONS\r\n\r\nFor ages 12 and older.\r\nTake two capsules immediately before your largest starch-containing meal. Do not use between meals or on an empty stomach. \r\n\r\nCAUTION: \r\nThis product is not intended for pregnant or nursing women. \r\n\r\nKEEP OUT OF REACH OF CHILDREN: \r\nIn case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\n\r\nKEY INGREDIENTS\r\n\r\nPhase 2® , ID-alG™ , Svetol™","options":[{"id":50668917,"name":"30 Servings","price":37.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129436572/-/T4462.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129436572/-/T4462.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15575856,"name":"Coffeccino","permalink":"coffeccino","position":24,"price":38.95,"default_price":38.95,"tax":0.0,"url":"/product/coffeccino","status":"active","on_sale":false,"created_at":"2013-12-15T19:54:43.000Z","description":"Wake up to Coffeccino®. With its rich, creamy coffeehouse flavor, Coffeccino starts your morning off with B-vitamins, neuroactives and amino acids to wake you up and keep you alert and focused for hours without giving you the \"jitters.\"* It has about the same amount of caffeine as a cup of regular coffee, but costs less and has less sugar, fat and calories than most popular coffee drinks. It also provides superb appetite control* for anyone watching the waistline.\r\n\r\nIs this you?\r\nSomeone who wants a great-tasting energy drink\r\nSomeone fond of coffee that would like a healthier alternative\r\nSomeone who wants to support your weight-management program\r\nSomeone who wants help with appetite control\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•For a hot beverage: Blend, shake or stir the contents of one pouch into six ounces of very hot (not boiling) water. Stir thoroughly. Flavored extracts can be added.\r\n•For a cold beverage: Blend, shake or stir the contents of one pouch into six ounces of cold water. For an iced drink, shake thoroughly.\r\n•For a frappaccino add with ice cubes to a blender and blend until smooth. Flavored extracts can be added.\r\n\r\n\r\nCAUTION: This product is not intended for pregnant or nursing women. Not for use by persons who are sensitive to caffeine.\r\nKEY INGREDIENTS\r\n\r\nVitamin B-6, folic acid, pantothenic acid, chromium, medium chain triglycerides, L-tyrosine, caffeine","options":[{"id":50664321,"name":"14 Servings","price":38.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129432969/-/A3803.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129432969/-/A3803.jpg","width":180,"height":158}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":15575931,"name":"Definate Difference Night Recovery Creme","permalink":"definate-difference-night-recovery-creme","position":25,"price":39.95,"default_price":39.95,"tax":0.0,"url":"/product/definate-difference-night-recovery-creme","status":"active","on_sale":false,"created_at":"2013-12-15T19:58:06.000Z","description":"Nourish & Hydrate as you sleep...\r\n\r\nThis comforting, luxurious cream helps hydrate, firm and soothe the skin. Awaken to skin that appears well-rested as fine lines and wrinkles are reduced. \r\n\r\nFormulated with vitamins, antioxidants, moisturizers, botanical extracts & peptides to help nourish, hydrate, soothe & reduce the appearance of fine lines and wrinkles. \r\n\r\nDIRECTIONS\r\n\r\n1.In the evening, cleanse with Foaming Cleanser and pat dry.\r\n2.Apply Vitamin C Reparative, if desired, to face, neck and décolletage.\r\n3.Follow with Night Recovery Crème.\r\nKEY INGREDIENTS\r\n\r\nhelianthus annuus (sunflower) seed oil, squalane, sodium hyaluronate, panthenol, algae extract, arnica montana (arnica) extract camellia sinensis (green tea) leaf extract, cucumis sativus (cucumber) fruit extract, rosmarinus officinalis extract, saccharomyces cerevisiae extract, tocopheryl acetate, glucosamine hcl, retinyl palmitate, ubiquinone, palmitoyl tripeptide-5, phospholipids \r\n  \r\n","options":[{"id":50664528,"name":"2 ounces","price":39.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129433188/-/5222.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129433188/-/5222.jpg","width":200,"height":190}],"artists":[],"categories":[{"id":2362483,"name":"Definate Difference","permalink":"definate-difference","url":"/category/definate-difference"}]},{"id":15577524,"name":"Fibo-Trim","permalink":"fibo-trim","position":26,"price":37.95,"default_price":37.95,"tax":0.0,"url":"/product/fibo-trim","status":"active","on_sale":false,"created_at":"2013-12-15T21:39:25.000Z","description":"Fibo-Trim™ supplement can help limit fat absorption that takes place when you consume high-fat meals.* It contains a proprietary blend of fibers and nutrients help bind, transport and remove dietary fats from the gastrointestinal tract, helping to move the fat through your system before the body has an opportunity to store it.* This unique blend of fibers such as chitosan, guar gum, xantham and psyllium reduce the absorption of fat molecules and then move them quickly through your system before they are broken down.* Furthermore, Fibo-Trim contains key ingredients that are shown to help maintain healthy cholesterol levels already within the normal range.* In the proper proportions, these ingredients make Fibo-Trim a revolutionary weight-management product when combined with diet and exercise.* And you can enhance your results by using it with MNS®.\r\n\r\nIs this you?\r\nSomeone who has trouble avoiding large portions at mealtime, particularly of fatty foods\r\nSomeone who wants to fill up without overeating\r\nSomeone looking to reduce your caloric intake\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•Take three capsules 10 to 15 minutes before a meal. Take with a full glass of water and continue to drink water throughout the day. \r\n•Taking Fibo-Trim™ before your heaviest meals may be especially beneficial. \r\n•Do not use Fibo-Trim at the same meal as Antioxidant Plus, CardioShield™, CorePlex?, OptiSight® or OmegaPlex® supplements.\r\n\r\n\r\nNOTE:This product contains chitosan, an ingredient obtained from crustacean shellfish (crab,lobster or shrimp). Persons who are allergic to shellfish should not consume this product.\r\n\r\nCAUTION: This product is not intended for pregnant or nursing women. Keep out of reach of children.\r\nKEY INGREDIENTS\r\n\r\nChitosan, psyllium husk powder, guar gum, xanthan gum, garlic powder, beta-sitosterol","options":[{"id":50669835,"name":"60 Servings","price":37.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129437256/-/T3191.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129437256/-/T3191.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15576210,"name":"LeptiLean","permalink":"leptilean","position":27,"price":42.0,"default_price":42.0,"tax":0.0,"url":"/product/leptilean","status":"active","on_sale":false,"created_at":"2013-12-15T20:20:37.000Z","description":"AdvoCare LeptiLean® is an innovative weight management product that supports appetite management and satiety and helps boost metabolism.* This convenient and flexible product, free of caffeine, can be taken before any meal – breakfast, lunch or dinner – and can be easily combined with other programs. \r\nAppetite Management & Satiety\r\nDifferent individuals have various pathways in which their appetite is managed most effectively. LeptiLean® approaches appetite control in two ways, with Lepticore® and PhosphoLean®. These two patented ingredients encourage appetite management through their own mechanisms. LeptiCore® helps raise brain leptin levels, which have been linked to satiety, a feeling of fullness and satisfaction, and suppressed appetite, keeping your focus off of food.* PhosphoLean helps switch off feeding signals and activates sympathetic thermogenesis, helping to increase fat oxidation.* LeptiLean® is also formulated with anti-inflammatory properties to help facilitate weight management.*\r\n\r\nMetabolism\r\nNaringin, a flavanone glycoside from grapefruit and other citrus fruits, works as a metabolic enhancer.* LeptiLean® incorporates this ingredient to help encourage your body's ability to metabolize fat+ and for longer periods of time, helping you look and feel your best.*\r\n\r\nOther Benefits\r\nIngredients in LeptiLean® help support a healthy cardiovascular system, help maintain a normal blood glucose level, and to promote overall well being.* \r\n\r\nDIRECTIONS\r\n\r\nTake two capsules daily as needed. Consume at least 45 minutes before a meal. \r\nCAUTION:\r\nThis product is not intended for pregnant or nursing women. \r\n\r\nKEEP OUT OF REACH OF CHILDREN: \r\nIn case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\n\r\nKEY INGREDIENTS\r\n\r\nvitamin A, biotin, LeptiCore, Naringin extract, PhosphoLean™ N-Oleoyl-PE & EGCG (NOPE & EGCG), Cat's Claw extract (bark – Uncaria tomentosa) \r\n\r\nLepticore® is a trademark of Gateway Health Alliances, Inc. and is protected under US Patent 6,899,892 and patents pending\r\n\r\n\r\nPhosphoLean   PhosphoLean™ is protected under US Patent No. 20100179107 and other patents pending.\r\n \r\n","options":[{"id":50665353,"name":"30-Day Supply","price":42.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129433968/-/T5000.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129433968/-/T5000.jpg","width":185,"height":163}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15575280,"name":"Mass Impact","permalink":"mass-impact","position":28,"price":72.95,"default_price":72.95,"tax":0.0,"url":"/product/mass-impact","status":"active","on_sale":false,"created_at":"2013-12-15T19:26:36.000Z","description":"Mass Impact™ is a sports performance product that supports muscle building for performance athletes as well as those looking to prevent muscle breakdown through three ingredients: \r\nCreatine\r\nCreatine is found naturally in the body, with about 95 percent of it found in skeletal muscle. Large amounts of creatine are lost during intense workouts, so in order to build muscle mass, it is important to replace creatine. Since creatine is primarily obtained through meat sources and it's inadvisable to consume large quantities of meat at one time, Mass Impact supplies the creatine you need. *+ Mass Impact™ helps maintain ATP levels for cellular energy and to preserve muscle glycogen, which promotes muscle mass, volume and strength.*\r\n\r\nSustamine™\r\nThis powerful ingredient supports rehydration, energy replenishment and muscle recovery.* Research shows that Sustamine supplementation results in improved performance and promotes protein synthesis, inhibiting muscle breakdown and reducing muscle tissue damage.* Sustamine also improves water and electrolyte absorption.*\r\n\r\nOther Amino Acids\r\nSeveral other amino acids found in Mass Impact™ help optimize fat cell and muscle tissue communication to promote muscle leanness, activating cell signaling pathways for muscle growth.* They also contribute to muscle repair and strength, and assist in hydration.*\r\n\r\nMaximize your results with Mass Impact™.* This light, fresh-tasting powder can easily be combined with other AdvoCare Performance Elite products.\r\n\r\n+Resource\r\nMedline Plus, U.S. National Library of Medicine, National Institutes of Health\r\n\r\nDIRECTIONS\r\n\r\nShake or stir the contents of one slightly rounded scoop into 8 fluid ounces of water or the beverage of your choice. For enhanced athletic performance*, consume on an empty stomach 30 minutes before exercise. May consume up to three servings per day. \r\nCAUTION:\r\nThis product is not intended for pregnant or nursing women or those under 18 years of age. \r\n\r\nNOTE:\r\nMaintain proper hydration during product use.\r\n\r\nKEEP OUT OF REACH OF CHILDREN: \r\nIn case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\n\r\nKEY INGREDIENTS\r\n\r\nCreatine monohydrate, L-leucine, Glycine, L-Alanyl-L-Glutamine (Sustamine)™ \r\n\r\nContains Sustamine™. Sustamine™ is a registered trademark of Kyowa Hakko Bio Co., Ltd.\r\n","options":[{"id":50662791,"name":"50 Servings","price":72.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129431718/-/P2800.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129431718/-/P2800.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334739,"name":"Performance Elite","permalink":"performance-elite","url":"/category/performance-elite"}]},{"id":15577296,"name":"MNS Max 3","permalink":"mns-max-3","position":29,"price":45.95,"default_price":45.95,"tax":0.0,"url":"/product/mns-max-3","status":"active","on_sale":false,"created_at":"2013-12-15T21:25:17.000Z","description":"Our most comprehensive system yet! In addition to appetite control, you will receive the best core nutrition as we have added Amplify A.T., Calcium Plus and an additional OmegaPlex® to this system.* Max 3 also offers sustained-release energy, which means energy will last throughout the day.* And with approximately half the caffeine of MNS® Max E and MNS® Max C, it is a fantastic alternative for anyone looking for a lower-caffeine solution.* For energy, appetite control and overall outstanding core nutrition and wellness, Max 3 is the answer.*\r\n\r\nIncluded in every strip pack of MNS® Max 3:\r\nMNS Max 3 Contents:\r\nBefore Breakfast Color Packet\r\nCalcium Plus - 2 caplets\r\nActoTherm SR - 1 caplet\r\nProBiotic Restore ULTRA - 1 capsule\r\nBefore Lunch Color Packet\r\nCalcium Plus - 2 caplets\r\nBioTherm - 2 capsules\r\nWhite Packet\r\nCorePlex - 3 caplets\r\nWhite Packet\r\nOmegaPlex - 2 softgels\r\nAmplify A.T. - 1 softgel\r\n\r\nActoTherm: Based on an exclusive blend of botanicals including cinnamon, gotu kola, ginger and peppermint, this time-honored AdvoCare original product has been reformulated. This new version features a sustained-release to aid in preventing a spike and drop-off of energy throughout the day.*\r\n\r\nBioTherm: A unique weight-management aid developed by AdvoCare that combines oolong tea, effective botanicals and B vitamin, biotin, to support weight control.* BioTherm helps your body convert fat into energy.* Biotin is also used by the body to facilitate the conversion of food to energy. It acts as a coenzyme in several metabolic reactions that aid in the metabolism of fats and carbohydrates and the conversion of amino acids from protein into energy.*\r\n\r\nCorePlex®: An optimal formulation of vitamins, minerals, antioxidants, and trace elements needed by the body to promote and sustain long-term health and well being.* By combining this synergistic blend of 36 nutrients, CorePlex supports healthy bone structure and growth as well as provides optimum nutritional support for healthy muscle, connective tissue and skin.*\r\n\r\nOmegaPlex®: A safe, convenient and easy way to get the omega-3 fatty acids that may be missing in your diet. OmegaPlex contains a concentrate of at least 500mg long-chain omega-3 fatty acids, 300mg EPA and 200mg DHA. Omega-3 fatty acids such as those present in OmegaPlex help support cardiovascular health in combination with a healthy diet and exercise.*\r\n\r\nProBiotic Restore™ ULTRA: Probiotics are beneficial microorganisms that confer health benefits on the host. Our bodies must maintain a healthy balance of beneficial bacteria and harmful bacteria to work at its best. The multi-strain probiotic complex in ProBiotic Restore ULTRA provides six high potency strains - three species of Lactobacillus and three species of Bifidobacterium. Two billion colony forming units (CFU) ensure full coverage of both the small and large intestines. ProBiotic Restore ULTRA helps replenish normal beneficial intestinal microflora to support healthy immune and intestinal function, while aiding good digestion and enhancing weight management programs.*\r\n\r\nCalcium Plus:An incredibly effective way to ensure you receive enough calcium to keep bones and teeth strong and healthy.* Calcium Plus delivers two types of highly absorbable calcium, combined with other minerals, vitamins and botanicals.\r\n\r\nAmplify A.T.: A revolutionary formula that combines two potent and unique natural ingredients that produce advanced nutritional benefits.* These two super-nutrients, astaxanthin and tocotrienols, are the real secret behind the power of Amplify A.T. For anyone who wants to fight the aging process, Amplify A.T. can help by strengthening the immune system, maintaining healthy blood pressure levels already in the normal range, and providing excellent nutrition for joint health and mobility.\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•Consume contents of one (4-packet) strip pack each day.\r\n•Take contents of one Copper Packet 30 minutes before breakfast.\r\n•Take contents of both White Packets with a meal, preferably with breakfast.\r\n•Take contents of remaining Copper Packet 30 minutes before lunch.\r\nCAUTION: Do not take more than the contents of one strip pack per day. If you are pregnant or nursing, please seek the advice of a healthcare professional before using this product.\r\nThis product contains herbal sources of caffeine comparable to one cup of coffee per day. \r\n\r\nKEEP OUT OF REACH OF CHILDREN: In case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\nKEY INGREDIENTS\r\n\r\nvitamins A, C, D, E, B-6, B-12, folic acid, niacin, riboflavin, omega-3 fatty acids, astaxanthin, calcium, citrus flavonoids, green tea extract, lutein, lycopene, guarana, biotin, oolong tea, taurine, lactobacillus acidophilus, bifdobacterium, bifidum, artichoke, magnesium, zinc, chromium. \r\n\r\nFor more information, please see separate product detail listings for these AdvoCare products: CorePlex®, OmegaPlex®, ProBiotic Restore™ ULTRA, Calcium Plus, Amplify A.T.","options":[{"id":50669115,"name":"14 Day Supply","price":45.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129436758/-/T1131.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129436758/-/T1131.jpg","width":155,"height":165}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15577368,"name":"MNS Max C","permalink":"mns-max-c","position":30,"price":43.95,"default_price":43.95,"tax":0.0,"url":"/product/mns-max-c","status":"active","on_sale":false,"created_at":"2013-12-15T21:28:46.000Z","description":"Metabolic Nutrition Systems (MNS®) help you target your specific weight management challenges.* MNS Maximum Appetite Control is a safe and powerful blend of botanical extracts designed to work on the appetite control center of the brain.* Recent studies suggest that 5-HTP, an ingredient found in MNS Maximum Appetite Control, may send \"fullness signals\" to the food intake centers of the brain, helping you limit the amount of food (and calories) you consume.* 5-HTP is the precursor for serotonin, a key neurochemical involved in mood and appetite. Low serotonin levels are associated with obesity, excessive carbohydrate and fat intake, low energy and depression. Furthermore, other components found in MNS Maximum Appetite Control may have additional appetite suppressing effects.* Together, these appetite suppressing components combined with the core nutrition, omega-3 fatty acids, metabolic enhancers, and probiotics in MNS Maximum Appetite Control provide a synergistic blend to help you get the results you want.*+\r\n\r\n\r\nMNS Max C Contents:\r\nBefore Breakfast Color Packet\r\nMetabolic Enhancer - 2 caplets\r\nThermo T - 1 caplet\r\nProBiotic Restore ULTRA - 1 capsule\r\nBefore Lunch Color Packet\r\nMetabolic Enhancer - 2 caplets\r\nThermo T - 1 caplet\r\nWhite Packet\r\nCorePlex - 3 caplets\r\nCitriSate - 1 caplet\r\nWhite Packet\r\nOmegaPlex - 1 softgel\r\n\r\nListed below are the primary function(s) of each component in MNS:\r\n\r\nThermogenesis*: A unique combination of tea extracts and other nutrients that enhances the body's basic metabolic rate and thereby increases calorie use and fat oxidation.* This exclusive product contains oolong, black, white and green mate tea extracts.\r\n\r\nMetabolic Enhancer*: A blend of safe and powerful herbal extracts, vitamins and minerals that help boost the body's energy systems to provide moderate appetite control and support your body's ability to burn calories more effectively.*\r\n\r\nCorePlex® multivitamin/mineral supplement: CorePlex is a high-potency, comprehensive multivitamin and mineral supplement that provides a strong foundation of basic nutrition.* Each serving provides 36 vitamins, minerals and nutrients in a highly absorbable form to give you complete core nutrition, fill your nutritional gaps and receive maximum benefits and results.*\r\n\r\nOmegaPlex® supplement: OmegaPlex is a blend of omega-3 fatty acids that¿s high in purity and effectiveness. Omega-3s are essential for a multitude of biological and physiological functions, including proper brain development, strengthened immune and cardiovascular systems and healthier skin and hair.*\r\n\r\nProBiotic Restore™ ULTRA supplement: Probiotics are beneficial microorganisms that confer health benefits on the host. Our bodies must maintain a healthy balance of beneficial bacteria and harmful bacteria to work at its best. The multi-strain probiotic complex in ProBiotic Restore ULTRA provides six high potency strains - three species of Lactobacillus and three species of Bifidobacterium. Two billion colony forming units (CFU) ensure full coverage of both the small and large intestines. ProBiotic Restore ULTRA helps replenish normal beneficial intestinal microflora to support healthy immune and intestinal function, while aiding good digestion and enhancing weight management programs.*\r\n\r\nAppetite Suppressant*: A synergistic mix helps you take more control over your eating habits by influencing your appetite control center.*\r\n\r\nIs this you?\r\nSomeone who needs help reducing caloric intake and losing weight\r\nSomeone who has trouble controlling your appetite\r\nSomeone who wants to make better food choices and lower your portion sizes\r\nSomeone who struggles with snacking on foods high in calories, sugar and/or fats\r\nDIRECTIONS\r\n\r\n•For ages 18 and older.\r\n•Consume the contents of one 4-packet strip pack each day.\r\n•Take the contents of one Gold Packet 30 minutes before breakfast.\r\n•Take the contents of both White Packets with a meal, preferably breakfast.\r\n•Take the contents of the remaining Gold Packet 30 minutes before lunch.\r\n\r\nWARNING: Do not take more than the contents of one strip pack per day. If you are pregnant, nursing or under the age of 18, please seek the advice of a healthcare professional before using this product.\r\n\r\nKEEP OUT OF REACH OF CHILDREN: In case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\n\r\nCaution: Children and pregnant or nursing women should consult a healthcare professional prior to use. Not for use by persons who are sensitive to caffeine or choline.\r\nKEY INGREDIENTS\r\n\r\n5-Hydroxytryptophan, citrus flavonoids, green tea extract, L-carnitine, taurine, garlic powder (odorless), coenzyme Q-10, guarana extract, gymnema extract, omega-3 fatty acids, folic acid, vitamin B-12, vitamin B-6, lutein, lycopene, N-acetylcysteine, white tea extract, black tea extract, green mate extract \r\n\r\nFor more information, please see separate product detail listings for these AdvoCare products: \r\nCorePlex® multivitamin/mineral supplement\r\nOmegaPlex® supplement\r\nProBiotic Restore™ ULTRA supplement.","options":[{"id":50669358,"name":"14 Day Supply","price":43.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129436869/-/T1172.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129436869/-/T1172.jpg","width":143,"height":165}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15577335,"name":"MNS Max E","permalink":"mns-max-e","position":31,"price":43.95,"default_price":43.95,"tax":0.0,"url":"/product/mns-max-e","status":"active","on_sale":false,"created_at":"2013-12-15T21:27:13.000Z","description":"Metabolic Nutrition Systems (MNS®) help you target your specific weight management challenges.* MNS Maximum Energy contains a proprietary blend of botanical extracts and nutrients designed to help \"rev up\" metabolism.*+ It reflects years of research and development at AdvoCare®, where our Scientific and Medical Advisory Board has searched the world for the safest and most effective energy boosters.* It is the synergistic blends and scientifically proportional amounts of ingredients used in MNS Maximum Energy that make it an exceptional solution for weight management.* For added metabolism support, use it in conjunction with ThermoPlus™ Vitamin and Herbal Supplement.\r\n\r\n\r\nMNS Max E Contents:\r\nBefore Breakfast Color Packet\r\nMetabolic Enhancer - 2 caplets\r\nThermo P - 2 caplet\r\nProBiotic Restore ULTRA - 1 capsule\r\nBefore Lunch Color Packet\r\nMetabolic Enhancer - 2 caplets\r\nThermo P - 2 caplet\r\nWhite Packet\r\nCorePlex - 3 caplets\r\nWhite Packet\r\nOmegaPlex - 1 softgel\r\n\r\n\r\nListed below are the primary function(s) of each component in MNS:\r\n\r\nThermogenesis/Energy*: This unique formulation of herbal ingredients helps increase energy, support metabolic efficiency and suppress your appetite.* The oolong tea extract helps ignite your body's natural ability to produce energy so you feel more vibrant and ready to do more.* It contains oolong tea extract to help ignite your body's natural ability to produce energy.* It's the sustained energy comes from the thermogenic/energy ingredients is that makes MNS Maximum Energy a powerful source of energy and more efficient metabolism.*\r\n\r\nMetabolic Enhancer*: This key component is a blend of safe and powerful herbal extracts, vitamins and minerals that help boost the body's energy systems while also providing appetite control. The botanical extracts in Metabolic Enhancer support the body's ability to reduce appetite and burn calories more effectively.\r\n\r\nCorePlex® multivitamin/mineral supplement: CorePlex is a high-potency, comprehensive multivitamin and mineral supplement that provides a strong foundation of basic nutrition.* Each serving provides 36 vitamins, minerals and nutrients in a highly absorbable form to give you complete core nutrition, fill your nutritional gaps and receive maximum benefits and results.*\r\n\r\nOmegaPlex® supplement: OmegaPlex is a blend of omega-3 fatty acids that's high in purity and effectiveness. Omega-3s are essential for a multitude of biological and physiological functions, including proper brain development, strengthened immune and cardiovascular systems and healthier skin and hair.*\r\n\r\nProBiotic Restore™ ULTRA supplement: Probiotics are beneficial microorganisms that confer health benefits on the host. Our bodies must maintain a healthy balance of beneficial bacteria and harmful bacteria to work at its best. The multi-strain probiotic complex in ProBiotic Restore ULTRA provides six high potency strains - three species of Lactobacillus and three species of Bifidobacterium. Two billion colony forming units (CFU) ensure full coverage of both the small and large intestines. ProBiotic Restore ULTRA helps replenish normal beneficial intestinal microflora to support healthy immune and intestinal function, while aiding good digestion and enhancing weight management programs.*\r\n\r\nIs this you?\r\nSomeone who wants to lose weight and improve lean body mass\r\nSomeone who feels that a lack of energy is keeping you from following through with fitness and nutritional goals\r\nSomeone who needs some help controlling your appetite and food choices\r\nSomeone who needs a well-rounded approach to weight management\r\nSomeone who has tried other weight-management programs that have not delivered the expected results\r\nDIRECTIONS\r\n\r\n•For ages 18 and older.\r\n•Consume the contents of one 4-packet strip pack each day.\r\n•Take contents of one Silver Packet 30 minutes before breakfast.\r\n•Take contents of both White Packets with a meal, preferably breakfast.\r\n•Take contents of remaining Silver Packet 30 minutes before lunch. \r\n\r\n\r\nWARNING: Do not take more than the contents of one strip pack per day. If you are pregnant, nursing or under the age of 18, please seek the advice of a healthcare professional before using this product.\r\n\r\nKEEP OUT OF REACH OF CHILDREN: In case of accidental overdose, seek professional assistance or contact a poison control center immediately.\r\n\r\nCaution: Children and pregnant or nursing women should consult a healthcare professional prior to use. Not for use by persons who are sensitive to caffeine or choline.\r\nKEY INGREDIENTS\r\n\r\nVitamin B-12, omega-3 fatty acids, gymnema, vitamin B-6, folic acid, garlic powder (odorless), taurine, green tea extract, guarana extract, lutein, lycopene, N-acetylcysteine\r\n\r\nFor more information, please see separate product detail listings for these AdvoCare products:\r\n\r\nCorePlex® multivitamin/mineral supplement\r\nOmegaPlex® supplement\r\nProBiotic Restore™ ULTRA supplement.","options":[{"id":50669250,"name":"14 Day Supply","price":43.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129436812/-/T1141.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129436812/-/T1141.jpg","width":143,"height":165}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15577431,"name":"Thermo Plus","permalink":"thermo-plus","position":32,"price":31.95,"default_price":31.95,"tax":0.0,"url":"/product/thermo-plus","status":"active","on_sale":false,"created_at":"2013-12-15T21:32:34.000Z","description":"ThermoPlus™ supplement is an innovative weight-loss enhancer that contains key botanical extracts to help support efficient metabolism and suppress appetite.* Together, they provide powerful support for stimulating fat oxidation and healthy metabolism when used in conjunction with a healthy diet and exercise.* Use it with a Metabolic Nutrition System (MNS®)for enhanced results.*\r\n\r\nIs this you?\r\nSomeone who is seeking to support your healthy metabolism\r\nSomeone who wants additional support in managing your diet as part of a weight-management program\r\nSomeone who wants to further enhance your current AdvoCare weight-management program\r\nSomeone who wants to increase your energy level\r\nSomeone looking to add support for weight loss to a current general health and wellness regimen\r\nDIRECTIONS\r\n\r\n•For ages 18 and older.\r\n•Take one capsule daily 30 minutes before a meal. \r\n•May be taken in conjunction with any of the Metabolic Nutrition System color packets.\r\n\r\nCaution: This product is not intended for pregnant or nursing women, or for children less than 18 years of age.\r\n\r\nKeep out of reach of children.\r\nKEY INGREDIENTS\r\n\r\nSage extract, oolong tea extract, guarana extract, thiamine, niacin","options":[{"id":50669583,"name":"90 Servings","price":31.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129437013/-/T4101.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129437013/-/T4101.jpg","width":240,"height":211}],"artists":[],"categories":[{"id":2334735,"name":"Trim","permalink":"trim","url":"/category/trim"}]},{"id":15575799,"name":"V12 Energy Drink","permalink":"v12-energy-drink","position":33,"price":38.95,"default_price":38.95,"tax":0.0,"url":"/product/v12-energy-drink","status":"active","on_sale":false,"created_at":"2013-12-15T19:51:31.000Z","description":"Based on an herbal adaptogen formula used for years by Russia's top athletes, V16® energy drink turns a glass of water into an effervescent pick-me-up that leaves you feeling refreshed and awake within minutes.* Each serving contains 13 essential vitamins, including B-vitamins, and three distinct adaptogens to help your body cope with stress and sustain energy for hours so you can perform at an optimal level both mentally and physically.*\r\nDIRECTIONS\r\n\r\n•For ages 12 and older.\r\n•Pour contents of one pouch into 8 fluid ounces of water.\r\n•Slightly shake or stir and allow to fizz.\r\n\r\nCaution: This product is not intended for women who are pregnant or nursing.\r\nKEY INGREDIENTS\r\n\r\nGolden root, leuzea extract, schisandra extract, vitamin B-6, vitamin B-12, thiamine, folic acid, niacin, vitamin K, biotin","options":[{"id":50664165,"name":"28 Servings","price":38.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.94,"amount_with_others":3.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129432825/-/A4372.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129432825/-/A4372.jpg","width":177,"height":156}],"artists":[],"categories":[{"id":2334733,"name":"Active","permalink":"active","url":"/category/active"}]},{"id":4383293,"name":"Optimum Wristbands","permalink":"optimum-wristbands","position":34,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/optimum-wristbands","status":"active","on_sale":true,"created_at":"2011-09-05T20:47:14.000Z","description":"\"Desire. Dedication. Determination.\"","options":[{"id":14400713,"name":"Black","price":8.0,"sold_out":false,"has_custom_price":false},{"id":14400715,"name":"Pink","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.99,"amount_with_others":0.99,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42879483/-/photo.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42879483/-/photo.JPG","width":1000,"height":747}],"artists":[],"categories":[{"id":2416523,"name":"Wristbands","permalink":"wristbands","url":"/category/wristbands"}]}]