[{"id":6130573,"name":"Koncept -  Watch The Sky Fall EP","permalink":"koncept-watch-the-sky-fall-ep","position":1,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/koncept-watch-the-sky-fall-ep","status":"active","on_sale":false,"created_at":"2012-05-08T01:15:11.000Z","description":" A long time ago we all got the message that it’s like a jungle sometimes, and Koncept wants to remind us all that it ain’t the adversity you face... it’s the way you face it. Koncept opens up a window into his world, and if you look through it you’ll find that there’s a lot of soul to be seen as we “Watch the Sky Fall.” Koncept tells it like it is, spitting verses about the obstacles in his path and the dreams he clings to as he struggles past them. Despite the apocalyptic title, there’s a current of optimism that runs through the record. Given the list of friends dropping in to help out; there should be. This may be a solo outing, but Koncept still has the support of his Brown Bag family (J57, The Audible Doctor and Soul Khan all make appearances) - as well as a bit of help from the likes of Royce da 5’9, Marco Polo, and DJ Brace.","options":[{"id":19558861,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":8.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/60190303/-/Koncept_-_Watch_The_Sky_Fall_EP__Cover_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/60190303/-/Koncept_-_Watch_The_Sky_Fall_EP__Cover_.jpg","width":995,"height":1000}],"artists":[],"categories":[{"id":3199609,"name":"Vinyl","permalink":"vinyl","url":"/category/vinyl"}]},{"id":6130783,"name":"DJ Brace - Nostomania","permalink":"dj-brace-nostomania","position":2,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/dj-brace-nostomania","status":"active","on_sale":true,"created_at":"2012-05-08T01:38:13.000Z","description":"Awarded 2009 Juno for best instrumental album\r\n\r\nCanadian DMC champion, DJ Brace presents an instrumental hip-hop album built from a crate filled with familiar sounds and things you've never heard. In the mysterious Electric Nosehair Orchestra, each nosehair is distinctively titled (NH1-NH14) to correspond with visual artwork, guiding the listener through the Nostomanian experience.\r\n\r\n    * nostomania, [nos-tuh-mey-nee-uh] -noun\r\n    * i: an irresistible compulsion to return home.\r\n    * ii: another dimension where the orchestra resides.\r\n\r\nOnce you begin to experience Nostomania you will rediscover where your home is and will have a clear picture to always bring you back; as a Nostomanian, the compulsion to return becomes irresistible. The Electric Nosehair Orchestra In Nostomania captures fleeting moments in time, but remains timeless. ","options":[{"id":19559561,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/60192287/-/NostomaniaVinyl.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/60192287/-/NostomaniaVinyl.jpg","width":401,"height":400}],"artists":[],"categories":[{"id":3199609,"name":"Vinyl","permalink":"vinyl","url":"/category/vinyl"}]},{"id":6130743,"name":"DJ Brace - Synesthasia","permalink":"synesthasia","position":3,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/synesthasia","status":"active","on_sale":false,"created_at":"2012-05-08T01:34:49.000Z","description":"After winning a Juno for best instrumental album of the year with Nostomania, Brace decided to start his own label by the same name to honor music of a similar kind. Nostomania records has already released a 7”, entitled Everyday featuring ESL Artists, Ancient Astronauts, and the Brown Bag AllStars. Synesthasia is the second album from Brace’s Electric Nosehair Orchestra Project. Brace has had a diverse DJ career that began over 10 years ago and features many highlights as a turntablist, producer and DJ instructor. DJ Brace has won numerous turntablist battles, including the DMC Canadian Championship in 2004 and placing 8th in the world. In 2005 Brace released a self titled LP entitled Soundbarriers, with legendprairie rapper Gruf. Brace’s music can also be heard on the Fox TV hit Prison Break. Brace has also scored music for the CBC. Debut solo album, Nostomania, won a Juno for Best Instrumental album of 2009. Summer 2009 a 12” Vinyl was released on ESL Music, with a Brace remix. Has DJ’d for Roxanne Shante. Brace currently resides in Montreal where he is actively composing and recording in the studio working on his solo material, collaborating with rap group Brown Bag\r\nAllStars, Ancient Astronauts, Microthol and Birdapres.\r\n\r\nPart of the concept for Nostomania was the idea that sound can pull up long neglected memories. Synesthaisa is something\r\nlike a crossed wire in the brain where one sense connects with another; a color might have a certain smell, or maybe you\r\ncan taste a sound. Once again visual artists were asked to provide images inspired by the songs on the record, but this time\r\naround don’t think about the places you’ve been.\r\nSynesthasia opens with something that sounds like a mothership landing at some distant port of call. That’s the first clue that\r\nyou’ve arrived in a strange land. Suddenly an unknown voice gives you the instruction to relax, and it’s time to let the music\r\ntake control of your senses and guide you on your journey.\r\nWhile there are some familiar elements from the last time around, it’s no longer what you’ve heard, seen, tasted or smelled\r\nbefore. So don’t be afraid to forge some new connections, and be sure to take a mental snapshot of whatever you might find.\r\n— Fishead ","options":[{"id":19559407,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":4.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/60191943/-/Synesthasia.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/60191943/-/Synesthasia.jpg","width":1000,"height":999}],"artists":[],"categories":[{"id":3199607,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":6130833,"name":"Brown Bag Season Vol.1 (X2CD)","permalink":"brown-bag-season-vol-1-x2cd","position":4,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/brown-bag-season-vol-1-x2cd","status":"active","on_sale":false,"created_at":"2012-05-08T01:43:38.000Z","description":"More than just another talented crew, the Brown Bag AllStars represent an attitude. There are those that feel that the face of hip-hop over the years has shifted from one that speaks from the heart, and tells it like it is, and has increasingly become one that brags about outrageous exploits and inflated bank accounts... but the BBAS are proof positive that a need for expression is still the fuel that powers the hip-hop engine. These guys live for this music.\r\nThey met up while working at Fat Beats (NYC): the virtual mecca of hip-hop... driven by a desire to live, eat and breathe the culture, they built an association around a common bond to do everything necessary to get their sound out there. This music isn’t about glory - it’s about tireless hard work, enormous passion and the serious skills to back it all up.\r\n\r\nThe Brown Bag AllStars consist of The Audible Doctor (MC/Producer), J57 (MC/Producer), Soul Khan (MC), Koncept (MC), DeeJay Element (DJ/Producer), E holla (DJ) & DJ Goo (DJ/Producer). Co-signed by DJ Premier, DJ Eclipse, Peter Rosenberg and many more, BBAS is the group to look out for in 2011. \r\n\r\nBrown Bag Season Vol. 1 is a double CD release of Brown Bag AllStars tracks. CD1 features production by Audible Doctor, J57, Marink, M-Phazes, Marco Polo and more. CD2 features Brown Bag AllStars remixes and original production by Juno Award winning (Canada’s Music Awards) Canadian DMC champion DJ Brace ","options":[{"id":19559659,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":6.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/60192729/-/BrownBagSeason_itunes_Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/60192729/-/BrownBagSeason_itunes_Cover.jpg","width":900,"height":900}],"artists":[],"categories":[{"id":3199607,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":6130811,"name":"DJ Brace F. Brown Bag AllStars - Everyday","permalink":"dj-brace-f-brown-bag-allstars-everyday","position":5,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/dj-brace-f-brown-bag-allstars-everyday","status":"active","on_sale":true,"created_at":"2012-05-08T01:41:50.000Z","description":"Everyday, featuring the Brown Bag AllStars, is the first release on Canadian DMC Champion and Juno Award winning DJ Brace's new label, Nostomania Records. B-side features a dubbed-out remix by ESL artists, The Ancient Astronauts. Every one of the artists featured on this 45 are on the grind everyday making music, doing shows, and trying to live as musicians. In the song Everyday MCs J57, Koncept & Soul Khan tell the story of that grind. ","options":[{"id":19559633,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":6.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/60192609/-/EverydayVinyl.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/60192609/-/EverydayVinyl.jpg","width":700,"height":665}],"artists":[],"categories":[{"id":3199609,"name":"Vinyl","permalink":"vinyl","url":"/category/vinyl"}]}]