[{"id":11688132,"name":"iCog Hades v2.0B: Wooden Steampunk Case w/ Bluetooth KB for the Apple iPad 3 and iPad 4","permalink":"icog-hades-v2-0b-wooden-steampunk-case-w-bluetooth-kb-for-the-apple-ipad-3-and-ipad-4","position":1,"price":424.0,"default_price":424.0,"tax":0.0,"url":"/product/icog-hades-v2-0b-wooden-steampunk-case-w-bluetooth-kb-for-the-apple-ipad-3-and-ipad-4","status":"active","on_sale":false,"created_at":"2013-06-10T07:14:19.000Z","description":"{{ The iCog Hades (TM) Case. Version 2.0B Boilerplate Ed. }}\r\n\r\n***********************************************\r\nNOTE: this is a custom item, made by hand; it needs a 4-week period of time to be manufactured. Please look at section titled: \"Handling Time and Available Shipping\" below.\r\n***********************************************\r\nNOTE The top part of the lid of the Hades is identical to the iCog Dionea case also in this shop.  To see more images, please click links below:\r\n\r\nhttp://j-wilhelm.deviantart.com/art/iCog-Hades-for-iPad-2-3-open-287451400\r\nhttp://j-wilhelm.deviantart.com/art/iCog-Hades-tm-for-iPad-r-2-3-287451648\r\n\r\nNOTE: This post is for Version 2 of Hades which fits iPad 3 and iPad 4 !! This case will not fit iPad 2; look at my store, there is another active post for the iCog Hades™ V.10B for the iPad® 2!!  If you can't see it please contact me.\r\n\r\n~~~\r\n\r\nDear ladies and gentlemen:\r\n\r\nThe time has come for me to push the boundary of possibilities. The iCog Hades™ case is named after the Greek god of the underworld, ruler of the abode of the dead, and this case is the natural progression for my case design parting from the iCog Dionaea™ (case for the iPad® 2) and the eCog Mercury™ (case for the Sony VAIO® F-Series laptop).\r\n\r\nThe iCog Hades™ combines the look of a Steampunk laptop with the practicality of an iPad case. It also captures the versatility of a bumper case with the functionality of a wireless keyboarded case. However, this is not where the story ends; the top lid on the iCog Hades™ is itself a stand-alone bumper case, and is detachable from the keyboard base. The keyboard is itself wireless, powered by two AAA batteries and communicated through to the iPad by way of Bluetooth® wireless technology, which is present in the iPad® 2 / 3.\r\n\r\n~~\r\n{{Design Updates}}\r\n\r\nLadies and gentlemen. Apple is now selling the iPad® 4 whic is morphologically identical to the iPad® 3 and the adaptation of Hades to the new iPad was very easy! The changes turned out to be absolutely minimal compared to the iPad® 2 (just thickness being the important measurement), especially with the way I build my cases.\r\n\r\nPlease note the top of the case (showing the copper sculpture on the 2nd and the inside on the 4th photos from top down, ), is -for all practical purposes- the same as the iCog Dionaea™ \"bumper\" case, the difference being that one side of the \"bumper case\" is structurally reinforced to withstand the force of the hinges and has special hardware that allows the case to be detached. Because of this I reserve the right to make small unannounced design adjustments as needed to this version (V1.0) and future versions. Other small unannounced changes may include small aesthetic details such as adding ultra-thin wood to the large keys in the keyboard, as I did in the eCog Mercury™ case for the Sony VAIO® F-Series laptop. I will probably be implementing these changes very soon, so if you have any questions feel free to contact me. Note the iCog Hades™ will even be offered in both \"Boilerplate\" ($424) and \"Diana\" (Metal \"lace\") Editions ($375), although the \"Diana\" edition is gounf to be released after the \"Boilkerplate,\" but again, please feel free to inquire by sending me a message.\r\n~~\r\n\r\n{{The top lid of the iCog Hades™ (description)}}\r\n\r\nThe top lid of the Cog Hades™ is a wooden frame-type case which leaves the touchscreen open for use (similar to \"bumper cases\"), but the back is closed and decorated with metal parts. The iPad® tablet slides into the case through a spring-gate\r\n\r\nThis case is handcrafted from scratch and NOT by using a laser CAD/CAM system as others you may see elsewhere. The iCog™ case is made primarily of wood, including Aspen, Poplar and Pine.\r\n\r\nThe reverse of the iCog Hades™, V. 2.0 \"Boilerplate,\" lid features a copper-sculpture on the back, reminiscent of steam-powered machinery. You have a pressure dial (non functional) essential for measuring the pressure of a boiler, and you have a thermometer as well (also non functional). Connecting the two “instruments,” you have two \"iron pipes\" (actually made of solid steel), and a couple of \"copper pipes\" (actually a solid copper wire) presumably, connecting the instruments, although one copper pipe seems to be redundant as the “third instrument” is “missing.” Several steel round covers hide the holes for \"missing instruments.\" Note the two \"iron pipes\" actually double as the legs for the iPad® case when you set it down on a table.\r\n\r\n“Should you see a temperature increase, followed by sudden pressure drop, gingerly set the steam-powered calculation tablet down on the floor. Then run to the nearest exit, as this is a symptom of a crack in the pressure vessel (boiler)”\r\n-Locomotive Engineer\r\n\r\nPlease note the rear of the case is designed to accommodate various decorations other than those shown; for example, in this store, see the 'Diana' version of the iCog Dione™ or Dionaea™ cases with a \"metal-lace\" backplate, or please send me an inquiry. If you have any requests, however please send me a message o_Q.\r\n\r\nThe case is hand-rubbed with English Walnut finish, and I used a Victorian-Era inspired black and white felt to cushion the phone (alternatively a Cranberry-Apple felt is available; see the listings for the \"iCog Dione\" in this store). A spring operated trap door, located at the bottom of the case locks open to let the iPad™ tablet in, and it also allows access to the USB / power adapter chord. The trap door shuts like a “mousetrap’ with a slight push, which I think gives the case a truly “antiquarian” 19th Century feel.\r\n\r\nMost of the front of the tablet’s glass front is unobstructed, on account that you have a front camera and the home button. Fully mechanized buttons activate the On/Off and Volume controls of the iPhone, however I do NOT provide an opening for the mute/screen lock switch.\r\n\r\nThe new mechanized buttons (which were introduced with Version 1.2 of the iCog Dione™ case for the iPhone®), feature a hollow copper tube fixed directly to the wood case and a brass-plated steel-spring mechanism to push back the buttons. The \"crown” of each button is a brass nut mounted on a zinc screw. This new arrangement is strong enough to allow your friends to play with the case even when the tablet is not in the case!\r\n\r\n{{The keyboard base of the iCog Hades™ (description)}}\r\n\r\nThe keyboard base is a relatively simple contraption, just a holder for the Bluetooth wireless keyboard, but it features the same type of English Walnut finish as the top lid, and the base also has two very strong spring-loaded hinges which force the lid shut when it is closed. Two curious hinged \"flaps\" cover the keys at either extreme of the case, and this is a design feature required by the fact that the Bluetooth Keyboard is slightly larger than the iPad® itself.\r\n\r\nThe wireless Bluetooth® keyboard is battery powered and uses 2 \"AAA\" batteries; the wireless signal is in fact compatible with Mac and iPad as well as other Apple® products (please inquire). Another feature of the keyboard base is that the wireless keyboard features the same design style as in the eCog Mercury case; the keyboard of the laptop features typewriter-style keys surrounded in solid brass bezels surrounding an off-white label.\r\n\r\n{{Availability of the iCog Hades™}}\r\n\r\nSales of the iCog Hades will started on the weekend of Saturday 25th of February 2012. If you don't see the post and are interested please contact me! The iCog Hades is sold as a made-to-order item requiring 20 \"work-days\" for manufacture and one day for shipping (work-day means Monday Through Friday no holidays, read \"Handling Time and Available Shipping\" section below!).\r\n\r\n\r\n{{ More About the iCog Hades™: design features }}\r\n\r\nNote the case does NOT fit Version 1 of the iPad®, and it does NOT fit the iPad® with the Smart Cover attached (but the Smart Cover can be removed easily as it is attached magnetically to the iPad® 2).\r\n\r\nThe iCog Hades™ is primarily made of wood. This design feature was entirely intentional on account that I needed to make sure the case was as electromagnetically transparent as possible, so wood was an obvious choice.\r\n\r\nEven so, having noted the advantages of the case I must do what's right and point to the nature of the device:\r\n\r\n1. I reserve the right to make small changes to the design to improve the performance of the case. Any significant changes will be reflected in photographs as time progresses and will have a specific version number. Examples: recently, I changed the size and shape of the camera hole of the iCog Dione™ for the iPhone ® to allow for better clearance in field of view for the rear camera lens and LED light (v.1.1); For the same Dione ™, I also changed the button mechanisms (v.1.2) which I described above, and I will frequently update the dial designs according to availability (v.1.2.1).\r\n\r\n2. Most notably there is some added size and weight, but this is a natural consequence of the wood construction and elegant brass ornaments, and any self-respecting Steampunk would never complain about the inconvenience of a few added ounces of weight in exchange for the elegance that ensues due to the possession of such a device.\r\n\r\n3. Please note the absence of the mute / screen lock button. This was an aesthetic compromise in the construction of the case. I'll explore how to resolve this issue in future releases.\r\n\r\n4. Any presence of metal around a cellular phone or Wi-Fi wireless tablet will have an effect on the signal transmission and reception. It can't be helped. Same can be told about GPS antennas. Please read paragraph below:\r\n\r\n{{ IMPORTANT NOTES and DISCLAIMERS }}\r\n\r\nThe metal back-plate has not been tested for electromagnetic interference with the 4G cellular signal, Wi-Fi wireless, and GPS signal reception. I can’t guarantee the use of the case will not result in a weakening in the reception/transmission of the signal, but it must be noted the metal decorations are electrically isolated from the antenna.\r\n\r\nOne additional note: the paragraph above is a \"generic\" disclaimer for all phones / tablets. To be realistic about the effect of the metal in the case on reception, however, I must note that the entire back of the iPad is blocked by it's own aluminum case! Pictures of the antennas (as revealed by \"teardown\" websites where you can see the inside of the iPad 2 and iPod 4), show the antenna modules are pointing toward the screen. In the case of the iCog Dionaea, the screen is entirely unobstructed, and wood is electromagnetically transparent. I think this is obvious, when considering an iPad should be able (on account of it's size), to be placed horizontally on a steel countertop and still operate! So not much effect, if any, related to signal blockage is to be expected due to the metal decorations. Because of this fact I should also issue the disclaimer below:\r\n\r\nI HAVE A NO RETURN POLICY FOR THIS ITEM BASED ON AESTHETICS (as you can see what you buy; contact me if you need more information).\r\n\r\nALSO NOTE I HAVE A NO RETURN POLICY FOR THIS ITEM BASED ON TRANSMISSION or RECEPTION PERFORMANCE CLAIMS, NOR WILL I ASSUME ANY RESPONSIBILITY FOR GPS RECEPTION PROBLEMS.\r\n\r\n{ Handling Time and Available Shipping }\r\n\r\nTHIS ITEM NORMALLY REQUIRES TWENTY (20) WORK-DAYS FOR MANUFACTURE AND ONE or TWO EXTRA DAYS FOR SHIPPING (1 WORK-DAY = MONDAY THROUGH FRIDAY, NO HOLIDAYS). ITEM WILL SHIP AT END OF 21st DAY OR BEGINNING OF 22nd AFTER PLACING AN ORDER\r\n\r\nTo keep the costs down, and for, I am offering shipping via United States Postal Service, \"Flat Rate Priority Mail\". If possible (national service), I will issue a \"Delivery Confirmation Number,\" which is equivalent to a tracking number (you can track at www.usps.com please allow 24 hrs. after shipping to have the number entered into the computer system). Shipping is available for the United States, Canada, Mexico, the European Union, Japan, South Korea, and Australia. For other parts of the world you must inquire first and indicate the shipping address.\r\n\r\nApple® iPod®, iPhone®, iPad ®, and Smart Cover® are registered trademarks of Apple, Inc.\r\nVAIO® is registered trademark of Sony Electronics, Inc. All Rights Reserved.\r\nBluetooth® is a registered trademark of Bluetooth SIG\r\niCog™ , eCog™, iCog Lid™, iCog Tactile™, iCog Dione™, iCog Dionaea™, iCog Hades™, eCog Aeneas™, eCog Aphrodite™, and eCog™ Mercury, are trademarks of John William Dunn. ","options":[{"id":36914628,"name":"Default","price":424.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":41.0,"amount_with_others":41.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":14.0,"amount_with_others":14.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":60.0,"amount_with_others":60.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115096386/-/Hades1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115096386/-/Hades1.jpg","width":570,"height":417}],"artists":[],"categories":[]},{"id":11688036,"name":" iCog Dionaea Wooden Steampunk Case for the Apple iPad 2/3/4 Boilerplate Edition","permalink":"icog-dionaea-wooden-steampunk-case-for-the-apple-ipad-2-3-4-boilerplate-edition","position":2,"price":265.0,"default_price":265.0,"tax":0.0,"url":"/product/icog-dionaea-wooden-steampunk-case-for-the-apple-ipad-2-3-4-boilerplate-edition","status":"active","on_sale":false,"created_at":"2013-06-10T07:02:07.000Z","description":"{{ The iCog Dionaea™ Case. Version 1.0B with “Boilerplate” metal-work back }}\r\n\r\n***********************************************\r\nNOTE: this is a custom item, made by hand; it needs a 4-week period of time to be manufactured. Please look at section titled: \"Handling Time and Available Shipping\" below.\r\n***********************************************\r\n\r\nNEWS UPDATE, Oct. 23, 2012: Apple has released the IPAD MINI. This new smaller iPad will also have its own case, and it's named iCog Gaia™ If not found in the store please contact me.\r\n~ ~ ~\r\n\r\nNamed after Dione, the ancient pre-Classic Greek goddess, this case is intended to be a technological nod to the Oracle cults. This is an item for the discerning Lady or Gentleman who wishes to remain anachronistically proper while enjoying the benefits of living in the 21st century.\r\n\r\nA Steampunk Case for use with the Apple® iPad® Mini, the iCogDionaea™ is a wooden frame-type case which leaves the touch-screen open for use (similar to \"bumper cases\"), but the back is closed and decorated with metal parts. The iPad® tablet slides into the case through a gate at the bottom of the case.\r\n\r\nNOTE: the case does NOT fit Version 1of the iPad®. The case only fits the iPad® 2,3,4 with the \"Smart Cover\" detached.\r\n\r\n~~~\r\n\r\nThe item is sold as a made-to-order item requiring 20 \"work-days\" for manufacture and one day for shipping (work-day means Monday Through Friday no holidays, read \"Handling Time and Available Shipping\" section below!).\r\n\r\n~~~\r\n\r\nThis case is handcrafted from scratch and NOT by using a laser CAD/CAM system as others you may see elsewhere. The iCog™ case is made primarily of wood, including Aspen, Poplar and Pine.\r\n\r\nThe reverse of the iCogDionaea™ \"Boilerplate,\" features a copper-sculpture on the back, reminiscent of steam-powered machinery. You have a pressure dial (non functional) essential for measuring the pressure of a boiler, and you have a thermometer as well (also non functional). Connecting the two “instruments,” you have two \"iron pipes\" (actually made of solid steel), and a couple of \"copper pipes\" (actually a solid copper wire) presumably, connecting the instruments. Note the two \"iron pipes\" actually double as the legs for the iPad® case when you set it down on a table.\r\n\r\n“Should you see a temperature increase, followed by sudden pressure drop, gingerly set the steam-powered calculation tablet down on the floor. Then run to the nearest exit, as this is a symptom of a crack in the pressure vessel (boiler)”\r\n-Locomotive Engineer\r\n\r\nPlease note the rear of the case is designed to accommodate various decorations other than those shown; for example, in this store, see the 'Diana' version of the iCog Dione with a \"metal-lace\" backplate, or please send me an inquiry. If you have any requests, however please send me a message o_Q.\r\n\r\nThe case is hand-rubbed with English Walnut finish, and I used a Victorian-Era inspired black and white felt to cushion the phone (alternatively a Cranberry-Apple felt is available; see the listings for the \"iCog Dione\" in this store). A spring operated trap door, located at the bottom of the case locks open to let the iPad™ tablet in, and it also allows access to the USB / power adapter chord. The trap door shuts like a “mousetrap’ with a slight push, which I think gives the case a truly “antiquarian” 19th Century feel.\r\n\r\nMost of the front of the tablet’s glass front is unobstructed, on account that you have a front camera and the home button. Fully mechanized buttons activate the On/Off and Volume controls of the iPhone, however I do NOT provide an opening for the mute/screen lock switch.\r\n\r\nThe new mechanized buttons (which were introduced with Version 1.2 of the iCog Dione™ case for the iPhone®), feature a hollow copper tube fixed directly to the wood case and a brass-plated steel-spring mechanism to push back the buttons. The \"crown” of each button is a brass nut mounted on a zinc screw. This new arrangement is strong enough to allow your friends to play with the case even when the tablet is not in the case!\r\n\r\n\r\n\r\n{{ About the iCog Dionaea design features }}\r\n\r\nThe iCog Dionaea™ is primarily made of wood. This design feature was entirely intentional on account that I needed to make sure the case was as electromagnetically transparent as possible, so wood was an obvious choice.\r\n\r\nEven so, having noted the advantages of the case I must do what's right and point to the nature of the device:\r\n\r\n1. I reserve the right to make small changes to the design to improve the performance of the case. Any significant changes will be reflected in photographs as time progresses and will have a specific version number. Examples: recently, I changed the size and shape of the camera hole of the iCog Dione™ for the iPhone ® to allow for better clearance in field of view for the rear camera lens and LED light (v.1.1); For the same Dione ™, I also changed the button mechanisms (v.1.2) which I described above, and I will frequently update the dial designs according to availability (v.1.2.1).\r\n\r\n2. Most notably there is some added size and weight, but this is a natural consequence of the wood construction and elegant brass ornaments, and any self-respecting Steampunk would never complain about the inconvenience of a few added ounces of weight in exchange for the elegance that ensues due to the possession of such a device.\r\n\r\n3. Please note the absence of the mute / screen lock button. This was an aesthetic compromise in the construction of the case. I'll explore how to resolve this issue in future releases.\r\n\r\n4. Any presence of metal around a cellular phone or Wi-Fi wireless tablet will have an effect on the signal transmission and reception. It can't be helped. Same can be told about GPS antennas. Please read paragraph below:\r\n\r\n{{ IMPORTANT NOTES and DISCLAIMERS }}\r\n\r\nThe metal back-plate has not been tested for electromagnetic interference with the 4G cellular signal, Wi-Fi wireless, and GPS signal reception. I can’t guarantee the use of the case will not result in a weakening in the reception/transmission of the signal, but it must be noted the metal decorations are electrically isolated from the antenna.\r\n\r\nOne additional note: the paragraph above is a \"generic\" disclaimer for all phones / tablets. To be realistic about the effect of the metal in the case on reception, however, I must note that the entire back of the iPad is blocked by it's own aluminum case! Pictures of the antennas (as revealed by \"teardown\" websites where you can see the inside of the iPad 2 and iPod 4), show the antenna modules are pointing toward the screen. In the case of the iCog Dionaea, the screen is entirely unobstructed, and wood is electromagnetically transparent. I think this is obvious, when considering an iPad should be able (on account of it's size), to be placed horizontally on a steel countertop and still operate! So not much effect, if any, related to signal blockage is to be expected due to the metal decorations. Because of this fact I should also issue the disclaimer below:\r\n\r\nALSO NOTE I HAVE A NO RETURN POLICY FOR THIS ITEM BASED ON TRANSMISSION or RECEPTION PERFORMANCE CLAIMS, NOR WILL I ASSUME ANY RESPONSIBILITY FOR GPS RECEPTION PROBLEMS.\r\n\r\n{ Handling Time and Available Shipping }\r\n\r\nTHIS ITEM NORMALLY REQUIRES FIFTEEN (20) WORK-DAYS FOR MANUFACTURE AND ONE or TWO EXTRA DAYS FOR SHIPPING (1 WORK-DAY = MONDAY THROUGH FRIDAY, NO HOLIDAYS). ITEM WILL SHIP AT END OF 21st DAY OR BEGINNING OF 22th AFTER PLACING AN ORDER\r\n\r\nTo keep the costs down, and for, I am offering shipping via United States Postal Service, \"Flat Rate Priority Mail\". If possible (national service), I will issue a \"Delivery Confirmation Number,\" which is equivalent to a tracking number (you can track at www.usps.com please allow 24 hrs. after shipping to have the number entered into the computer system). Shipping is available for the United States, Canada, Mexico, the European Union, Japan, South Korea, and Australia. For other parts of the world you must inquire first and indicate the shipping address.\r\n\r\nApple® iPod®, iPhone®, iPad ®, and Smart Cover® are registered trademarks of Apple, Inc.\r\niCog™ , eCog™, iCog Lid™, iCog Tactile™, iCog Dione™, iCog Dionaea™,iCog Gaia™, eCog Aeneas™ and eCog Aphrodite™ are trademarks of John William Dunn.","options":[{"id":36914421,"name":"Default","price":265.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":41.0,"amount_with_others":41.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":14.0,"amount_with_others":14.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":60.0,"amount_with_others":60.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115095438/-/DionaeaCombo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115095438/-/DionaeaCombo.jpg","width":570,"height":400}],"artists":[],"categories":[]},{"id":11688006,"name":"Steampunk case for the Samsung Galaxy Note II smartphone: The eCog Aeneas GN2 Boilerplate Ed.","permalink":"steampunk-case-for-the-samsung-galaxy-note-ii-smartphone-the-ecog-aeneas-gn2-boilerplate-ed","position":3,"price":135.0,"default_price":135.0,"tax":0.0,"url":"/product/steampunk-case-for-the-samsung-galaxy-note-ii-smartphone-the-ecog-aeneas-gn2-boilerplate-ed","status":"active","on_sale":false,"created_at":"2013-06-10T06:57:02.000Z","description":"{{ The eCog Aeneas™ Case. Version 1.0GN2B with “Boilerplate” back}}\r\n\r\n***********************************************\r\nNOTE: this is a custom item, made by hand; it needs a 2-week period of time to be manufactured. Please look at section titled: \"Handling Time and Available Shipping\" below.\r\n***********************************************\r\n\r\nNamed after the ancient Greek god Aeneas, brother of Aphrodite, this is an item for the discerning Lady or Gentleman who wishes to remain anachronistically proper while enjoying the benefits of living in the 21st century.\r\n\r\nThis is a recent commission from a customer in Qatar; he requested a Steampunk case be developed for use with the Samsung Galaxy™ Note II \"phablet.\". Since I have already developed this case, I will offer it to explore the market with this type of phone.\r\n\r\nThe item is sold as a made-to-order item requiring 15 \"work-days\" for manufacture and two to three days for shipping (work-day means Monday Through Friday no holidays).\r\n\r\nIMPORTANT! Note the case does NOT fit any other version in Samsung Galaxy™ lineup, because these devices bearing the name \"Galaxy\" (such as Galaxy SII and Galaxy SIII) have different dimensions. I have taken, however, a special commission for the Galaxy SIII (S3) under the same name of eCog Aeneas™ , depending on what kind of market I see, please inquire if you're interested.\r\n\r\n~ ~ ~\r\nAbout the eCog™ Aeneas construction...\r\n\r\nThis case is handcrafted from scratch and NOT by using a laser CAD/CAM system as others you may see elsewhere. The eCog ™ case is made primarily of wood, including Aspen, Poplar and Pine. Most of the front of the phone front is unobstructed, on account that you have a front camera, the auricular speaker, etc.\r\n\r\nThe case is hand-rubbed with English Walnut finish, and I used a Black and White Patterned felt and Cranberry-Apple felt to cushion the phone. A spring operated trap door locks open to let the phone in and shuts like a “mousetrap’ with a slight push, which I think gives the case a truly “antiquarian” 19th Century feel. Plainly stated, it looks like an antique.\r\n\r\nIn true Steampunk fashion, the case features mechanized buttons first introduced in Version 1.2 of the iCog Dione™, and feature a hollow copper tube fixed directly to the wood case and a brass-plated steel-spring mechanism to push back the buttons (previous versions relied solely on a neoprene rubber tab to hold the buttons in place, so the new arrangement is much stronger). The \"crown of the button is a brass nut mounted on a zinc screw. This new arrangement allows your friends to play with the case even when the phone is not in the case!\r\n\r\nThe reverse of the eCog Aeneas™, Version 1.0B features copper and copper-plated steel decorations in the rear, reminiscent of steam-engine machinery and water pipes.\r\n\r\n{{ IMPORTANT NOTES and DISCLAIMERS }}\r\n\r\nThe metal back-plate has not been tested for electromagnetic interference with the 4G cellular signal and/or GPS signal reception. I can’t guarantee to prevent a weakening in the reception/transmission of the signal, but it must be noted that the plate decorations are electrically isolated from the antenna. ALSO NOTE I HAVE A NO RETURN POLICY FOR THIS ITEM BASED ON TRANSMISSION or RECEPTION PERFORMANCE CLAIMS, NOR WILL I ASSUME ANY RESPONSIBILITY FOR GPS RECEPTION PROBLEMS.\r\n\r\n{Handling Time and Available Shipping }\r\nTHIS ITEM REQUIRES FIFTEEN (15) WORK-DAYS FOR MANUFACTURE AND TWO TO THREE EXTRA DAY FOR SHIPPING (1 WORK-DAY =MONDAY THROUGH FRIDAY, NO HOLIDAYS). ITEM WILL SHIP AT END OF 17th DAY OR BEGINNING OF 18th AFTER PLACING AN ORDER.\r\n\r\nTo keep the costs down, and for more inexpensive items like this one, I will only ship via United States Postal Service, \"Flat Rate Priority Mail\" service. I will issue a \"Delivery Confirmation Number,\" which is equivalent to a tracking number (you can track at www.usps.com please allow 24 hrs. after shipping to have the number entered into the computer system). Shipping is available for the United States, Canada, Mexico, the European Union, Japan, South Korea, and China.\r\n\r\nGalaxy™, Galaxy SII™, Galaxy SIII, Galaxy Note™,and Galaxy Note II, are trademarks of Samsung Corporation.\r\niCog™ , eCog™, iCog Dione™, eCog Aphrodite™ and eCog Aeneas™ are trademarks of John William Dunn.\r\n\r\n","options":[{"id":36914280,"name":"Default","price":135.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":20.0,"amount_with_others":20.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":6.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":24.0,"amount_with_others":24.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115095102/-/EcogAeneasGN2Combo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115095102/-/EcogAeneasGN2Combo.jpg","width":570,"height":394}],"artists":[],"categories":[]},{"id":11687958,"name":"Steampunk case for the Samsung Galaxy S4 smartphone: eCog Aeneas SGS4 Boilerplate Ed.","permalink":"steampunk-case-for-the-samsung-galaxy-s4-smartphone-ecog-aeneas-sgs4-boilerplate-ed","position":4,"price":135.0,"default_price":135.0,"tax":0.0,"url":"/product/steampunk-case-for-the-samsung-galaxy-s4-smartphone-ecog-aeneas-sgs4-boilerplate-ed","status":"active","on_sale":false,"created_at":"2013-06-10T06:50:40.000Z","description":"{{ The eCog Aeneas™ Case. Version 1.0SGS4B with “Boilerplate” back}}\r\n\r\n***********************************************\r\nNOTE: this is a custom item, made by hand; it needs a 2-week period of time to be manufactured. Please look at section titled: \"Handling Time and Available Shipping\" below.\r\n***********************************************\r\n\r\nNamed after the ancient Greek god Aeneas, brother of Aphrodite, this is an item for the discerning Lady or Gentleman who wishes to remain anachronistically proper while enjoying the benefits of living in the 21st century.\r\n\r\nThis is a recent from the original Steampunk developed for use with the Samsung Galaxy™ SIII smartphone. Since I have already developed this case, It was rather easy to make the new model.\r\n\r\nThe item is sold as a made-to-order item requiring 15 \"work-days\" for manufacture and two to three days for shipping (work-day means Monday Through Friday no holidays).\r\n\r\nIMPORTANT! Note the case does NOT fit any other version in Samsung Galaxy™ lineup, because these devices bearing the name \"Galaxy\" (such as Galaxy SII and Galaxy SIII) have different dimensions. I have taken, however, special commissions for the Galaxy SII (S2) and Galaxy Note II under the same name of eCog Aeneas™ just using a different designation, depending on what kind of market I see, please inquire if you're interested.\r\n\r\n~ ~ ~\r\nAbout the eCog™ Aeneas construction...\r\n\r\nThis case is handcrafted from scratch and NOT by using a laser CAD/CAM system as others you may see elsewhere. The eCog ™ case is made primarily of wood, including Aspen, Poplar and Pine. Most of the front of the phone front is unobstructed, on account that you have a front camera, the auricular speaker, etc.\r\n\r\nThe case is hand-rubbed with English Walnut finish, and I used a Black and White Patterned felt and Cranberry-Apple felt to cushion the phone. A spring operated trap door locks open to let the phone in and shuts like a “mousetrap’ with a slight push, which I think gives the case a truly “antiquarian” 19th Century feel. Plainly stated, it looks like an antique.\r\n\r\nIn true Steampunk fashion, the case features mechanized buttons first introduced in Version 1.2 of the iCog Dione™, and feature a hollow copper tube fixed directly to the wood case and a brass-plated steel-spring mechanism to push back the buttons (previous versions relied solely on a neoprene rubber tab to hold the buttons in place, so the new arrangement is much stronger). The \"crown of the button is a brass nut mounted on a zinc screw. This new arrangement allows your friends to play with the case even when the phone is not in the case!\r\n\r\nThe reverse of the eCog Aeneas™, Version 1.0B features copper and copper-plated steel decorations in the rear, reminiscent of steam-engine machinery and water pipes.\r\n\r\n{{ IMPORTANT NOTES and DISCLAIMERS }}\r\n\r\nThe metal back-plate has not been tested for electromagnetic interference with the 4G cellular signal and/or GPS signal reception. I can’t guarantee to prevent a weakening in the reception/transmission of the signal, but it must be noted that the plate decorations are electrically isolated from the antenna. ALSO NOTE I HAVE A NO RETURN POLICY FOR THIS ITEM BASED ON TRANSMISSION or RECEPTION PERFORMANCE CLAIMS, NOR WILL I ASSUME ANY RESPONSIBILITY FOR GPS RECEPTION PROBLEMS.\r\n\r\n{Handling Time and Available Shipping }\r\nTHIS ITEM REQUIRES FIFTEEN (15) WORK-DAYS FOR MANUFACTURE AND TWO TO THREE EXTRA DAY FOR SHIPPING (1 WORK-DAY =MONDAY THROUGH FRIDAY, NO HOLIDAYS). ITEM WILL SHIP AT END OF 17th DAY OR BEGINNING OF 18th AFTER PLACING AN ORDER.\r\n\r\nTo keep the costs down, and for more inexpensive items like this one, I will only ship via United States Postal Service, \"Flat Rate Priority Mail\" service. I will issue a \"Delivery Confirmation Number,\" which is equivalent to a tracking number (you can track at www.usps.com please allow 24 hrs. after shipping to have the number entered into the computer system). Shipping is available for the United States, Canada, Mexico, the European Union, Japan, South Korea, and China.\r\n\r\nGalaxy™, Galaxy SII™, Galaxy SIII, Galaxy S4™, Galaxy Note™,and Galaxy Note II™, are trademarks of Samsung Corporation.\r\niCog™ , eCog™, iCog Dione™, eCog Aphrodite™ and eCog Aeneas™ are trademarks of John William Dunn.","options":[{"id":36914193,"name":"Default","price":135.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":20.0,"amount_with_others":20.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":6.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":24.0,"amount_with_others":24.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115094526/-/EcogAeneasSGS4Combo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115094526/-/EcogAeneasSGS4Combo.jpg","width":570,"height":424}],"artists":[],"categories":[]},{"id":11687904,"name":"The iCog Dione: Wooden Steampunk Case for Apple iPhone 5. Boilerplate Mk. II Ed.","permalink":"the-icog-dione-tm-wooden-steampunk-case-for-apple-iphone-r-5-boilerplate-mk-ii-ed","position":5,"price":99.95,"default_price":99.95,"tax":0.0,"url":"/product/the-icog-dione-tm-wooden-steampunk-case-for-apple-iphone-r-5-boilerplate-mk-ii-ed","status":"active","on_sale":false,"created_at":"2013-06-10T06:44:29.000Z","description":"{ The iCog Dione (TM) Case. Version 5.0B Mk. II with “Boilerplate Mark II” metal-work back }}\r\n\r\n~ For use with iPhone® 5 ~\r\n\r\n***********************************************\r\nNOTE: this is a custom item, made by hand; it needs a 2-week period of time to be manufactured. Please look at section titled: \"Handling Time and Available Shipping\" below.\r\n************************************************\r\n\r\n~ ~ ~\r\nLadies and Gentlemen:\r\n\r\nThis is the first revision of the style known as \"Boilerplate\" which made it's debut with the iCog Dione for the iPhone 4/4s and now is the default style for the iPhone 5 case. The old \"Boilerplate\" style used for iPhone 4s has been officially retired for good (see bottom picture for comparison); the Boilerplate Mk. I is on the left, and the Boilerplate Mk. II is on the right (both for iPhone 4/4s); this advertisement is for the Mk. II on the right hand side but made for the iPhone 5.\r\n\r\nNamed after the ancient pre-Classic Greek goddess Dione, and intended to be the “smart-phone” nod to the Oracle cults, this is an item for the discerning Lady or Gentleman who wishes to remain anachronistically proper while enjoying the benefits of living in the 21st century.\r\n\r\nNOTE: This is a Steampunk Case for use with the Apple® iPhone® 5. The case does NOT fit Versions 1/ 3 / 3GS or 4/4s of the iPhone® (Versions 2, 3, 4 respectively) and it does NOT fit any generation of the iPod® Touch (BUT, I do carry another case for the iPod® versions 2 , 3 and 4 and ecen the iPod Touch in my store! Please look around my shop!).\r\n~~~\r\n\r\nThe item is sold as a made-to-order item requiring 10 \"work-days\" for manufacture and 2-3 days for shipping (work-day means Monday Through Friday no holidays, please read \"Handling Time and Available Shipping\" section below!).\r\n\r\n~ ~ ~\r\nThis case is handcrafted from scratch and NOT by using a laser CAD/CAM system as others you may see elsewhere. The iCog™ case is made primarily of wood, including Aspen, Poplar and Pine.\r\n\r\nMost of the front of the phone front is unobstructed, on account that you have a front camera, the auricular speaker, and proximity sensors. Fully mechanized buttons activate the On/Off and Volume controls of the iPhone, however I do NOT provide an opening for the mute switch.\r\n\r\nThe mechanized buttons of the Dione feature a hollow copper tube fixed directly to the wood case and a brass-plated steel-spring mechanism to push back the buttons (previous versions relied solely on a neoprene rubber tab to hold the buttons in place, so the new arrangement is much stronger). The \"crown of the button is a brass nut mounted on a zinc screw. This new arrangement allows your friends to play with the case even when the phone is not in the case!\r\n\r\nThe case is hand-rubbed with English Walnut finish, and I used a Cranberry-Apple felt to cushion the phone. A spring operated trap door locks open to let the phone in and to allow access to the USB power adapter chord, and shuts like a “mousetrap’ with a slight push, which I think gives the case a truly “antiquarian” 19th Century feel.\r\n\r\nThe reverse of the iCog Dione™, Version 5.0B Mk. II \"Boilerplate,\" features a derivative of the original iCog Lid™ copper-sculpture on the back. Please note the rear of the case is designed to accommodate various decorations other than those shown, and I will soon have ANOTHER version of the Dione with a \"metal-lace\" backplate (V. 5.0D \"Diana,\" see the other items in my store or please send me an inquiry). The \"Boilerplate\" version is also more expensive because its two different projects rolled into one (Dione \"Basic\" + \"iCog Lid™\" ). If you have any requests, however please send me a message as perhaps you might have an idea for a custom commission!! o_Q.\r\n\r\n\r\n{{ About the iCog Dione design features }}\r\n\r\n1. I reserve the right to make small changes to the design to improve the performance of the case. Any significant changes will be reflected in photographs as time progresses and will have a specific version number. Examples: recently, I changed the size and shape of the camera hole to allow for better clearance in field of view for the rear camera lens and LED light (v.1.1), changed the button mechanisms (v.1.2) and updated the dial design (v.1.2.1).\r\n\r\n2. Most notably there is some added size and weight, but this is a natural consequence of the wood construction and elegant brass ornaments, and any self-respecting Steampunk would never complain about the inconvenience of a few added ounces of weight in exchange for the elegance that ensues due to the possession of such a device.\r\n\r\n3. Please note the absence of the Mute button. This was a compromise to allow for compatibility between the two variations of the iPhone® 4. I'll explore how to resolve this issue in future releases.\r\n\r\n4. The frame around the screen is a little thick, and in the \"vertical position\" some of the alphanumeric keys may be hard to hit. An easy workaround is the use of the screen in the \"horizontal mode\" position using the accelerometer, so as to make the on-screen keyboard a little larger. Since most of the front of the phone is exposed the extreme left and right letters in the keyboard will be completely unobstructed in the \"horizontal mode.\"\r\n\r\n5. Any presence of metal around a cellular phone will have an effect on the phone transmission and reception. It can't be helped. Same can be told about GPS antennas. Please read paragraph below:\r\n\r\n{{ IMPORTANT NOTES and DISCLAIMERS }}\r\n\r\nThe metal back-plate has not been tested for electromagnetic interference with the 4G cellular signal and GPS signal reception. I can’t guarantee the use of the case will not result in a weakening in the reception/transmission of the signal, but it must be noted that the metallic decorations were reduced in size, compared to my other cases for the iPod®. The metal decorations are electrically isolated from the antenna, and you will find OEM replacement back-plates made with an aluminum skin, currently for sale -- available from manufacturers in China and other parts in the world which I shall not mention, so the performance of the phone should be –in theory- similar to those circumstances when you use those metal replacement back-plates. ALSO NOTE I HAVE A NO RETURN POLICY FOR THIS ITEM BASED ON TRANSMISSION or RECEPTION PERFORMANCE CLAIMS, NOR WILL I ASSUME ANY RESPONSIBILITY FOR GPS RECEPTION PROBLEMS.\r\n\r\n{ Handling Time and Available Shipping }\r\n\r\nTHIS ITEM NORMALLY REQUIRES TEN (10) WORK-DAYS FOR MANUFACTURE AND TWO or THREE EXTRA DAYS FOR SHIPPING (1 WORK-DAY =MONDAY THROUGH FRIDAY, NO HOLIDAYS). ITEM WILL SHIP AT END OF 13th DAY OR BEGINNING OF 14th AFTER ORDERING.\r\n\r\nTo keep the costs down, and for more inexpensive items like this one, I will only ship via United States Postal Service, \"Flat Rate Priority Mail\" service. I will issue a \"Delivery Confirmation Number,\" which is equivalent to a tracking number (you can track at www.usps.com please allow 24 hrs. after shipping to have the number entered into the computer system). Shipping is available for the United States, Canada, Mexico, the European Union, Japan, South Korea, and Australia.\r\n\r\nApple® iPod ®, iPad ®, and iPhone® are registered trademarks of Apple, Inc.\r\niCog™ , iCog Tactile™, iCog Lid™ and iCog Dione™ are trademarks of John William Dunn. ","options":[{"id":36914127,"name":"Default","price":99.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":20.0,"amount_with_others":20.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":6.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":24.0,"amount_with_others":24.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115094226/-/DioneBoilerplateMk2combo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115094226/-/DioneBoilerplateMk2combo.jpg","width":570,"height":421}],"artists":[],"categories":[]}]