[{"id":212956,"name":"Apple Iphone 3G","permalink":"apple-iphone-3g","position":1,"price":260.0,"default_price":260.0,"tax":0.0,"url":"/product/apple-iphone-3g","status":"active","on_sale":true,"created_at":"2009-01-07T13:22:31.000Z","description":"Just over a year after Apple birthed the first iPhone, the long-awaited, next-generation iPhone 3G has arrived bearing a mildly tweaked design and a load of new features. With access to a faster 3G wireless network, Microsoft Exchange server e-mail, and support for a staggering array of third-party software from the iPhone App Store, the new handset is the iPhone we've been waiting for. It still lacks some basic features but when compared with what the original model was year ago, this device sets a new benchmark for the cell phone world.\r\n\r\nWith the iPhone 3G, Apple appears to have fixed some call-quality performance issues we had with the previous model--in our initial tests, the volume is louder with less background buzz than before. The 3G reception could be improved, however. Music and video quality were largely unchanged, but we didn't have many complaints in that department to begin with.\r\n\r\nPrice may well remain our largest concern. New AT&T customers and most current AT&T customers can buy the iPhone 3G for $199 for the 8GB model and $299 for the 16GB model. If you don't qualify for that price--check your AT&T account to find out--you'll pay $399 and $499 respectively. Either way, you'll pay $15 more per month ($74.99 total) for a plan comparable with the original iPhone ($59 per month). So, while you'll pay less outright to buy the handset, you'll make it up over the course of a standard two-year AT&T contract.\r\n\r\nSo should you buy an iPhone 3G? If you haven't bought an iPhone yet, and have been holding out for a new model, now is the time. If you're a current iPhone owner and you're yearning for a faster cellular network, then you should take the plunge. But if you're an iPhone owner who won't use 3G (or can't; check your coverage at AT&T), then you should stick with your current model. The iPhone 2.0 software update provides Exchange server support, third-party apps support, and many new features without the added cost.\r\n\r\nDesign\r\nYou'd be hard-pressed to notice any design differences on the front of the iPhone 3G. The minor changes--the silver rim is thinner and the silver mesh behind the speaker--are so minimal we didn't notice them for a few hours after picking up the device. Turn the phone on its side, however, and you'll see more changes. Apple has replaced the aluminum silver back with a plastic face in either white or black. The black version (our review model) is attractive, but we admit that we miss the original silver, which shows fewer fingerprints and smudges than the shiny black version. The white model is not our cup of tea.\r\n\r\n\r\nFrom the front, the two iPhones look almost identical.\r\n\r\nThe iPhone 3G's edges are slightly tapered to accommodate the curved back, making the device thinner around its perimeter than its predecessor, but a hair thicker (0.48 inch versus 0.46 inch) in the gut. Unfortunately, the curved back makes the iPhone 3G wobble slightly if you use it while resting on a table--which quickly becomes annoying. The phone's height and width measurements (5.5 inches by 2.4 inches) remain the same, though it weighs just a tiny bit less (4.7 ounces versus 4.8 ounces).\r\n\r\n\r\nWe love the iPhone 3G's flush headset jack.\r\n\r\nAt 3.5 inches and 480x320 pixels, the display is the same size as its predecessor, but displays slightly more dots per inch (163 vs.160), and still cranks out brilliant colors, sharp graphics, and fluid movements. The layout of the home screen is identical to that on the first version, though you'll see two new icons from the outset: A Contacts icon takes you directly to your phone book, and the App Store icon opens the iTunes App Store. The display's glass surface, accelerometer feature, touch interface, and secondary menus remain the same.\r\n\r\n\r\nTiny screws can be found on the bottom of the iPhone 3G.\r\n\r\nThe iPhone's 3G controls reveal a few changes, but none will surprise a current iPhone user. The Home button sits below the display, while the volume rocker and ringer mute switch rest on the left spine. The Power/sleep button rests on top of the phone in its normal position. All controls are now silver instead of black. The SIM card slot hasn't moved either, and Apple now includes a SIM removal tool in the box. The bottom of the iPhone houses the speaker, the microphone, and the charger port, but you'll also notice two tiny screws on either side of the charger jack. Think maybe you'll be able to replace your own battery now? Bummer: The battery is still not user-replaceable, so we don't recommend trying it (although we hear the battery is no longer soldered down). We're very pleased that the iPhone 3G's 3.5mm headset jack now sits flush with the surface of the phone allowing you to use any 3.5mm headset you like; you're no longer restricted to a headset that can fit in the previous phone's inane recessed jack.\r\n\r\nIn the box you'll find the syncing cable, a display cleaning cloth, a headset, user documentation, the aforementioned SIM removal tool, and an electrical outlet plug. The plug is pleasantly smaller than on the original iPhone's, but it's compatible with a standard USB cable. On the downside, you don't get a syncing dock. If you want one, you have to shell out $30 for it (boo!), and Apple made sure the iPhone 3G won't fit in the first iPhone's dock.\r\n\r\nFeatures\r\nThe iPhone 3G hangs on to all the original iPhone features and throws in a few more, so we'll concentrate on what's new. Lucky for first-gen iPhone owners, most of the impressive array of additions--save 3G support and enhanced GPS--come along with the free 2.0 software update. For more on the organizer features, stocks and weather widgets, YouTube app, notepad, threaded texting, and visual voicemail, see our original iPhone review.\r\n\r\nExchange server support\r\nWorker bees worldwide have awaited the iPhone 3G's full support for Microsoft Exchange server. In our tests, adding an Exchange account was ridiculously easy once we had the correct settings from our IT department--simply choose to add a new e-mail account in the main Settings menu, and you'll be taken to the standard list of available e-mail systems. \"Microsoft Exchange\" and \"MobileMe\" will appear at the top of the list just above the choice for Gmail. You'll then be prompted to enter the applicable e-mail address, domain/username, server, and password. The authentication process took just a couple of minutes. Installing CNET's security certificate posed a bit of a challenge, but we eventually succeeded by mailing the certificate to ourselves through Yahoo Mail.\r\n\r\n\r\nThe iPhone 3G offers settings for Exchange server and MobileMe e-mail accounts.\r\n\r\nOnce you're ready to go, the iPhone will sync your Outlook e-mail, contacts, and calendar. Be advised that while the iPhone can support multiple POP3 accounts at once (two Yahoo accounts, for instance), it syncs with only one Exchange server and, worse, with only with one calendar or contacts list at a time. If you have a separate personal calendar, your work calendar will replace it once you start the sync. (You'll be notified before it happens.)\r\n\r\nAs an alternative, though, you can sync e-mail without syncing your contacts and calendar. Also, you can keep work and personal e-mail accounts open at the same time, although you'll have to switch between the two (unlike on a BlackBerry). MobileMe is another way to work around this restriction, but we'll talk about the later.\r\n\r\nWhen using Wi-Fi, e-mail syncing went quickly. As new messages came in, the iPhone registered them almost immediately. It seemed to bog down when we received a large clump of messages at one time, however. In those cases, we had to update the phone manually, but even then the connection could freeze. In one instance, an update took almost 5 minutes--long enough that we had to back out of the e-mail app and try again later. We also noticed that if the iPhone loses its Wi-Fi connection, the syncing is interrupted even if the phone has 3G service. The Syncing via 3G was just as quick; if there was a difference, we didn't notice it. But if the 3G connection is shaky, it will take longer.\r\n\r\nWhen we deleted a message on our phone, the same e-mail vanished on our PC just a couple of seconds later. Messages deleted on the PC took longer to disappear from the phone; typically, we had to do a manual update to see them gone. Messages deleted on the phone will show up in your PC's Recycle Bin and vice versa. When the data connection is weak, deleting and moving messages can be problematic. There were a few instances when the iPhone would not let us delete a random message. But when we go back to our computer, the message was indeed in the Trash.\r\n\r\nYou can access all folders in your in-box and move messages from your in-box to a specific folder. You can't search for messages, but you can call a contact if they include their phone number in their e-mail. Opening attachments worked as promised, and we like how you now can save attached images directly to your photo gallery simply by tapping the image. To e-mail photos, you will need to do so in the traditional manner by opening the photo, selecting the e-mail option, and choosing which account you'd like to send from. We had some difficulty forwarding big attachments--on a couple of occasions we had to try multiple times to send the message on to a colleague. Also, the iPhone was not able to show imbedded JPEG images on e-mails.\r\n\r\nThe e-mail syncing is not without its faults, and it can't measure up to a BlackBerry just yet, but it is a good step toward making the iPhone a business device. Your experience will depend on how you use e-mail throughout the day. If you get scores of messages, and you must respond to each one, then we'd suggest holding off for now. But if you get scores, and only respond to a few (or you just get a few), then you could be perfectly content with the experience. Though according to AT&T, using Exchange server support on the iPhone 3G will require the business data plan (the one that costs $45 per month), we're not sure how AT&T will enforce this rule. The iPhone does not prompt you of this restriction in any way.\r\n\r\nMobileMe\r\nThe iPhone 3G supports Apple's new MobileMe service, which synchronizes from Mac's Mail, Address Book, and iCal applications: contacts, calendar appointments, e-mail messages, photos, and browser bookmarks. One advantage of MobileMe is that it allows you to sync personal and work calendars, and contacts. Check out our MobileMe review for a full analysis.\r\n\r\nApp Store\r\nWhen you select the iTunes Store, you're taken to the App Store main menu, which somewhat resembles the mobile iTunes store in design. You search applications by name and category and you can browse through the lists of Featured applications or the Top 25. There also is a feature for seeing if your purchased applications have any updates.\r\n\r\n\r\nThe mobile iPhone App Store.\r\n\r\nWe purchased a few apps for the iPhone. Downloads over Wi-Fi were pretty quick; most apps took just a few seconds, but keep in mind it will vary by the size of the app. Though you can purchase iTunes songs wirelessly only through a Wi-Fi connection, you can download applications of 10Mb or less over a 3G network and even over EDGE (if 3G isn't available).\r\n\r\nDownloads over 3G took about the same time as they did over Wi-Fi, give or take a few seconds, but apps over EDGE are quite pokey. We also purchased applications through the online iTunes (7.7) store. We downloaded Super Monkey Ball and then synced it to our phone--a new applications tab appears under the iPhone menu. The process was quick and painless. What's more, navigation through the online apps store is easy. After loading apps, the icons will appear on the Home screen.\r\n\r\nWhat's most remarkable about the online applications store is the sheer breadth of titles available, many of which take full advantage of the accelerometer. As of this writing, there are 27 pages available in a extensive range of categories. If there is one thing about the iPhone that's to love, it's the App Store--even if not all the applications are keepers and Apple is maintaining strict control over who gets in. Sure, Apple is not the first company to build a phone that takes third-party applications, but like the iPhone itself, the App Store is unique not for what it does, but for how it does it. The process is so easy that we can't imagine having the same experience on a Windows Mobile device. Of course, before you get carried away, remember that some apps are free but others will cost you.\r\n\r\n3G\r\nThe iPhone 3G's support for AT&T's wireless UMTS/HSDPA wireless broadband network comes too late for original iPhone buyers who grew frustrated with the slow Web-surfing speeds over the 2.5G EDGE network, but it makes for a much more satisfying second-generation device. Safari consistently delivered speeds of about 300Kbps to 500Kbps and even faster at times in our tests. That's a huge jump over the typical EDGE speeds of less than 100Kbps. Web pages that used to take minutes took only seconds to load via 3G.\r\n\r\nIn preliminary testing, the iPhone 3G blew away its predecessor. When using the 3G network, WorldofWarcraft.com (a very bandwidth-heavy Web site) loaded as quickly as 38 seconds and as slowly as 47 seconds. In contrast, the same site loaded anywhere from 2 minutes to 2 minutes and 45 seconds on the original iPhone using EDGE. We also tried accessing WorldofWarcraft.com on the iPhone 3G using EDGE. Its fastest speed also was 2 minutes but the slowest speed was a painful 3 minutes 30 seconds. The mobile site of CNET.com loaded in just 12 seconds on the 3G network but up to 23 seconds using EDGE. For more on Internet speeds, check out this Prizefight.\r\n\r\n\r\nThe iPhone 3G's Safari browser.\r\n\r\nOf course, the 3G experience is all relative. Your experience will depend on many factors including 3G coverage in your area, the number of people on the network at a given time, and the kind of pages you're trying to access--as a rule, busier pages will load more slowly. Also, it's absolutely essential that you test 3G coverage in your area using another AT&T 3G handset before buying the new iPhone. AT&T can give you guidance, but there's no substitute for real-world experience. Outside of the United States, the iPhone's tri-band (850/1900/2100) UMTS/HSDPA support will deliver 3G coverage around the world. One final point is that 3G will suck juice from your phone, so you should consider switching it off (there's an options in the Settings menu) when you're not using it. At that point, the handset will default to EDGE.\r\n\r\n\r\nFind your way with the iPhone 3G's Assisted GPS.\r\n\r\nGPS\r\nWhile the current iPhone location services find your position by triangulating among nearby cell phone towers and satellites, the iPhone 3G uses Assisted GPS supplemented by satellites, which better pinpoints your location. It also offers live tracking so that you can monitor your progress as you drive (or walk) along. We tested the GPS feature both in a car and on foot. When on foot, the tracking service from satellites was quite accurate. It pinpointed our location almost exactly, and the small blue dot that represented our location followed us as we moved along. What's more, we didn't lose the connection as we walked between tall buildings or under an overpass. Naturally, the satellite connection dropped out as we entered buildings, but it switched automatically to find the closest cellular phone tower or hot spot. That method isn't quite as accurate--at times it could only show a circle spanning several city blocks--but you get the general idea of where you are. There were times where we had to ask the iPhone to pinpoint our location again, particularly as we left buildings and switched back to a satellite connection. When riding in a car, the GPS wasn't quite as specific. The blue dot tended to jump block by block or as we came to stoplights.\r\n\r\nEven with these additions, however, the iPhone's GPS features can't compete with standalone GPS devices. Google Maps provides point-to-point directions on the iPhone 3G, but the phone doesn't support turn-by-turn directions in real time, and it's unclear whether that capability will come later from third-party applications. Apple's SDK prohibits location-based services \"designed or marketed for real-time route guidance,\" but that doesn't mean we'll never see them.\r\n\r\nThe iPhone's iPod\r\nWe can't blame Apple for leaving the iPhone's iPod functions unchanged. In the year since the original iPhone, no competitor has been able to match the iPhone's aptitude as a music and video player. Of course, it doesn't hurt that Apple's online iTunes store continues to reign as a top destination for music, video, and podcast downloads.\r\n\r\n\r\nThe iPhone 3G's music player.\r\n\r\nAs with the first-generation iPhone, the iPod icon on the iPhone 3G's main menu reveals a submenu of any content transferred from your computer's iTunes media library, including music, videos, and podcasts. The iPhone's remarkably responsive touch screen and its intuitive navigation allow you to swiftly scroll through lengthy song lists or leisurely browse your music collection in an attractive Cover Flow view. By default, the iPod menu includes shortcut icons for Playlists, Artists, Songs, and Video; however, these shortcuts can be easily swapped for other options that may be more useful to you, such as Podcasts, Albums, Audiobooks, Compilations, Composers, or Genres.\r\n\r\nIf you hunger for new music but lack the patience to download songs at home, the iPhone's iTunes Wi-Fi Store lets you browse new music and download purchases directly to your phone. As the name implies, the iTunes Wi-Fi Store unfortunately works only over your iPhone's Wi-Fi Internet connection, which is surprising, considering that downloads over 3G would strengthen the iPhone's appeal as on-demand music player.\r\n\r\nThe arrival of third-party applications to the iPhone has ushered in several new music-related capabilities, including a few free music applications we consider essential. For instance, radio fans can take advantage of AOL Radio and Pandora to stream music directly to the iPhone over both Wi-Fi and 3G connections. An in-house Apple application, Remote, transforms your iPhone into a full-featured remote control for your computer's iTunes music library or a separate Apple TV system.\r\n\r\nThe iPhone 3G does an admirable job supporting MP3, AAC, Audible, Apple Lossless, WAV, and AIFF audio files, as well as MPEG-4 or H.264 video files. Predictably, the iPhone does not support Windows Media file types such as WMA audio or WMV video, or more boutique formats like DIVX, FLAC, or Ogg Vorbis.\r\n\r\nWith the exception of songs downloaded directly to the phone using the iTunes Wi-Fi music store, loading audio and video content onto the iPhone 3G requires Apple's iTunes software. Unlike the initial release of the first-generation iPhone, you can now manually sync music files to your iPhone if you prefer not to have content automatically load from your iTunes library. The iPhone 3G's sound quality and EQ enhancement features are indistinguishable from the first-generation version's and certainly good enough to make your existing MP3 player redundant. The iPhone 3G's built-in speakers crank out noticeably louder--but still musically unacceptable--sound. To squeeze the most from the iPhone's sound quality, we recommend investing in a pair of higher quality headphones or earbuds than those that come with the device.\r\n\r\n\r\nThe iPhone 3G's video player.\r\n\r\nThe iPhone 3G's near-perfect storm of video features includes iTunes movie rental compatibility, excellent video podcast support, a dedicated YouTube player, autobookmarking, full-screen resizing, and support for embedded closed captions and chapter bookmarks. The iPhone's critical shortcoming as a Web-enabled portable video player is its lack of support for the Internet's ubiquitous Flash video content. Smaller video gripes include our dislike of the iPhone's reflective screen and the lack of a flip-out kickstand. The iPhone 3G's video quality offers no surprises, displaying crisp and colorful 480x320 video on its 3.5-inch screen. The phone tends toward negative blacks and low contrast when viewing the iPhone 3G at off angles, but the overall video experience is one of the best you'll find on a mobile phone.\r\n\r\nWith all of the iPhone 3G's cool new audio and radio applications, it's disappointing that Apple couldn't find a way to roll wireless A2DP stereo Bluetooth audio streaming into the device. In time, we hope third-party manufacturers will find a way to help users stream music from their iPhones to their Bluetooth-enabled speakers, headphones, and car stereos.\r\n\r\n\r\nThe camera lens sits in its usual location. There's still no flash or self-portrait mirror.\r\nCamera\r\nWe were hoping that the iPhone 3G would throw in an improved camera, but we got the same 2-megapixel shooter as in the original model, although with a slight improvement in the photo quality. Colors looked natural, there was little image noise, and interior shots had enough light. The camera's white balance can't handle bright sunlight, but that's not unusual for a camera phone. See our iPhone 3G camera slide show for a full gallery of shots. Camera features remain equally minimal, and the blatant lack of multimedia messaging and video recording continue to rub us the wrong way.\r\n\r\n\r\nThe iPhone 3G has improved photo quality .\r\n\r\nContacts search\r\nA search bar now appears above your contacts list. Typing in any portion of the name will take you immediately to that person.\r\n\r\niWork documents and PowerPoint\r\nWe haven't tried iWork documents, but we were able to view PowerPoint e-mail attachments. The attachment was rather large (1.3MB), but it didn't take very long to download. Keep in mind that as with other Office documents, the iPhone does not allow you to edit attachments.\r\n\r\nBulk delete and move\r\nThis works in your e-mail boxes only. In your in-box you'll see a small \"edit\" button at the top right-hand corner. When you press the button, a small circle will appear next to each e-mail. Touch the circle to highlight as many messages as you like and then select the \"delete\" or \"move\" options.\r\n\r\nScientific calculator\r\nAs Steve Jobs said in his WWDC keynote, you'll now get a scientific calculator when you turn the phone on its side. You'll see a lot more buttons that will set a mathematician's heart aflutter.\r\n\r\nParental controls\r\nYou now will find a \"Restrictions\" selection under the General tab of the main Settings menu. There you can restrict access to the Safari browser, explicit songs, YouTube, and the iTunes and iTunes App Stores. You can select as many restrictions as you like.\r\n\r\n\r\nChoose a language.\r\n\r\nLanguage support\r\nThe iPhone 3G also brings language support and typing keyboards in French, Canadian French, U.K. English, German, Japanese (QWERTY and Kana), Dutch, Italian, Spanish, Portuguese, Brazilian Portuguese, Danish, Finnish, Norwegian, Swedish, Korean, Simplified Chinese, Traditional Chinese, Russian, and Polish. You can select as many languages you want by opening the \"International\" selection under the General tab of the main Settings menu. For Chinese, you choose from Pinyin or a graffiti-style application for writing characters. As you enter characters, suggestions will appear to the right. To change between menus, choose from the small globe icon next to the space bar.\r\n\r\nWhat else is new?\r\nThe IPhone 3G offers a host of additional new features, from the noteworthy to the trivial. For the enterprise, there's remote wipe (to erase data in case of a stolen or lost phone) and integration with Cisco IPSec VPN for remote network access. You'll also find calendar colors and a new interface for entering passwords. (Now the screen temporarily displays the last character you entered so you can verify that you haven't mistyped.) We found the new ability to take screen captures (by holding the Home button and pressing the power/sleep key) especially useful. Screenshots end up in the camera's photo gallery.\r\n\r\nWhat's missing?\r\nWe've mentioned already that Apple has stubbornly left out multimedia messaging, stereo Bluetooth, and video recording. But we also wish we'd gotten a landscape keyboard for messaging, cut and paste, voice dialing, Flash support for the Web browser, tactile feedback for the touch screen and a memory card (or at least a 32GB model). Hopefully, Apple will add these features in time. True, they might also come as third-party applications, but Apple should really be the source for them. We'd also like the capability to send calendar appointments to contacts and an easier way to transfer files to the iPhone. Because there's no way to transfer them via iTunes, you'll have to e-mail files to yourself to access them on the iPhone. And even then, there's no accessible mass file storage.\r\n\r\nCall quality\r\nWhen we reviewed the original iPhone, we withheld our Editors' Choice Award largely over middling call quality because of low volume and a slight background hum. The iPhone 3G corrects most of these problems--our tests revealed louder volume and clearer audio. We also noticed that we could hear better at a variety of angles, whereas the first iPhone had a sensitive sweet spot. Also, while it was difficult to hear the original iPhone in noisy environments, we had better luck with this model. Reception didn't vary between GSM and HSDPA calls. We've heard a lot of reports that iPhone 3G users are experiencing a lot of dropped calls. Though we haven't experienced any issues on our review phone thus far, we have been on the receiving end of dropped calls while talking on a landline to an iPhone 3G owner.\r\n\r\nWe also tested the phone in a rural part of Sonoma County, California. Not surprisingly, our 3G connection was nonexistent, but we managed to keep a basic EDGE connection most of the time. We found that by turning off the 3G feature the phone stopped trying to find a high-speed connection, which resulted in a more reliable signal.\r\n\r\niPhone 3G also improves speakerphone calls. The phone's external speaker creates louder output, and callers said they can hear us better. Voices don't sound quite as natural, but that's typical on a speakerphone. Automated calling systems could understand us via regular or speakerphone calls. We also tested the iPhone 3G with the Aliph Jawbone 2 and enjoyed good audio quality. What's more, the handset autopairs with the Jawbone 2 so you don't need a passcode. As previously mentioned, iPhone 3G's lack of a stereo Bluetooth profile is disappointing.\r\n\r\nThe AT&T signal remained strong during much of our testing, though the 3G connection wavered in buildings. We have heard of some users complaining of poor 3G reception, even in urban areas. We noticed a few problems during our testing, specifically with the iPhone 3G's ability to switch back and forth between 3G and EDGE. The hand-off was sloppy at times, as the iPhone 3G continued trying to connect to the 3G network even when the signal was too low. But on the flip side, it was quicker about jumping back onto 3G when that network became available. According to FCC radiation tests, the iPhone 3G's highest digital SAR is 1.38 watts per kilogram.\r\n\r\nBattery life\r\nApple rates the iPhone 3G's battery at 5 hours of talk time over 3G and 10 hours over AT&T's standard cellular network; 6 hours of Internet time on Wi-Fi, or 5 hours over 3G; 7 hours of video playback; 24 hours of music playback; and a standby time of 12.5 days. In our first round of testing we were able to squeeze 4.95 hours of 3G talk time and 8.75 hours talk time over EDGE. We'll continue to run further tests over the next few days.\r\n\r\nFor music and video playback, our CNET Labs testing found the iPhone 3G's battery capable of 25.5 hours of audio playback and 2.7 hours of video playback, with 3G set to active. By comparison, the first-generation iPhone achieved 31.4 hours of music playback and 6 hours of video, although it didn't have the strain of 3G to contend with. A comparable 3G multimedia phone, like the Samsung Instinct, scored only 18 hours of audio playback, but eked out an impressive 4.3 hours of video playback. We suspect further testing will show that the iPhone 3G is capable of longer video playback when its 3G connection is switched off.\r\n\r\nLab tests have also revealed improvements to the iPhone's file transfer speed. A single 500MB file that once took the iPhone 1.6 minutes to transfer now takes the iPhone 3G just 1.4 minutes. The same test run on the Samsung Instinct took 4.28 minutes.\r\n\r\nThough our official Lab tests aren't bad, real-world use is a better judge of the iPhone 3G's endurance. And on that front, we've noticed that the iPhone 3G's battery life drops faster than on the original model, particularly while using the 3G network or GPS. That's to be expected, but we noticed that after a couple hours of use, the battery life dropped by about 30 percent. Large color displays like the iPhone's tend to be battery drainers as well, so you should expect to use more juice when you're constantly switching between applications. Indeed, during a day of even moderate use, the battery on our review model is depleted by the late evening. This remained true even after the iPhone 2.1 software update, which promised to improve battery life.\r\n\r\nActivation\r\nUnlike the original iPhone, you cannot activate the iPhone 3G via iTunes. Instead, you will have to activate the phone and sign your new contract in either an AT&T store or an Apple store. Though we understand the motivation behind this move--AT&T is trying to ensure every iPhone sold is activated on its own network--the experience isn't as nice as sitting in the comfort of your home. Once you have your phone out of the store, you will need to sync it with your iTunes account after first downloading the latest iTunes 7.7 update (download for Windows or Mac) first. That took us a long time on the iPhone 3G's first day on sale but hopefully those glitches will subside over the next few days. If you're replacing an original iPhone, make sure you back up your data from the old iPhone first; you'll then be able to transfer it to your new handset. As before, you can sync multiple iPhones to a single iTunes account. ","options":[{"id":931941,"name":"Apple Iphone 3G 8GB","price":260.0,"sold_out":false,"has_custom_price":false},{"id":931945,"name":"Apple Iphone 3G 16GB ($290)","price":260.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1485835/-/apple-iphone-3g.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1485835/-/apple-iphone-3g.jpg","width":300,"height":361}],"artists":[],"categories":[{"id":189990,"name":"iPhones","permalink":"iphones","url":"/category/iphones"}]},{"id":213093,"name":"Apple Ipod Touch","permalink":"apple-ipod-touch","position":2,"price":150.0,"default_price":150.0,"tax":0.0,"url":"/product/apple-ipod-touch","status":"active","on_sale":true,"created_at":"2009-01-07T22:55:41.000Z","description":"The iPod touch features Apple's revolutionary multi-touch user interface that enables you to find and enjoy all of your music, videos, and more on its gorgeous widescreen display with just the touch of a finger. First introduced on iPhone, the multi-touch interface uses pioneering new software to present the perfect user interface for each application.\r\n\r\nGlide through albums with the iPod touch's amazing Cover Flow technology. View iPod touch dimensions.\r\n\r\nBrowse the Web with the included Safari browser. Or fire up a YouTube video and enjoy the show.\r\n\r\nThe iPod touch responds to your movements; turn it sideways and your video is presented in widescreen mode.\r\n\r\nIncredibly thin at just 8 millimeters.\r\nThe iPod touch also includes Wi-Fi wireless networking, the first on any iPod, and three amazing applications that use it: Safari, the most advanced browser on any mobile device, lets you wirelessly view web pages just as they look on your computer, and features Google Search or Yahoo! oneSearch; Apple's YouTube application lets users wirelessly watch over 10 million free videos from the Internet's most popular video website; and the new iTunes Wi-Fi Music Store lets you wirelessly browse, preview and buy songs and albums from the most popular online music store in the world. And to top it all off, the iPod touch is an unbelievable eight millimeters thin.\r\n\r\nMusic\r\nIf a picture says a thousand words, think of what all the album art in your collection might say. With Cover Flow on iPod touch, you can flick through your music to find the album you want to hear. And when you do, a quick tap of the cover flips it over to display a track list. Another tap starts the music.\r\n\r\nVideo\r\nThe 3.5-inch display gives you video like nothing you've seen before on a portable device. Watch your favorite movie. Catch up on television shows, anywhere. Enjoy video podcasts. Play music videos. All using multi-touch technology that lets you bring up onscreen controls and go widescreen (or back to full screen) with a tap.\r\n\r\nPhotos\r\niPod touch holds up to 20,000 photos you sync via iTunes. Flick to scroll through thumbnails. Tap to view full screen. Rotate for landscape format. Or perform some sleight of hand by opening two fingers to zoom in. You can even play slideshows, complete with music and transitions. Set any photo as your wallpaper to personalize your iPod touch...with a touch.\r\n\r\nSafari\r\nWith Apple's Safari browser built in, iPod touch is the only iPod that gives you wireless access to the web, everywhere you go. See websites the way they were designed to be seen. Sync your bookmarks or add a few as you go. Search the web using the touchscreen keyboard. Zoom in and out by tapping the multi-touch display.\r\n\r\nYouTube\r\nGot a bit of a YouTube addiction? iPod touch feeds it from anywhere with a special YouTube player built right in. Watch featured videos, check out the most viewed, search for something specific, then bookmark your favorites for future reference. It's all the fun of YouTube--pocket-size.\r\n\r\niTunes Wi-Fi Music Store\r\nWith iPod touch, you can discover new music anywhere. Built-in wireless capability gives you access to the iTunes Wi-Fi Music Store, where you can buy songs with a tap. Browse New Releases, What's Hot, and Just Added lists. Or find exactly what you're looking for with a quick search. Tap a song to preview it or tap Buy to purchase it. From anywhere.\r\n\r\nStarbucks Music\r\nYou walk into a Starbucks. Order your latte. While you wait, you hear a song wafting from the loudspeakers. You love it. So you get out your iPod touch and buy it over Wi-Fi. Just like that. The iTunes Wi-Fi Music Store on iPod touch tells you what's playing in select Starbucks and lets you buy it along with other featured Starbucks content. So you can sip, shop, and listen.\r\n\r\nMulti-touch\r\niPod touch features the same revolutionary interface as iPhone. Built to take full advantage of the large 3.5-inch display, the multi-touch interface lets you control everything using only your fingers. So you can glide through albums with Cover Flow, flick through photos and enlarge them with a pinch, or zoom in and out on a section of a web page. And iPod touch features a touchscreen QWERTY keyboard perfect for browsing the web in Safari, searching for videos on YouTube, finding music on the iTunes Wi-Fi Music Store, entering calendar events, or adding new contacts.\r\n\r\nAmbient Light Sensor\r\nThe iPod touch display has an ambient light sensor that automatically adjusts brightness to suit the ambient light in your surroundings. The result? A better experience for you and battery-saving efficiency for iPod touch.\r\n\r\nAccelerometer\r\nAn accelerometer detects when you rotate iPod touch from portrait to landscape, then automatically changes the contents of the display, so you immediately see the entire width of a web page, your music in Cover Flow, or a photo in its proper aspect ratio.\r\n\r\nProduct Description\r\nWith the Apple iPod touch, Apple has married the iPhone's revolutionary multi-touch interface to their popular digital media player. So instead of a Click Wheel, you just use your fingers to flick through your music, photos, and video. Two fingers can be used in a pinching or spreading motion as well, which zooms in and out of photos and web pages. That's right, the iPod touch is the first iPod to offer web access. It does this via built-in Wi-Fi support. There's even a special iTunes Wi-Fi Store, so you can browse and purchase new music and video while you're on the road. Connects to a PC or Mac through USB (using the dock connector) 802.11b/g Wi-Fi Charge Time - about 3 hours (1.5 hours fast charge to 80% capacity) Audio Support - AAC (16 to 320 Kbps), Protected AAC (from iTunes Store), MP3 (16 to 320 Kbps), MP3 VBR, Audible (formats 2, 3, & 4), Apple Lossless, WAV, & AIFF Photo Support - Syncs iPod-viewable photos in JPEG, BMP, GIF, TIFF, PSD (Mac only), and PNG formats Video Support - H.264 video, up to 1.5 Mbps, 640 by 480 pixels, 30 frames per second, Low-Complexity version of the H.264 Baseline Profile with AAC-LC audio up to 160 Kbps, 48kHz, stereo audio in. m4v,. mp4, and. mov file formats; H.264 video, up to 2.5 Mbps, 640 by 480 pixels, 30 frames per second, Baseline Profile up to Level 3.0 with AAC-LC audio up to 160 Kbps, 48kHz, stereo audio in. m4v,. mp4, and. mov file formats; MPEG-4 video, up to 2.5 Mbps, 640 by 480 pixels, 30 frames per second, Simple Profile with AAC-LC audio up to 160 Kbps, 48kHz, stereo audio in. m4v,. mp4, and. mov file formats Unit Dimensions - 4.3 x 2.4 x 0.31 Unit Weight - 4.2 oz. ","options":[{"id":932311,"name":" Apple Ipod Touch 16gb","price":150.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1487489/-/apple-touch3g.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1487489/-/apple-touch3g.jpg","width":300,"height":361}],"artists":[],"categories":[{"id":189991,"name":"iPods","permalink":"ipods","url":"/category/ipods"}]},{"id":213095,"name":"Microsoft Xbox 360 [120 GB]","permalink":"microsoft-xbox-360-120-gb","position":3,"price":175.0,"default_price":175.0,"tax":0.0,"url":"/product/microsoft-xbox-360-120-gb","status":"active","on_sale":true,"created_at":"2009-01-07T23:01:21.000Z","description":"Product Description\r\nTake the next generation of gaming and entertainment one step further with the Xbox 360 Elite Console. It will become the center of your home and manage all your media needs. Featuring a sleek black enclosure, a 120GB hard drive and an HDMI port, the Elite Console brings you to the brink of innovation and the future of gaming. Incredible power from a triple-core CPU fuels gameplay, which pulses and crackles with lightning speed. Graphics climb to a new level as the 500MHz ATI processor enables games to be experienced in 1080p high-definition format. Colors will appear more vivid, blacks will come through deeper and images will move flawlessly across the screen, resulting in a lifelike representation you'll want to reach out and touch. Add to that full stereo surround sound, filling your media room with screaming highs and booming lows, and video games as you know them will never be the same. Xbox 360 Elite also handles your favorite movies, music and digital photos with ease for a new level of integration. Your gaming and entertainment world expands online with the included Xbox Live Silver membership. Connect to a global network of individuals who share your interests and passions. Communicate via voice, text and video chat, or engage in global competition. You can even download stimulating content from the Xbox Live Marketplace. It isn't just about information: Xbox Live makes it possible to create your own digital identity. It's just one aspect of the freedom Xbox 360 Elite provides, and it is sure to change your perspective on the role of video game consoles. The system comes with a black wireless controller, a black headset and more, so you can play right away. Witness the next generation of gaming and entertainment with incredible games, enhanced online play and the fusion of music, movies and photos.","options":[{"id":932315,"name":"Default","price":175.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1487513/-/xbox.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1487513/-/xbox.jpg","width":300,"height":361}],"artists":[],"categories":[{"id":190140,"name":"Xbox","permalink":"xbox","url":"/category/xbox"}]},{"id":213096,"name":"Sony PlayStation 3","permalink":"sony-playstation-3","position":4,"price":316.0,"default_price":316.0,"tax":0.0,"url":"/product/sony-playstation-3","status":"active","on_sale":true,"created_at":"2009-01-07T23:05:40.000Z","description":"Product Description\r\nSony PS3 - PS3 is the most advanced computer system that serves as a platform to enjoy next generation computer entertainment contents in the home, realized through the combination of Cell and RSX processors, in addition to the playability of a vast catalog of PlayStation and PlayStation 2 software titles. Having Giga-bit Ethernet and a pre-installed hard disk drive (HDD) as standard in PS3, users will be able to download a variety of contents as well as access on-line games and services over the network. Equipped with basic input/output ports, PS3 supports a broad range of displays from conventional NTSC/PAL standard TVs to the latest full HD (1080i/1080p) flat panel displays, offering the joy of the most advanced computer entertainment contents to homes around the world. For use in living rooms, maximum heat and noise reduction has been achieved with a noise level equivalent to that of the current slim-line PlayStation 2. With the overwhelming computational power of the Cell processor, PS3 is capable of playing back content from Blu-ray (BD) disc at a bit rate of multiplex 48Mbps with ease, the maximum bit rate defined in BD standards.The new controller for PS3 has been created by refining and improving the world's most popular PlayStation controller which has shipped more than several hundred million units worldwide. The controller for PS3 employs a high-precision, highly sensitive six-axis sensing system that is capable of processing all parameters within the controller itself, thereby eliminating the need for any additional settings on the display system. By applying this technology, it will become possible to freely control the PS3 system over the network. 60GB Playstation 3CPU - Cell Broadband EngineGPU - RSXMemory - 256MB XDR Main Ram, 256MB GDDR3 VRAMHard drive - 2.5\" Serial ATA (60GB)Input/Output - Four USB 2.0 ports, Memory Stick/SD/Compact FlashCommunication - Ethernet, Bluetooth 2.0, Built-in IEEE 802.11 b/g Wi-FiControllers - Wireless Bluetooth (up to","options":[{"id":932321,"name":"Sony PS3 80GB","price":316.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1487521/-/ps3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1487521/-/ps3.jpg","width":300,"height":361}],"artists":[],"categories":[{"id":190141,"name":"PlayStation 3","permalink":"playstation-3","url":"/category/playstation-3"}]},{"id":213099,"name":"Nintendo Wii [Plus Nintendo Wii Fit]","permalink":"nintendo-wii-plus-nintendo-wii-fit","position":5,"price":250.0,"default_price":250.0,"tax":0.0,"url":"/product/nintendo-wii-plus-nintendo-wii-fit","status":"active","on_sale":false,"created_at":"2009-01-07T23:10:16.000Z","description":"Nintendo's Wii video game system (pronounced \"we\") brings people of all ages and video game experience together to play. This simple yet ground breaking idea is expressed not only though the system's evocative name, which is easily pronounced in a variety of languages, and suggests two players side by side, but also through its innovative list of features and extensive list of playable titles.\r\n\r\nWii with Wii Remote\r\n\r\nWii with Wii Remote. View larger.\r\nA Little Box With Plenty of Power\r\nAs with every console, much of the buzz surrounds the specs. The Wii boasts 512 MB of internal flash memory, two USB 2.0 ports, and a slot for SD memory expansion. The system’s technological heart -- a processing chip developed with IBM and code-named \"Broadway\" and a graphics chipset from ATI code-named \"Hollywood\" -- deliver stunning performance. And instead of a tray, Wii uses a single, self-loading media bay that plays both 12-centimeter optical discs used for the new system, as well as Nintendo GameCube discs.\r\n\r\nRevolutionary Control\r\nNo bigger than a small traditional remote control, the wireless Wii Remote is a truly multi functional device. The magic of the Wii Remote's design lies within; acellerometers inside the controller measure movement in all directions and at all speeds. In a tennis game, it serves as your racket as you swing away. In driving games it serves as a steering wheel, allowing you to swerve to avoid obstacles or pickup power-ups. In first-person shooters, it acts as a firearm that you can point directly at an on-screen enemy. The controller also has a force feedback \"Rumble\" feature and an expansion port for use with accessories, such as the Nunchuck, which adds an analog thumbstick and trigger buttons. The system allows for up to four controllers to be linked at a time and utilizes standard Bluetooth wireless technology. For those who prefer the feel of a traditional controller an adapter is available that fits over the Wii's remote.\r\n\r\nWii with cradle\r\n\r\nWii with cradle. View larger.\r\n\r\nA Channel for Everyone\r\nMore than just a game machine, Wii also provides information and entertainment suitable for every member of the family. Some of the channels available include:\r\n\r\n    * Mii Channel - Miis are cute little caricatures you create to use as characters in a variety of Wii software. Store Miis on your Wii or load them onto your Wii Remote and take them over to a friend’s house to use on their Wii.\r\n    * Everybody Votes Channel * - The Everybody Votes Channel is packed with national and worldwide polls. Answer interesting questions and have your say. Up to six members of your family can vote. Just choose an answer and check in later to see the results.\r\n    * News Channel * - Wii might be great for games, but you can also use it to get updates on the latest news from across the Internet organized into easy-to-browse categories.\r\n    * Forecast Channel * - Your Wii can automatically update you on the weather from around the globe.\r\n    * Wii Shop Channel * - Download the Opera web browser and access games from classic consoles from the past. All you need is a Wii Points account.\r\n    * Virtual Console - Every Virtual Console game you download from the Wii Shop Channel appears in the Wii Menu as a separate Channel ready to select and play any time you like.\r\n    * Wii Message Board - Leave or receive messages for other family members on the calendar-based message board or use WiiConnect24 to send messages to people outside your home.\r\n    * Internet Channel * - Just download the Opera browser for 500 Wii Points and within minutes, you’ll be a professional sofa surfer, pointing-and-clicking your way around the web with your Wii Remote.\r\n    * Photo Channel - Show off all your digital photos on your TV. Just insert an SD memory card into your Wii and away you go.\r\n    * Disc Channel - The Disc Channel is backwards compatible with Nintendo GameCube, so you can play all your new Wii discs, along with all your classic Nintendo GameCube discs too!\r\n\r\nGameCube controller and memory port\r\n\r\nGameCube controller and memory ports.\r\nThe Depth of the Nintendo Game Catalog\r\nEach Wii comes with a game compilation called \"Wii Sports,\" including tennis, golf, baseball and bowling games, that show off the console's intuitive new controller, but Wii also plays games developed specifically for it as well as fan-favorite games from Nintendo's 20-year-old library. Its drive is compatible with GameCube discs, and select Nintendo titles from the original NES of the 1980s all the way through the Nintendo 64 are available for download through the \"Virtual Console\" for $5 and $10 respectively. To support this backwards compatibility the Wii includes four ports for classic Nintendo GameCube controllers and two slots for Nintendo GameCube Memory Cards. As if that weren't enough, the Virtual Console will also make available a few titles from SNES console contemporaries, Sega Genesis and TurboGrafx 16.\r\n\r\nAlso, Wii utilizes Nintendo's newly-announced wireless feature, WiiConnect24. This worldwide feature allows players to receive content such as Wii Message Board messages sent from other Wii consoles, Miis, e-mails, updated channel and game content, and notification of software updates even while the console is on standby, keeping the fun going even when you are not online.\r\n\r\n* Access to some channels may require your Wii needs to be set up with WiiConnect24. ","options":[{"id":932324,"name":"Default","price":250.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1487537/-/wii.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1487537/-/wii.jpg","width":300,"height":361}],"artists":[],"categories":[{"id":190143,"name":"Nintendo Wii","permalink":"nintendo-wii","url":"/category/nintendo-wii"}]}]