[{"id":13931259,"name":"Custom Cloth Doll with Hand Painted Face","permalink":"custom-cloth-doll-with-hand-painted-face","position":1,"price":50.0,"default_price":50.0,"tax":0.0,"url":"/product/custom-cloth-doll-with-hand-painted-face","status":"active","on_sale":false,"created_at":"2013-10-02T19:15:27.000Z","description":"Cloth Doll Custom Handpainted Heirloom Doll\r\n\r\nNow available: completely customizable Hen And Chick Heirloom Cloth Dolls! Your gorgeous 18 inch tall portrait doll with beautifully expressive hand-painted face will be created for the doll lover in your life to your exact specifications!\r\n\r\nChoose from the following for girl dolls and boy dolls:\r\n\r\nHairstyle\r\nHair Color\r\nSkin tone\r\nEye Color\r\n\r\nOutfit add-on (One included):\r\n\r\nfelt pea coat\r\nremovable skirt\r\nsailor collar\r\nhooded cloak\r\npants (default for boy dolls, please note pants are not removeable)\r\n\r\nLet me know if you have a preferred general color scheme for the clothing.\r\n\r\nAlso available, freckles and glasses!\r\n\r\nI will contact you to verify your selected options with you before I start, so no worries! You can also contact me by selecting \"contact\" at the top of the page.\r\n\r\nPlease allow two full weeks before your doll will ship.\r\n\r\nThese dolls are best for children over age 3 due to the buttons, snaps, and other small embellishments which may pose a choking hazard. Fine for all ages when used as an heirloom shelf ornament.\r\n\r\nEach Hen And Chick doll is one of a kind, hand made from my original design out of new and recycled fabrics. There's not another doll in the whole wide world just like this one! Give the gift of a beautiful, one-of-a-kind, heirloom doll to your favorite young person (or young at heart), and watch a life-long friendship develop!\r\n\r\n***************\r\nSome feedback from other customers who bought Hen And Chick Heirloom Dolls:\r\n\r\n\"I have bought several rag dolls before, none were as well-made and pretty as yours. Your price is more than fair. Great customer service and fast. The most amazing detailed clothes ever. I felt I got way more than I paid for! I've been telling all my friends. Thank you!\"\r\n\r\n\"Beautiful craftsmanship. Just stunning work!\"\r\n\r\n\"Even more beautiful in person!\"\r\n\r\n\"Absolutely BEAUTIFUL! Fast shipping, nice crafter. Well made. A+\"\r\n\r\n\"Wonderful! Carefully made, beautiful color combo, fast shipping. So adorable. THANKS.\"\r\n\r\n\"Well-crafted, meticulously hand-painted, carefully wrapped. Love her!\"\r\n\r\n\"Thanks for making the little details I asked for. They were custom touches that made these dolls just like their owners.\"\r\n\r\n\"I am a huge fan. The doll I ordered was so lovely. Couldn't be happier with my purchase. I highly recommend. Thanks!\"\r\n\r\n\"So perfectly crafted and beautifully sewn! The fabric she chose for me was wonderful - exactly what I envisioned. And the face... the painted eyes are exquisite. What a treasure! \"","options":[{"id":44766720,"name":"Default","price":50.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":11.0,"amount_with_others":5.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.0,"amount_with_others":2.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":16.5,"amount_with_others":8.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125238120/-/Rachel_Linquist_dolls_1.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125238120/-/Rachel_Linquist_dolls_1.JPG","width":4124,"height":2848}],"artists":[],"categories":[{"id":6343851,"name":"Dolls","permalink":"dolls","url":"/category/dolls"}]}]