[{"id":871431,"name":"Superhero Cape Sewing Pattern PDF Size 2-6","permalink":"superhero-cape-pattern-pdf-size-2-6","position":1,"price":3.99,"default_price":3.99,"tax":0.0,"url":"/product/superhero-cape-pattern-pdf-size-2-6","status":"active","on_sale":true,"created_at":"2009-12-07T22:50:45.000Z","description":"From the most trusted source of superhero cape know-how we bring you the Superhero Cape Pattern in PDF format! My tutorial has been on the internet for two years and has been used by hundreds of sewists worldwide. If you have boys of your own, this pattern is a must-have. The sizes are 2, 4, and 6, but the sizes are meant to have the cape hit your child at the knee. If you have an older (or taller) child that would like a cape, the size 6 would work just fine.\r\n\r\nAll the instructions for this pattern are found on my website: <a href=\"http://pukingpastilles.com/?p=213\">www.pukingpastilles.com</a>. I do not sell the applique patterns, but rather offer them free on my website since most of them are copyrighted. The applique patterns available to date are: Superman, Batman, Robin, SuperWHY!, Word Girl, Wonder Red, a princess crown, and the Obama symbol. \r\n\r\nThis PDF pattern will be sent to you within 24 hours of receiving payment. There are a few exceptions to this that can be found in my shop policies. The PDF will be sent to your Paypal email address.\r\n\r\nMy pattern is copyrighted so please do not distribute it or sell it:) Rights to sell the finished capes themselves are available for a small fee. Just contact me!\r\n\r\n","options":[{"id":3336491,"name":"Default","price":3.99,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[{"id":568571,"name":"Patterns","permalink":"patterns","url":"/category/patterns"}]},{"id":871511,"name":"Aromatherapy Neck Hot/Cold Wrap PDF Sewing Pattern","permalink":"aromatherapy-neck-hot-cold-wrap-pdf-sewing-pattern","position":2,"price":3.99,"default_price":3.99,"tax":0.0,"url":"/product/aromatherapy-neck-hot-cold-wrap-pdf-sewing-pattern","status":"active","on_sale":true,"created_at":"2009-12-07T22:58:00.000Z","description":"Introducing my newest pattern--perfect for gifts for the holidays! I, for one, am making one for each of my kids. They can be used as heat packs OR cold packs! It's amazing how many ailments a quick cold pack can fix ;)\r\n\r\nThis pattern includes instructions for the inner pack (including the filler material--where to buy it and how much to buy!) and the outer slipcover. I don't use or recommend rice because of the strange popcorn smell it releases when heated in the microwave. My heat packs have an all-natural filling that feels so smooth and hugs your neck so comfortably.\r\n\r\nFabric requirements:\r\n1/4 yard muslin\r\n1/4 yard fabric for cover\r\n3/4 yard ribbon\r\n\r\nVery inexpensive to make! The pattern comes with well-illustrated sewing instructions with full color photos. For a preview of how my PDF patterns are assembled, check out our\r\n<a href=\"http://www.youtube.com/watch?v=uF1evMnDcfk\">YouTube video</a>.\r\n\r\nThis item will be emailed to your Paypal email address within 24 hours of purchase with few exceptions which can be found in our shop policies.\r\n","options":[{"id":3336961,"name":"Default","price":3.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/7977131/-/heat_pack_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/7977131/-/heat_pack_cover.jpg","width":790,"height":459}],"artists":[],"categories":[{"id":568571,"name":"Patterns","permalink":"patterns","url":"/category/patterns"}]},{"id":871951,"name":"Infant Car Seat Recovering PDF Tutorial","permalink":"infant-car-seat-recovering-pdf-tutorial","position":3,"price":3.99,"default_price":3.99,"tax":0.0,"url":"/product/infant-car-seat-recovering-pdf-tutorial","status":"active","on_sale":false,"created_at":"2009-12-07T23:24:27.000Z","description":"Every mom knows that car seat covers are baby's number one item that get dingy and dirty. They get stained, stretched, bumped, scraped, and just plain filthy! No matter how often you wash it, you can't escape the inevitable. Or maybe you're like me and bought a pink car seat and now you're having a boy . . . ;)\r\n\r\nWhatever the reason, buying a brand new car seat just to replace the cover is simply a silly idea! This tutorial will teach you how to reinvent your car seat cover to make it beautiful and unique. The best part about my method is that you will use the original padding and original cover to create a brand new one. The manuals of all children's car seats state that no extra or different padding should ever be added to your child's car seat. My method follows these guidelines! Your original carseat cover will be RECOVERED. You won't be endangering your child's safety for the sake of fashion.\r\n\r\nYou'll receive a beautiful 15-page PDF with very detailed instructions and full color photos to show you how to recover your infant car seat and create a new canopy. Your car seat doesn't have to be a Graco Snugride like the one pictured. In fact, this tutorial will show you how to cover ANY infant car seat as long as the cover can be removed from the seat.\r\n\r\nI email all my PDF patterns and tutorials within 24 hours of payment, with few exceptions that can be found in my shop policies. I have excellent feedback for all my patterns! I will email the tutorial to your Paypal address. If you need it sent somewhere else, please notify me when you check out.\r\n\r\nFabric requirements:\r\n1 1/2 yards fabric A\r\n1 yard fabric B (no nap)\r\nOR 1 1/2 yards fabric B (with nap)\r\n2-3 pkgs extra wide double fold bias tape","options":[{"id":3338021,"name":"Default","price":3.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/7979631/-/car_seat_etsy_image.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/7979631/-/car_seat_etsy_image.jpg","width":612,"height":396}],"artists":[],"categories":[{"id":568851,"name":"Tutorials","permalink":"tutorials","url":"/category/tutorials"}]},{"id":872271,"name":"Toddler Booster Car Seat Recovering Tutorial PDF","permalink":"toddler-booster-car-seat-recovering-tutorial-pdf","position":4,"price":3.99,"default_price":3.99,"tax":0.0,"url":"/product/toddler-booster-car-seat-recovering-tutorial-pdf","status":"active","on_sale":true,"created_at":"2009-12-07T23:40:20.000Z","description":"Since the launch of my Infant Car Seat Recovering Tutorial, I've had many, many moms contact me about recovering their toddler car seat. I answered the call!\r\n\r\nThis tutorial will teach you how to reinvent your car seat cover to make it beautiful and unique. The best part about my method is that you will use the original padding and original cover to create a brand new one. The manuals of all children's car seats state that no extra or different padding should ever be added to your child's car seat. My method follows these guidelines! Your original carseat cover will be RECOVERED. You won't be endangering your child's safety for the sake of fashion.\r\n\r\nYou'll receive a 13-page PDF with very detailed instructions and over 70 full color photos to show you how to recover your child's car seat. Your car seat doesn't have to be exactly like the one pictured, just similar. This tutorial will help you with any booster-type seat (even convertible ones that can go forward or backwards). This tutorial will NOT help if your cover is not removable.\r\n\r\nI think this tutorial would be appropriate for intermediate sewists. The bulk of the seat makes some parts fairly tricky, but with a little elbow grease it is totally do-able!\r\n\r\nI email all my PDF patterns and tutorials within 24 hours of payment, with few exceptions that can be found in my shop policies. I have excellent feedback for all my patterns! I will email the tutorial to your Paypal email address. If you need it sent elsewhere, let me know during checkout with Paypal.\r\n\r\nBecause toddler boosters vary, I can't tell you exactly how much fabric to buy, but I can tell you how much I used:\r\n\r\nBrown Kona Cotton - 1 yd\r\nPink Kona Cotton - 1/4 yd no nap (with nap 3/4 yd)\r\nBaby Ducks in Feather (by Lizzie House) - 1/2 yd","options":[{"id":3338901,"name":"Default","price":3.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/7981771/-/Toddler_Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/7981771/-/Toddler_Cover.jpg","width":636,"height":909}],"artists":[],"categories":[{"id":568851,"name":"Tutorials","permalink":"tutorials","url":"/category/tutorials"}]},{"id":872481,"name":"Ankle Biter Toddler Pants Sewing Pattern size 9 months-4T","permalink":"ankle-biter-toddler-pants-sewing-pattern-size-9-months-4t","position":5,"price":3.99,"default_price":3.99,"tax":0.0,"url":"/product/ankle-biter-toddler-pants-sewing-pattern-size-9-months-4t","status":"active","on_sale":true,"created_at":"2009-12-07T23:53:14.000Z","description":"Behold, the ankle biter, wide-leg pants pattern! This pattern has sizes 9 months up to 4T. The baby sizes through 18 months have extra room in the bum for those cute diapered bums. \r\n\r\nYou'll have two styles to choose from: the pants with contrasting band and pants with no contrast. The length is meant to hit your child right at the ankle, so they don't trip over their cute pants (or drag them in snow, dirt, or that bucket of Nesquik they dumped out on the floor).\r\n\r\nYardage requirements are no more than 3/4 yard for the largest size all the way down to 1/2 yard! You can't beat that!\r\n\r\nPlease note that my model is quite short for her age:) The pattern will actually hit a normal sized child at the ankle. So cute!\r\n\r\nThis listing is for the PDF version of this pattern. Your pattern will be emailed to your Paypal email address within 24 hours of receiving payment (with a few exceptions found in my shop policies section).\r\n\r\nCheck out our video on how to assemble our PDF patterns (no scaling necessary--just print and assemble!): <a href=\"http://www.youtube.com/watch?v=uF1evMnDcfk\">Link to YouTube video</a>.","options":[{"id":3339231,"name":"Default","price":3.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/7983011/-/etsy_pants_pdf_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/7983011/-/etsy_pants_pdf_cover.jpg","width":580,"height":842}],"artists":[],"categories":[{"id":568571,"name":"Patterns","permalink":"patterns","url":"/category/patterns"}]}]