[{"id":13823913,"name":"Distance Reiki Healing","permalink":"reiki-healing","position":1,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/reiki-healing","status":"active","on_sale":false,"created_at":"2013-09-27T13:51:54.000Z","description":"Distance Reiki Healing is the distance version of the subtle energy healing modality Reiki. The only difference between the two is that you and I are divided by distance. As the healer, I am able be a bridge between your subtle energy bodies and the universal life force energy to be able to provide you what you need in terms of healing via Reiki.  I will provide you with more information and instructions once I receive your order. \r\n\r\nNamaste you beautiful soul.","options":[{"id":44386023,"name":"Default","price":45.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124960560/-/3d-rendered-orbs-metallic-large-studio-floating-depth-abstract-free-stock-photo.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124960560/-/3d-rendered-orbs-metallic-large-studio-floating-depth-abstract-free-stock-photo.JPG","width":1280,"height":720}],"artists":[],"categories":[{"id":6301902,"name":"Energy Healing","permalink":"energy-healing","url":"/category/energy-healing"}]},{"id":13809936,"name":"3-card Tarot Reading","permalink":"3-card-tarot-reading","position":2,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/3-card-tarot-reading","status":"active","on_sale":false,"created_at":"2013-09-26T20:13:30.000Z","description":"Namaste loves! The 3-card tarot reading consists of a Past, Present, and Future card. This reading will provide you with insight on energies from your past that are affecting your present, the present situation, and what may potentially happen in the future if you do or do not change your actions right now. This reading is very insightful, as it is a very focused and short-action reading, usually allowing you to make some very small and quick changes that have a powerful impact on your life. Speaking from experience, the messages from the Guides through these cards can't be matched.\r\n\r\nSome things that you should know before getting a reading from me:\r\n1. I currently only do distance readings, which are still as powerful as in-person readings.\r\n2. Tarot card readings do not predict the future in most cases; they offer insight into what your future will be like if you continue on your current path and change absolutely nothing. In some cases, that may be a great thing! In other cases, you might want to take a look at your life and where you're lacking or weak to make some positive changes for the betterment of your future.\r\n3. The above statement was made based on past readings for individuals who weren't happy with the outcome due to their expectation of a concrete prediction and prophecy, which isn't the case.\r\n4. We must keep an open mind! No tarot card is evil, negative, bad, or any of that. Each card is neutral and has the possibility of allowing you to look at your life and see where things may not be the best so that you can actively change those areas. This is a great thing!\r\n5. I DO NOT do readings for those under the age of 18. No ifs, ands, or buts!\r\n6. I will provide you with THE BEST reading within my willpower; I am a perfectionist and I want you to make the best changes in your life that I can help you with.","options":[{"id":44337147,"name":"Default","price":25.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124926258/-/empress.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124926258/-/empress.jpg","width":200,"height":347}],"artists":[],"categories":[{"id":6301917,"name":"Tarot Reading","permalink":"tarot-reading","url":"/category/tarot-reading"}]}]