[{"id":14769795,"name":"Printed Plastic Bags","permalink":"printed-plastic-bags","position":1,"price":0.1,"default_price":0.1,"tax":0.0,"url":"/product/printed-plastic-bags","status":"active","on_sale":false,"created_at":"2013-11-11T14:56:46.000Z","description":"Printed plastic bags available in quantities as low as 250 units.\r\n\r\nSmall quantities are made right here in the UK using modern technology all bags can have a special plastic additive included in their make up to make them Bio-Degradable, this simple technique helps to make sure your bags don't damage the environment, nor add to landfill.\r\n\r\nBio-Degradable bags are the same cost as regular plastic bags :)\r\n\r\nAvailable in a number of different colours, printed to one side or to both with pantone matching at no extra cost.\r\n\r\nPackaging Sauce Plastic bags.\r\n\r\nNote: All prices are for a guide only.  Packaging Sauce is unable to conduct transactions through the website so please contact us with your specification to obtain a written quotation.","options":[{"id":47854338,"name":"Default","price":0.1,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127380831/-/Packaging_Sauce_plastic_bag.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127380831/-/Packaging_Sauce_plastic_bag.jpg","width":211,"height":239}],"artists":[],"categories":[{"id":6637233,"name":"Printed Bags","permalink":"printed-bags","url":"/category/printed-bags"}]},{"id":14769672,"name":"Printed paper bags","permalink":"printed-paper-bags","position":2,"price":0.15,"default_price":0.15,"tax":0.0,"url":"/product/printed-paper-bags","status":"active","on_sale":false,"created_at":"2013-11-11T14:51:07.000Z","description":"However you like them we can make them! \r\n\r\nBags are available in a variety of papers, including coated art paper, Kraft paper and speciality papers.\r\n\r\nPaper bags are available with any colour and material as the handle, or a simple die cut handle which can help to reduce costs.\r\n\r\nWe can print to match Pantone colours* To help your business stand out from the crowd.  Line colours or four colour process is used to bring your artwork to life!\r\n\r\nVarnish and lamination come as standard and help protect your bag from damage and water damage.  This is available as gloss or matt.\r\nColoured foils, spot UV and other specialist techniques are available on request.\r\n\r\nPlease note that all enquiries must come through the contact us page with as much information as possible.  Packaging Sauce are not able to accept direct orders over the internet due to the nature of the product.  \r\n\r\nPrices listed are a guide only and are subject to your entire requirements.  Minimum order quantities are just 500 bags.\r\n\r\n","options":[{"id":47853924,"name":"Default","price":0.15,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127380225/-/Packaging_Sauce.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127380225/-/Packaging_Sauce.jpg","width":774,"height":423}],"artists":[],"categories":[{"id":6637233,"name":"Printed Bags","permalink":"printed-bags","url":"/category/printed-bags"}]}]