[{"id":4039355,"name":"Hand Built Cherry Armoire with Book Matched Fiddleback Maple Panels","permalink":"hand-built-cherry-armoire-with-book-matched-fiddleback-maple-panels","position":1,"price":9250.0,"default_price":9250.0,"tax":0.0,"url":"/product/hand-built-cherry-armoire-with-book-matched-fiddleback-maple-panels","status":"active","on_sale":true,"created_at":"2011-07-06T04:26:47.000Z","description":"For sale is a hand built cherry armoire with bookmatched fiddleback maple panels. With its vertical proportions, the armoire takes up very little floor space while providing enclosed storage in a dining room or study, as well as in the bedroom. The top half is fitted with a hanging rod and three adjustable shelves, and the bottom half features three drawers. The armoire offers a compromise between a closet and a chest of drawers. \r\nThe dimensions for the cabinet are as follows 78\" tall x 36\" wide x 24\" deep. The cabinet has an interior dimension of 21 1/4\" in depth. The half featuring the closet rod is 14\" wide. From the top of the closet rod to the bottom of the mid-shelf you have a total of 42'' of hanging height. The closet rod itself is 1 1/4\" in diameter and is hand turned. On the left hand side there are 3 hand built adjustable shelves. The shelfs are made out of solid cherry and measure 14 3/4\" wide x 21\" deep x 3/4 thick. When the shelves are evenly spaced you will have 10\" in between shelves. The partition can also unscrewed and removed. You will be left with a cavity measuring 30\" wide by 43\" tall, ample space for a television. The bottom section of the cabinet features 3 hand built drawers with a cut out that act as hand pulls. The drawers are made out of 5/8\" solid cherry and have a 1/2\" drawer bottom. The interior dimensions of the drawers are 26\" wide x 19 3/4\" deep x 5 3/4\" tall which results in a huge amount of storage. The drawers also feature solid wood drawer runners which are dadoed into the sides of the drawers. The main material used in building the armoire is cherry. The panels feature bookmatched fiddleback maple veneer laid onto 1/2 mdf sub-straight. The cabinet features Von Morris Hardware. The armoire was finished with three coats of tung oil and 1 coat of butcher's wax. The armoire was built with only a few boards to maximize clarity of color and grain consistency. You will notice that the grain carries through the whole project. The lower maple panels match the panels above. As well are the doors and end panels, boards were positioned so that when the doors are closed grain similarity will be recognized. This piece is one off and completely unique. You will find nothing else similar. The price for shipping is $1700.00. This is an estimate provided by UPS to the West Coast. If you live closer the price will most likely reduce. I would be more than happy to get an adjusted quote to your zip code. The armoire will arrive in a shipping container via UPS freight ground shipping. The armoire will also be insured for $9,250.00 when shipping to cover damages if they occur. If you live within 100 miles, the cabinet ships for FREE. The piece is available for pickup as well. Feel free to email with questions. More photos are available upon request.","options":[{"id":13388019,"name":"Default","price":9250.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/39403659/-/cabinet_white.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/39403659/-/cabinet_white.jpg","width":657,"height":1000}],"artists":[],"categories":[{"id":2231113,"name":"Furniture","permalink":"furniture","url":"/category/furniture"}]}]