[{"id":12642549,"name":"Best price Original Autel MaxiDAS DS708(English language)","permalink":"best-price-original-autel-maxidas-ds708-english-language","position":1,"price":999.0,"default_price":999.0,"tax":0.0,"url":"/product/best-price-original-autel-maxidas-ds708-english-language","status":"active","on_sale":true,"created_at":"2013-07-29T05:09:24.000Z","description":"This product is a universal auto scanner with powerful function and multi-language.7 language software is available,welcome to order!(German,French,Spanish,Portu\r\n\r\nAutel MaxiDAS DS708 works with Asian, European and American cars. it can diagnostic 46 kind of car now. For Toyota, Honda, Nissan and Renault, its functions have reached their original tool funcitions. For Volvo and Mitsubishi year before 2005, it has reached original functions.\r\n\r\nit is a original auto diangostic tool,update by internet free 1 years.\r\n \r\nAutel maxidas ds708 makes diagnosis easy and fast!\r\n \r\nHonda car model updated to 2011.12, Kia updated to 2011.06!\r\n\r\nAttention: Autel company cancel Holden car model, so DS708 do not contain Holden.\r\n\r\nAutel ds708 features & functions:\r\n•Extensive vehicle coverage for more than 40 domestic, Asian and European vehicles. \r\n•Deep vehicle system coverage for ALL electronic systems \r\n•Complete function capability including live data, ECU programming and so many others. \r\n•Automatic Wi-Fi updates available in new software releases, updating online. \r\n•The genuine Windows CE operating system allows for more stable performances, better compatibility and expandability. \r\n•WIFI internet capability allows for wireless access throughout the workshop. \r\n•Internet explorer brings internet resource of your choice at your fingertips. \r\n•Advanced USB communication for faster operation and more accurate diagnostics. \r\n•Touch screen scanner, extremely easy-to-us with touch-screen operation and intuitive operation. \r\n•7 inch color display provides better view of test results, graphs, web pages and etc \r\n•Intelligent memory of vehicles for easy and quick diagnosis of tested vehicles \r\n•Captures, saves and prints screenshots for convenient troubleshooting \r\n•Displays live data in text, graph and analog for easy data review and analysis. \r\n•Records and playbacks live data to pinpoint troubles of sensors and components \r\n•Innovative graph merging for easy and quick detection of intermittent problems \r\n•Automatic WIFI Data Logging for quick and accurate technical support and troubleshooting \r\n•Built-in overvoltage protection keeps the instrument and vehicle from unwanted damages \r\n•Creative remote diagnosis for convenient demonstration and training \r\n•Prints out recorded data any time and anywhere with Wi-Fi printing capability\r\n\r\nmore information and tech support please kindly visit:\r\n\r\n","options":[{"id":40216422,"name":"Default","price":999.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121966887/-/Best_price_Original_Autel_MaxiDAS_DS708(English_language).jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121966887/-/Best_price_Original_Autel_MaxiDAS_DS708(English_language).jpg","width":282,"height":282}],"artists":[],"categories":[]}]