[{"id":14173194,"name":"BELLY THIIN","permalink":"belly-thiin","position":1,"price":160.0,"default_price":160.0,"tax":0.0,"url":"/product/belly-thiin","status":"active","on_sale":false,"created_at":"2013-10-14T19:02:35.000Z","description":"Natural Ekma comprende perfectamente que cada organismo posee características diferentes, por tanto, requerimientos distintos. Así que busca, mediante opciones naturales, acercar a ti aquella que te sea efectiva y te permita lograr tus metas respecto al control de peso.\r\n\r\nBelly Thiin es una excelente opción para quienes buscan mejorar su digestión, controlar el exceso de apetito, acelerar su metabolismo y además iniciar una reducción en peso y talla, particularmente en el área vientre-cintura.\r\n\r\nINGREDIENTES:\r\n\r\nALOE VERA \r\n\r\nEs un depurador natural del organismo, elimina toxinas y residuos, \r\nReduce el tejido adiposo gracias a la mejor metabolización de ácidos grasos.\r\nEs un laxante natural, por sus efectos de estimulación de la movilidad intestinal.\r\n\r\nKELP\r\nLas algas Kelp son plantas marinas que por sus propiedades, está demostrado, ayudan a quemar los excesos de grasa. Al mismo tiempo que mitiga el deseo de tomar alimentos y mineraliza adecuadamente al organismo dándole una gran sensación de nuevas energías.\r\n\r\nCUACHALALATE\r\nUtilizado para combatir Inflamaciones diversas en el sistema digestivo. Agruras, colitis, colon irritable, úlceras gástricas. Contribuye a renovar la mucosa intestinal.\r\nPAPAYA\r\n\r\nLa Papaya es una fuente muy rica en vitaminas pues contiene vitamina A, C, complejo B, potasio, magnesio, fibra, ácido fólico y pequeñas cantidades de calcio y hierro. Además es antioxidante . Favorece la digestión. Ayuda a desintoxicar el organismo.\r\n\r\nNOPAL\r\nContiene fibra, la cual actúa brindando saciedad y quitando el hambre, así como depurando el organismo al eliminar los residuos y toxinas del cuerpo. Regula la concentración de glucosa en sangre, por lo que reduce la necesidad de consumir muchos azúcares. Tiene una acción antioxidante, ya que contiene vitaminas C y E\r\n\r\nALMENDRAS\r\nPoseen un elevado contenido en ácidos grasos monoinsaturados (ácido oleico).Contienen cantidades significativas de vitamina E. Son muy energéticas y una buena fuente de fibra, ricas en calcio.\r\n\r\nMAMEY ZAPOTE\r\nAlimento bastante energético debido a su elevado contenido en hidratos de carbono, que en su mayor parte son azúcares. Contiene vitamina C y su notable efecto antioxidante. Posee minerales tales como hierro, potasio y magnesio.\r\n\r\nINDICACIONES Y RECOMENDACIONES GENERALES:\r\nCONSUMIR UNA CÁPSULA CADA TERCER DÍA (Si padece un estreñimiento severo, se puede consumir una al día, por la mañana o noche, dependiendo de sus actividades y horarios)\r\nNO EXCEDER LA DOSIS RECOMENDADA\r\n\r\nBEBER SUFICIENTE AGUA (Es importante mantenerse bien hidratado, el agua debe ser natural, pura, sin endulzantes o saborizantes)\r\n\r\nDORMIR BIEN \r\n\r\nALIMENTARSE DE FORMA SALUDABLE (No malpasarse)\r\n\r\n*EN CASO DE PRESENTAR HIPERSENSIBILIDAD A LOS \r\nCOMPUESTOS DE LA FÓRMULA, SUSPENDER DE FORMA INMEDIATA\r\n* ES IMPORTANTE CONSULTE CON SU MÉDICO O FACULTATIVO SOBRE EL CONSUMO DEL PRODUCTO, ESPECIALMENTE SI PADECE ALGÚN PROBLEMA DE SALUD O CONSUME MEDICAMENTOS PARA ALGÚN TRATAMIENTO EN ESPECÍFICO.\r\n\r\nEs importante ser constante y seguir las indicaciones para observar resultados. Recuerde que cada organismo es diferente y la talla y peso a perder variará dependiendo de diversos factores personales\r\n","options":[{"id":45772401,"name":"Default","price":160.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":100.0,"amount_with_others":0.0,"country":{"id":28,"name":"Mexico","code":"MX"}},{"amount_alone":350.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":500.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125859651/-/bote_copy_251x456.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125859651/-/bote_copy_251x456.jpg","width":251,"height":456}],"artists":[],"categories":[]},{"id":13222626,"name":"ENERGY THIIN","permalink":"energy-thiin","position":2,"price":250.0,"default_price":250.0,"tax":0.0,"url":"/product/energy-thiin","status":"active","on_sale":false,"created_at":"2013-08-28T16:32:23.000Z","description":"ENERGY THIIN Porque cada persona posee características y requerimientos diferentes…, NATURAL EKMA ofrece otra efectiva opción natural para el control de peso, Energy Thiin. Su fórmula proporciona una dosis extra de energía durante el día, sintiéndonos más vigorizados durante nuestras actividades; además de ser suave respecto a reacciones de los primeros días de consumo, pero muy efectiva en cuanto a resultados al igual que la fórmula DetoxThiin.\r\n\r\nEs un excelente auxiliar para mejorar la función del aparato digestivo, evitando así las dañinas consecuencias del estreñimiento; ayuda a quemar más calorías, lo que nos facilita eliminar la grasa acumulada en nuestro cuerpo; y también disminuye el exceso de apetito.\r\n\r\nINGREDIENTES:\r\n\r\nNOPAL (Opuntia ficus-índica): \r\nEs una planta cactácea rica en fibras, vitaminas A, B, B2, clorofila, proteínas, minerales, etc.,\r\n•\tDisminuye los niveles de glucosa sanguínea, de colesterol total y triglicéridos (ácidos grasos).\r\n•\tEs una fuente importante de fibra digestiva y de gomas naturales que ayudan a la limpieza del aparato digestivo, eliminación de grasa y combatir el estreñimiento.\r\n\r\n•\tEs un auxiliar para el control de peso, entre otros.\r\n\r\nL . CARNITINA\r\nLa L-Carnitina es un nutriente similar a una vitamina, esencial para la conversión de las grasas en energía. \r\nLos estudios clínicos realizados han demostrado que la L-Carnitina tiene muchas aplicaciones, incluidas la nutrición para deportistas, el control de peso, la salud cardiovascular y el envejecimiento saludable.\r\n\r\nLINAZA (Linum usitatissimum)\r\nLa linaza es la semilla de la planta Linum usitatissimum (lino).Se utiliza como fuente de fibra, aceite y para usos medicinales. \r\nSus propiedades son múltiples y tienen que ver principalmente con su alto contenido de ácidos grasos omega 3, proteínas, vitaminas y fibra dietética soluble e insoluble. \r\nSu efecto más profundo es el estado de calma que se disfruta a pocas horas de ingerirla, es excelente para personas que llevan un ritmo acelerado de vida o para quien trabaja bajo presión.\r\n\r\nSÁBILA (Aloe Vera)\r\nLas propiedades del Aloe Vera se destacan en todo el aparato digestivo: úlceras, acidez estomacal y otras dolencias que pueden ser tratadas eficazmente.\r\nFunciona como un purgante, un laxante que estimula la digestión y excreción de toxinas (el acido uránico del aloe las elimina) y posibles parásitos que se encuentren en el tubo digestivo, activando la función del hígado y la vesícula biliar dado que contiene una cantidad de enzimas que intervienen en la asimilación de los nutrientes. \r\n\r\nPOSIBLES REACCIONES:\r\nDurante los primeros días de consumo se podrá presentar un poco de soltura de estómago. Podrá espaciarse su consumo a cada tercer día o según sean sus necesidades particulares.\r\n\r\nINDICACIONES Y RECOMENDACIONES GENERALES:\r\n\r\n* Consumir UNA cápsula diariamente después del desayuno. (No exceder la dosis recomendada)\r\n* BEBER SUFICIENTE AGUA. (El agua debe ser natural, pura, sin endulzantes o saborizantes)\r\n* DORMIR BIEN.\r\n\r\n* ALIMENTARSE DE FORMA SALUDABLE (No malpasarse).\r\n* EN CASO DE PRESENTAR HIPERSENSIBILIDAD A LOS COMPUESTOS DE LA FÓRMULA, SUSPENDER DE FORMA INMEDIATA.\r\n* ES IMPORTANTE CONSULTE CON SU MÉDICO O FACULTATIVO SOBRE EL CONSUMO DEL PRODUCTO, ESPECIALMENTE SI PADECE ALGUN PROBLEMA DE SALUD O CONSUME MEDICAMENTOS PARA ALGÚN TRATAMIENTO EN ESPECÍFICO.\r\n\r\nEs importante ser constante y seguir las indicaciones para observar resultados. Recuerde que cada organismo es diferente y la talla y peso a perder variará dependiendo de diversos factores personales.\r\n\r\nRECUERDE QUE ESTO ES INFORMATIVO Y EN NINGÚN MOMENTO SUSTITUYE UNA CONSULTA CON SU MÉDICO O FACULTATIVO.\r\n\r\n","options":[{"id":42264351,"name":"Default","price":250.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":100.0,"amount_with_others":0.0,"country":{"id":28,"name":"Mexico","code":"MX"}},{"amount_alone":350.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":500.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123543810/-/ENERGY_PRODUCTO.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123543810/-/ENERGY_PRODUCTO.png","width":3188,"height":2408}],"artists":[],"categories":[]},{"id":13222551,"name":"DETOX THIIN","permalink":"detox-thiin","position":3,"price":150.0,"default_price":150.0,"tax":0.0,"url":"/product/detox-thiin","status":"active","on_sale":false,"created_at":"2013-08-28T16:29:14.000Z","description":"DETOX THIIN:Diversos son los factores que intervienen como causa de sobrepeso y/u obesidad, entre los más comunes: un estilo de vida poco activo, problemas de salud, erróneos hábitos alimenticios, factores emocionales, embarazos, etc. NATURAL EKMA ofrece dos opciones naturales y efectivas, que servirán como auxiliares en la anhelada meta de llegar al peso y talla ideal, aquellos que sean el reflejo de salud física y emocional. Detox Thiin, una fórmula especial con ingredientes naturales que la hacen muy completa y eficaz para el control de peso. Le ayudará en los siguientes aspectos básicos:\r\n\r\n* Evitar estreñimiento.\r\n* Disminuir la ansiedad por comer, mediante un efecto de saciedad.\r\n* Acelerar el metabolismo para quemar más calorías.\r\n\r\nSus ingredientes aportan la fibra necesaria para regular la función del aparato digestivo, además de que tienen una acción depurativa y desintoxicante del organismo, beneficiándolo no solo en la cuestión estética sino también interna. De igual manera fungen literalmente como quemadores de calorías, lo que hará que sea más fácil lograr un equilibrio entre calorías consumidas y calorías utilizadas.\r\n\r\nINGREDIENTES:\r\n\r\nTAMARINDO MALABAR (Garcinia Cambogia)\r\nArbusto utilizado para bajar de peso, reduce la conversión de los hidratos de carbono en grasa, favoreciendo que no se acumulen grasas en el cuerpo. Algunos estudios afirman que esto se debe a que el AHC inhibe la producción de las enzimas que intervienen en la transformación de azúcares en grasas.\r\n\r\nTiene un efecto de saciedad, calma el apetito, actuando sobre el hígado y no sobre el cerebro: al no atravesar la barrera hematoencefálica no produce estimulación del sistema nervioso evitando, así, los efectos secundarios de algunos fármacos inhibidores del apetito (depresión, hipertensión, nerviosismo, taquicardia o insomnio).\r\nMARACUYA (Passiflora Edulis)\r\nEsta fruta es un efectivo energizante, por esta razón aumenta el metabolismo para la eliminación de las grasas depositadas en los tejidos,motivo por el cual es utilizado como un práctico adelgazante. \r\nPosee buen contenido de fibras, por esta razón, su consumo puede llegar a ser bueno para lograr una acción depurativa sobre el cuerpo.Además de un buen contenido de vitaminas del tipo A, B y C y de su acción antioxidante, el maracuyá tiene un efecto tranquilizante sobre el organismo, es por esto que puede ser empleado por personas que tienen cuadros de ansiedad por la comida.\r\nMARRUBIO (Marrubium Vulgare)\r\nEs una planta,  ideal para las dietas para perder peso, ya que logra reducir el apetito y elimina líquidos.\r\n\r\n* Colabora en el sistema digestivo desinflamando el intestino, la vesícula y el hígado, colabora en la regularización de las funciones digestivas. Se usa normalmente como estimulante de la función hepática, además previene la aparición de parásitos \r\n* Marrubio, expectorante natural, favorece las vías respiratorias.\r\n* Ideal para los problemas respiratorios, ya que brinda fluidez en las secreciones de los bronquios y posibilita la expectoración.\r\n\r\nANANÁS (Piña)\r\nEs una fruta que aumenta la digestión a causa de una enzima llamada bromelina. Es digestivo, aumentando la metabolización de los diferentes nutrientes. Alto contenido en fibra y antioxidantes.\r\n* Es diurético, gracias a la bromelina, la cual estimula los riñones para eliminar el exceso de agua y residuos.\r\n* Ayuda a perder peso, se lo considera un alimento de calorías negativas debido a que el cuerpo gasta más calorías en digerirlo que las que le aporta una vez digerido.\r\n* Es depurativa, evitando la formación de edemas y retención de líquidos en el organismo.\r\n\r\nPOSIBLES REACCIONES \r\nAl ser una fórmula desintoxicante y depurativa, pueden presentarse reacciones normales de limpieza durante los primeros días de consumo. Entre las más frecuentes:\r\n* Soltura de estómago.\r\n* Sensación de dolor muscular\r\n* Náuseas, mareos.\r\nEstas reacciones deben disminuir y desaparecer conforme se continúe con el tratamiento. Si presenta las reacciones muy intensas, deberá espaciar el consumo de producto a cada tercer día, o de manera más espaciada de ser necesario.\r\n\r\n\r\nINDICACIONES Y RECOMENDACIONES GENERALES:\r\n* Consumir UNA cápsula diariamente durante la noche, preferentemente antes de cenar. (No exceder la dosis recomendada) * BEBER SUFICIENTE AGUA. (El agua debe ser natural, pura, sin endulzantes o saborizantes)\r\n* DORMIR BIEN.\r\n\r\n* ALIMENTARSE DE FORMA SALUDABLE (No malpasarse)\r\n* EN CASO DE PRESENTAR HIPERSENSIBILIDAD A LOS COMPUESTOS DE LA FÓRMULA, SUSPENDER DE FORMA INMEDIATA.\r\n* ES IMPORTANTE CONSULTE CON SU MÉDICO O FACULTATIVO SOBRE EL CONSUMO DEL PRODUCTO, ESPECIALMENTE SI PADECE ALGUN PROBLEMA DE SALUD O CONSUME MEDICAMENTOS PARA ALGÚN TRATAMIENTO EN ESPECÍFICO.\r\n\r\nEs importante ser constante y seguir las indicaciones para observar resultados. Recuerde que cada organismo es diferente y la talla y peso a perder variará dependiendo de diversos factores personales.\r\n","options":[{"id":42264138,"name":"Default","price":150.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":100.0,"amount_with_others":0.0,"country":{"id":28,"name":"Mexico","code":"MX"}},{"amount_alone":350.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":500.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123543888/-/detox.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123543888/-/detox.png","width":4320,"height":3240}],"artists":[],"categories":[]}]