[{"id":9969016,"name":"Mosbeau Placenta White Body Scrub","permalink":"mosbeau-placenta-white-body-scrub","position":1,"price":160.0,"default_price":160.0,"tax":0.0,"url":"/product/mosbeau-placenta-white-body-scrub","status":"active","on_sale":true,"created_at":"2013-03-16T14:35:54.000Z","description":"Cellulite Free and Fairer Body\r\n \r\nMany will cling to you with that body glowing with fairness. Your skin will never disappoint with its soft and smooth texture. Shed dead skin cell build-up and cellulites through this effective exfoliant.\r\n \r\n100% MADE IN JAPAN \r\nContent: 300g\r\n \r\nHOW TO USE\r\n Wet skin. Get an ample amount of scrub and lightly massage all over your body to remove dirt and impurities on the skin. Leave for a few minutes before rinsing well with water.\r\n \r\n\r\nINGREDIENTS\r\n \r\nHORSE AND MARINE PLACENTAL PROTEIN\r\n Placental Protein is popular skin-whitening agent in Japan. This ingredient is recognized for its exemplary capability to visibly whiten skin, remove wrinkles and fine lines, speed up skin cell renewal and detoxifies the body. Horse and Marine Placental Protein is the most effective and safe kind of Placental Protein for cosmetics or skin care use. These ingredients are patented in Japan for their clinically-proven safe and effective skin-whitening, anti-aging and skin renewal properties.\r\n COLLAGEN\r\n Reverses skin aging and visibly removes wrinkles, fine lines and other unsightly signs of skin aging.\r\n PAEONIA SUFFRUCTICOSA ROOT EXTRACT\r\n All natural skin whitening ingredient that also helps condition skin.\r\n PUERARIA LOBOTA ROOT EXTRACT\r\n An herb extract that helps whitens skin while nourishing it.\r\n HONEY\r\n Moisturizing ingredient that promotes skin rejuvenation to make it silky and supple.\r\n ROYAL JELLY\r\n An all-natural hydrating agent that improve skin's texture and overall texture by tightening fine lines and making wrinkles less noticeable.\r\n ACETLY TYROSINE\r\n Helps improve skin's tone by making it fairer and radiant.\r\n \r\nBENEFITS\r\n \r\nGet fairer, younger and fresher looking skin all thanks to ingredients like Placental Protein, Royal Jelly and Honey.\r\n \r\nNo more dry skin from hereon because of Acetyl Tyronise ingredient that is good to improve dry skin.\r\n \r\nEffectively removes dead skin cell build-up and cellulites without stripping the skin’s natural moisture.\r\n \r\nMaintains skin elasticity making it firmer and velvety smooth to the touch.\r\n \r\nWith richer texture made from finer sea-salt that will not crystallized. It is easier to squeeze out the scrub.\r\n \r\nNow with colorant for improved color and a hint of lavender for fragrance.\r\n \r\n","options":[{"id":31176619,"name":"Default","price":160.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/97928467/-/313888_114571988730976_567925583_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/97928467/-/313888_114571988730976_567925583_n.jpg","width":600,"height":600}],"artists":[],"categories":[{"id":4837084,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":9968944,"name":"Mosbeau Placenta White All-In-One Facial Cream","permalink":"mosbeau-placenta-white-all-in-one-facial-cream","position":2,"price":227.0,"default_price":227.0,"tax":0.0,"url":"/product/mosbeau-placenta-white-all-in-one-facial-cream","status":"active","on_sale":true,"created_at":"2013-03-16T14:24:44.000Z","description":"PLACENTA WHITE ALL-IN-ONE FACIAL CREAM and its Benefits!\r\n\r\n • Get the benefits of skin-whitening, anti-aging, moisturizing and UV protection.\r\n • Let your skin be nourished and rejuvenated with Dipotassium Glycyrrhizate and Ubiquinone that serves as potent antioxidant properties. Look younger with great moisturizing ingredients like Hydrolyzed Collagen and Hydrolyzed Elastin. With Butyl Methoxydibenzoylmethane and Sericin for UV protection.\r\n • Be young, radiant and fair with Horse Placental Protein an effective skin-whitening, anti-aging and skin-nourishing ingredient.\r\n • Improve your skin problems by controlling your skin allergies with Glycyrrhizinate 2K.\r\n • Its gel type based texture is developed to achieve a lighter and smoother consistency that is easily absorbed by the skin. It is non-sticky or moist unlike before, and effective for all skin types.\r\n • The make up blends easily and smoothly to your skin, so you’ll get a matte finish for a shine-free instant make up base.\r\n \r\n","options":[{"id":31176379,"name":"Default","price":227.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/97927951/-/482860_114703798717795_1902929670_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/97927951/-/482860_114703798717795_1902929670_n.jpg","width":360,"height":504}],"artists":[],"categories":[{"id":4837084,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":9968926,"name":"Mosbeau Spotless White Green Tea Facial Soap ","permalink":"mosbeau-spotless-white-green-tea-facial-soap","position":3,"price":106.0,"default_price":106.0,"tax":0.0,"url":"/product/mosbeau-spotless-white-green-tea-facial-soap","status":"active","on_sale":false,"created_at":"2013-03-16T14:19:23.000Z","description":"Specialty Soap for Skin Problem\r\n \r\n• Infused with 7 different anti-inflammation ingredients like Dipotassium Glycyrrhizate, Scutellaria Baicalensis Root Extract, Artemisia Princeps Leaf Extract and more.\r\n • Achieve fairer skin with whitening ingredients like Horse Placental Protein, Japan Patented Marine Placental Protein, Sericin and Beta-Arbutin to get faster results.\r\n • Effectively absorbs and cleans dirt on pores with a mix of Charcoal Powder and tea component.\r\n • Reduce large skin pores with famous Japan ingredient Enantia Chlorantha Bark Extract. Improved to create fine and creamy bubbles that are effective for all skin types.\r\n\r\nNo dry skin. No allergies. Just beautiful radiantly glowing skin. Effective for whitening, anti-aging, moisturizing and peeling soap. It can also reduce pores and solves skin problems like blemishes, pimples, allergy, dry skin and dead skin cells. Perfect for Problematic Skin. \r\n\r\n100% MADE IN JAPAN \r\n\r\nContent: 100g\r\n \r\nHOW TO USE\r\n Create a rich lather by rubbing the soap onto a foaming net. Squeeze off the foam and massage on your face, neck and body. Leave for one minute before rinsing well with water.\r\n ","options":[{"id":31176340,"name":"Default","price":106.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/97927723/-/559702_114781298710045_34159876_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/97927723/-/559702_114781298710045_34159876_n.jpg","width":600,"height":600}],"artists":[],"categories":[{"id":4837084,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":9968899,"name":"Mosbeau Collagen Plus 12000","permalink":"mosbeau-collagen-plus-12000","position":4,"price":299.0,"default_price":299.0,"tax":0.0,"url":"/product/mosbeau-collagen-plus-12000","status":"active","on_sale":true,"created_at":"2013-03-16T14:13:40.000Z","description":"The first and ONLY anti-aging drink in the market with 12,000mg fish collagen content.\r\n\r\nFormulated through high technology to remove the \"chemical or medicine-like\" smell and taste of collagen.\r\n\r\nIt is sugar-free with a zest of mango flavour for a more pleasurable drinking experience.\r\n\r\nCombined with other potent anti-aging ingredients (coenzyme Q10, hyaluronic acid and elastin), it is the best ever formulated anti-aging and it is more effective.\r\n\r\nFormulated with Japan Patented Marine Salmon Eggs, it boosts whitening  as it helps reduce the signs of aging on your skin. \r\n\r\nOther than for healthy, beautiful skin, fish collagen also promotes youthful-looking complexion, luxurious hair growth, stronger nails and cartilage regeneration.\r\n\r\nFeel a slight firmness smoothness, and notice obvious reductions on your fine lines and wrinkles within 3 consecutive days of intake!","options":[{"id":31176253,"name":"Default","price":299.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/97927039/-/482663_114530545401787_182329549_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/97927039/-/482663_114530545401787_182329549_n.jpg","width":600,"height":600}],"artists":[],"categories":[{"id":4837084,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":9968821,"name":"Mosbeau Placenta White Advanced Supplement","permalink":"mosbeau-placenta-white-advanced-supplement","position":5,"price":349.0,"default_price":349.0,"tax":0.0,"url":"/product/mosbeau-placenta-white-advanced-supplement","status":"active","on_sale":true,"created_at":"2013-03-16T07:53:04.000Z","description":"PLACENTA WHITE ADVANCED SUPPLEMENT and its Benefits!\r\n \r\n• Double up whitening, anti-aging and moisturizing effects.\r\n • Get effective whitening, anti-aging and skin renewing benefits from Horse Placental Protein and Japan Patented No. 3899116, 3946238 & 3946239Marine Placental Protein.\r\n • Promotes good blood circulation that gives better sleep through Carrot Extract.\r\n • Potent anti-allergic effect with Rose Petal Extract.\r\n • Rid skin imperfections with Silk Powder that has 18 kinds of amino acids that revitalizes the skin.\r\n • Achieve firmer, softer and younger skin with Elastin and Collagen.\r\n • No need to take in other vitamins or supplements for skin-whitening or anti-aging to take effect.\r\n • Promotes healthy and renewed cells that make a whiter skin.","options":[{"id":31176043,"name":"Default","price":349.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/97926895/-/image001.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/97926895/-/image001.jpg","width":758,"height":633}],"artists":[],"categories":[{"id":4837084,"name":"Albums","permalink":"albums","url":"/category/albums"}]}]