[{"id":16310,"name":"Lunabee Prenez Garde Aux Flots Bleus","permalink":"lunabee-prenez-garde-aux-flots-bleus","position":1,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/lunabee-prenez-garde-aux-flots-bleus","status":"active","on_sale":true,"created_at":"2007-03-18T18:13:47.000Z","description":"Already wildly popular with discriminating sets in their homeland of Belgium, France and the rest of Europe, Lunabee brings their CD “Prenez Garde aux Flots Bleus” to North America for the first time. Lunabee artfully combines elements of glitch, trip hop, and even circus music to elevate the genre of electronica. Cinematic at times, Lunabee’s lyrics, which are sung in French, cover topics ranging from love and eventual regret, to computers and zoos, real or imagined. Lunabee’s lyrical vision is caustic and beautiful, murky and ethereal.\r\n\r\n\tLunabee began as a solo project and evolved into a collaboration that now includes vocals by Pascale Vervloet; guitar, bass, and other noises by Pierre Vervloesem; and stunning artwork for the North American digi-pack by Thierry Mondelaers. Whether you understand French is irrelevant; in this case, beauty is global.\r\n\r\n\tThe music of Lunabee’s North American debut, “Prenez Garde aux Flots Bleus,” is for fans of Bjork, Portishead, CocoRosie and, yes, even Francoise Hardy!\r\n\r\n\tSorry, this item is only available for shipping in U.S.,Canada and South America at this time. For EU, please go to http://lunabee.be\r\n\r\n\tTo hear samples please click the following link\r\n\r\n\t<a href=\"http://www.allmusic.com/cg/amg.dll?p=amg&#38;sql=10:f9frxzlgldke~T0\">Lunabee on <span class=\"caps\">AMG</span></a>\r\n\r\n","options":[{"id":129043,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.5,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":3.0,"amount_with_others":1.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/32711/-/300.gif","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/32711/-/300.gif","width":300,"height":300}],"artists":[],"categories":[{"id":24769,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]