[{"id":13995225,"name":"Baby Boomer","permalink":"baby-boomer","position":1,"price":14.95,"default_price":14.95,"tax":0.0,"url":"/product/baby-boomer","status":"active","on_sale":false,"created_at":"2013-10-05T20:38:55.000Z","description":"\r\nRon E.Beck has the depth of a blues singer, the energy of a soul singer, and the contemporary sound of today which makes him modern.\r\n\r\nRon E. is also a world renowned drummer who has graced the stage with several of the industries legends. Beck has toured and recorded with the legendary funk band Tower of Power, Steve Cropper, Marilyn McCoo & Billy Davis, Jr., Sista Monica, Chris Cain, Clifford Coulter, Dr. Lonnie Smith, Calvin Keys and the list goes on.","options":[{"id":45067272,"name":"Default","price":14.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125420373/-/LFJ5002_1_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125420373/-/LFJ5002_1_.jpg","width":250,"height":250}],"artists":[{"id":238497,"name":"Ron E. Beck","permalink":"ron-e-beck","url":"/artist/ron-e-beck"}],"categories":[]},{"id":13994718,"name":"For A Friend - Rhythms, Tones and Colors","permalink":"for-a-friend-rhytms-tones-and-colors","position":2,"price":14.95,"default_price":14.95,"tax":0.0,"url":"/product/for-a-friend-rhytms-tones-and-colors","status":"active","on_sale":false,"created_at":"2013-10-05T20:10:35.000Z","description":"The music on For a Friend, Rhythms,Tones & Colors is a musical tribute by Dan Sabanovich to his very special friend and musical mentor, Elvin Jones whom he met in 1972 and remained close with until Elvin's death in 2004. As Dan says “my time and friendship with Elvin was the most important and profound relationship of my life”!\r\n\r\nAs composer, arranger, producer and percussionist for the recording Dan used among other musical elements a multiple array of percussion instruments plus a traditional drum set in creating the various textures, “rhythms, tones & colors” that has created his very special jazz blend.\r\n\r\n  ","options":[{"id":45066003,"name":"Default","price":14.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":6.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125395920/-/DanSabanovich.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125395920/-/DanSabanovich.jpg","width":1621,"height":1440}],"artists":[{"id":238473,"name":"Dan Sabanovich","permalink":"dan-sabanovich","url":"/artist/dan-sabanovich"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":13994481,"name":"Swingin Blue","permalink":"swingin-blue","position":3,"price":14.95,"default_price":14.95,"tax":0.0,"url":"/product/swingin-blue","status":"active","on_sale":false,"created_at":"2013-10-05T19:59:35.000Z","description":"Frankye Kelly delivers magnificently in both of her musical worlds of jazz and blues. Swingin Blue which leads off with a sizzling Never Make Your Move to Soon and you'll know right away the lady can sing, and swing the blues!! Equally as exhilarating is Next Time You See Me Things Won't Be The Same the other blues tune on the Swingin Blue CD. Added to Frankye Kelly's more gutsy and whaling vocal performance here are great solo's from the rhythm section of Will Blades organ, Don Nick guitar and Ron E. Beck on drums and together they rock the blues here!! “I couldn't have imagined just how much fun I would have making music with these cats, along with the fabulous saxophonist Danny Hull”  Frankye says. Regarding her jazz side Frankye says “I wanted to sing jazz because of its freedom and because that way I could express myself the way I wanted” and on the tracks Sophisticated Lady, Autumn Leaves and A night In Tunisa that seems to be exactly what happens! Her voice is tender, emotional and articulate! On tracks 1-7 the rhythm section of Harold Acey, drums and Spencer Allen, organ is superb and Frankye adds “I had a really swinging time working with Harold Acey and Spencer Allen.","options":[{"id":45065493,"name":"Default","price":14.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125395134/-/FrankyeKelly-SwingingBlues.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125395134/-/FrankyeKelly-SwingingBlues.jpeg","width":394,"height":343}],"artists":[],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":8039088,"name":"Mambo Jazz Dance","permalink":"mambo-jazz-dance","position":4,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/mambo-jazz-dance","status":"active","on_sale":true,"created_at":"2012-11-17T00:03:50.000Z","description":"Mambo Jazz Dance is the latest offering from the Bobby Matos Afro Latin Jazz Ensemble, recorded live at two different Southern California concert venues.  In addition to regular members of the ensemble, strong contributions from some very special guest artists are also featured.  Well known jazz trumpeter Dr. Bobby Rodriguez is heard on all but one track, and three tracks also feature Italian/Brazilian trumpeter/trombonist Gabriel Rosati, chorus singer Ismael Carlo, and Jazz & Latin Jazz violinist Harry Scorzo.  \r\n\r\nThis is the real deal--seasoned Jazz and Latin Jazz musicians, great art, passionate rhythms and beautiful melodies resulting in the music called MAMBO JAZZ DANCE! ","options":[{"id":25376283,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":6.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/79754253/-/MamboJazzcdcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/79754253/-/MamboJazzcdcover.jpg","width":1000,"height":877}],"artists":[{"id":49795,"name":"Bobby Matos","permalink":"bobby-matos","url":"/artist/bobby-matos"}],"categories":[]},{"id":5774797,"name":"James Leary - Together - Plus Bonus Tracks - LFJ 5001","permalink":"james-leary-together-bonus-tracks","position":5,"price":14.95,"default_price":14.95,"tax":0.0,"url":"/product/james-leary-together-bonus-tracks","status":"active","on_sale":true,"created_at":"2012-03-25T05:51:38.000Z","description":"In the world of bassists/composers associated with the music commonly known as jazz, and sometimes referred to as America’s classical music or National Treasure, names like Oscar Pettiford and Charles Mingus stand out amongst an elite group. However, this elite group has expanded over the years along with the natural role of bass in contemporary music ensembles. Today we have many great bass players who are also great composers and James Leary is certainly one among them!\r\n\r\nAs a bassist, James Leary has worked consistently for over fifty years performing with many of the world’s most renowned entertainers and performing artists. He has accumulated a long list of credits, overshadowing an equally impressive list of personal artistic accomplishments (For more bio information, please visit www.jamlearmusic.com).\r\n\r\n“Together” is a CD project featuring a compilation of original compositions written and arranged by James Leary.  The music is an integral part of his musical legacy and chronicles many of his west coast artistic endeavors, emanating from a deep sense of social responsibility and dedication to community involvement. The first seven tracks showcase a unique big band sound, recorded and independently released on vinyl in 1980.\tAlthough the music was well received by those hearing the band live as well as on recordings, the record album was not promoted and got very little national or international exposure. Today, the music is heralded as a classic San Francisco Bay Area treasure, witnessed and heard by only a few. With George Cables, Eddie Marshall, Kenneth Nash and Babatunde Lea joining him in the rhythm section, James paints a musical landscape for the incomparable solo genius of the great tenor saxophonist, Joe Henderson, backed by some of the finest section players in the Bay Area at that time! We are sure both casual listeners and serious music enthusiasts will agree that it would be a “Cardinal Sin” not to re-release these tracks with a goal of reaching broader audiences and increasing opportunities for the greater public to experience and collect this music.\r\n\r\nThe remaining six tracks were taken from various sessions produced in Southern California, during the 1990’s. With the exception of the tune “Little Joe,” James composes for smaller ensembles on these tracks, featuring “jazz” heroes based in and around the Los Angeles area, including our co-founder and inspiration for LifeForcejazz Records, the legendary Billy Higgins. Whether writing for instrumentals, vocals, small or large ensembles, James Leary is a music storyteller with a dedicated connection to other performing arts disciplines. Listeners of this CD will hear his propensity for creating and harmonizing haunting melodic themes over an array of different rhythms and tempos, which is also his formula for scoring sound tracks used in films, modern dance or theatrical productions. Although the innovative music presented on this disc reflects James Leary’s interpretation, expression and statement of personal experiences, it also positively impacts the consciousness of society by continuing to convey messages of peace, love, unity and the idea that “we can make a deal,” Together!\r\nDawan Muhammad\r\n\r\n\r\nJames Leary is a catalytic musical force. He makes beautiful things happen like this extraordinary CD. Although this particular compilation of music will probably be categorized by most as jazz, it really transcends popular genres or styles and has already stood the test of time among those familiar with Leary’s work. These 13 classic originals brilliantly showcase James Leary as composer, arranger, bassist and leader of various music ensembles. If virtuosity, originality, historical continuity, integrity and charisma are any criteria for distinguishing a major artist, then one listen to this disc assures that James Leary most certainly qualifies.\r\nJohn Collar, President Blue Collar Records\r\n\r\nI’ve always known that James Leary was an excellent Jazz bassist but hearing his wonderful and striking original compositions and arrangements is a true revelation. He lets us hear melodies and harmonies in a new and unpredictable way and he has assembled an outstanding ensemble of master musicians who interpret the music flawlessly. This is an instant classic, a recording you will always want to hear.\r\nBobby Matos LifeForce Jazz recording artist\r\n\r\nLike an improvised Jazz standard, James Leary is a melody somewhat well known but whose moment-to-moment development is unpredictable and nearly always unexpected. Each time you see or hear him, you recognize the melody but what happens during the interaction is anything but casual or automatic. You have a long history of association and a large collection of touch points but Leary remains an inscrutable enigma. He is an evolving composition best understood listening to his music.\r\n-Eddie Green\r\n\r\nJames Leary set his own tempo soon after birth in Little Rock, Arkansas; he began demolishing the fragile glass baby bottles of that era in favor of sturdy Royal Crown Cola (RC) bottles with nipples affixed. As a result, today James is as understandable as he is incomprehensible, playful as he is serious, transparent as he is unreadable, and fundamental as he is profound. Back home, we gave up on trying to figure him out long ago and learned to just savor his music.\r\nW. Callion Stevens \r\n\r\nSPECIAL THANKS:\r\nTo the musicians, production team and supporters who came “Together” with the idea and specific goal of assembling this treasure of recorded music for listening enjoyment.\r\n\r\nSPECIAL ACKNOWLEDGEMENTS:\r\nTo Bobby Hutcherson a great artist, inspiration, mentor, and one of the world’s most innovative musicians!\r\n\r\nThis CD project is dedicated to the memory of Margaret Leary Brown, Joe Henderson, Eddie Marshall, Manny Boyd, Fred Mergy, Robert Trezvant, John Stubblefield and others directly contributing to the evolution of this music before making their transition from this life.\r\n","options":[{"id":18527405,"name":"Default","price":14.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56696341/-/jamesLeary.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56696341/-/jamesLeary.jpg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59595627/-/J_Leary_8285x_print_media_CMYK.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59595627/-/J_Leary_8285x_print_media_CMYK.jpg","width":594,"height":396},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59595635/-/J._Leary_8254xx_print_media.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59595635/-/J._Leary_8254xx_print_media.jpg","width":396,"height":594},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59595651/-/J._Leary_8439x_print_media_CMYK.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59595651/-/J._Leary_8439x_print_media_CMYK.jpg","width":594,"height":396}],"artists":[{"id":112627,"name":"James Leary","permalink":"james-leary","url":"/artist/james-leary"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3081489,"name":"Micheal Carvin - Lost and Found Project 2065","permalink":"micheal-carvin","position":6,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/micheal-carvin","status":"active","on_sale":true,"created_at":"2011-01-01T06:01:38.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/carvin/Lost%20And%20Found%20Project%202065/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/carvin/Lost%20And%20Found%20Project%202065/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/carvin/Lost%20And%20Found%20Project%202065/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/carvin/Lost%20And%20Found%20Project%202065/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/carvin/Lost%20And%20Found%20Project%202065/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/carvin/Lost%20And%20Found%20Project%202065/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/carvin/Lost%20And%20Found%20Project%202065/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/carvin/Lost%20And%20Found%20Project%202065/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nMichael Carvin is a drummer of extraordinary talent, inventiveness and technique. His mastery affords him the ability to handle any musical situation and to skillfully pass on his knowledge of the instrument to an ever increasing number of students internationally. Born in Houston, Texas, Carvin’s musical training began at an early age with his father, one of the top drummers in Houston. With that training, by the age of twelve, Carvin began playing professionally and won what would be the first of five consecutive Texas rudimental championships. Mr.Carvin’s diversified career has included a two-year tour with Earl Grant throughout Europe, Japan and the U.S., another two years as a staff drummer with Motown Records and extensive studio and television work on the west coast. Joining Freddie Hubbard’s band in 1973, Mr.Carvin moved to New York where he quickly gained a reputation as a formidable jazz drummer. In addition to leading his own bands, Carvin’s vast playing and recording experience includes work with Dizzy Gillespie, Dexter Gordon, Jackie McLean, Hank Jones, McCoy Tyner, Illinois Jacquet, Pharoah Sanders, Bobby Hutcherson, James Moody, Hampton Hawes, Ruth Brown, Abbey Lincoln, Jimmy Smith, Hugh Masekela, Alice Coltrane, Cecil Taylor, Charles Brown, Terumasa Hino, Bobby Watson, Billy Bang, and many others. Michael Carvin has established himself as one of the world’s most respected drum teachers and clinicians. Students from Europe, Japan and South America come to New York to study at the Michael Carvin School of Drumming. His book, “Something For All Drummers”, written with beginning, intermediate and advanced students in mind, provides information of improving sight reading and soloing abilities. Mr. Carvin has recorded over 150 albums. He endorses Pearl Drums, Istanbul Cymbals, Remo Drum Heads and the Michael Carvin Signature Drum stick which he designed.","options":[{"id":10564405,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30220487/-/MichaelCarvin.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30220487/-/MichaelCarvin.jpg","width":678,"height":600}],"artists":[{"id":49791,"name":"Michael Carvin","permalink":"michael-carvin","url":"/artist/michael-carvin"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3081485,"name":"Calvin Keys - An Evening with Calvin Keys - Double CD - LFJ 1025","permalink":"calvin-keys-an-evening-with-calvin-keys","position":7,"price":17.95,"default_price":17.95,"tax":0.0,"url":"/product/calvin-keys-an-evening-with-calvin-keys","status":"active","on_sale":false,"created_at":"2011-01-01T05:58:42.000Z","description":"<img style=\"visibility:hidden;width:0px;height:0px;\" border=0 width=0 height=0 src=\"http://c.gigcount.com/wildfire/IMP/CXNID=2000002.0NXC/bT*xJmx*PTEyOTYxMTQzMTc3MTgmcHQ9MTI5NjExNDMyMzEzNiZwPTE4MDMxJmQ9Jmc9MSZvPTVmYTc*ZjVkYTc*NzQzNTk5ZDVh/MTNiMDFlNmM*YTE2.gif\" /><embed src=\"http://assets.mixpod.com/swf/mp3/myflashfetish-mp3-player.swf?myid=76130352&path=2011/01/26\" quality=\"high\" wmode=\"transparent\" flashvars=\"mycolor=4a4a4a&mycolor2=050505&mycolor3=ffffff&autoplay=true&rand=0&f=4&vol=100&pat=0&grad=false\" width=\"218\" height=\"155\" name=\"myflashfetish\" salign=\"TL\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" border=\"0\" style=\"visibility:visible;width:218px;height:155px;\" />\r\n\r\nBorn in Omaha, Nebraska in 1943, Calvin Keys' musical legacy began early with his father Otis Keys, a man who is still described as Omaha's greatest natural drummer. Early on in his own musical career Calvin auditioned and played guitar with such greats as Eddie Cleanhead Vinson and bassist Gerald Holts. At age 17, he first hit the road with sax player Little Walkin' Willie and then followed in his father's footsteps to Kansas City, where his first gigs were with Preston Love of the Count Basie Orchestra and The Frank Edwards Organ Trio. That foundation led to working with one of the greatest organ trios of all time‚ The Jimmy Smith Trio, and then on to working with several other organ greats: Jimmy McGriff, Jack McDuff, and Groove Holmes. ","options":[{"id":10564333,"name":"Default","price":17.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224799/-/calvin_evening.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224799/-/calvin_evening.jpg","width":600,"height":600}],"artists":[{"id":49793,"name":"Calvin Keys","permalink":"calvin-keys","url":"/artist/calvin-keys"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084429,"name":"Calvin Keys - Standard Keys","permalink":"calvin-keys-standard-keys-lfr-1004","position":8,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/calvin-keys-standard-keys-lfr-1004","status":"active","on_sale":true,"created_at":"2011-01-02T12:55:25.000Z","description":"Captured live at a hall in Saratoga, CA, guitarist Keys is heard in trio with bassist Tim Hauf and drummer Bob Braye in a program of the familiar (\"Once I Loved;\" \"Willow Weep For Me;\" \"Little Sunflower\"), to not-so-familiar (McCoy Tyner's \"Blues On The Corner\"), and two Keys originals. Though a generally well-played, workmanlike guitar trio date, there's something missing. Perhaps the audience felt it as well, as the applause is generally of the tepid variety. A fourth player, a piano or horn maybe, would have brought much-needed fire to this date. Though this is a concert date, it is played like a casual, incidental music session at a club. \"Talent of Keys'\" obvious level deserves more spice than this setting afforded.\r\n\r\n—Willard Jenkins","options":[{"id":10572471,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226519/-/calvinkeys_standardkeys.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226519/-/calvinkeys_standardkeys.jpg","width":600,"height":600}],"artists":[{"id":49793,"name":"Calvin Keys","permalink":"calvin-keys","url":"/artist/calvin-keys"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3304785,"name":"Elmer Gibson Trio - All the Seasons","permalink":"elmer-gibson-trio-all-the-seasons","position":9,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/elmer-gibson-trio-all-the-seasons","status":"active","on_sale":true,"created_at":"2011-02-18T07:54:03.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/gibson/All%20the%20Seasons/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/gibson/All%20the%20Seasons/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/gibson/All%20the%20Seasons/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/gibson/All%20the%20Seasons/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/gibson/All%20the%20Seasons/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/gibson/All%20the%20Seasons/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/gibson/All%20the%20Seasons/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/gibson/All%20the%20Seasons/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nI’VE BEEN PLAYING JAZZ most of my life, all over the world, and with musicians of every persuasion, but since I’ve been in North Carolina, many people have come to know me as a solo pianist. Over the years I’ve found myself playing more and more solo engagements and composing new songs for solo piano. I developed a style that was influenced by innovative pianists such as Erroll Garner, Oscar Peterson, Art Tatum and Herbie Hancock. I purposefully cultivated a style of “left-hand bass” that had become a signature of my piano performance. In 2007 I nearly lost all use of my left hand. Neck surgery was my only option, and for over a year and a half after the operation, I struggled to regain my sense of touch and feel, a successful struggle that was blessed by skillful medical care, physical therapy, much effort and a healthy dollop of good fortune.\r\n\r\nThis life-changing experience inspired me to record the music I’ve performed so often during “all my seasons” in North Carolina. I’m sure you’ll enjoy listening to it as much as I’ve enjoyed playing it for you.","options":[{"id":11218619,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/32064339/-/ElmerGibson_AllTheSeasons.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/32064339/-/ElmerGibson_AllTheSeasons.jpg","width":600,"height":593}],"artists":[{"id":49819,"name":"Elmer Gibson","permalink":"elmer-gibson","url":"/artist/elmer-gibson"}],"categories":[]},{"id":3134017,"name":"Bobby Matos - Beautiful as the Moon - LFJ 1051","permalink":"bobby-matos-beautiful-as-the-moon","position":10,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/bobby-matos-beautiful-as-the-moon","status":"active","on_sale":false,"created_at":"2011-01-14T02:32:57.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://www.dawanmuhammad.com/mp3/matos/Beautiful%20as%20the%20Moon/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://www.dawanmuhammad.com/mp3/matos/Beautiful%20as%20the%20Moon/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Beautiful%20as%20the%20Moon/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Beautiful%20as%20the%20Moon/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://www.dawanmuhammad.com/mp3/matos/Beautiful%20as%20the%20Moon/wimpy.swf\" flashvars=\"wimpyApp=http://www.dawanmuhammad.com/mp3/matos/Beautiful%20as%20the%20Moon/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Beautiful%20as%20the%20Moon/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Beautiful%20as%20the%20Moon/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nBeautiful As The Moon is the new CD release from Bobby Matos & his Afro Latin Jazz Ensemble.<br><br>\r\n\r\nBeautiful As The Moon is a very personal statement from the band--all of the music comes from the band members or is inspired by their families and their influences. The title tune comes from a song Bobby’s grandfather sang to his young grandson.  Originally performed in the once thriving Yiddish theater, the song was one of the best known anthems of New World Yiddish culture.  It blends seamlessly with the Mapaye rhythm from Puerto Rico, and the Afro Latin Jazz treatment of Bobby’s arrangement. <br><br>\r\n\r\nBobby dedicates an original composition to his grandfather called Pop Moish. The quirky nature of the tune with its changes of rhythm mirrors “Pop’s” personality.  Violinist/trombonist,Danny Weinstein contributes the original Fiddlunky to reflect the violin’s flirtation with funk rhythms.  He also gives us an arrangement of a tune by his well known uncle, Mark Weinstein, Just Another Guajira.<br><br>\r\n\r\nReedman, Pablo Calogero, contributes Mi Santiaguito, a moody, slow, polyrhythmic tune dedicated to his son Santiago.  Former band mate Frank Fontaine wrote Buena Gente in collaboration with Wilson “Chembo” Corniel, an extended band family member.  Bobby also gives us Early Morning Song, a swinging Mambo Jazz piece, with a melody that came to him in a dream. Rounding off the CD, the band includes songs written by some of their important influences, three titans of modern music--Thelonius Monk, Armando Peraza, and Herbie Hancock.<br><br>\r\n\r\nWith all but one song recorded at the Saville Theater, San Diego City College for a live concert on KSDS Jazz88 radio in San Diego, this is an excellent opportunity to experience some great Latin Jazz live without any edits or tricks so common on many studio produced sessions where the music is recorded overdub by overdub. Not here, this is the real deal--seasoned Jazz and Latin Jazz musicians running risks to create great art, passionate rhythms and beautiful melodies resulting in music that is as beautiful as the moon. The new CD ships in mid February, 2011.","options":[{"id":10717967,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30388295/-/BeautifulMoon.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30388295/-/BeautifulMoon.jpg","width":375,"height":375}],"artists":[{"id":49795,"name":"Bobby Matos","permalink":"bobby-matos","url":"/artist/bobby-matos"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3080749,"name":"Bobby Matos - Unity","permalink":"bobby-matos-unity","position":11,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/bobby-matos-unity","status":"active","on_sale":false,"created_at":"2011-01-01T00:03:58.000Z","description":"On his latest recording for LifeForce Jazz Records, in addition to 9 tracks with his regular working group, Bobby has also included 5 Afro Latin percussion jam sessions, with special guests Chembo Corniel, and Phoenix Rivera. There is also one track with special guest artists Binky Griptite and Bosco Mann (from the soul phenomenon “the Dap Kings”) as well as an appearance from the Doo Wop vocal group “the Mighty Echoes”.\r\n\r\nBobby’s 2 horn section switches easily between a jazzy frontline of sax and trombone to a violin and flute Charanga sound. In addition to several originals from the band members, there are tunes from masters like Wayne Shorter, Tito Rodriguez, Horace Silver, and Ray Rivera. For the first time on a recording, the band adds Puerto Rican rhythms (Bomba and Plena) to their repertoire of Jazz, Mambo, Son Montuno, Rumba, Mozambique, Charanga, and Iyesa.\r\n\r\nBobby’s band features jazz and Latin jazz veterans Theo Saunders (piano), John B. Williams (bass), Dan Weinstein (violin & trombone), Pablo Calogero (tenor sax & flute), Robertito Melendez (congas & panderetta), Frank Fontaine (tenor sax), and Jud Matos (percussion), as well as the leader on timbales, congas, percussion in addition to arranging several songs.\r\n\r\nBobby says \"Occasionally times can get so stressful, depressing, and painful that everything seems hopeless, and out of nowhere you'll hear a great piece of music that suddenly transforms and transcends all the negative stuff. Music can actually change your brainwaves and even act as a healing force for the body. I've seen an old man with a walker get up and dance to a sensous Cuban danzon-mambo. I've seen crowds all moving in time to the beat of the music and I know that music has this power to unify us, and make us one\"","options":[{"id":10562485,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224623/-/bm_unity.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224623/-/bm_unity.jpg","width":600,"height":600}],"artists":[{"id":49795,"name":"Bobby Matos","permalink":"bobby-matos","url":"/artist/bobby-matos"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084049,"name":"Bobby Matos - Charanga Chango - LFJ 1046","permalink":"bobby-matos-charanga-chango","position":12,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/bobby-matos-charanga-chango","status":"active","on_sale":false,"created_at":"2011-01-02T09:08:36.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://www.dawanmuhammad.com/mp3/matos/Charanga%20Chango/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://www.dawanmuhammad.com/mp3/matos/Charanga%20Chango/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Charanga%20Chango/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Charanga%20Chango/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://www.dawanmuhammad.com/mp3/matos/Charanga%20Chango/wimpy.swf\" flashvars=\"wimpyApp=http://www.dawanmuhammad.com/mp3/matos/Charanga%20Chango/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Charanga%20Chango/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Charanga%20Chango/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n“ Within every Latin jazz band, lurks a dance band, a Charanga or Conjunto anxious to escape. Mambo, Salsa, and all the Afro Latin dance forms have been influenced by Jazz. Latin Jazz bands also play dance music. And the dancers always request more, constantly asking us to play and record more dance music. So our Afro Latin Jazz Ensemble transforms into “ LA CHARANGA CHANGO” . And this recording is for all of those dancers, and the dancer inside all of us.\r\nWith a little help from friends like Larry Harlow ( our very special guest artist), we recorded new songs and arrangements, remixed and re-mastered a few older tracks, re-presented two of most danceable tracks , and resurrected two rare collector’s items , “Kimbisia”, ( a dance track from the out of print CD “Footprints”), and “Return To Spanish Harlem”, (an extremely rare boogaloo single from 1969-70). So, let’s dance.”\r\n\r\n-Bobby Matos, Los Angeles 2006\r\n\r\nREVIEWS\r\n\r\nReview by Roberto Carlos Lujan - courtesy Dj El Chino Bobby Matos es un percusionista,arreglista,compositor,líder de banda y pedagógo que nació en Nueva York aunque desde hace varias décadas está radicado en los Angeles, ciudad desde la cual ha continuado su carrera musical que inició, a temprana edad, en la gran manzana a finales del decenio de los 60's. Bobby Matos de madre boricua y padre judio ha sabido preservar y reproducir durante años el sabor y la intensidad sonora de la música afrocaribeña en la costa Oeste de Norteamérica. Como artista Matos ha tocado y grabado con músicos de diversos estilos como Bobby Hutcherson, Joe Loco, Tito puente, Luis Bonfa,Willie Bobo y Machito entre otros. Charanga Changó es un disco que Matos dedica a los bailadores demostrando que que su Afro Latin Jazz Ensemble no sólo cultiva un repertorio eminentemente jazzístico sino que también,como en este trabajo, se evidencia la calidad de su banda musical capaz de desdoblarse hacia el díficil formato e intención de la charanga. Por ello el repertorio de este disco busca complacer a ese otro auditorio, el danzante, que Matos ha sabido también cautivar históricamente. Pues bien, para este disco el maestro Bobby Matos ha querido remasterizar un par de canciones como Kimbisia, incluído originalmente en su disco Footprints( Cubop , 1996), y Return To Spanish Harlem, un bugalú grabado en un disco sencillo a finales de la década de 1960 con un colectivo importante de músicos de la escena de Nueva York. Para esta nueva puesta discográfica ha sido invitado el pianista nacido de Brooklyn Larry Harlow. Matos cuenta como siempre con un gran colectivo de músicos que le acompañan en esta nueva gesta sonora, amplios conocedores de la propuesta musical que el percusionista líder de banda viene construyendo en la que el amplio lenguaje musical cubano se funde con el sentido jazzístico para producir una música profunda y excitante. El repertorio incluído resulta conocido para los fieles seguidores de la producción musical del veterano percusionista, en tal sentido podemos escuchar números como, Chango's charanga, Nadie baila como yo, realizado originalmente en los 70's con su combo; Oye mi querida, un son montuno con la notable vocalización del bajista puertorriqueño Eliseo Borrero; considersación especial se merece Poem for Cachao, poema que es recitado por el actor y cantante Ismael East Carlo en tributo al legendario y revolucionario bajista Israel López Cachao, utilizando como base el clásico número Descarga Cachao. Este último al igual que Cuando Baila Ramón y Madrigal motivos de jazz ( parte 2) – declamación bilingue- son poemas de distintos creadores, que Matos gusta de musicalizar, una histórica práctica en la obra de Matos. El talento de Matos aparece desplegado a lo largo del disco no sólo por la diversidad de instrumentos de percusión ejecutados , sino también por su talento y creatividad en el campo autoral y de los arreglos. Bobby Matos es por derecho propio una leyenda de la música afrocaribeña en Estados Unidos, su histórica práctica de los ritmos del caribe así lo demuestran, celebramos su fuerza de vida para el jazz... para la buena música en general!!!\r\n\r\n—Roberto Carlos Lujan\r\n\r\n\r\nWest coast roots Latin jazz percussionist extraordinaire Bobby Matos has produced a fantastic wide screen excursion into his musical world with Charanga Chango (LifeForce Jazz). It is brimming with quality playing, ideas and creativity. This valuable release modulates successfully between sublime and very groovy jazzy out-there. “Nadie Baila Como Yo” opens the album with a Charanga and montuno system of changes from slow to fast then slow and fast at the end with fantastically percussive liquid piano from guest pianist Latin legend Larry Harlow. There are fabbo thick layers of swinging riddim and horns throughout this release, oozing out of every space and pore in the music. Standouts include the title track, which has deep flute and violin floating within rhythm, while “Oye Mi Querida” is a mega rough ’n’ tough groove. A previous Bobby Matos cd threw up a minor hit on the London dance floors with “I Don’t Speak Spanish”. The equivalent one-off on this cd is “Cuando Baila Ramon” with poetic vocals by Denise Cook. It’s a good one.\r\n\r\n—The Beat magazine…Dave Hucker\r\n","options":[{"id":10571117,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224535/-/bm_charanga.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224535/-/bm_charanga.jpg","width":600,"height":600}],"artists":[{"id":49795,"name":"Bobby Matos","permalink":"bobby-matos","url":"/artist/bobby-matos"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084393,"name":"Bobby Matos - Gratitude - LFJ 1048","permalink":"bobby-matos-gratitude-lfr-1048","position":13,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/bobby-matos-gratitude-lfr-1048","status":"active","on_sale":false,"created_at":"2011-01-02T12:40:08.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://www.dawanmuhammad.com/mp3/matos/Gratitude/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://www.dawanmuhammad.com/mp3/matos/Gratitude/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Gratitude/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Gratitude/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://www.dawanmuhammad.com/mp3/matos/Gratitude/wimpy.swf\" flashvars=\"wimpyApp=http://www.dawanmuhammad.com/mp3/matos/Gratitude/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Gratitude/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Gratitude/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nBobby Matos is a survivor and defender of certain Afro_ Antillean musical traditions which are indispensible roots of contemporary Latin Jazz. He brings a \"streets of New York\" edge to his work and provides a fundamental element that too many young lions are skipping over. His group is an incubator for young talent and of course attracts old school veteranos as well.\r\n\r\nQue viva Bobby Matos and all the musicians who respect the origins of our music! ","options":[{"id":10572427,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226079/-/gratitude.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226079/-/gratitude.jpg","width":600,"height":600}],"artists":[{"id":49795,"name":"Bobby Matos","permalink":"bobby-matos","url":"/artist/bobby-matos"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084397,"name":"Bobby Matos - Made By Hand","permalink":"bobby-matos-made-by-hand-lfr-1038","position":14,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/bobby-matos-made-by-hand-lfr-1038","status":"active","on_sale":false,"created_at":"2011-01-02T12:41:30.000Z","description":"This CD was produced from an unplanned and unannounced live recording. Although the band was unaware of being recorded, the natural communication between musicians and high level of performance energy was clearly captured. Jazz Latino, Mambo, Bembe, and Son Montuno represents healing energy, meditation and medicine encoded as music. Yoga as sound. When musicians listen and communicate with each other and their audience on a spiritual level, the music becomes much more than a performance.\r\n\r\n\"Made By Hand\" features Frank Fontaine -Tenor Sax, soprano sax, & flute; Michael James Turre -baritone,alto sax, & flute; Victor Cegarra-piano;Eliseo Borrero -bass & vocals; Robertito Melendez-congas; Jacques Voyemant-trombone;Jud Matos-percussion;Denise Cook-coro; Ismael Carlo-coro & spoken word; Rogelio Mitchell-coro; and Bobby on timbales. Mambo, Bembe, and Jazz Latino represent healing energy, meditation, and medicine encoded as music. When musicians listen and communicate with each other and their audience on this spiritual level, the music becomes much more than a performance.","options":[{"id":10572431,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226143/-/bm_madebyhand.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226143/-/bm_madebyhand.jpg","width":600,"height":600}],"artists":[{"id":49795,"name":"Bobby Matos","permalink":"bobby-matos","url":"/artist/bobby-matos"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084043,"name":"Bobby Matos - Acknowledgement - LFJ 1043","permalink":"bobby-matos-acknowledgement","position":15,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/bobby-matos-acknowledgement","status":"active","on_sale":false,"created_at":"2011-01-02T09:05:15.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://www.dawanmuhammad.com/mp3/matos/Acknowledgement/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://www.dawanmuhammad.com/mp3/matos/Acknowledgement/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Acknowledgement/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Acknowledgement/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://www.dawanmuhammad.com/mp3/matos/Acknowledgement/wimpy.swf\" flashvars=\"wimpyApp=http://www.dawanmuhammad.com/mp3/matos/Acknowledgement/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Acknowledgement/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/matos/Acknowledgement/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nA veteran percussionist and pioneer of the Latin jazz genre since the early sixties, Bobby Matos has created an excellent fusion of Latin and Afro-jazz music on Acknowledgement. Matos records ten original hot and heavy, hip-moving compositions with his Afro Latin Jazz Ensemble and pays tribute to the legendary John Coltrane with Afro-Latin arrangements of three Coltrane standards. They include the four-note classic \"A Love Supreme Acknowledgement,\" supported by some masterful playing from bassist John B. Williams, and \"Tunji\" and \"Equinox,\" featuring fine tenor work by Frank Fontaine, Jr. and several solos by Danny Weinstein on viola and trombone. Matos opens up the session with one of his own uptempo charts on \"Manhattan Mozambique,\" which is followed by another upbeat piece dedicated to his musician son, \"Song for Jud.\" Jud Matos, also a member of the band, plays the clave throughout but really shines on the guiro, bell and chekere on \"Chango's Jazz.\" Not to be outdone,Bobby Matos comes through on congas and timbales in expressive style, marking this disc as an exciting percussion project. While the majority of the tracks here are instrumentals,\"Songoro\" and \"Soy Lucumi\" are two charanga-based tunes with vocals provided by Ismael \"East\" Carlo. Two of the best scores on the album have to be the brief but sweet little number \"Motivos de Jazz,\" highlighting Weinstein's performance on violin, and the melodically engaging \"Evelyn,\" with pronounced play by Matos (timbales),Fontaine, Jr. (flute) and Theo Saunders (piano). This album contains an obvious Afro-Cuban accent that this Cuban-American reviewer can appreciate. Acknowledgement combines Latin jazz swing with a heavy Afro percussive backdrop, delivering a truly vibrant performance. \r\n\r\n—Edward Blanco","options":[{"id":10571101,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30315399/-/bobbymatos_acknowledgment.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30315399/-/bobbymatos_acknowledgment.jpg","width":600,"height":600}],"artists":[{"id":49795,"name":"Bobby Matos","permalink":"bobby-matos","url":"/artist/bobby-matos"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3116759,"name":"Chester E. Smith - Blues C - LFJ 1044","permalink":"chester-e-smith-blues-c","position":16,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/chester-e-smith-blues-c","status":"active","on_sale":false,"created_at":"2011-01-10T11:18:29.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/smith/Blues%20For%20C/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/smith/Blues%20For%20C/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/smith/Blues%20For%20C/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/smith/Blues%20For%20C/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/smith/Blues%20For%20C/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/smith/Blues%20For%20C/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/smith/Blues%20For%20C/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/smith/Blues%20For%20C/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nChester E. Smith is a respected musician, talented performer and exciting addition to today’s jazz scene, particularly in the bay area where he now makes his home. Early in his career known as “Jazz Machine,” Chester opened for the Larry Coryell Show in Philadelphia to a full house of adoring fans.\r\n \r\nHe was technical consultant to electronic organ manufacturers, and the late jazz organist Jimmy Smith (no relative). He designed his own touring/recording organ called the FOX Special. His talents include both arranging and composing.  Many of his performances feature his own compositions, which are strongly influenced by the music of Duke Ellington, Erroll Garner and Jimmy Smith.\r\n","options":[{"id":10670929,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226407/-/chestersmith.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226407/-/chestersmith.jpg","width":600,"height":600}],"artists":[{"id":49823,"name":"Chester E. Smith","permalink":"chester-e-smith","url":"/artist/chester-e-smith"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084445,"name":"Chester E. Smith - Monster Groove Party","permalink":"chester-e-smith-monster-groove-party","position":17,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/chester-e-smith-monster-groove-party","status":"active","on_sale":false,"created_at":"2011-01-02T13:01:35.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/smith/Monster%20Groove%20Party/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/smith/Monster%20Groove%20Party/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/smith/Monster%20Groove%20Party/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/smith/Monster%20Groove%20Party/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/smith/Monster%20Groove%20Party/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/smith/Monster%20Groove%20Party/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/smith/Monster%20Groove%20Party/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/smith/Monster%20Groove%20Party/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nThe 18 funky bite-sized tracks on Monster Groove Party demonstrate Smith's keyboard wizardry, composition skills, and musical humor. He's joined on some tracks by drummer Gregg Bissonette or John Ferraro, and he makes liberal use of samples and loops from Spectrasonics - but Smith's chops are the focal point.","options":[{"id":10572495,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226183/-/monstergroove.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226183/-/monstergroove.jpg","width":600,"height":600}],"artists":[{"id":49823,"name":"Chester E. Smith","permalink":"chester-e-smith","url":"/artist/chester-e-smith"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3112247,"name":"Elmer Gibson Trio - Live - LFJ 1024","permalink":"elmer-gibson-trio-live-lfr-1024","position":18,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/elmer-gibson-trio-live-lfr-1024","status":"active","on_sale":false,"created_at":"2011-01-09T05:11:25.000Z","description":"\"Elmer Gibson is probably a new name for most of us, but he has been performing his brand of mainstream Jazz for many years, perhaps most notably with the Norman Connors Band in the 1970s. Gibson is an excellent pianist and a good composer and arranger, with good taste in sidemen.\" It is ironic that Steven Loewy wrote this review for Generation Dance in Cadence Magazine, April, 2003, because it is especially applicable in this offering, which he has not heard. The Elmer Gibson Trio Live date features an unknown bassist, Rick Jones, a doctorate of electronic engineering, who cut his eyeteeth playing with Elmer over the previous ten years, and a rediscovered powerhouse drummer named Ron Free, who hadn't been heard from in 30 years, since his days with Mose Allison. Ron sat in on Elmer's gig at the Chef and Clef in Charleston, SC, the year before and this was Elmer's first opportunity to call him for a gig. Ironically, Ron's first official recording date (at the tender age of 20) was given to him by a cousin of Elmer's, the eminent bassist Oscar Pettiford. Oscar had heard him perform in the pit band for an off-Broadway show called \"The Shoestring,\" and was obviously impressed.\r\n\r\nWhat is truly amazing is the fact that this session would not exist if it had not been for Rick's foresight and engineering skills that made him bring his DAT recorder that inauspicious November night in 1994. Rick had received his first taste of big-time drummers when Elmer headlined a trio date for the Artsplosure Festival (Raleigh, North Carolina) featuring Danny Richmond, and another with Bobby Durham, sadly, neither of which was recorded. Rick had this to say about his experience with Ron: \"Elmer and I had played together enough that I knew his music pretty well. Ron, of course, was not familiar with any of Elmer's music. Given those circumstances, what you hear from Ron in the performances recorded at that gig, is remarkable. Even the first time through a given tune, you can hear how Ron is able to anticipate the rhythmic aspects of the tune and make it sound like we had been playing together for years. His musical radar created a cohesiveness that inspired us collectively and lifted the music to new heights.\"\"What Happened to Ronnie Free?\" shouts a headline from an article by Sam Stephenson in the Oxford-American (July/August 2000). Well, this CD answers the question. And what does Ron think about his re-emergence? \"I am proud of our performance. We did some serious cooking, rare and well done at the same time. We had a lot of good energy going.\" And what does Elmer Gibson think about this recording? \"If Rick hadn't saved those DATs, and if I hadn't decided to revisit them in 2001, I would have missed presenting what is probably my best performance on record to date. Totally unselfconscious and full of genuine emotion and a lot of fun.\" How ironic.\r\n\r\nElmer Gibson Trio: Elmer Gibson (piano); Rick Jones (bass); Ron Free (drums).\r\n\r\nPersonnel: Elmer Gibson (piano); Ronnie Free (drums).\r\n\r\nLiner Note Authors: Bob Rogers; Elmer Gibson.\r\n\r\nRecording information: Raleigh, NC (11/19/1994).\r\n\r\nPhotographer: Robert Flynn.","options":[{"id":10658643,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224111/-/elmergibson_live.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224111/-/elmergibson_live.jpg","width":600,"height":600}],"artists":[{"id":49819,"name":"Elmer Gibson","permalink":"elmer-gibson","url":"/artist/elmer-gibson"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084547,"name":"Elmer Gibson - Generation Dance","permalink":"elmer-gibson-generation-dance","position":19,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/elmer-gibson-generation-dance","status":"active","on_sale":false,"created_at":"2011-01-02T13:27:00.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/gibson/Generation%20Dance/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/gibson/Generation%20Dance/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/gibson/Generation%20Dance/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/gibson/Generation%20Dance/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/gibson/Generation%20Dance/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/gibson/Generation%20Dance/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/gibson/Generation%20Dance/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/gibson/Generation%20Dance/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nInitially, I created Generation Dance as a memorial to my late father and as a living memorial to my mother who was 85 years old at the time of the recording session. Because of my great respect for my parents, I wanted my offering to have meaning and purpose worthy of their extraordinary life achievements. I wanted to make a statement, a summation of thoughts and ideas generated by the news of my father's passing.\r\n\r\nI hope that you find it thought provoking, informative and entertaining...\r\n\r\n\r\nThe making of Generation Dance was a particularly spiritual experience for me. It began in 1976 with the unexpected but foruitous move from my birthplace of Philadelphia, Pennsylvania to Raleigh, North Carolina, the Capital City of my father's birthstate.\r\n\r\nAfter attending a Pettiford family reunion in 1983, and being totally overwhelmed by the discovery of an extended family I had never known, I began to research my father's family history. Searching old records in the N.C. State archives, I was amazed to find the actual slave records of my grandfather, great grandfather, and great grandmother. More amazing was my visit to the actual plantation where they were born and to see their owners, (perhaps my great, great grandfather) house still in tact. \"Here, I noted, I have finally set foot on soil in this United States that has meaning to me personally.\"\r\n\r\nThere are names of my family members, both slave and free, listed in the N.C. State archives that stretch back many years before the Revolutionary War. A fact that I noted with some pride in 1993 when my father, Chaplain Lt. Colonel Elmer Pettiford Gibson was buried in Arlington National Cemetery with full military honors.\r\n\r\nThere are great insights to be had from the study of generation. . . The griots words were more than just a litany of minute facts and details. . . I might never have known had I not sat and listened. . .\r\n\r\nI wish to thank the wonderful group of musicians who, answering my call, spoke with such passionate eloquence.\r\n\r\n—E.H. Gibson 1997","options":[{"id":10572623,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30315871/-/elmergibson_generationdance.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30315871/-/elmergibson_generationdance.jpg","width":600,"height":600}],"artists":[{"id":49819,"name":"Elmer Gibson","permalink":"elmer-gibson","url":"/artist/elmer-gibson"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084621,"name":"Mingus Amungus - Live in Cuba","permalink":"mingus-amungus","position":20,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/mingus-amungus","status":"active","on_sale":true,"created_at":"2011-01-02T13:48:51.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/mingusamungus/Live%20In%20Cuba/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/mingusamungus/Live%20In%20Cuba/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/mingusamungus/Live%20In%20Cuba/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/mingusamungus/Live%20In%20Cuba/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/mingusamungus/Live%20In%20Cuba/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/mingusamungus/Live%20In%20Cuba/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/mingusamungus/Live%20In%20Cuba/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/mingusamungus/Live%20In%20Cuba/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nThe Mingus Amungus trip to Cuba was one of the most profound tours of my career. The rich culture, musical heritage, and genuine passion of the people was awe-inspiring. Bearing witness to a society so culturally advanced, yet without the material possessions Americans view as basic necessities, gave me a renewed look on my priorities in life.\r\n\r\nI was especially impressed by what was held to be important by the the people of Cuba — family, friends, God, education, music, and dance are of foremost importance to the people we met. In evaluating their values, I and Mingus Amungus realized that these are the same priorities that bring essence to my life. Material objects do not guarantee lasting happiness - it is family, friends, God, education, music, and dance that bring meaning to my life - the rest just fills the gaps.\r\n\r\nBecause Cuban music is tied to dance, their concept of music is very social. The audience is involved and, therefore, just as much a part of making the music as those on stage. Listen to the middle of track seven where you can hear a young boy saying \"so much on my mind, so much on my brain\". The boy was not English-speaking, yet he had no problem with the hook. This is the type of involvement that is heaven for a performer.\r\n\r\nThe ability to come together as a people, despite cultural or linguistic barriers is one of the most beautiful things about music and the Mingus Amungus  concept. Music is just as much a way of communicating as language and conversation. Listen to the interaction between Adrian Areas and Miguel \"Anga\" Diaz in the middle of track nine. You can hear them \"trading\" phrases back and forth as they were sharing seven conga drums. This is the amazing thing about music -- that two people who had never met, from different cultures, could sit down and communicate so well without missing a beat. In this case, music is the tie that binds. We can all learn from this -- politicians, diplomats, business people, and other international officials must find the tie that binds to communicate effectively and meaningfully with one another.\r\n\r\nAs members of humankind we are obligated to take an active role in making the world a better place for everyone, but not at the expense of imposing our own ideology onto others. Cultures, genders, and generations must be encouraged to coexist without making one subservient to the other. To make a difference we must challenge boundaries and limitations making a better world than when we arrived. \r\n\r\n- Miles D.V. Perkins, Director\r\n\r\n----------------------------------------------------\r\n\r\nThe Mingus Amungus Concept:\r\n\r\nCharles Mingus is one of the most difficult players and composers of the bop and post-bop era to define. His complex rhythms and tempos made him a stand-out artist within the jazz genre. His thematic compositions, were often inspired by political events and/or people, such as \"Fables of Faubus,\" named after Orval E. Faubus, Governor of Arkansas who, in 1957, deployed the National Guard to prevent a few black children from entering Little Rock's Central High School. His music covered a wide range of styles, from his earliest work with Louis Armstrong to his later free-form orchestral compositions.\r\n\r\nMusically, Mingus never played it safe. His artistic intent was to create an immediate emotional statement through what he created. While he relied on the individual strength of his players, he would always inspire and channel their creative energies toward collective expression.\r\n\r\nSimilarly, with the individual strengths of his players in mind, Miles Perkins brings Mingus' musical philosophy into the the new millennium with Mingus Amungus. Musically, he too, like Mingus, never plays it safe. The all-star seven piece band weaves its way through Mingus' intricate charts with hard-hitting be-bop, funk and classical. The band then sprinkles San Francisco's native Hip-Hop Jazz flavor into the mix with a variety of lyricists, thereby bringing Mingus' work into the contemporary age. Recognized with a 1997 BAMMIE award for Most Outstanding Jazz Club Band, Mingus Amungus is a noted festival favorite and a must-see act. \r\n\r\nCombining cultures, Mingus Amungus frequently works with dancers who focus on Jazz Improvisational, Haitian and Brazilian dance. These collaborations are breathtaking performances and can include up to 15 musicians, drummers, vocalists and dancers providing the audience with a glimpse into the richness of cultures that are often undervalued in urban society.","options":[{"id":10572735,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224775/-/mingusamungus.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224775/-/mingusamungus.jpg","width":600,"height":600}],"artists":[{"id":49847,"name":"Mingus Amungus","permalink":"mingus-amungus","url":"/artist/mingus-amungus"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3304775,"name":"Elmer Gibson - Comfort & Joy","permalink":"elmer-gibson-comfort-joy","position":21,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/elmer-gibson-comfort-joy","status":"active","on_sale":true,"created_at":"2011-02-18T07:52:13.000Z","description":"Two weeks before Christmas of 2006, flutist Lori Barmer asked if I would help her record a CD of Christmas songs as a gift for her mother. Besides the obvious time crunch, I was completely unfamiliar with her choice of songs. Her selections had special meaning for her and her family while growing up in rural North Carolina, so I had to do some research to get an idea of the feel of each piece. We both wanted the recording to have a unique jazz flavor, so not only was I her accompanist, I was also the arranger. After studying the music, I found that all of the songs didn’t lend themselves to strict jazz interpretations, so I added some intros and interludes, re-harmonized chords and changed the rhythms. Thanks to our good friend and mastering expert, Joel Leipzig, we met the deadline and produced a demo CD of six songs. I decided to give the music another listen about a year later and realized that the arrangements warranted a serious recording of holiday music. John Drymon, a fine organist and arranger himself, offered to re-program the general midi sounds I used with real recorded orchestral sounds. I added four more songs and invited some musician friends to join me. The result is “Comfort and Joy,” a collection that reflects several cultural influences, including German, French, English, Appalachian folk, and African-American folk. All of the songs are arranged as straight-ahead jazz, Brazilian samba rhythms, symphonic orchestrations … even a touch of Sousa. I wish you much comfort and joy throughout the holidays!\r\n\r\nPeace, Elmer Gibson","options":[{"id":11218581,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/32064251/-/Elmer_Gibson_CompfortJoy.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/32064251/-/Elmer_Gibson_CompfortJoy.jpg","width":600,"height":597}],"artists":[{"id":49819,"name":"Elmer Gibson","permalink":"elmer-gibson","url":"/artist/elmer-gibson"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084717,"name":"Vern Thomson - Sea of Dreams","permalink":"vern-thomson-sea-of-dreams","position":22,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/vern-thomson-sea-of-dreams","status":"active","on_sale":false,"created_at":"2011-01-02T14:31:48.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/thompson/Sea%20Of%20Dreams/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/thompson/Sea%20Of%20Dreams/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Sea%20Of%20Dreams/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Sea%20Of%20Dreams/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/thompson/Sea%20Of%20Dreams/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/thompson/Sea%20Of%20Dreams/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Sea%20Of%20Dreams/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Sea%20Of%20Dreams/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nSea of Dreams\" effectively blends the angular melodic lines and altered chordal structures of \"Ibo\" with the arrestingly beautiful harmonies of the Jobim-influenced \"Ondas Bonitas\". In a refreshing departure from the tendency towards rehashing standard jazz forms, Thompson speaks in a clear and unique voice. These recordings are gems, and the bay area should be proud to claim Vern Thompson as one of its own. \r\n\r\n— Jerome Matthews, Bay Jazz.com","options":[{"id":10572867,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30315767/-/vern_seaofdreams.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30315767/-/vern_seaofdreams.jpg","width":600,"height":600}],"artists":[{"id":49859,"name":"Vern Thompson","permalink":"vern-thompson","url":"/artist/vern-thompson"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084713,"name":"Vern Thompson - Passions of the Heart","permalink":"vern-thompson-passions-of-the-heart","position":23,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/vern-thompson-passions-of-the-heart","status":"active","on_sale":false,"created_at":"2011-01-02T14:29:42.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/thompson/Passions%20Of%20The%20Heart/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/thompson/Passions%20Of%20The%20Heart/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Passions%20Of%20The%20Heart/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Passions%20Of%20The%20Heart/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/thompson/Passions%20Of%20The%20Heart/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/thompson/Passions%20Of%20The%20Heart/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Passions%20Of%20The%20Heart/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Passions%20Of%20The%20Heart/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nThompson clearly is not afraid of challenging chord changes and intricate melodies: Woody Shaw and Joe Henderson's influences suffuse many of the tracks on both albums. In a refreshing departure from the tendency towards rehashing standard jazz forms, Thompson speaks in a clear and unique voice. These recordings are gems, and the bay area should be proud to claim Vern Thompson as one of its own. \r\n\r\n—Jerome Matthews , Bay Jazz.com\r\n","options":[{"id":10572863,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224495/-/passions.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224495/-/passions.jpg","width":600,"height":600}],"artists":[{"id":49859,"name":"Vern Thompson","permalink":"vern-thompson","url":"/artist/vern-thompson"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084707,"name":"Vern Thompson - Convergence","permalink":"vern-thompson-convergence","position":24,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/vern-thompson-convergence","status":"active","on_sale":false,"created_at":"2011-01-02T14:27:31.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/thompson/Convergence/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/thompson/Convergence/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Convergence/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Convergence/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/thompson/Convergence/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/thompson/Convergence/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Convergence/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/thompson/Convergence/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nComposer and arranger Vern Thompson's enormous technical skill and artistic vision are at the core of this fine straight -ahead Jazz session, recorded at the Spark Studios in Emeryville, California. \r\n\r\nThompson is of a highly melodic temperament, and his challenging, original compositions are thoughtfully interpreted by outstanding performers who are leaders in their own right. Gale and Childs are among the most melodic players in contemporary music, and their inspired efforts here deserve repeated listening. A case in point is expertly crafted the quintet performance, \"Pooka\", a medium up-tempo piece whose harmonic structure evokes Woody Shaw' s best designs. And Tana's explosive polyrhythms on \"Swirl\" reveal a creative musician in his prime. This is an advanced group that deserves an immediate engagement at a premiere Jazz performance venue. \r\n\r\n—James D. Armstrong, Jr.","options":[{"id":10572847,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224599/-/vt_convergence.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224599/-/vt_convergence.jpg","width":600,"height":600}],"artists":[{"id":49859,"name":"Vern Thompson","permalink":"vern-thompson","url":"/artist/vern-thompson"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084465,"name":"Dawan Muhammad - Consider The Source - LFJ 1021","permalink":"dawan-muhammad-consider-the-source","position":25,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/dawan-muhammad-consider-the-source","status":"active","on_sale":false,"created_at":"2011-01-02T13:05:19.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://www.dawanmuhammad.com/mp3/dawan/considerthesource/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://www.dawanmuhammad.com/mp3/dawan/considerthesource/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/considerthesource/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/considerthesource/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://www.dawanmuhammad.com/mp3/dawan/considerthesource/wimpy.swf\" flashvars=\"wimpyApp=http://www.dawanmuhammad.com/mp3/dawan/considerthesource/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/considerthesource/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/considerthesource/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nIn the mysterious world of jazz, Dawan Muhammad is an improvising composer and his recordings reveal that he is also able to attract other artists with innovative approaches to original composition and refreshing variations on jazz standards. This source is bonafide!","options":[{"id":10572515,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224999/-/consider.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224999/-/consider.jpg","width":600,"height":600}],"artists":[{"id":49837,"name":"Dawan Muhammad","permalink":"dawan-muhammad","url":"/artist/dawan-muhammad"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084613,"name":"LifeForce Jazz & Blues Compilation - LFJ 1010","permalink":"lifeforce-jazz-blues-compilation","position":26,"price":14.95,"default_price":14.95,"tax":0.0,"url":"/product/lifeforce-jazz-blues-compilation","status":"active","on_sale":true,"created_at":"2011-01-02T13:46:58.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/lifeforce1/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/lifeforce1/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/lifeforce1/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/lifeforce1/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/lifeforce1/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/lifeforce1/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/lifeforce1/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/lifeforce1/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nThis is an album of solid jazz and blues performed by an impeccable array of musicians and with 18 tracks and an excellent sampler into the world of LifeForce Jazz. The common denominator on most of the tracks is Dawan Muhammad on woodwinds and percussion, and whose inspiration and versatility has laid the foundation for these projects to get off the ground.","options":[{"id":10572723,"name":"Default","price":14.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125397867/-/LJB-Comp.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125397867/-/LJB-Comp.jpeg","width":1645,"height":1478}],"artists":[{"id":49837,"name":"Dawan Muhammad","permalink":"dawan-muhammad","url":"/artist/dawan-muhammad"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3116725,"name":"Dawan Muhammad - Hereafter - LFJ 1020","permalink":"dawan-muhammad-hereafter","position":27,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/dawan-muhammad-hereafter","status":"active","on_sale":true,"created_at":"2011-01-10T11:03:49.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://www.dawanmuhammad.com/mp3/dawan/hereafter/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://www.dawanmuhammad.com/mp3/dawan/hereafter/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/hereafter/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/hereafter/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://www.dawanmuhammad.com/mp3/dawan/hereafter/wimpy.swf\" flashvars=\"wimpyApp=http://www.dawanmuhammad.com/mp3/dawan/hereafter/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/hereafter/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/hereafter/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nDawan Muhammad qualifies as a unique kind of renaissance man. For Hereafter he plays woodwinds and flutes, is composer, arranger, conceptualizer, and label manager. But the reality is so much broader than that. He is a community activist and non-profit entrepreneur, as much concerned for the mental and cultural health of Bay Area communities, and propagation of this unique art form we call jazz, as he is about his own musical development. He gives back to the community in a variety of different, well-chronicled ways;\r\nhe gives back to the music in this instance with Hereafter.\r\nDawan¹s primary vehicle, LifeForcejazz, is not only the imprimatur of this recording, it is also a means of bringing arts and culture to various Bay Area communities, through a variety of after-school and weekend programs\r\nfor youngsters and young adults. LifeForcejazz, which can be accessed on the web at www.lifeforcejazz.com (http://www.lifeforcejazz.com), also provides vehicles to assist independent jazz recording artists to better maximize\r\ntheir product and opportunities. Just who is the dynamic force behind LifeForcejazz?\r\n\r\nBorn in Dallas Texas, Dawan Muhammad seemed to naturally respond to jazz, even as a toddler. He later became intrigued by homegrown jazz artists like Buster Smith, Red Garland, Ornette Coleman, King Curtis, Kenny Dorham, David\r\n\"Fathead\" Newman, Cedar Walton, and James Clay, just to name a few. When Muhammad¹s family migrated to the San Francisco Bay Area, he took up the saxophone in middle school. By the time he entered military service his alto\r\nsax was just a memory, but his love for jazz and experience in the service drove him to resume his musical quest. He enrolled in correspondence courses from Berklee School of Music and was eventually stationed at McGuire Air Force Base in New Jersey where he came in contact with New York-based artists and mentors such as Frank Wess,George Coleman, Barry Harris, James Spaulding, Don Patterson, Joe Chambers and a host of others.\r\n\r\nFollowing his service stint he earned degrees in Political Science and Islamic Studies from UC Santa Cruz. While matriculating, he co-founded Evidence Artistic Records with classmate Randy Masters and became immersed in developing ideas, vehicles, and means to assist in advancing the careers of his fellow artists. In 1994, Dawan and jazz legend Billy Higgins launched LifeForcejazz Records to pursue new projects and examine the impressive body of recordings in the can, some of which they never intended to release. However, due to the compelling nature of the music and a desire to build a label and distribution vehicles, more releases became inevitable. Which brings us to Hereafter.\r\n\r\nThe sessions that yielded this 10 track program stem from recordings laid down in December 1979; December 1987; and February 1988. Despite that passage of time, there is freshness in this music that is unmistakable. According to Dawan, \"I have a somewhat suspect reputation for attempting to pull off spontaneous recording sessions, where musicians are called together at the last minute, the music is arranged on the spot, and everyone leaves the session wondering what happened.\" Wonder no more, the evidence is\r\nfinely wrought in Hereafter, which is a somewhat prophetic title considering its recording vintage and current release.\r\n\"Although these recordings were not intended for commercial use, as it turns out, I ended up releasing them for documentation purposes. The collaborating artists on these dates are a combination of long time friends and mentors,\r\nwho were always willing to help me try out my ideas and bring some of their own to the table. I try to pay tribute to those who influenced me,\" says Muhammad. Indeed the music is delivered by a cast including several notable\r\nartists on the national and international stage. These include Ray Drummond (tracks 1-4) and Jeff Chambers (tracks 5-10), who anchor the date with their bulwark bass work, giving the music a firm foundation. The trumpet and\r\nflugelhorn chores are split between two underrated voices: Eddie Henderson (tracks 1-4), and the late Johnny Coles (tracks 8-10). And speaking of underrated, the drum work on tracks 8-10 is contributed by one of the Bay Area¹s finest, Eddie Marshall. Rounding out the cast are such estimable players as pianists Paul Nagel (tracks 1-4) and Glen Pearson (tracks 5-10); drummers Guillermo Cantu (tracks 1-4) and Bob Braye (tracks 5-7); and trombonist Dan Marcus (tracks 8-10). One of the date¹s wild cards is Mondre Moffett on baritone horn, a member of the brass family seldom heard in jazz settings, but quite appropriate to the setting in which Dawan has cast it. Establishing the tone is our leader, who performs on soprano, alto, and tenor saxophones; bass clarinet, and flutes. The title track, Hereafter, establishes a medium tempo, contemplative mood,\r\nwith flute and woodwind harmonies underpinning Henderson's bittersweet flugelhorn. Capturing the mood, Dawan takes his solo on alto flute, which coupled with Henderson's flugelhorn is remindful of some of Herbie Hancock's\r\nvoicings when Eddie was his trumpeter. Dawan adroitly switches to the alto after concluding his flute statement. West Oakland Strut, written by fellow Bay Area pianist Ed Kelly, provides a framework for Moffett's dexterous\r\nbaritone horn. One of the hallmarks of this date is Muhammad's democratic leadership; he gives ample breathing room to his peers' expressions, never hogging the spotlight.\r\nDawan wrote a stately intro to Chick Corea¹s Now He Sings, arranging the composer's piano voicings for horns, this sextet rendition finds our leader on soprano sax. Bowing to the composing gifts of his fellow travelers, next up is pianist Paul Nagel¹s No Need, a superb showcase for Eddie Henderson¹s fluid drive trumpet, as he delivers a beautiful legato solo, spelled by Dawan¹s tenor this time. Speaking of his tenor, he takes his own Consider The Source on the big horn. It¹s a quartet showcase for the leader¹s tenor,\r\nwhich at least at this point in his career was his most broadly developed voice. Glen Pearson¹s lyrical Bree¹s Theme follows. It¹s a lovely, optimistically open piece and yet another fine tenor showcase for Dawan. His tenor has a warm, humanistic quality. Sneakin¹ A Peak Into Darkness by Jeff Chambers is a good blowing vehicle for Muhammad¹s soprano. The pianist sits this one out, leaving a bare bones sax, bass & drums setting, allowing Dawan to hang fly with his freest expressions on the date. His original piece Ota is an apt follow-up, a lovely flute ballad, and the entry point for the burnish-toned Johnny Coles. Eddie\r\nMarshall¹s Seems To Be is one of this disc¹s highlight themes, given a jaunty swagger in its delivery and Dan Marcus¹ fluid trombone adds a tasty voice on this piece.\r\nThe slightly introverted styling of Coles offers a nice contrast to Eddie Henderson from earlier in the date. While Eddie Henderson is more from the Freddie Hubbard school, Coles is more closely akin to a Kenny Dorham or Booker Little approach. The juxtaposition of the two trumpet & flugelhorn men lends the date a successful sense of balance. The surging Muhammad original, Muqaddimah, with its three horn frontline, has an almost Messengers-like quality. The selections on Hereafter offer music that grows\r\nand further unfolds with each listen. Makes one wonder what other goodies Dawan Muhammad has up his sleeve or rather, in his vault. The wait should be well worth it!\r\n\r\n-Willard Jenkins ","options":[{"id":10670847,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30225919/-/dm_hereafter.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30225919/-/dm_hereafter.jpg","width":600,"height":600}],"artists":[{"id":49837,"name":"Dawan Muhammad","permalink":"dawan-muhammad","url":"/artist/dawan-muhammad"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084667,"name":"Dawan Muhammad - Radio Free Soul - LFJ 1015","permalink":"dawan-muhammad-radio-free-soul-lfr-1015","position":28,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/dawan-muhammad-radio-free-soul-lfr-1015","status":"active","on_sale":false,"created_at":"2011-01-02T14:11:10.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://www.dawanmuhammad.com/mp3/dawan/rfs/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://www.dawanmuhammad.com/mp3/dawan/rfs/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/rfs/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/rfs/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://www.dawanmuhammad.com/mp3/dawan/rfs/wimpy.swf\" flashvars=\"wimpyApp=http://www.dawanmuhammad.com/mp3/dawan/rfs/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/rfs/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/rfs/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nWhile serving as an artist in residence at University of California, Santa Cruz from 1975 - 78, I had several opportunities to record some original compositions for extended ensembles of varied instrumentation. With support from students, professionals and a community of serious music lovers, \"Radio Free Soul\" was written in tribute to America's high tide of revolutionary spirit during the 1960's and in question of it's decline or lull during the 1970's.\r\n\r\nThe idea was to present a variety of jazz styles, incorporating voice, African rhythms, modern harmony and chamber or string orchestra. The live performances of this highly improvisational body of work received rave reviews at that time, and now, over twenty-five years later, music collectors are recapturing the experience through this CD. What's important to me is that it was a collective effort, we were able to document it and we all had Fun! ","options":[{"id":10572793,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226039/-/dm_rfs.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226039/-/dm_rfs.jpg","width":600,"height":600}],"artists":[{"id":49837,"name":"Dawan Muhammad","permalink":"dawan-muhammad","url":"/artist/dawan-muhammad"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084485,"name":"Dawan Muhammad/Billy Higgins Sextet - Smoke Signal - LFJ 1023","permalink":"dawan-muhammad-billy-higgins-sextet-smoke-signal","position":29,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/dawan-muhammad-billy-higgins-sextet-smoke-signal","status":"active","on_sale":false,"created_at":"2011-01-02T13:08:41.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://www.dawanmuhammad.com/mp3/dawan/smokesignal/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://www.dawanmuhammad.com/mp3/dawan/smokesignal/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/smokesignal/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/smokesignal/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://www.dawanmuhammad.com/mp3/dawan/smokesignal/wimpy.swf\" flashvars=\"wimpyApp=http://www.dawanmuhammad.com/mp3/dawan/smokesignal/wimpy.php&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/smokesignal/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://www.dawanmuhammad.com/mp3/dawan/smokesignal/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nA jazz workshop conducted by Dawan Muhammad and Billy Higgins, produced this recording in tribute to Art Blakey and the Jazz Messengers. It is re-issued to also pay homage to Billy Higgins for his many contributions on and off the World Stage.","options":[{"id":10572535,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226479/-/dm_smokesignal.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226479/-/dm_smokesignal.jpg","width":600,"height":600}],"artists":[{"id":49815,"name":"Billy Higgins","permalink":"billy-higgins","url":"/artist/billy-higgins"},{"id":49837,"name":"Dawan Muhammad","permalink":"dawan-muhammad","url":"/artist/dawan-muhammad"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084693,"name":"TC 3 Live! Mega Jazz Explosion","permalink":"tc-3-live-mega-jazz-explosion","position":30,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/tc-3-live-mega-jazz-explosion","status":"active","on_sale":false,"created_at":"2011-01-02T14:23:39.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/tc3/Live%20Mega%20Jazz%20Explosion/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/tc3/Live%20Mega%20Jazz%20Explosion/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/tc3/Live%20Mega%20Jazz%20Explosion/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/tc3/Live%20Mega%20Jazz%20Explosion/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/tc3/Live%20Mega%20Jazz%20Explosion/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/tc3/Live%20Mega%20Jazz%20Explosion/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/tc3/Live%20Mega%20Jazz%20Explosion/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/tc3/Live%20Mega%20Jazz%20Explosion/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nA VOCALIST WITH GIFTED TASTE AND IMPRESSIVE CHOPS! - HOT HOUSE MAGAZINE -This is the first and long awaited CD recording of one of the Jazz Industry's Premiere Jazz Vocalist known as \"T.C.,III\". Pronounded(tc the third). He was a 2005 Jazz Mobile Anheuser-Busch, 2nd Annual Jazz Vocal Competition Winner, and was the MC for that competition the following year. He's one of the most talked about jazz singres on the New York scene today. Reminences of LeonThomas, Joe Williams & Eddie Jefferson. Check-out www.boperetta.com, so you can read about a new jazz musical that he's starring in. In 2006 He Recorded with the Late Great \"Roland Alexander\", Taru Alexander, Joe Ford, and their contemporary Gerry Eastman, on Eastman's indie label / WMC (williamsburg music center). Also, presently, T.C.,III performs every Sunday at St. Nick's Pub, located in the prestigious section of New York City known as \"Harlem\", Where Duke Ellington and Fletcher Henderson lived back in the 1920's and 30's, and various other venues throuhout the states, abroad and beyond. His first gig was at age 14 with his parents, The Legenday Trudy Pitts and \"Mr. C\", opposite the Mercer Ellington Big Band, featuring Phillis Hyman on Vocals. On his 16th Birthday, he sang Rahsaan Roland Kirk's composition \"Bright Moments\" at the The Village Vangard in New York's well talked about section called The East Village, w/ Rahsaan Roland Kirk and The Vibration Society. Incidently, the version of lyrics that TC sang were written by Todd Barken, who was at that time, Rahsaan's road manager, but now manages Dizzy' Club Coca-Cola, located inside the prestigious Jazz @ Lincoln Center in NEW YORK CITY, NEW YORK. Home of Wynton Marsalis and The Lincoln Jazz Orchestra. T.C.,III's version of this song can be found on track 5 of this new cd, in which the live audience joins in for a little bit of \"HI DE HO\". In March of 2006 he sang in Jazz @ Lincoln Center's, ROSE HALL. On a program entitled, \"IN THE CITY OF BROTHERLY JAZZ\"!. With born Philadelpian natives, Jimmy Heath, Albert \"Tootie\" Heath, Buster Williams, Joey DeFrancesco, Pat Martino, and Duane Eubanks, from the famous Eubanks Family. A concert Honoring the MUSIC of Great Jazz Composers from his home town of Philadephia. Also known as \"THE CITY OF BROTHELY LOVE\"!. He's worked and toured with such Jazz Greats as; Terrance Blanchard, TS Monk, Grover Washinton Jr., Milt Hinton, Wynton Marsalis, SunRa & His Arkestra, \"Philly\" Joe Jones, Rahsaan Roland Kirk, Donald Harrison, The Heath Brothers, Jon Hendricks, Norman Connons & The Strarship Orchestra, Bobby Watson, Curtis Lundy, Ralph Peterson Jr., Orrin Evans and J.D. Allen just to name a few. On this CD, T.C.,III leads an ALL-STAR Cast of Cats such as; GARY BARTZ, JOEY DEFRACESCO, EDDIE HENDERSON, TRUDY PITTS AND \"MR. C\", DON BRADEN, CLIFFORD ADAMS, ORRIN EVANS, BYRON LANDHAM, DARYL HALL, LEE SMITH, DAVID EPHROSS, MAMONTE', AND ELMER GIBSON, who wrote \"SONG FOR DEBRA\", found on track 3. A very beautiful ballad sang to perfection by TC and played especially tasteful by the legendary Gary Bartz on alto sax and the fanaminal Elmer Gibson on piano and strings. Elmer Gibson also wrote the arrangement for the Frank Loeosser composition,\"IF I WERE A BELL\", for which he accompanied the band on piano, and it is found on track 6, in which tenorman Don Braden takes a great solo. And last but not least, my good friend and mentor The GodFather of Jazz Vocalese, SIR. JON HENDRICKS, wrote the Liner Notes for this wonderful recording. Helping this CD to be A TRUE JAZZ CLASSIC COLLECTIBLE. This CD is truely a great asset for Jazz listeners from all catogories; The seasoned listener, the new listener and the inquisitive mind. A GREAT RECORD TO ADD TO YOUR MUSIC COLLECTION!","options":[{"id":10572833,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30315799/-/tc3_mega.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30315799/-/tc3_mega.jpg","width":600,"height":600}],"artists":[{"id":49857,"name":"TC 3","permalink":"tc-3","url":"/artist/tc-3"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084685,"name":"Rolando Matias - Live Volume One","permalink":"rolando-matias-live-volume-one-lfr-1047","position":31,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/rolando-matias-live-volume-one-lfr-1047","status":"active","on_sale":false,"created_at":"2011-01-02T14:19:16.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/matias/_Live_%20Volume%20One/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/matias/_Live_%20Volume%20One/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/matias/_Live_%20Volume%20One/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/matias/_Live_%20Volume%20One/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/matias/_Live_%20Volume%20One/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/matias/_Live_%20Volume%20One/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/matias/_Live_%20Volume%20One/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/matias/_Live_%20Volume%20One/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nTraditional and Latin jazz musicians have taken separate risks to develop unique experimental approaches. Traditional jazz musicians have spent decades building, destroying, and reconstructing the harmonic foundation of jazz. Latin jazz musicians have emphasized rhythmic diversity, exploring the connections between jazz and a variety of Caribbean and South American traditions. Paths often cross through the stylistic embellishment of jazz standards with fixed harmonic forms, and diverge between avant-garde and Latin music. Percussionist Rolando Matias and his Afro-Rican Ensemble bring all jazz roads together into an intriguing mixture of risk, experimentation and history on \"Live Volume One.\r\n\r\nSeveral repertoire choices immediately set the band apart from many Latin jazz ensembles. Rahsaan Roland Kirk's \"Volunteered Slavery stands the furthest outside of Latin jazz conventions. Matias opens the piece with spoken word, and then leaves bassist Roger Hines to freely define a swing feel behind trumpet player Mike Wade and pianist Baris Buyukyildirim. The full Latin rhythm section brings the song to an up-tempo finish. The veiled appearance of a two-chord dance song starts Pharaoh Sanders' \"Thembi (Part 1), as tenor saxophonist Eddy Bayard plays the melody. Wade and Bayard push their solos outside the harmony while Buyukyildirim and Hines boldly eliminate the harmonic center. As the band transitions into the sparse texture of \"Thembi (Part 2), Buyukyildirim freely explores the territory between traditional melodies, polytonality, and Tyner-like open voicings. Beyond the novelty of unusual song choices, the full commitment to the musical aesthetics creates a stimulating musical experience.\r\n\r\nMatias and his group rhythmically reconstruct standards as well, elevating the traditional music with their inspired performances. Joe Henderson's \"Mamacita inherits a salsa rhythm, while maintaining its original hard bop flare. Wade and Bayard have done their homework on this jazz era, and they deliver fiery solos full of blues flavor and bop shape. \"Black Narcissus opens with Hines rhythmically bowing his bass over a Comparsa rhythm. As the rhythm section builds intensity, Bayard delivers the melody and then plays a strong and passionate solo. Buyukyildirim takes center stage in \"Tico Tico, a Bomba with traditional melodic and harmonic structures. After locking the melody into the drums, Buyukyildirim completely explores the changes, alternating between tense rhythmic patterns and flowing melodic phrases. Matias and guest timbalero Bobby Matos bring a passionate sense of tradition to \"Song for Judd, providing heartfelt and studied percussion solos. The group builds strong performances, combining the best of both jazz worlds with their defined personal voices.\r\n\r\nMatias and his group prioritize risk taking on \"Live Volume One, bringing together diverse musical aesthetics. At times, the album reflects the downsides of musical risks—momentary lacks of unity, occasional tuning issues in the winds, and an uneven recording. Yet the positive results push the band into uncharted Latin jazz territory, forcing them to explore new improvisational challenges. Their musical journey reflects broad jazz history knowledge and an unbridled creative spirit. Their performance evolves into a clear statement of personality and character, exposing a tradition of unified experimentation.","options":[{"id":10572825,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30315839/-/rolandomatias.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30315839/-/rolandomatias.jpg","width":600,"height":600}],"artists":[{"id":49855,"name":"Rolando Matias","permalink":"rolando-matias","url":"/artist/rolando-matias"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084573,"name":"Gordon Stevens - Homecoming - LFJ 1011","permalink":"gordon-stevens-homecoming-lfr-1011","position":32,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/gordon-stevens-homecoming-lfr-1011","status":"active","on_sale":false,"created_at":"2011-01-02T13:35:35.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/stephens/Homecoming/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/stephens/Homecoming/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/stephens/Homecoming/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/stephens/Homecoming/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/stephens/Homecoming/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/stephens/Homecoming/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/stephens/Homecoming/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/stephens/Homecoming/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nHarold Stevens (bass); Tom Harrell (trumpet, flugelhorn); Mike Morris (saxophones); Rich Tumoy (piano); Buddy Barnhill (drums)","options":[{"id":10572663,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224975/-/gordon.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224975/-/gordon.jpg","width":600,"height":600}],"artists":[{"id":49813,"name":"Gordon Stevens","permalink":"gordon-stevens","url":"/artist/gordon-stevens"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084661,"name":"Potaje - Charanga Flamenca","permalink":"potaje-charanga-flamenca","position":33,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/potaje-charanga-flamenca","status":"active","on_sale":false,"created_at":"2011-01-02T14:08:12.000Z","description":"While the linguistic and cultural legacies left by Spain in Cuba may be fairly obvious, the musical one is perhaps less so. Many of the complex polyrhythmic musical elements that make Cuban music so beloved in the rest of the world stem from African elements imported by the Yoruba of West Africa, who were first brought there as slaves. But the musical bond linking Spain and Cuba is in fact a strong one, encompassing everything from the stringed instruments brought by the Spanish to the New World that evolved into the Cuban tres and other instruments, to the fact that both flamenco and the Cuban son are strongly organized in groups of 12 beats.\r\n\r\nPotaje, a Bay Area-based ensemble led by master flutist Chus Alonso, is hardly the first group to marry flamenco and Cuban music -- fusions of this sort have been around at least since flamenco guitarist Paco De Lucia and others began experimenting with salsa rhythms in the '70s. But the mix has surely never sounded as natural and inviting as it does on Potaje's breathtaking Charanga Flamenca. The beauty of Potaje -- which also includes violinist Tregar Otton, guitarist Jorge Liceaga, percussionist Sage Baggot, and bassist Steve Senft-Herrera -- isn't just the impressive musical facility provided by its members, though both Alonso and Liceaga in particular are capable of show-stopping theatrics. Rather, it's in the way the entire ensemble moves between styles with such fluidity that they make the difficult transition from flamenco to son or rumba sound like a natural progression.\r\n\r\nThe album starts off in a pure flamenco vein on \"Como El Humo,\" a thrilling bulerias that shows off the melodic blend of flute and violin to gorgeous effect. But things soon get a bit more multinational, and \"Tarareando\" finds the group dipping into rumba rhythms with its traditional flamenco instrumentation, and \"Migajas\" pastes melodies from artists like De Lucia, the Orquestra Aragon, and Spanish folk tunes over rhythms that move effortlessly through son, tangos, and flamenco. By the time \"Tertulia\" rolls around, with its seamless shift from flamenco to Afro-Cuban 6/8 rhythms and back again, the juxtaposition between musical styles seems like anything but, as the group makes the different rhythmic patterns sound like parts of the same cloth.\r\n\r\nAnd yet, while Charanga Flamenca may demonstrate beyond reproach the linkage between flamenco and Cuban music, it's anything but academic. Potaje (the name of a stew made with beans, vegetables, and meats) sounds instead like the work of a multinational chef who uses spices from different cultures to whip up his own irresistible dish.\r\n\r\n—SF Weekly","options":[{"id":10572787,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224447/-/potaje.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224447/-/potaje.jpg","width":600,"height":600}],"artists":[{"id":49853,"name":"Potaje","permalink":"potaje","url":"/artist/potaje"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084657,"name":"Pocketized - Oaktown Jazz Workshops","permalink":"pocketized-oaktown-jazz-workshops","position":34,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/pocketized-oaktown-jazz-workshops","status":"active","on_sale":false,"created_at":"2011-01-02T14:02:30.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/oaktown/Pocketized/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/oaktown/Pocketized/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/oaktown/Pocketized/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/oaktown/Pocketized/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/oaktown/Pocketized/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/oaktown/Pocketized/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/oaktown/Pocketized/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/oaktown/Pocketized/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nBased in Oakland and formed in 1994, Oaktown Jazz Workshops (OJW) celebrates jazz music as an American indigenous art form of profound artistic and cultural significance. A complex and enjoyable music as well as an important indicator of American history, jazz offers a rich legacy that has touched the lives of each generation and continues to be an important component of contemporary culture. Our purpose is to promote, preserve, and present this music so that all youth, and especially African American youth, develop a sense of ownership and pride in jazz music as a uniquely American cultural tradition.\r\n\r\nThe goal of OJW is to provide young musicians with focused opportunities to develop a new or deeper relationship with this rich medium of expression; both as skilled performers and as informed and involved listeners. Our original program creates a safe, structured environment in which young people with different levels of musical experience are able to come and be a part of a creative jazz ensemble under the guidance of professional master musicians. Through new initiatives, OJW continues to make jazz music accessible to Bay Area youth as our programs bring together young musicians from diverse backgrounds, joined by their common interest in jazz.","options":[{"id":10572783,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224471/-/pocketized.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224471/-/pocketized.jpg","width":600,"height":600}],"artists":[{"id":49851,"name":"Oaktown Jazz Workshops","permalink":"oaktown-jazz-workshops","url":"/artist/oaktown-jazz-workshops"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084647,"name":"Phil Ranelin - A Close Encounter of the Very Best Kind","permalink":"phil-ranelin-a-close-encounter-of-the-very-best-kind","position":35,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/phil-ranelin-a-close-encounter-of-the-very-best-kind","status":"active","on_sale":false,"created_at":"2011-01-02T13:59:40.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/ranelin/A%20Close%20Encounter%20Of%20The%20Very%20Best%20Kind/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/ranelin/A%20Close%20Encounter%20Of%20The%20Very%20Best%20Kind/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/ranelin/A%20Close%20Encounter%20Of%20The%20Very%20Best%20Kind/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/ranelin/A%20Close%20Encounter%20Of%20The%20Very%20Best%20Kind/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/ranelin/A%20Close%20Encounter%20Of%20The%20Very%20Best%20Kind/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/ranelin/A%20Close%20Encounter%20Of%20The%20Very%20Best%20Kind/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/ranelin/A%20Close%20Encounter%20Of%20The%20Very%20Best%20Kind/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/ranelin/A%20Close%20Encounter%20Of%20The%20Very%20Best%20Kind/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nTrombonist Phil Ranelin was one of the Detroit jazz scene's unsung heroes, releasing several excellent, politicized albums that blended post-Coltrane avant-garde jazz, post-B*****s Brew psychedelia, hard bop, funk, and African rhythms. Ranelin was born and raised in Indianapolis, and later moved to New York and then Detroit, where he started out as a session man for Motown artists like Stevie Wonder. In 1971, along with saxophonist Wendell Harrison, Ranelin co-founded a band, magazine, and record label conglomeration known as the Tribe, which used experimental jazz as a vehicle to raise African-American political consciousness. That year, Ranelin also issued his first album as a leader, Message From the Tribe. 1974's The Time Is Now! continued Ranelin's accessible avant leanings, but 1976's Vibes From the Tribe pushed more firmly into groovy jazz-funk territory. The Tribe organization folded in 1978, after which Ranelin played with Freddie Hubbard for several years. In 1986, Ranelin led a date for Rebirth titled Love Dream, and ten years later released the self-produced album A Close Encounter of the Very Best Kind — which featured his new Los Angeles-based sextet — on Lifeforce. Though Ranelin's albums didn't get much exposure outside of his home base, they found their way onto the acid jazz/rare-groove collector's market, creating an underground buzz around Ranelin's music. In 2001, Tortoise drummer John McEntire remixed and remastered The Time Is Now! and Vibes From the Tribe, which were reissued by the Hefty label. The following year, a full-fledged electronic Remixes collection was released.","options":[{"id":10572769,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224671/-/ranelin.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224671/-/ranelin.jpg","width":600,"height":600}],"artists":[{"id":49825,"name":"Phillip A. Ranelin","permalink":"phillip-a-ranelin","url":"/artist/phillip-a-ranelin"}],"categories":[]},{"id":3084639,"name":"Modesto Briseno - Dulcinea - LFJ 1042","permalink":"lfr-1042-dulcinea-by-modesto-briseno","position":36,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/lfr-1042-dulcinea-by-modesto-briseno","status":"active","on_sale":false,"created_at":"2011-01-02T13:55:51.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/briseno/Dulcinea/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/briseno/Dulcinea/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/briseno/Dulcinea/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/briseno/Dulcinea/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/briseno/Dulcinea/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/briseno/Dulcinea/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/briseno/Dulcinea/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/briseno/Dulcinea/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nLong, stretching notes on horn take Dolphin Dance to a new level of exploration—somber & thoughtful. Briseno uses a Harmon mute on Herbie Hancock’s classic, providing an extra layer of sound.\r\n\r\nComing back with \"Invitation\" gives a perky lift to this CD. Clark travels lithely across the keyboard, with a gentle bass backing by Zisman. Aiming for a fat sound was Briseno’s idea on Invitation--and, he succeeded nicely. Drummer, Tana, does a brief but brisk solo, keeping this tune up-tempo.\r\n\r\nClark’s artistry shows again on \"A Child Is Born,\" as he offers a soft accompaniment to Briseno’s muted horn. \"Rocinanate\" and \"Dulcinea\" show Briseno’s talent for layering tones. He shows the same devotion to creating music, as he shows for performing music. Done in 6/8, \"Dulcinea\" proves peppy and pure. The quartet show their ability to integrate melodies in the swaggering Bob Haggart tune, \"What’s New?\" \"Half Nelson\" brings back the perky tempo and showcases all players.\r\n\r\nThis album is more than piano bar music. It swings. It goes introspective. It allows for reminiscing. The Modesto Briseno Quartet flows smoothly, reaching new levels of sound--a nice presentation. Truly the fruit of legendary perfection, as the name implies.\r\n\r\nLife Force Jazz is a community-based program, bridging the gap between musicians and industry, allowing creative free expression of talents. ","options":[{"id":10572759,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226463/-/dulcinea.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226463/-/dulcinea.jpg","width":600,"height":600}],"artists":[{"id":49849,"name":"Modesto Briseno","permalink":"modesto-briseno","url":"/artist/modesto-briseno"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084591,"name":"Lee Venters - Vermillion Sands","permalink":"lee-venters-vermillion-sands","position":37,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/lee-venters-vermillion-sands","status":"active","on_sale":false,"created_at":"2011-01-02T13:42:12.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/venters/Vermillion%20Sands/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/venters/Vermillion%20Sands/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/venters/Vermillion%20Sands/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/venters/Vermillion%20Sands/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/venters/Vermillion%20Sands/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/venters/Vermillion%20Sands/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/venters/Vermillion%20Sands/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/venters/Vermillion%20Sands/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nDrummer, vocalist, multi-instrumentalist, composer, producer Lee Venters was born in Miami, Florida. A self taught instrumentalist, Lee started playing drums at the age of 11, and by the age 16 he was gigging professionally with musicians doubling his age and experience. After settling in Raleigh, North Carolina, Lee's earlier performing and experience included one of Raleigh's most noted bands featuring now Phillips recording artist (Steve Dobrogosz) and a stint in the Capitol City All-Stars, a big band comprised of the areas High Schools most accomplished musicians. This led to a performance for President Gerald Ford.\r\n\r\nLee's natural ability combined with disciplined practice found a home at Berklee College of Music in Boston from 1978-1981. Attending Berklee provided Lee with the opportunity to share his ideas and explore many styles with some of the world's finest players. Lee's technique and energetic drumming style was well received and allowed him the opportunity to play and perform with Donald Harrison, Dean Brown, Baron Brown, Kevin Eubanks, George Garzone, Steve Vai, Stuart Hamm, Victor Bailey, Jeff Andrews and Mike Stern to name a few.\r\n\r\nAfter leaving Berklee in 1981, Venters toured th US with an established 7 piece band out of Jacksonville, Florida. The band Florida was an extremely respected show band and relocated out of Atlantic City, New Jersey. The band toured through out most of the US, Saudi Arabia, and Aruba.\r\n\r\n\r\nIn 1987 Lee was signed by Blue Quail Records \"388 Marlborough Street\" which featured Kevin Eubanks, Victor Bailey and Dean Brown. 388 Marlborough Street was added to 256 stations nationwide and was number 12 on R&R (Radio and Records charting). 388 Marlborough Street was also featured on the David Sanborn syndicated radio show.\r\n\r\nAfter touring the East Coast in promotion of \"388 Marlborough Street\", Lee moved to Los Angeles in search of the right combination of musicians. Lee had the opportunity to share the stage with such musicians as: Multi-reeds national recording artists Eric Marienthal, Jeff Kashiwa, Guitarists Mike Lent (Jeffrey Osbourne) Bennett Brandeis, Jimmy Mahlis, Bassists Dave Carpenter Allan Holdsworth,Larry Carlton Melvin Davis (Lee Ritenhour),Jimmy Earl with (Chick Corea). Tom Moran with Tom Scott too many to list...\r\n\r\nLee had previously recorded two CDs with pianist and recording artist Ted Howe who resided in Atlanta. Lee started working extensively even before his furniture, drums and personal belongings had arrived from the West Coast. Gaining much exposure and popularity, Lee was asked to participate in the Vic Firth Drumstick and Mallets NEP program or (National Education Program).\r\n\r\nLee performed over 25 clinics at over 25 high schools, junior high schools and middle schools throughout the Atlanta metro and in the inner city and surrounding counties. This led to the opportunity to accept a position as a part time instructor at Georgia State University. He was considered an expert instructor in the areas of solo development, drum set improvisation, Latin, Brazilian drum set techniques.\r\n\r\nShortly after landing the teaching position, Lee was asked to join Aquarium Rescue Unit, a band that happened to be one of the hottest bands in the country.\r\n\r\nThe band was a blind date that all accomplished musicians often dreamed about. The band's tour schedule would then cover over 30 states and over 250 national dates across the US. August of 1996 after a grueling road schedule, Lee decided to leave the road to persue his teaching and start his family. ARU shared the stage with such acts as: Gov't Mule, Everything, Moon Boot Lover, Derek Trucks Band, Bruce Hornsby, Blues Traveler, Col. Bruce Hampton performed at two HORDE Festivals with Lenny Kravits, Black Crows, Natalie Merchant, Rusted Root members of Phish, and Taj Mahal.\r\n\r\nLee has recorded over two dozen national and regional Radio and Television sessions in Atlanta and was becoming a sought after session musician.\r\n\r\nWhile developing a strong reputation as one of the most versatile and most in demand drummers in Atlanta and a love of all music, Lee found himself performing nightly Brazillian, Cajun, straight ahead jazz, Cuban, big band, or virtually anything that was happening. He performed with artist Miquel Romero, a Cuban pianist, at the Atlanta Jazz Fest in 1998 and 2000, and many club dates and concerts with his own band and also performed with Tropicus 22, an authentic Brazilian 7 piece group\r\n\r\nLee has performed over 50 clinics for Sabian Cymbals, Vic Firth Sticks, Attack Heads and Gretsch Drums throughout the southeast and was featured in the Atlanta Drum Festival along with Gerry Brown, (Stanley Clarke, Lionel Richie, Stevie Wonder), Richie Morales, (Hal Galper, Brecker Brothers and Spyro Gyra).\r\n\r\nLee was a finalist and featured in Jazziz Magazine's composers competition \"Percussionist On Fire\",compilation of compositions from percussionists around the world. His composition Bahia was chosen from hundreds of other entries from around the world.","options":[{"id":10572693,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224407/-/leeventers_vermillion.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224407/-/leeventers_vermillion.jpg","width":600,"height":600}],"artists":[{"id":49845,"name":"Lee Venters","permalink":"lee-venters","url":"/artist/lee-venters"}],"categories":[]},{"id":3084579,"name":"Jesse Foster - People, Places and Songs","permalink":"jesse-foster-people-places-and-songs","position":38,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/jesse-foster-people-places-and-songs","status":"active","on_sale":false,"created_at":"2011-01-02T13:37:57.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/foster/PeoplePlacesSongs/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/foster/PeoplePlacesSongs/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/foster/PeoplePlacesSongs/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/foster/PeoplePlacesSongs/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/foster/PeoplePlacesSongs/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/foster/PeoplePlacesSongs/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/foster/PeoplePlacesSongs/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/foster/PeoplePlacesSongs/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\n\r\nAfter many years of honing his craft and teaching others, Jesse Foster has finally released the musical offering that those of us that know him have been waiting for.\r\n\r\nBorn in Bessimer, Alabama and raised in Cleveland Ohio, Jesse recognized his musical calling at an early age and pursued his own natural course of study, by receiving formal training and absorbing influences from other great artists.\r\n\r\nHe is a singer, songwriter and percussionist extraordinare, with an original composition and arranging style, which conveys deep and personal messages through songs crossing a wide range of musical genres.\r\n\r\nAlthough Jesse has worked with and been influenced by many renowned artists,he credits the body of works by master artists like Wes Montgomery,Marvin Gaye,John Coltrane,Smokey Robinson,David Ruffin,Nat\"King\"Cole and Miles Davis, for having a profound impact on his concepts,musical direction and career.\r\n\r\nIn the seventies Jesses travels brought him to San Francisco where for over thirty years now, his writing performing and teaching has received international acclaim and earned him a special place amongst the unsung heroes of the music scene.\r\n\r\nJesse views life as a series of segways, living moment to moment and song to song, never knowing what will happen, but possessing relentless drive and undying faith in his mission.","options":[{"id":10572681,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30315695/-/jessefoster.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30315695/-/jessefoster.jpg","width":600,"height":600}],"artists":[{"id":49843,"name":"Jesse Foster","permalink":"jesse-foster","url":"/artist/jesse-foster"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084533,"name":"Gail Dobson - Parallel Reflections - LFJ 1032","permalink":"gail-dobson-parallel-reflections","position":39,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/gail-dobson-parallel-reflections","status":"active","on_sale":false,"created_at":"2011-01-02T13:22:56.000Z","description":"A masterpiece of mood, poetry and song, Gail’s album is dedicated to her late husband, Smith Dobson.","options":[{"id":10572591,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30226023/-/gaildobson.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30226023/-/gaildobson.jpg","width":600,"height":600}],"artists":[{"id":49841,"name":"Gail Dobson","permalink":"gail-dobson","url":"/artist/gail-dobson"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084517,"name":"Frank Fontaine - Wisdom Rising","permalink":"frank-fontaine-wisdom-rising-lfr-1049","position":40,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/frank-fontaine-wisdom-rising-lfr-1049","status":"active","on_sale":false,"created_at":"2011-01-02T13:16:54.000Z","description":"It is quite fashionable these days for jazz enthusiasts to pose the question, is jazz dead, in much the way boxing fans muse about the imminent demise of their sport. This self-pitying form of navel gazing is possibly a reflection that many people who love jazz have forced themselves always to believe that this music is in some state of crisis or in some form of survival mode. If the music is seemingly on life support, it makes their love of the music seem more like true commitment, to love something that no one appreciates.\r\n\r\nBut when one enters any Starbucks or any Ann Taylor boutique or sees a television commercial for Lexus or BMW automobiles, it is hard to imagine that jazz is anything like dead. Indeed, it seems in America that the voice of Billie Holiday or the horn of Miles Davis is used to sell virtually anything upscale. Jazz is the soundtrack for the appearance of sophistication. (Considering jazz’s decidedly disreputable social origins, this turnabout seems one of the great American upward mobility stories.) Of course, as saxophonist Frank G. Fontaine points out as a “realist,” one thinks about ‘slumping record sales” and “the Chapter 11 of Tower Records and Sound Warehouse” and wonder if a market or an audience exists at all in America for serious music-making of the sort that jazz is, where excellent musicians really take chances to reach new depths in exploring what our lives mean. It is perhaps the problem with jazz today that it exists for so many as an emblem of taste, as a type of background music for the upper-middle class, but not as an emotionally meaningful experience of artistic expression. Listening to jazz is now meant to decorate or ornament your life; it is not meant to grab you by the throat and change your life. It is a sign of how diminished and impoverished our culture has become over the last fifty years that all we wish for show and distraction, sensation and titillation.\r\n\r\nThis sad state of affairs in our nation’s cultural life makes a CD like Frank Fontaine’s Wisdom Rising not only something of a revelation but also something heroic, simply because it so insists on being listened to seriously and because it is so inspiring in that insistence. Here is music that truly believes in itself. It was recorded in one seven-hour session. “No overdubs. No fixes,” Frank maintains. In other words, inspired music played by inspired musicians. Here is music that is so alive that a listener is reminded of the glorious challenge of being alive which is what any art worth its salt is supposed to do.\r\n\r\nFrank is thirty years old, is the offspring of a Mexican mother and a Creole father, Frank Sr., who worked for Duke Ellington for over ten years and introduced his son to jazz greats like trumpeters Sweets Edison and Freddie Hubbard and pianist Oscar Peterson, and to an intuitive understanding of jazz as something more than a form of mechanics but rather a sense of awareness. He has overcome his share of personal demons to arrive at the point where he could create a CD like Wisdom Rising, consisting of original compositions by a man who is assured of and comfortable with the things he wants to do artistically, who knows why he wants to do what he finds himself doing. It is mature music, songs of fierce tears and sweet fatalism.\r\n\r\nFrank, who has had little formal musical training, comes to this project with the passion and daring of the autodidact, the great American tinker, understanding that small variations can create great individuality and that novelty is not the heart and soul of originality. There are a great number of references in his playing: one hears echoes of Sonny Rollins in track # 4 “Interlude,” and of John Coltrane in Track # 7 “Interlude,” the latter which Frank admits was prompted by his love of Coltrane’s album of duets with drummer Rashid Ali called “Interstellar Space.” “You, Me, and the Bean,” an absolutely wonderful tune with a touch of mystery in the sax-stated melody and warmth and color in the vibes voicings, conjures up the great Wayne Shorter. And the more boppish and blues-oriented “Urban Aristocracy,” “Wisdom Rising,” with its tricky meter, “Jalalabad News,” another tune I especially like, suggest Joe Henderson at moments. But these references tie this music to the deep traditions of post-World War II jazz, particularly to the glory days of Blue Note Records in the 1960s, without trapping the music within a particular milieu. Frank evokes these giants of the jazz saxophone but in the end does not sound like anyone but himself. That is to say, no one could imagine anyone else but Frank playing quite this music in quite this same way. The music does not copy Blue Note Records as much as reinvented it; while listening to this music, no one would ever mistake for music made forty years ago. There are elements of Latin/Cuban music that tinges many of the pieces here but in ways that are integral to the compositions, not exotic added effects. This is jazz music, forged in the crucible of a stern, demanding heritage, that is meant to be express what we are and how we are living now and not meant as some homage to the past.\r\n\r\nThere are so many remarkable moments of music making on this CD: the guitar playing Ronald Muldrow on the opening lilting blues track “Flowers for Rose.” “Ronald is not a very ‘flashy’ player but I really love where he puts his notes,” Frank observes. This is Muldrow’s last recording. He died shortly after from a massive heart attack. So, “Wisdom Rising” serves, in some sense, as an informal memorial. Other moments: the strong drumming of Smitty Smith on all the tracks and his fine solo on “Urban Aristocracy;” the fleet vibes playing of Nick Mancini on “You, Me, and the Bean” and “Jalalabad News;” the bright piano solo by John Beasley on “Eleventh Hour Blues.” And Frank’s playing is compelling throughout. He is not afraid to push the boundaries in his solos, yet his playing always remains strongly grounded in the blues and always bounded by a deeply-felt, moving lyricism that instantly communicates with the audience. This is richly played, virtuosic professional jazz but highly accessible music.\r\n\r\nIs jazz dead? Frank answered the question this way when I posed it to him: “This morning I was jogging to the gym that I play basketball at. I had my Ipod blasting John Coltrane’s Coltrane Jazz and I heard something that I’ve NEVER heard before. I know Coltrane Jazz inside and out… Does this mean that I was remiss in my previous listening? NO! It means that this music is ‘LIVING.’ Jazz will never stop speaking to us.”\r\nWith CDs like Wisdom Rising, I am glad to say that reports of the death of jazz have been greatly exaggerated. Jazz ain’t dead, to paraphrase a headline from Billboard a few decades ago, it ain’t even sick.\r\n\r\nDr. Gerald Early\r\nWashington University in St. Louis","options":[{"id":10572567,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224911/-/frankfontaine.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224911/-/frankfontaine.jpg","width":600,"height":600}],"artists":[{"id":49811,"name":"Frank Fontaine","permalink":"frank-fontaine","url":"/artist/frank-fontaine"}],"categories":[]},{"id":3084499,"name":"Devon Hoff - Memory From Below","permalink":"devon-hoff-memory-from-below","position":41,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/devon-hoff-memory-from-below","status":"active","on_sale":false,"created_at":"2011-01-02T13:12:55.000Z","description":"Music is a fleeting, passive thing. It has no bones of its own, no will and no obligation. It is lazy and waits all day for someone to come and play with it.","options":[{"id":10572549,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224895/-/devonhoff.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224895/-/devonhoff.jpg","width":600,"height":600}],"artists":[{"id":49839,"name":"Devon Hoff","permalink":"devon-hoff","url":"/artist/devon-hoff"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3084457,"name":"Christopher Lowell Clark - The Swooper","permalink":"christopher-lowell-clark-the-swooper","position":42,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/christopher-lowell-clark-the-swooper","status":"active","on_sale":false,"created_at":"2011-01-02T13:03:21.000Z","description":"<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://fpdownload.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=8,0,0,0\" width=\"133\" height=\"31\" id=\"wimpy\" align=\"center\">\r\n<param name=\"allowScriptAccess\" value=\"always\" />\r\n<param name=\"movie\" value=\"http://dawanmuhammad.com/mp3/clarke/The%20Swooper/wimpy.swf\" />\r\n<param name=\"loop\" value=\"false\" />\r\n<param name=\"menu\" value=\"false\" />\r\n<param name=\"quality\" value=\"high\" />\r\n<param name=\"scale\" value=\"noscale\" />\r\n<param name=\"salign\" value=\"lt\" />\r\n<param name=\"bgcolor\" value=\"#FFFFFF\" />\r\n<param name=\"flashvars\" value=\"wimpyApp=http://dawanmuhammad.com/mp3/clarke/The%20Swooper/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/clarke/The%20Swooper/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/clarke/The%20Swooper/skins/skin_micro.xml\" />\r\n<param name=\"wmode\" value=\"opaque\" />\r\n<embed src=\"http://dawanmuhammad.com/mp3/clarke/The%20Swooper/wimpy.swf\" flashvars=\"wimpyApp=http://dawanmuhammad.com/mp3/clarke/The%20Swooper/wimpy.php&wimpySkin=http://dawanmuhammad.com/mp3/clarke/The%20Swooper/skins/skin_micro.xml&startPlayingOnload=yes&wimpySkin=http://dawanmuhammad.com/mp3/clarke/The%20Swooper/skins/skin_micro.xml\" loop=\"false\" wmode=\"opaque\" menu=\"false\" quality=\"high\" width=\"133\" height=\"31\" scale=\"noscale\" salign=\"lt\" name=\"wimpy\" align=\"center\" bgcolor=\"#FFFFFF\" allowScriptAccess=\"always\" allowFullScreen=\"true\" type=\"application/x-shockwave-flash\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" />\r\n</object>\r\n\r\nThe Swooper 7:49\r\nKooty Bootys Blues For Kat 6:56\r\nAll Alone 6:22\r\nBeautiful Flower 7:15\r\nLike Someone in Love 8:10\r\nMeekas Lament 6:59\r\nIndonesia (The Hip-hop Joint) 6:06\r\nUm-foo-foo 7:08\r\nLil' Boom 5:42\r\nSeptember in the Rain 5:43","options":[{"id":10572507,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30315511/-/chrislowellclark.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30315511/-/chrislowellclark.jpg","width":600,"height":600}],"artists":[{"id":49835,"name":"Christopher Lowell Clark","permalink":"christopher-lowell-clark","url":"/artist/christopher-lowell-clark"}],"categories":[]},{"id":3083981,"name":"Blowout - The Supporting Theory","permalink":"blowout","position":43,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/blowout","status":"active","on_sale":false,"created_at":"2011-01-02T08:36:37.000Z","description":"Blowout is a musical collective concentrating on composition, improvisation, and communication in a jazz setting. \r\n\r\nPRESS & REVIEWS:\r\n\r\n“Blowout plays a rousing, raucous brand of post-Bop music, combining the arranging sensibilities and layered tempos of vintage Mingus with a quirky structuralist sensibility that recalls Phillip Johnston, and some occasional rock. I love the horn polyphony! Many of the tunes feature a kind of continual weave between Ewing's excellently portly trombone (check him out on \"Solid Brass Numchuk\") and the sinewy saxophones (listen to Bennett punish his bari on \"Duplicity\"), with Moran the comper/mischief-maker sprinting ahead of Germain and Lewis. Make no mistake, this is Jazz, not Jazz-Rock. Moran is an extremely tasteful electric player, who simply knows how to use the textures (and the history) of his instrument (including that extra low string for some serious rumble). He also displays a nimble swinging technique on his own \"Ring around the Collar\". But for all the tightly woven charts and nimble swing, the group sure does have range: check out the eeire atmospherics on \"Tin Foil Is Not Soft\", the heavy funking on \"Nothing But Trouble\", the sludgy menace of \"Deuguelasse\", or the noir-ish \"Baby Be Mine\". All in all, this is a nice surprising disc: a band with real personality, playing music with warmth and heart and - what's so rare these days- humor!” — Cadence Magazine\r\n\r\n“All of the musicians… distinguish themselves not so much for what they contribute as what they leave out, restraining from making the pointless squeal or pseudo-virtuosic wail that characterizes so many first offerings in the modern-jazz world. …If this young band keeps going, the blowing is only going to get more ‘out’ — in the most complimentary sense of the word.” — SF Weekly\r\n\r\n“Some music is so hip, you know, upon first hearing, there is no way it will ever find a large drawing. Like fine wine made in small reserves, it is to be savored when experienced. This is as candid a statement as can be made regarding the excellent compositional abilities found within the six-member band Blowout.\r\nThe compositions are all clever and sharp, witty and urbane, but most especially fun. All of the compositions emphasize a true collective sound with no one instrumental texture predominating.\r\nThe music on The Supporting Theory isn't what you might expect, and that's due to the way Moran handles his instrument. For the most part he plays single note lines which allow the music to have an airy space and freedom lacking in most jazz - think Kenny Wheeler's Angel Song ensemble.” — Jazz Review.com\r\n\r\n“Their music is very much a modern day jazz fusion which has taken influences from World, Contemporary, Middle Eastern and Avant Guard to offer a blend of excitement and expression which is what jazz is all about.\r\nThis is music to wake up and listen to, and an album full of energy, musicianship and composition and an album which has superb arrangements and will appeal to the jazz fan who wants a menu of steak and chips as opposed to a watered down consumme soup.” — EuroClubDeJazz.com ","options":[{"id":10570901,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224927/-/blowout.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224927/-/blowout.jpg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/29907971/-/Blowout6-Color.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/29907971/-/Blowout6-Color.jpg","width":661,"height":1000},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/29907979/-/Blowout1-BW.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/29907979/-/Blowout1-BW.jpg","width":1000,"height":655}],"artists":[{"id":49831,"name":"Blowout","permalink":"blowout","url":"/artist/blowout"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]},{"id":3083967,"name":"The Big Belly Blues Band","permalink":"the-big-belly-blues-band","position":44,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/the-big-belly-blues-band","status":"active","on_sale":false,"created_at":"2011-01-02T08:20:37.000Z","description":"The Big Belly Blues Band originated from a blues co-written by songwriter/drummer Paul Smith and Jazz Diva Faye Carol called the \"Big Belly Blues\" in Oakland, Ca.\r\n\r\n, 2002. Guys from the local jam session at the Bluesville Jazz Club on Sunday's decided to form a Blues Band to honor bay area icon's ailing pianist Ed Kelly and vocalist George Hubbard. A retired bay area teacher, bassist and trombonist Harley White was brought in to pen arrangements along with band trumpeter director Kalill Shaeed of the Oaktown Youth Jazz Group. Other bay area heavy weights joined the band such as Larry Vann on drums, Charley Spikes on vocals and guitar, and Ron Belcher on electric bass. Assistiing on piano with Ed Kelly was the young and budding Kevin Stewart.\r\n\r\nThe recording also includes Harley White on trombone, tuba and bowed bass, along with conga/harmonica player Richard Meyers, Danny Armstrong on the trombone solos. Over a 15 month period of weekly rehearsals, a female vocal group called the \"belly buttons\" featured Kate Shaheed, Judith Harris-Coleman,Carla Careen, Aletha Archie; and the great Fred Hughes on background vocals. A local rapper and newsman joined ...joined in on \"Good Thang\" and gave us some current sounds.\r\n\r\nWonderful alto saxophonist Joseph Thornton took over our logo, website and booking and away we went on to many, many dates around the Bay Area for about 3 years culminating at the re-opening of the historic \"Sweets Ballroom\" in downtown Oakland in 2004. The late Ed Kelly and George Hubbard live on in the Big Belly Blues Band!\r\n\r\nA historic and original band that preserves East Bay music history. Subsequent members since the recording include:saxophonist Richard Howell, pianist Glenn Pearson, bassist Tony Sanders,and many others.","options":[{"id":10570879,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30224703/-/bigbelly.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30224703/-/bigbelly.jpg","width":600,"height":600}],"artists":[{"id":49821,"name":"Big Belly Blues Band","permalink":"big-belly-blues-band","url":"/artist/big-belly-blues-band"}],"categories":[{"id":1791131,"name":"Jazz Releases","permalink":"jazz-releases","url":"/category/jazz-releases"}]}]