[{"id":7486997,"name":"The Heinous Collection V1: False Shuffles and Cuts","permalink":"heinous-false-shuffles-and-cuts","position":1,"price":34.99,"default_price":34.99,"tax":0.0,"url":"/product/heinous-false-shuffles-and-cuts","status":"active","on_sale":false,"created_at":"2012-10-08T23:21:36.000Z","description":"<iframe width=\"375\" height=\"211\" src=\"//www.youtube.com/embed/ExdAtkFWq3E\" frameborder=\"0\" allowfullscreen></iframe><br><br><br>\r\n\r\n<a href=\"http://www.karlhein.com/cart\"><B>ADD TO CART</B></a>\r\n\r\n<i>\"The natural appearance of your <b>Heinstein Shuffle</b> is breathtaking!\"</i>- <b>Richard Kaufman</b> \r\n\r\n<i>\"In Karl's hands, this is the most deceptive in-hands false riffle I have witnessed in the 30 years I've been involved in card magic.\"</>  - <b>Paul Cummins</b> \r\n\r\n<b><u>THE HEINOUS COLLECTION VOLUME 1</b></u>\r\nThis DVD contains the wickedly deceptive false shuffles and cuts that Karl Hein uses throughout his professional performances.  V1 includes 10 false shuffles & cuts, varying in degree of difficulty from beginner to advanced.  All video has detailed and easy to follow instructions with close-up multi angle views of the moves and finger positions.  All of these false shuffles and cuts can be done in the hands without the need of a table.  You will learn how to do false dovetail shuffles with a bridge, overhand shuffles, one-handed shuffles and flourish cuts.   \r\n\r\n1.   <b>Heinous Shuffle</b> - Simulates a dovetail shuffle with a bridge that is                   ideal for strolling cocktail hour environments.\r\n\r\n2.   <b>Heinstein Shuffle </b>- Considered by many top card men to be the best and only in the hands false shuffle that you need.  \r\n\r\n3.   <b>Truffle Shuffle 2.0 </b>- Karl's variation of Derek Delgaudio's Truffle Shuffle that utilizes a deceptive new technique. \r\n\r\n4.   <b>False Overhand</b> - A relatively easy false version of the shuffle commonly used in home card games.  \r\n\r\n5.   <b>Lavand2 Shuffle</b> - Simultaneous one handed false bridge shuffles inspired by Rene Lavand.\r\n\r\n6.   <b>Transformer Cut</b> - A five packet flourish cut that has many applications and really looks like it mixes up the packets.\r\n\r\n7.   <b>Swing Kids Cut & Production</b> - A fast and flourish cut with a flashy production and one handed spin out.\r\n\r\n8.   <b>Equilateral Cut & Production </b>- A unique flourish cut with a design and an instant flash production of a selected card.\r\n\r\n9.   <b>Doublemint Cut</b> - Combines two easy one handed cuts in a very deceptive way.  \r\n\r\n10. <b>Charlier Shuffle</b> - A sloppy version of a classic way of falsely mixing cards in a very casual but extremely convincing way.","options":[{"id":23663579,"name":"Default","price":34.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124091205/-/Heinous-1-Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124091205/-/Heinous-1-Front.jpg","width":410,"height":419},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124091280/-/Heinous-1-Back.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124091280/-/Heinous-1-Back.jpg","width":410,"height":422}],"artists":[],"categories":[{"id":3510507,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]},{"id":12894069,"name":"The Heinous Collection V2","permalink":"heinous-v2-routines-utilizing-false-shuffles","position":2,"price":34.99,"default_price":34.99,"tax":0.0,"url":"/product/heinous-v2-routines-utilizing-false-shuffles","status":"active","on_sale":false,"created_at":"2013-08-10T22:09:35.000Z","description":"<iframe width=\"375\" height=\"211\" src=\"//www.youtube.com/embed/mXYqNzoOyfM\" frameborder=\"0\" allowfullscreen></iframe><br><br><br>\r\n\r\n<i>“Karl is an entertaining, accomplished and experienced worker.  Just one of his routines has more magic than some acts.”  </i>- <b>Bob Sheets</b>\r\n\r\n<i>\"How did I not think of GIVE ME FIVE!\"<i> - <b>Chad Long</b>\r\n\r\n\r\n\r\n<u><b>THE HEINOUS COLLECTION VOLUME 2</b></u>\r\nThis DVD contains 7 of Karl Hein's original and commercial routines that require the use of false shuffles and/or cuts.  All of these routines are incredibly strong and many are reputation makers.  While a few require that you learn specific false shuffles from the HEINOUS V1 DVD, most of the routines can be done with any false shuffles or cuts that you might already know.  \r\n  \r\n1. <b>Square Deal</b> - A unique version of the Magic Square that is easy to do but gives the appearance of incredible technical skill and brain power.\r\n  \r\n2.<b> Jack Spade</b> - A full deck story routine full of funny moments that always leave a memorable impression.  \r\n\r\n3. <b>Prophecy Location </b>- A spectator finds a selected card under seemingly impossible conditions.\r\n \r\n4.<b> Equilateral Production </b>- A captivating cut with an incredible production that always gets audible audience reactions.  \r\n\r\n5. <b>Transformer Triumph</b> - Karl's version of the classic Dai Vernon effect with few kickers that add to the effect instead of taking away from it.  \r\n\r\n6. <b>Every Card, Every Number, Every TIME </b>- A combination of impressive sleight of hand and an improbable prediction reminiscent of ACAAN.  \r\n\r\n<b>Bonus Effect: Give Me Five </b>- A very quick magical gag that you will use all the time!","options":[{"id":41112864,"name":"Default","price":34.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124092885/-/Heinous-2-Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124092885/-/Heinous-2-Front.jpg","width":410,"height":422},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124092888/-/Heinous-2-Back.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124092888/-/Heinous-2-Back.jpg","width":410,"height":422}],"artists":[],"categories":[{"id":3510507,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]},{"id":12894105,"name":"The Heinous Collection V3","permalink":"heinous-v3-routines-for-multiple-spectators","position":3,"price":34.99,"default_price":34.99,"tax":0.0,"url":"/product/heinous-v3-routines-for-multiple-spectators","status":"active","on_sale":false,"created_at":"2013-08-10T22:12:37.000Z","description":"<iframe width=\"375\" height=\"211\" src=\"//www.youtube.com/embed/so__llqBNxk\" frameborder=\"0\" allowfullscreen></iframe><br><br><br>\r\n\r\n<i>“Of all the new faces I’ve met in the past 10 years, Karl stands out as being one of the few magicians that I just know will be a huge success.  It is rare for a magician to not only understand technique, but also entertainment and business.  I feel comfortable booking Karl anytime and anywhere.” </i><b>– Bill Malone</b>\r\n\r\n<i> \"I love this DVD! I remember the first time you FRIED me with Grandmother's BLT over 10 years ago and I have been doing it ever since.  Breaking the Second Rule is simply brilliant and such a practical way to switch a deck. I'm going to start working on Sublime as I just started doing my multiple selection routine again…I LOVE ‘the moment’ where the knife comes out of the box! Also, I REALLY like your ‘thoughts’ on the psychotic prediction…this is something that I WILL start doing immediately…\"<i> <b>Cody Fisher</b>\r\n\r\n<b><u>THE HEINOUS COLLECTION VOLUME 3</b></u>\r\n\r\nThis DVD contains several of Karl Hein's signature multiple selection effects with a few bonuses thrown in.  These multiple selection routines involve 3-4 spectator's at a time in an engaging and fun way.  All of them have multiple moments of magic for a layered effect that will leave a lasting impression on your audiences.    \r\n\r\n1. <b>Grandmother's BLT</b> - A 3 phase sandwich effect with an unexpected ending that will give even the most experienced magician \"that moment\".\r\n\r\n2. <b>Collecting Camaro</b> - A combination of the \"Collectors\" and \"Triumph\" effects that is a great follow-up to any 4 Ace routine.  \r\n\r\n3. <b>Breaking the 2nd Rule </b>- A repeat card under the box routine with 3 spectators that is a great lesson in misdirection and routining.  \r\n\r\n4. <b>Sublime </b>- Karl's favorite ending to any multiple selection routine that is a reputation maker. Includes all the tips that make it practical to do.  \r\n\r\n5. <b>Hat Trick</b> - The performer uses his hat or a borrowed hat to find 3 selections and produce a bottle of your choosing.  \r\n\r\n<b>Bonus Effect:</b> Psychotic Prediction - This is the routine that Karl didn't want to give away.  3 or 4 named cards appear in an impossible location.\r\n\r\n<b>Bonus Effect: Sponge Ball Prediction</b> - A really great way to end just about any sponge ball routine!","options":[{"id":41112948,"name":"Default","price":34.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124092999/-/Heinous-3-Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124092999/-/Heinous-3-Front.jpg","width":410,"height":415},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124093017/-/Heinous-3-Back.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124093017/-/Heinous-3-Back.jpg","width":410,"height":426}],"artists":[],"categories":[{"id":3510507,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]},{"id":7486979,"name":"Heinstein's Dream","permalink":"heinstein-s-dream","position":4,"price":29.99,"default_price":29.99,"tax":0.0,"url":"/product/heinstein-s-dream","status":"active","on_sale":false,"created_at":"2012-10-08T23:19:56.000Z","description":"<iframe width=\"375\" height=\"281\" src=\"//www.youtube.com/embed/BxS8e56LjRE\" frameborder=\"0\" allowfullscreen></iframe><br><br><br>\r\n\r\n<i>\"Heinstein’s Dream is without a doubt the best torn and restored card I have seen.  It’s a real workable item!\"<i><b>Bill Malone</b>\r\n\r\n<i>“I have had this for quite a while now and can HIGHLY recommend it to anyone who want to add a T&R card routine to their REAL WORLD show.  Of all the versions that I have examined over the years, Heinsteins Dream is the one that I currently use strolling/stand up.  It looks very clean and is relatively easy to do!” <i><b> Cody Fisher</b>\r\n\r\n<i>“Heinstein's Dream is strong, visual magic that is practical and performable.  If you are looking for a real world torn and restored card effect Heinsteins Dream is the answer.\" <i><b>Matthew Furman - Professional Magician</b>\r\n\r\n<i>\"Heinstein's Dream blew me away the first time I saw it. It looks like real magic. The explanations are clear and easy to follow with no details left out. By far my favorite Torn and Restored card effect!\" <i><b> Ian Pidgeon </b>\r\n\r\n<u><b>HEINSTEIN'S DREAM</u></b>\r\n\r\n<b>Heinstein's Dream</b> is a clean, practical, commercial and easy to perform version of the Torn and Restored Card.\r\n\r\nFine tuned after more than a decade of performances, creator Karl Hein has developed a diabolical method for this classic effect. Heinstein's Dream allows you to adapt the same setup to perform 3 versions for maximum versatility: An instant flash restoration at the performer's fingertips, a powerful restoration in the spectator's hand and a visual piece by piece restoration. \r\n\r\nIf you've been searching for a solution to this plot that is as practical as it is deceptive- look no further. Heinstein's Dream delivers! ","options":[{"id":23663525,"name":"Default","price":29.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124093251/-/HSD-Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124093251/-/HSD-Front.jpg","width":410,"height":423},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124093494/-/HSD-Back.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124093494/-/HSD-Back.jpg","width":410,"height":426}],"artists":[],"categories":[{"id":3510507,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]},{"id":12893838,"name":"Hein's Catch Up","permalink":"hein-s-catch-up","position":5,"price":29.99,"default_price":29.99,"tax":0.0,"url":"/product/hein-s-catch-up","status":"active","on_sale":false,"created_at":"2013-08-10T21:52:37.000Z","description":"<iframe width=\"375\" height=\"211\" src=\"//www.youtube.com/embed/yyC3zXqTX38\" frameborder=\"0\" allowfullscreen></iframe><br><br><br>\r\n\r\n<i>\"Hein's Catch Up is simply brilliant! It's hard to believe that I would even consider a new twist to a routine that I have been doing for so many years but I love it! The production of the coins is fabulous and the explanations are concise, to the point and easily understood.    I especially like that it all happens in the open without pockets.  I have to play with this!\"<i/> - <b>Doc Eason</b>\r\n\r\n<i>\"A brilliant approach to a classic effect! The subtle lighting effects on your Hein's Catch Up  and Heinstein's Dream make them VERY easy to following along and learn.  ABSOLUTELY FANTASTIC... Honestly!\" </i> -<b>Cody Fisher</b>\r\n\r\n<i>\"Wow...I didn't think I would ever try another approach but I want to work with a couple of the ideas in your routine.  Thanks for sharing!\" </i> - <b>J.C. Wagner</b>\r\n\r\n<i>“We are talking about an in the hands, no table, highly visual coin routine with loads of audience interaction.  I highly recommend this DVD.  Definitely worth every single penny.  If you are into sleights you will love it.  If not, you will love how the coins do all the work for you.” </i> - <b>Jeremy Tan - Singapore’s Favorite Magician</b>\r\n\r\n<b><u>HEIN'S CATCH UP</b></u>\r\n\r\n<b>\"Hein's Catch Up\"</b> is a 5 phase coin routine will devastate your audiences. Karl's unique in the hands approach to the traditional <b>Copper/Silver/Brass Gimmick</b> puts you so far ahead of your audience that they will never be able to \"catch up\".  \r\n\r\nThe DVD also includes a <b>BONUS </b>one coin routine with a surprising Extra Large Jumbo Coin Production that will destroy your audiences in close-up environments.  \r\n\r\n<b>**Hein's Catch-Up requires the use of a Copper/Silver/Brass Gimmick**\r\n***Copper/Silver/Brass Gimmick is NOT included with this DVD.***</b>","options":[{"id":41112177,"name":"Default","price":29.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124093053/-/Catch-Up-Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124093053/-/Catch-Up-Front.jpg","width":410,"height":419},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124093062/-/Catch-Up-Back.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124093062/-/Catch-Up-Back.jpg","width":410,"height":426}],"artists":[],"categories":[{"id":3510507,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]},{"id":7486987,"name":"Heinsight","permalink":"heinsight","position":6,"price":29.99,"default_price":29.99,"tax":0.0,"url":"/product/heinsight","status":"active","on_sale":false,"created_at":"2012-10-08T23:20:24.000Z","description":"<iframe width=\"375\" height=\"211\" src=\"//www.youtube.com/embed/mc4oUVe7ElE\" frameborder=\"0\" allowfullscreen></iframe> <br><br><br>\r\n\r\n<i>\"I love performing Heinsight - IT KILLS!\"</i> - <b>Cyril Takayama</b>\r\n\r\n<i>\"It's not often that I see someone else's routine and immediately know that I want to add it to my professional repertoire!\" </i>- <b>Cosmo Solano</b>\r\n\r\n<i>\"Heinsight has quickly become one of my favorite close-up effects!  It's impact on laymen is so much stronger than I expected it to be when I first came up with the idea.  Do yourself a favor and give it a try.\"</i> - <b>Karl Hein</b>\r\n\r\n<u><b>HEINSIGHT - Karl Hein and Rich Aviles</b></u>\r\n\r\nDo you want to make your audience question their own memory?  Heinsight strikes twice! It's an open prediction effect with an impossible transformation and a kicker ending. Heinsight is easy to perform and requires little to no sleight of hand.  After the effect is finished, everything is examinable and you can quickly reset for another performance.  If you perform Heinsight, you will get incredible and memorable reactions!\r\n\r\n<b>The Effect:</b> The performer shows a prediction written on the card box flap that says <i>\"You Will Choose The Joker\".</i>  When the audience member chooses a card, it is not the Joker, but when they look at the flap again the prediction has changed to their chosen card.  For the kicker ending, all the remaining cards in the deck are shown to be Jokers!\r\n\r\n**HEINSIGHT includes an ALL JOKER DECK, prepared MEMORY FLAP GIMMICK (Rich Aviles), and INSTRUCTIONAL DVD**\r\n\r\n<b>BONUS ROUTINES:\r\n1. That Would Be a Freaking Miracle (Hein)\r\n2. eBay Scam (Aviles) </b>\r\n\r\n**Easy To Do**\r\n**Resets Quickly**","options":[{"id":23663537,"name":"Default","price":29.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":10.99,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124094469/-/Heinsight.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124094469/-/Heinsight.jpg","width":410,"height":410}],"artists":[],"categories":[{"id":3510507,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]},{"id":6821061,"name":"Heiny 500","permalink":"heiny-500","position":7,"price":29.99,"default_price":29.99,"tax":0.0,"url":"/product/heiny-500","status":"active","on_sale":false,"created_at":"2012-07-29T08:44:29.000Z","description":"<iframe width=\"375\" height=\"281\" src=\"http://www.youtube.com/embed/HtON3ova_5U?rel=0\" frameborder=\"0\" allowfullscreen></iframe><br><br><br>\r\n\r\n<i>“Heiny 500 is the best #*%@! money effect I have ever seen!”</i> \r\n<b>– Chris Kenner</b>\r\n<i>\"Who introduced Karl to Harry Potter? This effect is REAL magic!\"</i> - <b>Daniel Garcia</b>\r\n<i>\"Karl made a good trick into an amazing one! The difference is now I use it all the time.\"</i>          \r\n- <b>Bob Sheets</b>\r\n<i>\"This is the best handling of Pat Page's Easy Money anyone has come up with and I've seen them all.  It's better than Hundy 500, Slow Burn, Extreme Burn, Foreign Exchange, 3-D Cash or any of the others.\"</i> - <b>John Lovick</b>\r\n\r\n<u><b>HEINY 500</u></b>\r\n\r\n<b>The Effect:</b>\r\nYou count out five one dollar bills and they instantly turn into five one hundred dollar bills.  \r\n\r\nHeiny 500 can be performed under just about any conditions, even when completely surrounded.  Turning $1 Bills into $100 Bills is arguably one of the best close-up effects you can do and Heiny 500 is one of the cleanest, visual and most thought out version of the Pat Page effect that is available.  You will get HUGE reactions!","options":[{"id":21644475,"name":"Default","price":29.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124094736/-/Heiny-500-Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124094736/-/Heiny-500-Front.jpg","width":410,"height":410},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124094745/-/Heiny-500-Back.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124094745/-/Heiny-500-Back.jpg","width":410,"height":410}],"artists":[],"categories":[{"id":3510507,"name":"DVDs","permalink":"dvds","url":"/category/dvds"}]}]