[{"id":15529938,"name":"Rokwell&Groom 'New Parts'","permalink":"rokwell-groom-new-parts","position":1,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/rokwell-groom-new-parts","status":"active","on_sale":false,"created_at":"2013-12-13T02:58:01.000Z","description":"Rokwell & Groom's album \"New Parts\" is a ethereal journey through worldly rhythms, hazy synths and vocals that float on a sea of reverb. Haunting yet uplifting simultaneously, it's an engaging debut that belies its near-accidental inception.\r\n\r\nVocalist Felicity Groom and producer/multi-instrumentalist Diger Rokwell began to work together after it was suggested they collaborate for a one-off gig - Cut & Paste Collaborations. Deciding to create new material, rather than just mash together their respective musical worlds, the duo exchanged files and ideas via the internet, building a cohesive set for the night, which was all but completed before they had even met. They received such an enthusiastic response, that the one-night-only performance evolved into a fully fledged creative project.\r\n\r\nWith both artists being WAMI award winners in their respective fields, Groom's success with her previous album Gossamer, and Rokwell's extensive DIY beat making catalogue, \"New Parts\" is an intricately balanced production. On the opening track \"Impossible Alps\" vocals drift effortlessly over the top of a casual rhythm, while synth and guitar lines swoop in to add density, creating a kind of ambience you can get lost in.\r\n\r\nWhile this otherworldly sensation continues through the album, the next track \"New Parts\" ups the ante, stretching tones and esoteric transmissions over a steadily thumping drum pattern. Despite the mystical sensation and subtle tension, the album is never really dark. It's more smokey, with frequent pulses of strange coloured lights glowing through, diffused by the haze.\r\n\r\nThe tracks \"Old Town\" and \"Little Lions\" hark back to elements of Rokwell's \"Beat Tourism\" releases, referencing traditional hip hop sounds but shaping them into forms unique to this collaboration. \"Omaha\" steps up the intensity once more, with an almost menacing synth line, but is softened by Groom's engrossing vocals. \"Inflatable Afterlife\" rounds out the experience. Strings are plucked and drums are carefully placed, then removed, stopping and starting, creating a space for what could be the most intriguing vocal performance of the album.\r\n\r\nRecalling elements of Massive Attack, Portishead, Bat for Lashes and Zola Jesus, but imitating no-one, the duo of Rokwell & Groom stand poised to make an impact. \"New Parts\" is an insightful reflection of its time, utilising each artists strengths to create a unique and fascinating release.\r\n","options":[{"id":50503026,"name":"Default","price":25.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129315945/-/rokwellgroomDIGITALCoverART.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129315945/-/rokwellgroomDIGITALCoverART.jpg","width":1500,"height":1500}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":11688000,"name":"The Community Sweatshirt","permalink":"the-community-sweatshirt","position":2,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/the-community-sweatshirt","status":"active","on_sale":false,"created_at":"2013-06-10T06:55:07.000Z","description":"The Community Sweatshirt\r\n\r\nDesigned by Diger Rokwell\r\n\r\nM,L,XL,XXL\r\n\r\nNavy Blue.\r\n\r\n","options":[{"id":36914268,"name":"Medium","price":60.0,"sold_out":false,"has_custom_price":false},{"id":36914271,"name":"Large","price":60.0,"sold_out":false,"has_custom_price":false},{"id":36914274,"name":"Extra Large","price":60.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115094862/-/Screen_Shot_2013-06-10_at_2.42.50_PM_1.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115094862/-/Screen_Shot_2013-06-10_at_2.42.50_PM_1.png","width":588,"height":588}],"artists":[],"categories":[{"id":5509032,"name":"Street wear","permalink":"street-wear","url":"/category/street-wear"}]},{"id":11687961,"name":"WA Sweatshirt","permalink":"wa-sweatshirt","position":3,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/wa-sweatshirt","status":"active","on_sale":false,"created_at":"2013-06-10T06:50:52.000Z","description":"WA Sweatshirt\r\n\r\nRepresent WA with this sweatshirt.\r\n\r\nDesign by Diger Rokwell\r\n\r\nSizes: M,L,XL,2XL \r\n\r\nColour: Black\r\n\r\nFree postage within Australia.\r\n\r\n","options":[{"id":36914199,"name":"Medium","price":60.0,"sold_out":true,"has_custom_price":false},{"id":36914202,"name":"Large","price":60.0,"sold_out":true,"has_custom_price":false},{"id":36914205,"name":"XL","price":60.0,"sold_out":false,"has_custom_price":false},{"id":40935810,"name":"2XL","price":60.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115094466/-/Screen_Shot_2013-06-10_at_2.43.11_PM.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115094466/-/Screen_Shot_2013-06-10_at_2.43.11_PM.png","width":547,"height":552}],"artists":[],"categories":[{"id":5509032,"name":"Street wear","permalink":"street-wear","url":"/category/street-wear"}]},{"id":8378982,"name":"FG 'Making Space'","permalink":"fg-making-space","position":4,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/fg-making-space","status":"active","on_sale":false,"created_at":"2012-12-05T07:00:14.000Z","description":"FG 'Making Space'\r\n\r\nMaking Space is the product of four years wandering lost through the streets of life, work and hip hop. Its songs cover topics as far ranging as eco-tastrephy driven zombie apocalypses, neurotic psychiatric sessions, love lost, records found and the joys of working life. \r\n\r\nFeaturing the WAM Hip Hop Song of the Year winning song, The Ego-dystonic Blues, and comprised of a plethora of soul sounds, Making Space is a homage to the forgotten records of our past and a record of the forgotten pasts we all have. \r\n\r\nMaking Space is the first release from Human Writes Records (HWR) and a new addition to the numerous releases from Perth's premiere artists and musicians collective, The Community.\r\n\r\nDigital DL from:\r\nhttp://iamfg.bandcamp.com/\r\n\r\nThe Community & Human Writes Records","options":[{"id":26368440,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":2.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/82401429/-/1962049958-1-480x469.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/82401429/-/1962049958-1-480x469.jpg","width":480,"height":469}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":8222127,"name":"Tripl M.U.M 'Desert Steve'","permalink":"tripl-m-u-m-desert-steve","position":5,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/tripl-m-u-m-desert-steve","status":"active","on_sale":false,"created_at":"2012-11-27T00:57:52.000Z","description":"Tripl M.U.M 'Desert Steve'\r\n\r\nTripl M.U.M is a Perth based MC and producer who creates powerful and vivid sound scapes using ancient samples from Africa and the Middle East. Hip hop has always had its roots in the civil rights movement and tripl M.U.M is a derivative, a side effect if you may, of the immigration of people from the ‘outer’ regions to THE LAND that we call Australia. His music reflects the challenges and the mysticism of yore, as well as many of the major human and environmental issues of today. \r\n\r\nOn his debut album Desert Steve, desert themes are culminated in a character whom represents a people and a circumstance, it is a vivid reflection of the mind that is the Australian immigrant. The opening song is titled “West”. It is heard as the rising of an industrial sun, a visceral and intoxicating hymn of saying hello and goodbye with a beat that pounds with a dangerous pulse. \r\n\r\nAnd serious it gets with the percussion in “Abdul”. Wind sirens echo and fury is unleashed by tripl M.U.M. There are no subtleties here, the world is far from a happy place and the ambiences of flutes remind us that there still remains beauty in the world.\r\n\r\n'Desert Steve' is one for the heads. We are all immigrants.\r\n\r\nWritten and produced by Nader Mustafa Abdul Al\r\nMixed by Sibalance. Mastered by YLEM.\r\n\r\nContact/Booking\r\nNader Mustafa Abdul Al\r\nPh: 0421 348 276\r\nnaderpug@gmail.com\r\n\r\nMore info:\r\nhttp://thecommunity.com.au/tripl-m-u-m\r\n\r\nFor fans of:\r\nPublic Enemy\r\nEric B and Rakim\r\nAfrika Bambatta\r\nRZA\r\n\r\nD/L: tripl-m-u-m.bandcamp.com\r\n","options":[{"id":25910493,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/80829996/-/community_promo_pic_1__1_of_1_-1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/80829996/-/community_promo_pic_1__1_of_1_-1.jpg","width":662,"height":607}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":8202546,"name":"Ylem 'Disk.151'","permalink":"ylem-disk-151","position":6,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/ylem-disk-151","status":"active","on_sale":false,"created_at":"2012-11-26T04:59:53.000Z","description":"Ylem 'Disk.151'\r\n\r\nYlem is a Perth based producer carefully blending synthetic and organic sounds into compositions that reveal his taste for the various emerging \"future beat\" scenes. In a world where almost anyone that has a computer can partake in these ever evolving genres, his music stands out from the masses. Where many are simply content to sit within the confines of what makes a tune dubstep, hiphop, triphop or whatever, Ylem's music is intricately designed and thoughtful. Incredibly focused, yet progressive.\r\n\r\nOn his new album \"Disk.151.\" this thoughtfulness and careful design is reflected from the very beginning, with the appropriately titled \"Submerge.\" A solitary synth loop is built upon with lurching kicks, only to be smothered in wave after wave of tone and atmosphere, with drum patterns that seem to drip from the speakers. Here your descent begins.\r\n\r\nHowever, perhaps those drum sounds actually are drips. \"Disk.151.\" is named after a document relating to original Hollywood sound FX pioneer Jack Foley, and like Foley, Ylem has been collecting field sounds and recordings, which are incorporated into every track on the album.\r\n\r\nThe track \"Slew\" (which happens to be winner of the West Australian Music Industry award for Electronic Song of the Year), begins with a field recording that could be interpreted in many ways, but somehow establishes a feeling of nostalgia which is then echoed in the sighing vocal samples utilised throughout. It's unclear if this was Ylem's intention, but one of the beautiful things about this album is that it does provoke emotion and contemplation in the listener, and will likely effect every listener differently.\r\n\r\nThe following track \"Sweat,\" (again being appropriately titled), features heaving, writhing synths and the kind of beat that let it easily make the leap from headphones to club speakers, and back again. \"Roadie,\" and \"Red Herring\" continue the intelligent dancefloor vibe, while \"Something for the Pain\" somehow evokes both sci-fi and summer at the same time. \"Global Village\" is the album's closer, and it's joyful vocal snippets, chaotic stuttering melodies, and lush sweeping synths seemingly imply a spontaneous celebration of the preceding journey.\r\n","options":[{"id":25853205,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":3.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/80643081/-/Cover_Art_SQR.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/80643081/-/Cover_Art_SQR.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":8109699,"name":"Community Words","permalink":"community-words","position":7,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/community-words","status":"active","on_sale":false,"created_at":"2012-11-21T03:31:08.000Z","description":"The Community has had a big year and it's about to get a whole lot bigger. Following on from the critical success of Community Beats in August, The Community has banded together to release a second compilation of unreleased music for 2012. This time, the collective felt that instrumentals were not enough and conceived Community Words.\r\n\r\nCommunity Words is a 16-track album featuring The Community’s finest songwriters, emcees, singers and their close associates. With songs that vary in subject matter from first date anxiety to post-traumatic stress disorder, Community Words has been designed to show the world that beats driven music is about more than making people dance in clubs. Emcees and singers including Marksman and ASAP, Felicity Groom, Wisdom2th, The Empty Cup, Mathas and Rachael Dease are given centre stage. Of course, a healthy dose of head nod rhythms and banging beats compliment the vocalists, with instrumentals delivered from the consummate creative fingertips of Diger Rokwell, YLEM, DOS4GW, Able8, The Boost Hero Man, DJ Silence and Lenny Rudeberg to name but a few.\r\n\r\nCommunity Words is a testament to the outpouring of creativity that has overwhelmed The Community in 2012. It is the collective’s second full-length compilation this year, in addition to the numerous outstanding releases from individual Community artists. These fresh releases have included Marksman's album, 'The Bridges in Spain', (which received a pleasant share of Triple J and Rage love), Diger Rokwell's 'Build my…' EP, Empty's 'The Empty Cup Mixtape' and FG's 'Making Space' album. The releases don't stop there, though.\r\n\r\nNot satisfied with a simple single-album launch to reveal Community Words, The Community will be launching three new albums at Mojo's Bar on November 24.  In addition to Community Words, YLEM will be launching his new, much-anticipated album 'Disk.151' and tripl M.U.M will be dropping his solo project 'Desert Steve'. More over, triple launch patrons will receive each of those three original albums in exchange for a $15 cover charge.\r\n\r\nThe Community is a self-funded artist collective consisting of music producers, performers, administrators and visual artists from Perth, Western Australia.  Founded in 2004, The Community is a multi-platform music and arts group that engages with the local Perth scene through running live events, exhibitions, music releases, fundraising initiatives and artist development.\r\n\r\nFurther information may be found at: http://www.thecommunity.com.au\r\n\r\nFor interviews or press related enquiries, please contact Ashley Hosken at info@thecommunity.com.au\r\n","options":[{"id":25578960,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/79724805/-/Screen_shot_2012-11-09_at_12.58.01_AM.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/79724805/-/Screen_shot_2012-11-09_at_12.58.01_AM.png","width":489,"height":491}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":6969657,"name":"Community Beats","permalink":"community-beats","position":8,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/community-beats","status":"active","on_sale":false,"created_at":"2012-08-15T06:47:12.000Z","description":"The Community Beats Compilation\r\n\r\n\r\nIf lyrics are the conscience of music then beats are the soul. And The Community is about to show the world that souls come in all sizes, colours and shapes. Some souls are angular, delicate and brittle, as if looking at them would be enough to shatter them into pieces; other souls are energetic, excited and robust - they fill you with a sense of immediacy and joy; still other souls are dark, ominous and disturbing yet, also, strangely alluring. This diversity of musical soul will be presented on The Community's newest release, Community Beats.\r\n\r\nCommunity Beats features 18 tracks from the likes of recent WAMi Award winning artists Diger Rokwell and Mathas (without a mic), as well as, YLEM, Vishnu, FG, Mei Saraswati, Ourobonic Plague and Able8 just to name a few. A quick listen will show just how diverse this collection of tunes actually is. ‘Pull Up’ by Diger Rokwell is a future beat up start complete with squelch bass, airhorns and squirling sonics. Mathas’ inclusion, entitled ‘Glowboiler’, is a deep, emotive and progressive hip hop beat that nods its head to Apollo Brown whilst FG’s ‘Community 101’ is a forward-thinking public service announcement disguised as a hip hop beat. Vishnu, YLEM and Mostarsk bring a more experimental edge release with layers of ambient sounds, percussive counterpoint and sophisticated melodic elements. The Empty Cup, DJ Silence, DOS4GW and Able8 reinterpret the conventions of hip hop with their contributions and demonstrate why they are considered amongst the most cutting edge hip hop producers in the country. The release represents the souls, sounds and vibes that currently resonate within this tight collective.\r\n\r\nBirthed as a street art project in 2004, The Community has grown into collective of over 30 members with artists, musicians, lyricists and emcees located throughout Australia. As a part of The Community’s 8th birthday celebrations, the collective is releasing two compilations: Community Beats and Community Words. Community Beats is the first of these two albums and features a stylistically diverse array of music from artists featured on thecommunity.com.au\r\n\r\nThe Community Records 2012 \r\nSerial No: CMTY14\r\nwww.thecommunity.com.au\r\nhttp://soundcloud.com/thecommunityrecords\r\n\r\nMixed by Everyone\r\nMastered by Alex Planet","options":[{"id":22083113,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/68389523/-/Screen_shot_2012-08-15_at_10.42.08_AM.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/68389523/-/Screen_shot_2012-08-15_at_10.42.08_AM.png","width":732,"height":731}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":6565189,"name":"'Build My...' Diger Rokwell","permalink":"build-my-diger-rokwell","position":9,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/build-my-diger-rokwell","status":"active","on_sale":false,"created_at":"2012-06-28T10:42:55.000Z","description":"‘Build My...’ Diger Rokwell\r\n\r\nDiger Rokwell has built quite the name for himself in recent years. After cutting his teeth performing to the tight knit audience surrounding The Community collective - of which he was a founder - Diger started sharing shows with those in the wider circles of Perth's flourishing and diverse indie scene. This hard work recently paid off in the form of winning the 2012 WAMI award for Electronic Producer of the Year. You'd think someone in that position might slow down a bit, relishing the praise. That's not Diger's style.\r\n\r\nDiger Rokwell's new EP \"Build My...\" comes at a time when the flavours of his last release, the second \"beat tourism\" project \"Sri Diger,\" are still fresh in the mind. The new work is echoed in the stand out track \"Wake Up,\" but with a darker bent that reflects on the themes of winter, solitude and the ending of relationships. In fact this may be Diger's most melancholy release yet, with tracks like \"Broken Man\" and \"Rework\" utilising chopped short samples of percussion and live instruments at their most forlorn. With Diger's work, though, \"dark\" does not necessarily mean \"negative.\" Making use of his skills as a multi-intrumentalist, Diger has flexed his skills in bass, guitars, synths, keys, and organs to dance with these samples, leaving the listener in a reflective state and filled with hope. This is most evident in the final track \"Together,\" in which vocals born from pain meld with glorious ambient synths and squelches, creating the perfect music for a meditation on the self, life, and love.\r\n\r\n\"Build My\" showcases the infusion of production, themes and narrative adding to Diger Rokwell’s list of musical releases. But it's only the tip of the proverbial iceberg of upcoming releases. A much anticipated collaboration with Perth songstress Felicity Groom is soon to follow, along with a house and psychedelic hip hop EPs plus \"beat tourism\" chapters \"Digstanbul,\" and \"Indigernesia\" in the pipeline also.  Mixed by Ylem and Diger himself, and mastered by Monk Fly at The Frequency Lab, \"Build My\" will show you exactly why the awards have started flowing and the crowds at Diger's shows just keep growing.\r\n\r\nThe Community Records 2012 \r\nSerial No: CMTY13\r\nDLs available from http://digerrokwell6000.bandcamp.com/","options":[{"id":20870261,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/64481589/-/EP_BUILD_Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/64481589/-/EP_BUILD_Cover.jpg","width":984,"height":1000}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":6095489,"name":"The Community Shirt","permalink":"the-community-shirt","position":10,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/the-community-shirt","status":"active","on_sale":false,"created_at":"2012-05-03T15:36:37.000Z","description":"The Community Shirt (MARoON)\r\n\r\nEarth Heads mount up! Dinkies are the best.\r\n\r\nAvailable in S, M, L, XL\r\n\r\nFree shipping anywhere!","options":[{"id":19459067,"name":"Small","price":40.0,"sold_out":false,"has_custom_price":false},{"id":19459069,"name":"Medium","price":40.0,"sold_out":false,"has_custom_price":false},{"id":19459071,"name":"Large","price":40.0,"sold_out":false,"has_custom_price":false},{"id":19459073,"name":"X Large","price":40.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59847719/-/2000B_AshGrey_Flat_Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59847719/-/2000B_AshGrey_Flat_Front.jpg","width":522,"height":480}],"artists":[],"categories":[{"id":488481,"name":"Tees","permalink":"tees","url":"/category/tees"}]},{"id":6073285,"name":"Mathas 'Ten Pound Hairless Sasquatch' ","permalink":"mathas-ten-pound-hairless-sasquatch","position":11,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/mathas-ten-pound-hairless-sasquatch","status":"sold-out","on_sale":false,"created_at":"2012-05-01T05:58:25.000Z","description":"Mathas 'Ten Pound Hairless Sasquatch' \r\n\r\nThe debut release from Mathas. Touching on elements from a safe Australian birth to the climatic environment we now exist in, Mathas picks apart his planet with thickly cryptic sarcasm that is overall begrudgingly optimistic.\r\n\r\nSold out! DL available from:\r\nhttp://mathas.bandcamp.com/album/10lb-hairless-sasquatch-2009\r\n\r\nreleased 17 September 2009 \r\nfeat. Mathas, The Empty Cup, DOS4GW, Able, Jasper Thomas, Hykus, Arms in Motion, Deph One.","options":[{"id":19398807,"name":"Default","price":10.0,"sold_out":true,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59630147/-/2176371938-1.jpg.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59630147/-/2176371938-1.jpg.png","width":350,"height":350}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":6073241,"name":"Mathas 'White Sugar' EP (Lollipop style)","permalink":"mathas-white-sugar-lolliepop-single","position":12,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/mathas-white-sugar-lolliepop-single","status":"sold-out","on_sale":false,"created_at":"2012-05-01T05:52:21.000Z","description":"Mathas 'White Sugar' EP (Lolliepop style)\r\n\r\n+ Bubbleboy\r\n+ PLRT feat. Able\r\n+ Puppies in the Fish Tank- Injured Ninja (Mathas redux)\r\n\r\n\r\nWhite Sugar is a little study of personal flaws, habitual behaviour and the extreme consumption of heavily refined and processed foods in the western world.\r\n\r\nLimited edition.\r\n\r\nreleased 28 June 2011 \r\nMusic & Lyrics: Mathas \r\nMixed by: Lewis Galaga @ Loop Studio \r\nMastered by: Ylem","options":[{"id":19398711,"name":"Default","price":10.0,"sold_out":true,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59629643/-/1721088991-1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59629643/-/1721088991-1.jpg","width":350,"height":350}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":6067131,"name":"WA Snapback","permalink":"wa-snapback","position":13,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/wa-snapback","status":"active","on_sale":false,"created_at":"2012-04-30T17:34:05.000Z","description":"WA Snapback \r\n\r\nState colours.\r\n\r\nLimited edition. \r\n\r\nEmbroided in the USA, Yupoong Classic Snapback.\r\n\r\nFree shipping in Australia.\r\n","options":[{"id":19383009,"name":"Default","price":40.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/63016663/-/428468_10150882476571173_2121138670_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/63016663/-/428468_10150882476571173_2121138670_n.jpg","width":638,"height":960},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59567707/-/IMG_0727.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59567707/-/IMG_0727.jpg","width":750,"height":1000}],"artists":[],"categories":[{"id":3171705,"name":"Cap","permalink":"cap","url":"/category/cap"}]},{"id":5755423,"name":"WA tee","permalink":"wa-shirt","position":14,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/wa-shirt","status":"active","on_sale":false,"created_at":"2012-03-22T13:21:43.000Z","description":"WA tee\r\n\r\nRepresent in State Colours!\r\n\r\nAvailable in S,M,L,XL,2XL.\r\n\r\nFree postage anywhere.\r\n","options":[{"id":18471561,"name":"X Large","price":40.0,"sold_out":false,"has_custom_price":false},{"id":18726707,"name":"Large","price":40.0,"sold_out":false,"has_custom_price":false},{"id":18726709,"name":"Medium","price":40.0,"sold_out":false,"has_custom_price":false},{"id":18726711,"name":"Small","price":40.0,"sold_out":false,"has_custom_price":false},{"id":18726713,"name":"XX Large","price":40.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56498919/-/t-shirt-template-17.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56498919/-/t-shirt-template-17.jpg","width":450,"height":460}],"artists":[],"categories":[{"id":488481,"name":"Tees","permalink":"tees","url":"/category/tees"}]},{"id":3883966,"name":"'Dust Moats' Maxy Bills","permalink":"dust-moats-by-maxy-bills","position":15,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/dust-moats-by-maxy-bills","status":"active","on_sale":false,"created_at":"2011-06-08T05:31:20.000Z","description":"In late 2009, Maxy Bills released \"Peace for Pieces,\" his debut EP merging sounds of dub and triphop to create his signature brand of \"future cosmic funky glooping intergalactic resonance\" (Maxy's description of his own sound). Now, after nearly 2 years of fiddling with machines and refining the style, \"Dust Moats\" is ready for release.\r\n\r\n\"Dust Moats\" is very much a product of the beat scenes of today, while avoiding the traps and cliches that commonly prevail. On the title track, the drums come in almost as an afterthought, casually weaving into the lush synthetic drones that form the base. Things build ever so slowly from there, with Maxy showing a kind of patience with the beat rarely demonstrated. Tracks seems to gather steam as they follow each other, with the echo-drenched dubs of \"Fruit Time,\" easing into the slightly busier \"Seeding Suns,\" and then again picking up the tempo on \"No More Mice.\" And it's on this track that things really get going. A round, fat, bass tone ambles along under skittering drums, giving the impression this could just have easily originated in London, or LA, as it was in Perth. The complex sonics continue until the final track, \"Tom Sai\" takes things down a notch once more, functioning as a soundtrack for a moment of contemplation.\r\n\r\nThe themes and concepts within \"Dust Moats\" speak of a connection with nature, and a thirst for knowledge - be it without or within. The resulting sounds reflect an artist who's developed his craft to the point that it's just an extension of himself. \"Dust Moats\" takes you on a journey, but it's a journey that reminds you how interesting and exotic things can be, without you having to travel very far.\r\n\r\nDigital download available here:\r\nhttp://maxybills6000.bandcamp.com/\r\n\r\nAlso available from Dada's, 78's, Mills Records, Fat Shans, Planet Music and Wax Museum Melbourne.","options":[{"id":12941336,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40785525/-/dust_moat_BC.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40785525/-/dust_moat_BC.jpg","width":350,"height":350}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":3740332,"name":"'Sri Diger' Diger Rokwell","permalink":"sri-diger","position":16,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/sri-diger","status":"active","on_sale":false,"created_at":"2011-05-12T10:26:37.000Z","description":"Diger Rokwell is home with his latest limited edition Beat Tourism installment and follow up to 'Digerbodia'. 'Sri Diger:remixes and beats from Lanka' features the Veddah, Sinhalese, Moorish and Tamil sounds of the enchanted isle Sri Lanka fused with technology.\r\n\r\nThe work was primarily created whilst Diger was on rest and recreation in Sri Lanka. This trip Diger sampled radio, television, drums, recorded field recordings and bass interwoven with purchased Sri Lanka folk music to produce styles very much of the now.\r\nThe work features various genres from lo fi dub step to choppie hip hop to fuzzy disco.\r\n\r\n‘Lion Rok’ scales the scene with its textual soundscape floating above a dubstep symbolism of the temple outcrop. ‘Galle’ explores the lax sway of the colonial port and fort, ‘Dharma Drums’ merges the worlds of Sri Lankan soap opera, talk shows with severe sitar and drum chops. ‘Squirrel Jam’ pays tribute to Sri Lanka’s resourceful rodents with quirky synths. ‘Jothipala Forever’ remembers the music of HR Jothipala, Sri Lanka’s king of Sinhalese popular music.\r\n\r\nCollected, complied, arranged and tweaked for over 7 months, Sri Diger features 7 tracks that pay homage to Sri Lankan scapes, sounds and songs through recontextualisation. Mixed by Community comrade YLEM and mastered by Dave Cooley of Stones Throw fame, Sri Diger is a sonic sounding journey.\r\n\r\n\r\n1. dharma drums\r\n2. lion vs. tiger\r\n3. sri sitar\r\n4. squirrel jam\r\n5. ella\r\n6. galle\r\n7. jothipala forever\r\n\r\nDigital download available here:\r\nhttp://digerrokwell6000.bandcamp.com/album/sri-diger\r\n\r\nAlso available from Dada's, 78's, Mills Records, Fat Shans, Planet Music and Wax Museum Melbourne.","options":[{"id":12526052,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40785589/-/sri_diger_layer_flat_brown_A.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40785589/-/sri_diger_layer_flat_brown_A.jpg","width":1000,"height":984}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2945459,"name":"'Ziggurat' Arms in Motion","permalink":"ziggurat-arms-in-motion","position":17,"price":7.0,"default_price":7.0,"tax":0.0,"url":"/product/ziggurat-arms-in-motion","status":"active","on_sale":true,"created_at":"2010-11-29T05:30:41.000Z","description":"Arms in Motion debut album 'Ziggurat' featuring 'Punch Out' featuring Emcee Galaga, 'Starry Faces' and 'Street Sweepers' with Mathas plus 'Scientifix' featuring Wisdom Teeth. A musical footnote in West Coast Australia's Hip Hop scene. A diverse and higher order listening device, a must for any hip hop devotee.","options":[{"id":10192879,"name":"Default","price":7.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/28567947/-/cover_arms_in_motion.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/28567947/-/cover_arms_in_motion.jpg","width":1000,"height":881}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2876856,"name":"'Urban Grey' YLEM ","permalink":"urban-grey-ylem","position":18,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/urban-grey-ylem","status":"active","on_sale":false,"created_at":"2010-11-15T08:01:37.000Z","description":"Although primarily known as a Dubstep producer and DJ, Ylem returns to his roots for his debut LP, entitled ‘Urban Grey’, which showcases his down-tempo production and atmospheric Trip-Hop. The brooding soundscapes in his first full length release draw from his diverse musical background. He has tirelessly promoted Dubstep to the Perth underground over the past 2 years: founding WattHz and dedicated local Dubstep nights, co-hosting Basscheck on RTRFM 92.1 and supporting many international acts. He has also released several Dubstep tunes on international record labels as singles, compilations and EPs. \r\n\r\nThe departure from Dubstep on ‘Urban Grey’ sees Ylem explore his fascination with utopian/ dystopian futures and reflect on contemporary issues like Globalisation and the changing environment. The dark aural experience the listener can expect in ‘Urban Grey’ is created from obscure sound bites and carefully crafted synths layered over organic grooves. Shades of light and anticipation are also revealed in Ylem’s masterly crafted sounds, depicting his nuanced understanding of the turbulent society we live in. \r\n\r\n\r\n","options":[{"id":10013346,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27867138/-/Urban_Grey_big_cartel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27867138/-/Urban_Grey_big_cartel.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2876824,"name":"'We Are All Related' Diger Rokwell","permalink":"we-are-all-related-by-diger-rokwell","position":19,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/we-are-all-related-by-diger-rokwell","status":"active","on_sale":true,"created_at":"2010-11-15T07:50:22.000Z","description":"Diger Rokwell has had a productive year. The Digerbodia beat tourism tape dropped earlier this year to critical praise and plenty of airplay, leading to his live shows being in great demand. That was only the beginning though, because, as promised, the full-length album “We Are All Related” has arrived.\r\n\r\nTwelve months in the making, “WAAR” is Diger as a multi-instrumentalist, handling guitar, bass, synths, keys and organ parts all himself. This live element accompanies the deft sampling and masterful composition that we’ve come expect, as seen on The Earthhead and Digerbodia releases, but now taken to a higher level. On top of all that, the album delivers again a symbolic narrative to the audience and its open-endedness leads to multiple interpretations. With samples and inspiration originating from the music of Pakistan, Iran, Africa, Mongolia and China, and philosophical resonance via Carl Sagan speeches and other forward thinkers spoken word. The overriding theme of the release is the path of Humanity: past, present and future and our hopeful eventual realisation of true relationship with each other.\r\n\r\nAll tracks on the release showcase the diversity of sounds Diger Rokwell produces. Past, present, and future interpretations of our travels on this earth combine with ambient reversed sitars and spaced out drum loops on “Journey”. Heavy, apocalyptic bass lines lay the foundation for consideration of inactivity and delusion in our society and a localised play on words in “Aperthy.” Echoes of Pakistani cinema rattle through the cosmos on “No More Kings” while on “Nothing Stays the Same”, the rockabilly jungle beats provide as much material for reflection, as they do for dancing. “Show me” is an ambient number reminiscent of a space documentary soundtrack. “Free Ticket” is a hip hop throw back track with pigmy vocals and Turkish Anatolian drums. All these concepts – both sonic and philosophical – are dealt with in “We Are All Related,” which ingeniously functions as a kind of epilogue, and features eloquent lyrical ponderings from Mathas.\r\n\r\nEnlisting Sibalance to mix and Dave Cooley (Stones Throw, Elefant Traks) to master the work. Diger has ensured that every snare snaps, every bassline booms, and every synth soars. ‘We Are All Related’ is truly a statement, a mark made on both the musical community and the world at large.\r\n","options":[{"id":10013264,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27866954/-/bigcartelPIC.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27866954/-/bigcartelPIC.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2625340,"name":"'Digerbodia' Diger Rokwell","permalink":"digerbodia-remixes-and-beats-from-the-khmer-kingdom","position":20,"price":7.0,"default_price":7.0,"tax":0.0,"url":"/product/digerbodia-remixes-and-beats-from-the-khmer-kingdom","status":"sold-out","on_sale":true,"created_at":"2010-06-22T05:01:19.000Z","description":"Tracklist:\r\n1. mother mekong\r\n2. battambang bop\r\n3. phnom penh pressure\r\n4. khmer kosmos\r\n5. west of vietnam\r\n6. so long\r\n7. tomorrow\r\n\r\nWhere Diger Rokwell’s prior releases, The Earthhead and Digstrumentals, were a sprawling mass of samples from across the globe and genres, Digerbodia: remixes and beats from the Khmer Kingdom, finds him focusing and refining those ideas on the music from the Khmer Kingdom of Cambodia. The first chapter in a series of “beat tourism” beat tapes; these 7 tracks are built on samples unearthed on a journey in Cambodia.\r\n\r\nUtilising inspiration gained from the golden age of Cambodian popular music, the work of artists including Sinn Sisamouth, Ros Sereysothea and Pen Ron, is re-imagined as a series of hip hop, prog-hop and quasi-dub step rhythms.\r\n\r\nFeaturing such standout tracks as Mother Mekong - a blissful melodic trip hop journey down Cambodia's mother river, and Phnom Penh Pressure - a hip hop flavoured remix of Sinn Sisamouth – Cambodia’s King of golden age popular music.\r\n\r\nDigerbodia swelters with the exotic, cosmic realms and humidity similar it’s spiritual home. While it reflects the work Madlib’s numerous musical forays into India, this beat tape is also an ode to those educated free thinkers, musicians, artists and countless other minority groups who were displaced or murdered by the Khmer Rouge Year Zero campaign from 1975-79.\r\n\r\n2010 is a big year for Diger. November 27th sees the release of a full-length album ‘We are All Related’ - featuring Diger’s live instrumentation and wordly overlays.\r\n\r\nThen the beat tourism continues in 2011 with Diger already concocting his Digernesia and Sri Diger project. First traveling to Sri Lanka in 2011, Diger being an Indonesian teacher by trade, he plans to travel to Jakarta and dig for the sound of Indonesia for a 2011 beat tape and companion piece to the monsoonal storm of samples that is Digerbodia.\r\n\r\nDigerbodia is released through The Community Records & Paper Chain. With half of the proceeds made from the EP to be donated to organizations assisting Cambodian landmine victims. \r\n","options":[{"id":9289019,"name":"Default","price":7.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/25294214/-/digerbodiacoveridea.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/25294214/-/digerbodiacoveridea.jpg","width":1000,"height":984}],"artists":[],"categories":[{"id":488451,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]