[{"id":13451421,"name":"N. 0","permalink":"n-0","position":3,"price":21.0,"default_price":21.0,"tax":0.0,"url":"/product/n-0","status":"active","on_sale":false,"created_at":"2013-09-09T11:07:32.000Z","description":"<p>\r\nCosa lega Dario Zidaric a Bittor Arginzoniz, Niko Romito ad Aurora Mazzucchelli, Sasu Laukkonen\r\ne le ostriche, la cacciata dal Paradiso e le opere di Milk Factory, il Pop e il Gourmet? Un sottile fil rouge\r\nche attraversa le parole e le immagini del Numero Zero di Dispensa, un doppio registro tra generi umani\r\ne generi alimentari cui dedicarsi con calma e scoprire – parola dopo parola, una foto dietro l’altra – che\r\nil Postrivoro a Genova era bifronte, che gli Spaghetti al Dente appartengono a una loro\r\nEra, che lo Street Food può avere le ruote. E che è bellissimo farsi abbindolare da questi e tanti altri,\r\nmeravigliosi incontri.\r\n</p>\r\n<div id=\"product_detail\">\r\n    <p>\r\n        <strong>CARATTERISTICHE  TECNICHE</strong><br />\r\n        96 pagine<br />\r\n        Formato 20,3x27,9<br />\r\n        Carte: Copertina Favini Crush 250 gr.  Interno Selena certificata FSC<br />\r\n        Confezione: Brossura cucita<br />\r\n        Prezzo: € 21,00\r\n    </p>\r\n    <p>\r\n        <strong>HANNO COLLABORATO</strong><br />\r\n        Lea Anouchinsky, Andrea Basti, Massimo Bernardi, Blue G., Giulia Bonora,\r\n        Carla Brigliadori, Rossella Calabrò, Lorenza Fumelli, Anna Guazzotti, Michela Iorio, Ilaria Lazzaroni,\r\n        Josep Parker, Simone Sbarbati, Stefano Scatà, Elisabetta Stoinich, Giulia Tacchini, Roberto Taddeo,\r\n        Massimiliano Tonelli, Laura Torelli, Enrico Vignoli\r\n    </p>\r\n    <p>\r\n        <strong>CONTENUTI</strong><br />\r\n        IL POSTRIVORO<br />\r\n        <em>Questo  è il tentativo di agguantare con foto e parole un evento e le sue incredibili storie. Quella volta in cui uno chef giapponese e uno finlandese, un  raccoglitore seriale di erbe spontanee, un oste ruvido dal cuore grande, un  manipolo di gastrofissati che crede nei pirati e nell’avventura, si sono  incontrati a Genova. </em>\r\n    </p>\r\n    <p>\r\n        UNDERGROUND – OVERGROUND<br />\r\n        <em>Là  sopra, è difficile notare ciò che vedi tutti i giorni salvo avere occhi nuovi. Là sotto, succedono cose incredibili, basta prendersi la briga di andare a  guardare. Non è una questione spaziale, piuttosto di quella linea che separa e  unisce la sana nostalgia che rende i cuori più pazienti alla smania pura che ci mantiene insaziabili.</em>\r\n    </p>\r\n    <p>\r\n        COME COLTIVARE UN PIATTO<br />\r\n        <em>Non  ha un nome quella cosa che ti fa dedicare una vita e migliaia di ore a star dietro a una passione, ma la puoi assaggiare in un piatto indimenticabile. Ecco  il racconto della coltivazione di un talento e della costruzione di un piatto:  sia per quelli che credono nei miracoli, che per quelli che credono nel sudore.</em>\r\n    </p>\r\n    <p>\r\n        DUE CUCINE<br />\r\n        <em>Lei  predestinata, lui scampato al suo primo destino. Lei bolognese, lui basco. Lei una cucina materna e generosa, lui primitiva degli elementi. Il fuoco delle  braci, lui; quello del carattere, lei. Ma da Bologna si vedono i Paesi Baschi,  e i gradi di separazione in questo mondo piccolo tocca a voi starli a trovare.  Aurora Mazzucchelli e Bittor Arginzoniz.</em>\r\n    </p>\r\n    <p>\r\n        IL LATTE E LE OSTRICHE<br />\r\n        <em>Se  è vero che ogni storia d'amore è una storia di fantasmi, questi sono i prodotti che meglio di altri spaccano cuori e palati: o li ami o li odi. Le mezze misure  sono così noiose! Li scopri da adulto o ti conservano bambino, ma è certo che  con il latte e le ostriche si creano rapporti personali. Per questo motivo  ognuno ha la sua storia da raccontare. </em>\r\n    </p>\r\n    <p>\r\n        DISPENSANDO<br />\r\n        <em>Approfondimenti,  divagazioni, esperimenti: piccole storie a corollario del Numero per chiudere  in bellezza e scoprire che i pop corn possono essere gourmet, il formaggio può  trasformarsi in opera d’arte, che Kristin e Linzi hanno molto in comune, e che  le salse posseggono un loro Generatore Automatico. </em>\r\n    </p>\r\n</div>","options":[{"id":43060038,"name":"Default","price":21.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.5,"amount_with_others":0.0,"country":{"id":23,"name":"Italy","code":"IT"}},{"amount_alone":13.0,"amount_with_others":0.0,"country":{"id":38,"name":"Switzerland","code":"CH"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125838480/-/Dispensa_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125838480/-/Dispensa_cover.jpg","width":700,"height":932},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125838486/-/Dispensa_Doppia_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125838486/-/Dispensa_Doppia_1.jpg","width":700,"height":508},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125838498/-/Dispensa_Doppia_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125838498/-/Dispensa_Doppia_2.jpg","width":700,"height":508}],"artists":[],"categories":[]}]