[{"id":12204906,"name":"Not Perfect, But Chosen","permalink":"not-perfect-but-chosen","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/not-perfect-but-chosen","status":"active","on_sale":false,"created_at":"2013-07-05T22:43:54.000Z","description":"The pages of this book will encourage you to understand that perfection does not mean without flaws or mistakes, but the progress toward maturity. You will also realize that you have been chosen for a specific purpose, in fact you may have already tapped into your purpose and you may not even know it yet. You will get a revelation on how to tap into your purpose. It's a lot more simple than you think. This is your time to just say yes to GOD, for GOD knew who you were before you were born, he knows every mistake and every bad choice you have ever made and those things he will use to produce something awesome in you. GOD has selected you! GOD has handpicked you! Out of millions of people, you are one of the people GOD has chosen!","options":[{"id":38666775,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/120271674/-/not_perfect.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/120271674/-/not_perfect.png","width":773,"height":1000}],"artists":[],"categories":[{"id":5700222,"name":"Books","permalink":"books","url":"/category/books"}]},{"id":12204969,"name":"The Ward","permalink":"the-ward","position":2,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/the-ward","status":"active","on_sale":false,"created_at":"2013-07-05T22:47:11.000Z","description":"This story is based on a young man, Everett Washington who struggles with his identity. He didn't know who he was, he wasn't assured of his place in this world, but GOD through his infinite wisdom allowed Everett's eyes to be opened through a plethora of events. Marital problems, a visit to the psychiatric ward, coupled with a search for his own worth as a man led him down a dark path. Fighting with demons and himself, he felt hopeless. But GOD created hope in a hopeless situation. \r\n\r\nEverett came to this place, the Ward, where he had to face his own insecurities, fears, weaknesses and strengths and that confrontation would lead him to his ultimate purpose. The Ward is a figurative place that represents how we all come to moments in our lives that demand a transitional decision to do something different than what we have been doing up to that point. Like Everett, you can reconnect with GOD, step back into your place and move toward your destiny! It's never too late, it's never too dark, it's never too hard and you're never too far too come back home!","options":[{"id":38667006,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/120270858/-/the_Ward_front_cover_1_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/120270858/-/the_Ward_front_cover_1_.jpg","width":773,"height":1000}],"artists":[],"categories":[{"id":5700222,"name":"Books","permalink":"books","url":"/category/books"}]},{"id":12205011,"name":"Go With the Flow","permalink":"go-with-the-flow","position":3,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/go-with-the-flow","status":"active","on_sale":false,"created_at":"2013-07-05T22:49:46.000Z","description":"Praise and worship is a very important part of our personal lives as well as our corporation meetings every week. The power of praise worship will change an atmosphere releasing the power of GOD in dimensions you have never experienced before. You have to flow in the river of GOD, which is a river of life. Have you ever wanted to experience new songs, spiritual songs that would break chains and release GOD's power? This book will reveal some practical information, causing your praise and worship both privately and corporately to touch the heart of GOD.\r\n\r\nBreak Tradition! Break church as usual! Sing the songs GOD wants to hear ushering God's people into his presence, where there is healing deliverance and power. If you have to go, why not go with the Flow?","options":[{"id":38667162,"name":"Default","price":12.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/120271110/-/Go_With_the_flow_cover_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/120271110/-/Go_With_the_flow_cover_1.jpg","width":773,"height":1000}],"artists":[],"categories":[{"id":5700222,"name":"Books","permalink":"books","url":"/category/books"}]}]