[{"id":6276863,"name":"Achat de Vins","permalink":"achat-de-vins","position":1,"price":1.0,"default_price":1.0,"tax":0.0,"url":"/product/achat-de-vins","status":"coming-soon","on_sale":true,"created_at":"2012-05-24T23:40:47.000Z","description":"Chaque année, l’équipe de DEGUST’ EMOI parcourt les vignobles, participe à des dizaines de salons et goûte des milliers de vins.\r\n\r\nNotre cœur de métier n’est pas la vente de vins, mais l’organisation de dégustations, cependant, nous souhaitons vous faire partager nos coups de cœurs, vous faire découvrir les vignerons artisans que nous aimons, leurs vins authentiques reflétant leurs terroirs, bien loin des modes œnologiques modernes.\r\n\r\n95% des vins proposés sont issus de raisins biologiques, souvent travaillés en biodynamie, des vins purs, sans artifices, ni compromis !\r\nDécouvrez bientôt notre catalogue !","options":[{"id":20015411,"name":"Coming soon","price":1.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/61634973/-/Boutique-37050_140x140.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/61634973/-/Boutique-37050_140x140.jpg","width":140,"height":140}],"artists":[],"categories":[{"id":3264161,"name":"Achat de vins","permalink":"achat-de-vins","url":"/category/achat-de-vins"}]},{"id":6276537,"name":"Dégustations Vins Mythiques","permalink":"degustations-vins-mythiques","position":2,"price":98.0,"default_price":98.0,"tax":0.0,"url":"/product/degustations-vins-mythiques","status":"active","on_sale":true,"created_at":"2012-05-24T23:12:46.000Z","description":"Sessions de 2h30 – Une dizaine de vins dégustés.\r\n\r\nDégustation de vins Mythiques… Les plus beaux flacons.\r\n\r\nLors de ces dégustations, nous vous  ferons découvrir les vins les plus rares et les plus prestigieux. Des Bourgognes mythiques, en passant par les 1er crus du Bordelais, sans oublier les Hermitage et Côte-Rôtie, Riesling et grands Chenin, Barolos et Barbera, venez découvrir les plus beaux flacons de la planète vins !\r\n\r\nLors de ces soirées inoubliables, vous aurez le privilège de déguster une dizaine de vins souvent introuvables par leur rareté et leur prix, juste pour information, le prix chez un caviste d’une des bouteilles dégustées excède souvent les 100 euros.\r\n\r\nUn plateau de fromages affinés sera servi au milieu de la séance.\r\n\r\n \r\n\r\nQuelques exemples de dégustations de vins Mythiques :\r\n\r\n1) CHÂTEAU RAYAS, CHÂTEAU FONSALETTE, PIGNAN et CHÂTEAU DES TOURS : Vins Mythiques de la Vallée du Rhône Méridionale : 98 euros\r\n\r\n    Thématique et déroulement de la dégustation :\r\n\r\nAu cœur des appellations viticoles méridionales de la Vallée du Rhône, Emmanuel Reynaud, propriétaire de Rayas, Fonsalette, Pignan et Château des Tours, propose surement les plus grands vins des appellations Châteauneuf du Pape, Côtes du Rhône, Vacqueyras et Côtes du Rhône Village. La seule évocation des noms de Château Rayas, Fonsalette et Pignan font rêver les connaisseurs du monde entier !\r\n\r\nLe château Rayas est surnommé par les amateurs « le diamant pourpre », c’est un cru mythique, considéré comme l’un des plus grands vins du monde. L’élégance de texture que ses vins acquièrent avec l’âge n’a absolument pas d’équivalent !!\r\n\r\nSurnommé « Le petit Rayas » par les collectionneurs, les vins de Fonsalette sont devenus presque introuvables. D’une gourmandise incroyable dès leur prime jeunesse, ces flacons sont parés pour affronter des décennies de garde.\r\n\r\nLors de cette superbe dégustation, nous aurons l’occasion de déguster deux millésimes du Château Rayas, Fonsalette et de Pignan, ainsi que des vieux millésimes du Château de Tours.\r\n\r\nUne dégustation mémorable, avec quelques flacons rarissimes, qui raviront les palais des dégustateurs les plus exigeants !\r\n\r\n    Échantillon des vins proposés :\r\n\r\nChâteau Rayas 2000 / Château Rayas 2002/Château de Fonsalette 1997 / Château de Fonsalette cuvée Syrah 2003 / Château de Fonsalette 1996 / Château Pignan Châteauneuf du Pape 2006 / Château Pignan Châteauneuf du Pape 2000 / Château des Tours Vacqueras 2001 / Château des Tours grande Réserve 2002.\r\n\r\n \r\n\r\n2) GRANDS LIQUOREUX ET MOELLEUX de France : 98 euros\r\n\r\n    Thématique et déroulement de la dégustation :\r\n\r\nLe Château Yquem figure parmi les plus grand vins de monde, il est sans aucun doute le plus prestigieux liquoreux !! Nous aurons l’occasion de déguster deux millésimes de cette légende, sans oublier les grands moelleux et liquoreux d’Alsace, de Loire et du Jurançon, autant de nectars pouvant être gardés plus d’un siècle pour les meilleurs. Une dégustation mémorable, placée sous le signe de la volupté, ou vous pourrez découvrir ces merveilleux vins, d’une complexité et d’une « longueur en bouche » incroyable.\r\n\r\n    Échantillon des vins proposés :\r\n\r\nChâteau Yquem 2001 / Château Yquem 1998 / Domaine de Souch Jurançon 1995 / Domaine Deiss Gewurztraminer Vendanges Tardives 2004 / Gewurztraminer Vendanges Tardives Grand Cru Golbert 2005, Domaine Zind Humbrecht / Pinot Gris Clos Jebsal Vendanges Tardives 1997, Domaine Zind Humbrecht / Le Haut Lieu 1996, Domaine Huet /  Coteaux du Layon Quintessence de Juchépie 1976, Domaine de Juchépie.\r\n\r\n \r\n\r\n3) TOUR DE FRANCE DES GRANDS VINS BLANCS : 98 euros\r\n\r\n    Thématique et déroulement de la dégustation :\r\n\r\nNous verrons à quel point nos terroirs produisent des vins d’une grande diversité : Riesling et Chenin d’une grande complexité et d’une superbe minéralité, Chardonnay ample et élégant, mais aussi deux vins blancs du Languedoc Roussillon aromatiques, mais très digestes et tendus. Nous aurons le plaisir de déguster, entre autres, les vins des domaines légendaires « Raveneau », dont la production s’arrache aux quatre coins du monde, Anne Claude Leflaive, offrant certaines des plus belles expressions de chardonnay au monde, sans oublier les vins de Marcel Deiss et Olivier Zind Humbrecht, les deux grands vignerons d’Alsace adulés par les amateurs et les critiques du monde entier pour l’équilibre de leurs vins et leur extraordinaire pureté d’expression.\r\n\r\n    Échantillon des vins proposés :\r\n\r\nSaumur  2002, Domaine Clos Rougeard Brézé/ Oro 1996, Domaine Peyre Rose / Sancerre Culs de Beaujeu François Cotat 2003 / Chablis Grand Cru Valmur 2003, Domaine Raveneau / Puligny Montrachet 1er Cru Clavoillon 1998, Domaine Anne Claude Leflaive /  Gineste 2006, Domaine Gauby Goume / Altenberg Bergheim 1995,Domaine Deiss / Pinot gris Rangen de Thann Clos-Saint Urbain Grand Cru 2004, Domaine Zind Humbrecht.\r\n\r\n \r\n\r\n4) HERMITAGE / CÔTE-RÔTIE / CORNAS : les perles de la Vallée du Rhône Septentrional  : 98 euros \r\n\r\n    Thématique et déroulement de la dégustation :\r\n\r\nLa Syrah est un cépage magnifique doté d’une grande puissance, mais aussi d’une superbe finesse. C’est sur les terroirs de Cornas, Côte-Rôtie et de l’Hermitage que la Syrah nous livre ses plus belles expressions. Sur ces terroirs d’exception, la renommée de l’Hermitage classe l’appellation parmi les plus grands vins du monde. La culture de la vigne remonte à plus de 2000 ans et c’est ici, dans son berceau d’origine, que la Syrah donne le meilleur d’elle-même. Le Cornas est, quant à lui, un vin de grande structure. Charpenté, avec une matière dense et profonde, d’une belle complexité, il connait une grande aptitude à la longévité. Le vignoble de Côte-Rôtie est aussi l’un des plus anciens de France. La Syrah nous donne ici des vins majestueux, méritant un long vieillissement en cave pour révéler leur potentiel.\r\n\r\nVenez déguster les meilleurs nectars de ces coteaux vertigineux, les plus grands de la Vallée du Rhône Septentrionale.\r\n\r\n    Échantillon des vins proposés :\r\n\r\nHermitage rouge 2002, Domaine Jean-Louis Chave / Hermitage rouge 1987, Domaine Jean-Louis Chave / Hermitage Blanc Rocoules 2006, Domaine Marc Sorrel / Côte-Rôtie 1995, Domaine Jamet / Côte-Rôtie La Landonne Rostaing / Cornas Reynard 2000, Domaine Thierry Allemand / Cornas 1996, Domaine Auguste Clape.\r\n\r\n \r\n\r\n5) BOUTEILLES MYTHIQUES DE BOURGOGNE : 196 euros \r\n\r\n    Thématique et déroulement de la dégustation :\r\n\r\nParticipez à une dégustation d’anthologie avec les plus grands vins de Bourgogne, particulièrement difficiles à acquérir, en raison de leur prix et de leur rareté. Nous allons déguster une dizaine de vins de légende, les vins mythiques de Bourgogne. Une soirée inoubliable !\r\n\r\n    Échantillon des vins proposés :\r\n\r\nGrand Echezeaux, Domaine de la Romanée Conti 2006 / Batard Montrachet, Domaine Leflaive 2002 / Meursault Charmes 2004, Domaine Comtes Lafon / Clos des Lambrays 2002 / Clos de Tart 2006 / Chambolle Musigny 1er Cru « les cras » 2007, Domaine Roumier / Chambertin Grand Cru 2004, Domaine Trapet/ Latricières Chambertin Grand Cru, Domaine Trapet 1991.\r\n\r\n \r\n\r\n*sauf session Bouteilles Mythiques de Bourgogne 196€","options":[{"id":20014547,"name":"Dégustations Vins Mythiques","price":98.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/61632543/-/Experts_degrade-75002_140x140.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/61632543/-/Experts_degrade-75002_140x140.jpg","width":140,"height":140}],"artists":[],"categories":[{"id":3264007,"name":"Chèques cadeaux","permalink":"cheques-cadeaux","url":"/category/cheques-cadeaux"}]},{"id":6276521,"name":"Formation Perfectionnement","permalink":"formation-perfectionnement","position":3,"price":65.0,"default_price":65.0,"tax":0.0,"url":"/product/formation-perfectionnement","status":"active","on_sale":true,"created_at":"2012-05-24T23:10:07.000Z","description":"Sessions de 2h30 – Une dizaine de vins dégustés.\r\n\r\nIl s’agit ici d’étudier plus en détail une région et ses particularités et de déguster ce qui se fait de meilleur. Nous présenterons donc la région concernée à travers sa géographie, son climat, ses cépages et ses méthodes de vinifications.\r\nAprès avoir expliqué la méthode de dégustation, simple mais efficace, nous verrons, à travers une étude d’une dizaine de vins des meilleurs vignerons, les différentes facettes de chaque région. A chaque session, un petit livret vous sera remis avec le vocabulaire et la méthode de dégustation, la carte de la région étudiée, les noms des cépages et des appellations, ainsi que le détail des différents éléments étudiés lors de la séance\r\nCes séances s’adressent à tous, sans avoir de connaissances spécifiques au préalable, mais ont pour intérêt d’être complémentaires des sessions d’initiation à la dégustation.\r\n\r\n \r\nQuelques régions étudiées :\r\n\r\n \r\n\r\n1) Découverte des grands vins de Loire :\r\n\r\n    Thématique et déroulement de la dégustation :\r\n\r\nAprès un rappel de la méthode et du vocabulaire de la dégustation, vous étudierez les principales appellations (Chinon/ Saumur Champigny / Sancerre / Vouvray / Coteaux du Layon) et les cépages de cette région aux multiples facettes. La Loire produit des vins d’une grande diversité, des blancs secs aux liquoreux, des rouges fruités aux grands vins de garde. Découvrez les grands vins de cette magnifique région en dégustant une dizaine de vins des meilleurs vignerons.\r\n\r\n    Échantillon des vins proposés :\r\n\r\nSaumur Champigny Clos Rougeard 2004 / Saumur Champigny Thierry Germain « Terre chaude » 2001 / Sancerre « Culs de Beaujeu » 2003 du Domaine Cotat / Bourgueil « les Perrières » 2008 du domaine Breton / Chinon 1990, Domaine des Roches / Vouvray « Le Mont » 1996, Domaine Huet / Coteaux du Layon 1999, Domaine de Juchépie.\r\n\r\n \r\n\r\n2) Découverte des grands vins de la Vallée du Rhône :\r\n\r\n    Thématique et déroulement de la dégustation :\r\n\r\nLa région viticole du Rhône se compose de deux parties distinctes : les Côtes du Rhône Septentrionales et les Côtes du Rhône Méridionales. Elles ont des cépages différents, des sols différents mais aussi des climats relativement différents.\r\n\r\nNous verrons donc les spécificités des vins de ces deux parties qui produisent des vins dont la seule évocation du nom fait rêver : Côte-Rôtie, Hermitage, Cornas, Condrieu, Châteauneuf du Pape…\r\n\r\nAprès un rappel de la méthode et du vocabulaire de la dégustation, vous étudierez les principales appellations et les cépages de la région. Vous pourrez ensuite déguster et analyser les vins des meilleurs vignerons.\r\n\r\nEchantillons des vins proposés :\r\n\r\nCôte-Rôtie « Champin le Seigneur » 2006, Domaine Gerin / Saint Joseph 2008, Domaine Jean Louis Chave / Cornas « Chaillots » 2004, Domaine Thierry Allemand / Crozes-Hermitage blanc 2004, Domaine Dard et Ribo / Châteauneuf du Pape, Domaine de la Janasse 2005 / Cairanne « Ebrescade » 2008, Domaine Richaud.","options":[{"id":20014511,"name":"Formation Perfectionnement","price":65.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/61632375/-/perf-16685_140x140.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/61632375/-/perf-16685_140x140.jpg","width":140,"height":140}],"artists":[],"categories":[{"id":3264007,"name":"Chèques cadeaux","permalink":"cheques-cadeaux","url":"/category/cheques-cadeaux"}]},{"id":6276423,"name":"Formation Initiation","permalink":"initiation-degustation","position":4,"price":49.0,"default_price":49.0,"tax":0.0,"url":"/product/initiation-degustation","status":"active","on_sale":true,"created_at":"2012-05-24T23:00:58.000Z","description":"Sessions de 2h30 – Une dizaine de vins dégustés.\r\n\r\nCes sessions vous permettront de découvrir les arômes et les saveurs du vin et d’apprendre les techniques et le vocabulaire de la dégustation. Un premier pas dans le monde magique du vin !\r\n\r\nLa dégustation c’est la capacité à analyser les sensations perçues et les retranscrire grâce à un vocabulaire et une méthode simple mais précise. Vous possédez en vous tout le potentiel d’un bon dégustateur, mais vous ne savez sans doute pas l’utiliser. Le but est de vous enseigner cette méthode et ce vocabulaire grâce à un support pédagogique, de nombreux exercices de reconnaissances d’arômes, ainsi que la dégustation d’une dizaine de vins à chaque séance.\r\n\r\nNotre but est de rendre la dégustation ludique, accessible à tous : la dégustation doit rester avant tout un plaisir !\r\n\r\nNotre méthode de dégustation se décompose en 3 parties : le visuel, l’olfactif et le gustatif.\r\n\r\n    L’analyse visuelle : la vue est le premier contact du dégustateur avec le vin. La couleur, limpidité, brillance, fluidité vont permettre de collecter des renseignements sur chaque vin.\r\n    L’analyse olfactive : le but est de savoir mettre des mots sur les odeurs, développer la reconnaissance d’arômes par analogie avec toute la gamme de fruits, fleurs, épices et autres substances aromatiques que l’on rencontre dans la nature et que l’on a gardé en mémoire depuis la petite enfance. Nous proposerons donc de nombreux exercices de reconnaissance d’arômes, unique moyen pour développer la mémoire olfactive de chacun.\r\n    L’analyse gustative : c’est la partie la plus complexe de la dégustation. Il s’agit avant tout de mettre des mots sur les saveurs ressenties, mais aussi de percevoir la « structure » du vin à travers 3 phases : « l’attaque », le « milieu de bouche » et la « fin de bouche ».\r\n\r\n \r\n3 séances composent le chapitre « Initiation à la dégustation »\r\n\r\n \r\n\r\nInitiation à la dégustation : « LES CLEFS DE LA DÉGUSTATION »\r\n\r\nCette séance vous permettra d’apprendre la méthode de dégustation. Elle est composée de nombreux  exercices de reconnaissances d’arômes, d’un tour de France des grandes régions viticoles, et d’une dégustation et analyse d’une dizaine de vins (rouges et blancs) issus de nos meilleurs terroirs. Cette séance s’adresse à tous, sans avoir de connaissances spécifiques au préalable.\r\n\r\n \r\n\r\nInitiation à la dégustation : « ARÔMES ET CÉPAGES DES VINS BLANCS »\r\n\r\nCette formation vous permettra d’apprendre une méthode analytique de dégustation et de connaitre les principales  régions, appellations et cépages des vins blancs de France. Vous étudierez aussi les différences entre un vin blanc sec, doux, moelleux et liquoreux. Après un exercice de reconnaissance d’arômes, vous allez, bien évidemment, déguster et commenter une dizaine de vins blancs produits par les meilleurs domaines de chaque région. Cette séance s’adresse à tous, sans avoir de connaissances spécifiques au préalable.\r\n\r\n \r\n\r\nInitiation à la dégustation : « ARÔMES ET CÉPAGES DES VINS ROUGES »\r\n\r\nCette formation vous permettra d’apprendre une méthode analytique de dégustation et de connaitre les principales régions, appellations et cépages des vins rouges de France. Après un exercice de reconnaissance d’arômes, vous allez, bien évidemment, déguster et commenter une dizaine de vins rouges produits par les meilleurs domaines de chaque région. Cette séance s’adresse à tous, sans avoir de connaissances spécifiques au préalable.\r\n\r\nCes trois séances sont complémentaires, elles vous permettront de découvrir les arômes et saveurs du vin, d’apprendre les techniques de dégustation, les méthodes de vinification et les principaux accords mets/vins. Ce voyage sensoriel au travers des paysages viticoles vous donnera aussi les clefs pour parler d’un vin, le choisir au restaurant ou chez un caviste, et de l’associer aux mets.","options":[{"id":20014259,"name":"Initiation Dégustation","price":49.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/61631591/-/initiation_degrade-56908_140x140.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/61631591/-/initiation_degrade-56908_140x140.jpg","width":140,"height":140}],"artists":[],"categories":[{"id":3264007,"name":"Chèques cadeaux","permalink":"cheques-cadeaux","url":"/category/cheques-cadeaux"}]}]