[{"id":279147,"name":"The Informers - Bret Easton Ellis","permalink":"the-informers-bret-easton-ellis","position":1,"price":3.5,"default_price":3.5,"tax":0.0,"url":"/product/the-informers-bret-easton-ellis","status":"active","on_sale":false,"created_at":"2009-04-16T02:24:54.000Z","description":"Product Description\r\nDirk sees his best friend killed in a desert car wreck, then rifles through his pockets for a last joint before the ambulance comes. Cheryl, a wannabe newscaster, chides her future stepdaughter, 'You're tan but you don't look happy'. Jamie is a clubland carnivore with a taste for human blood. The characters go to the same schools and eat at the same restaurants. Their voices enfold us as seamlessly as those of DJs heard over a car radio. They have sex with the same boys and girls and buy from the same dealers. In short, they are connected in the only way people can be in L.A. - suffering from nothing less than the death of the soul. \"A writer at the peak of his powers...The book takes us from the first to the seventh circles of hell, from Salinger to De Sade.\" - Will Self. \"The Informers is spare, austere, elegantly designed, telling in detail, coolly ferocious, sardonic in its humour; every vestige of authorial sentiment is expunged.\" - \"New York Times.\" \"A spare and hypnotic prose style which beats out these lives of quiet desperation with a slow pulse as gentle as it is compelling...Ellis has been compared to Fitzgerald and here we see why.\" - \"Modern Review.\" \r\n\r\nAbout the Author\r\nBret Easton Ellis is the author of five novels and a collection of stories, which have been translated into twenty-seven languages. He divides his time between Los Angeles and New York.","options":[{"id":1169438,"name":"Default","price":3.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2085804/-/informers.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2085804/-/informers.jpg","width":500,"height":500}],"artists":[],"categories":[{"id":239816,"name":"Fiction","permalink":"fiction","url":"/category/fiction"}]},{"id":279151,"name":"Twelve by Nick McDonell","permalink":"twelve-by-nick-mcdonell","position":2,"price":3.5,"default_price":3.5,"tax":0.0,"url":"/product/twelve-by-nick-mcdonell","status":"active","on_sale":false,"created_at":"2009-04-16T02:28:46.000Z","description":"Review\r\n17-year-old Nick McDonell's debut novel centres around White Mike, an upper-class drug dealer, and the days just after Christmas leading up to a New Year's Eve party destined to go down in history for all the wrong reasons. For this is New York City, and the bored, ultra-rich teenagers who roam free with seemingly no parental guidance are jaded and tough, fed a steady diet of Camus, cynicism and concealed weapons. Hunter is a nice kid who likes to play basketball in Harlem. Jessica is an athlete, popular and self-confident. Molly and Tobias are models. Sara is beautiful and famous not only in her school but all the surrounding private boarding academies. Chris and Claude's parents are never home, so their parties are legendary. Timmy and Mark are two white boys desperate to be black. Andrew's a quiet guy who has enough connections to save him from total obscurity. All these kids need White Mike's assistance at some point or another, never more so than for some Twelve, a new drug unlike anything they've ever experienced before. When at last they all come together on New Year's Eve, the drugs come out. And then the guns. McDonell has the bold and confident voice of a teenager, and his characters are clearly well known to him, as is their way of life, their speech and their conduct. However, the sheer number of characters proves a burden as, aside from White Mike, only the barest of surfaces is scratched before hastily moving on the next character's brief sketch and relevance to the plot. For all the vibrant attitude and gritty realism, the novel's not quite three-dimensional enough. Comparisons have already been made with Bret Easton Ellis, and the climactic party scene is admittedly reminiscent of Less Than Zero. But this is a new generation of wasted youth, the younger siblings of Ellis's coked up late '80s kids, inheritors of false corporate social responsibility, political correctness and September 11th. Once McDonell polishes and focuses his narrative, he'll be an important voice for the 21st-century generation drowning in a sea of drugs and guns. ","options":[{"id":1169475,"name":"Default","price":3.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2085852/-/twelve.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2085852/-/twelve.jpg","width":185,"height":277}],"artists":[],"categories":[{"id":239816,"name":"Fiction","permalink":"fiction","url":"/category/fiction"}]},{"id":279154,"name":"Lucky by Alice Sebold","permalink":"lucky-by-alice-sebold","position":3,"price":3.5,"default_price":3.5,"tax":0.0,"url":"/product/lucky-by-alice-sebold","status":"active","on_sale":false,"created_at":"2009-04-16T02:30:28.000Z","description":"Review\r\nSebold is best known in this country for her bestselling novel, The Lovely Bones. Published in the UK for the first time, Lucky is an earlier work, the story of her own rape and its aftermath. The title derives from the comment of a police officer who told her that she was 'lucky' not to have been murdered. The memoir begins with an account of the rape itself. Sebold, an 18-year-old virgin, and a first-year student at Syracuse University, is walking back to campus one night when she is grabbed from behind by a man with a knife. The description of the brutal and vicious attack that follows is unsparing in its detail. Nonetheless, Sebold manages to persuade her attacker that she won't report him, and thus saves her own life. The story that follows is both harrowing and uplifting. Harrowing because Sebold finds that, as a rape victim, she doesn't receive the kindness and sympathy she might have expected - from the police, from her friends or even from her own family. Her father, on hearing that Sebold's attacker had dropped his knife in the struggle, asks: 'How could you have been raped if he didn't have the knife?' Uplifting because Sebold refuses to let the rape destroy her: 'You save yourself or you remain unsaved.' When the rapist is caught and tried, Sebold has to go through the trauma of cross-examination by a sneering defence barrister determined to undermine her evidence. Yet she triumphs; the court bailiff later tells her that she is the best rape witness he has ever seen. Sebold is unflinchingly honest about her feelings about what happened to her; this isn't an easy story of someone undergoing a trauma and overcoming it. On the contrary, Sebold's life goes to pieces - she starts drinking heavily and taking drugs - even as she convinces herself that she is unaffected by what has happened to her. Only years later does she realize that she is suffering from post-traumatic stress and that the experience has left deep psychological wounds. Yet even though she is unflinching in her account of the attack and its consequences, she is never self-pitying, never asks for sympathy. Don't be fooled into thinking, either, that this is just a memoir of a rape victim; Sebold is a fine writer and brings to her account a novelist's ability to tell a story. Horrifying though this book is, you'll find it hard to put down. And by the end, you'll find yourself feeling the deepest admiration for this exceptional woman. (Kirkus UK) ","options":[{"id":1169482,"name":"Default","price":3.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2085872/-/luck.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2085872/-/luck.jpg","width":500,"height":500}],"artists":[],"categories":[{"id":239813,"name":"Drama and Crime","permalink":"drama-and-crime","url":"/category/drama-and-crime"}]},{"id":279159,"name":"Bright Lights, Big City by Jay McInerney","permalink":"bright-lights-big-city-by-jay-mcinerney","position":4,"price":3.5,"default_price":3.5,"tax":0.0,"url":"/product/bright-lights-big-city-by-jay-mcinerney","status":"active","on_sale":false,"created_at":"2009-04-16T02:33:53.000Z","description":"Review\r\n'Probably the best book ever written about being young, about doing drugs and about music' Tony Parsons, Daily Express 'A rambunctious, deadly funny novel that goes for the right mark - the human heart' Raymond Carver 'McInerney earns his place in literary history with Bright Lights, Big City, the comic morality tale of a spoilt young man making a mess of his life in Manhattan a landmark evocation of the wasteful decade it lampoons' Guardian 'The seminal novel of the 1980s' New York Times ","options":[{"id":1169484,"name":"Default","price":3.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2085928/-/bl.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2085928/-/bl.jpg","width":500,"height":500}],"artists":[],"categories":[{"id":239816,"name":"Fiction","permalink":"fiction","url":"/category/fiction"}]},{"id":279162,"name":"Manic by Terri Cheney","permalink":"manic-by-terri-cheney","position":5,"price":3.5,"default_price":3.5,"tax":0.0,"url":"/product/manic-by-terri-cheney","status":"active","on_sale":false,"created_at":"2009-04-16T02:35:39.000Z","description":"Manic: A Woman in Pain. A Life in Chaos. The Courage to Fight a Secret Madness. by Terri Cheney\r\n\r\nSynopsis\r\nA harrowing memoir of life with manic depression. All In My Head reveals the terrible reality of the condition and it's devastating impact on the life of a young woman. 'When I'm manic all I remember is the moment. When I'm depressed all I remember is the pain.' Terri Cheney Terri Cheney's story starts with her rape.Occuring at the height of her mania, Terri had spun out of control on many an occasion, but never had she been hurt as brutally or as badly as the night she was raped by a complete stranger. Graphically telling the account of that night is the beginning of Terri's journey, from beautiful, well-educated and successful lawyer based in LA to multiple suicide attempts, nights in jail, her eating disorder, broken jobs, ruined friendships and finally electroshock treatment. In this painfully honest account of a life lived in extremes, one minute Terri, the competent, professional lawyer would be crouched beneath her desk at work, paralyzed by depression; the next she'd be flying kites off the edge of a cliff in a violent thunderstorm.One minute she's euphoric from a successful date with a cute guy, the next she's eating remains of food left on her pillowcase, too depressed to get out of bed.\r\nFrom her early 20s Terri struggled with manic depression and there seemed to be no treatment, no help. Rounds of medication and even electroshock therapy -- this a mere ten years ago -- proved useless. Only the shock of a brutal rape and subsequent suicide attempt would finally lead Terri to the help she so desperately wanted and needed. All in my head is a startling and moving account of Terri's battle with manic depression, a battle she continues to fight.\r\n","options":[{"id":1169495,"name":"Default","price":3.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2085956/-/man.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2085956/-/man.jpg","width":500,"height":500}],"artists":[],"categories":[{"id":239812,"name":"Non-Fiction","permalink":"non-fiction","url":"/category/non-fiction"}]}]