[{"id":7280791,"name":"Référentiel EarthCheck Version 3.5 Juin 2012","permalink":"referentiel-earthcheck-version-3-5-juin-2012","position":1,"price":175.0,"default_price":175.0,"tax":0.0,"url":"/product/referentiel-earthcheck-version-3-5-juin-2012","status":"active","on_sale":false,"created_at":"2012-09-18T09:07:49.000Z","description":"EarthCheck est le seul programme d'analyse comparative et de certification au monde dans le domaine du tourisme et des voyages qui s'appuie sur les compétences scientifiques et les logiciels d'EarthCheck. A l’origine du programme : une décision du gouvernement australien d’établir une organisation de recherche scientifique et stratégique spécifiquement pour le tourisme.  Cette organisation, le Sustainable Tourism Cooperative Research Centre (STCRC), a été fondée en 1997, et est devenue par la suite la plus grande organisation de recherche sur le tourisme dans le monde.\r\n\r\nEarthCheck applique les principes de l'Agenda 21 pour le développement durable, qui a été ratifié par 182 chefs d'état à l'occasion du Sommet de la Terre, organisé par les Nations Unies à Rio de Janeiro en 1992. Il propose aux entreprises un cadre pour les aider à atteindre les objectifs en matière de tourisme durable définis dans le rapport final du Sommet de la Terre pour le développement durable qui s'est tenu à Johannesbourg en 2002.\r\n\r\nLe Référentiel EarthCheck est reconnu par le Global Sustainable Tourism Criteria (GSTC, Critères mondiaux de tourisme durable) et est conforme à l'Accord de Mohonk qui expose les directives et les principes d'un programme de certification internationale en faveur du tourisme durable.\r\n\r\nLes données scientifiques et les rapports d'EarthCheck sont alignés sur les directives du GIEC (Groupe d'experts intergouvernemental sur l'évolution du climat) pour l'inventaire des émissions de gaz à effet de serre, le protocole relatif aux gaz à effet de serre du WBCSD (World Business Council for Sustainable Development, conseil mondial des entreprises pour le développement durable), et la 14064 série des normes ISO (International Organisation for Standardisation, Organisation Internationale de Normalisation) sur les gaz à effet de serre.\r\n\r\nEarthCheck s'associe à des acteurs majeurs du secteur du tourisme et des voyages pour établir et maintenir de bonnes pratiques sociales et environnementales, apporter le maximum de bénéfice à toutes les parties intéressées et garantir aux clients éco-responsables un programme crédible placé sous le signe de l'intégrité, de la transparence et de la rigueur scientifique.\r\n\r\nLa marque EarthCheck est synonyme d'optimisation des performances environnementales et sociales, d'amélioration des interactions avec la communauté et d'économies grâce à une utilisation plus efficace des ressources. ","options":[{"id":23050583,"name":"Default","price":175.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/71420091/-/Standard.FR.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/71420091/-/Standard.FR.JPG","width":673,"height":954}],"artists":[],"categories":[{"id":3612825,"name":"eBook","permalink":"ebook","url":"/category/ebook"}]},{"id":7277847,"name":"Unternehmensstandard Version 3.5 Juni 2012","permalink":"unternehmensstandard-version-3-5-juni-2012","position":2,"price":175.0,"default_price":175.0,"tax":0.0,"url":"/product/unternehmensstandard-version-3-5-juni-2012","status":"active","on_sale":false,"created_at":"2012-09-18T03:23:00.000Z","description":"EarthCheck ist das einzige globale Benchmark- und Zertifizierungsprogramm für nachhaltiges Reisen und nachhaltigen Tourismus, welches wissenschaftlich durch die Software von EarthCheck untermauert wird. Dieses wissenschaftliche EarthCheck – System wurde vom australischen „Cooperative Research Centre for Sustainable Tourism” in 10 jähriger Arbeit entwickelt. \r\n\r\nEarthCheck basiert auf den Prinzipien der Agenda 21 für nachhaltige Entwicklung, unterstützt von 182 Staatsoberhäuptern auf dem Klimagipfel 1992 in Rio de Janeiro. EarthCheck bietet Organisationen ein Rahmenwerk, um die angestrebten Ergebnisse für nachhaltigen Tourismus, die im Endbericht des Klimagipfels für nachhaltige Entwicklung in Johannesburg 2002 beschrieben werden, zu erreichen. Der EarthCheck Standard ist von der „Global Sustainable Tourism Criteria (GSTC)“ – Initiative anerkannt und erfüllt das Mohonk Agreement, welches die Richtlinien und Prinzipien für ein internationales nachhaltiges Tourismus- Zertifizierungsprogramm beschreibt.\r\n\r\nDie EarthCheck- Wissenschaft und das Reporting sind mit den Leitlinien des „Intergovernmental Panel for Climate Change (IPCC)“ für nationale Treibhausgasinventare, mit dem Greenhouse Gas Protocol des „World Business Council for Sustainable Development (WBCSD)“ und mit den Standards zur Treibhausgasberechnung der ISO 14064 abgestimmt. \r\n\r\nEarthCheck kooperiert mit führenden Reise- und Tourismusorganisationen, um beste ökologische und soziale Praktiken zu erzielen und zu erhalten, sowie allen interessierten Parteien maximalen Nutzen sowie Verbrauchern Sicherheit zu bieten. EarthCheck richtet sich an alle Verbraucher auf der Suche nach einem glaubwürdigen Programm, das sich durch Integrität, Transparenz und wissenschaftliche Genauigkeit auszeichnet. \r\n\r\nDie Marke EarthCheck steht für bessere ökologische und soziale Leistung, verbesserte Interaktion mit der Gemeinde und Einsparungsmöglichkeiten durch effizientere Ressourcennutzung. Sie bietet einen Wiederkennungswert und wirkt verkaufsfördernd auf dem weltweiten Verbrauchermarkt. \r\n","options":[{"id":23042135,"name":"Default","price":175.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/71390827/-/Standard.GER.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/71390827/-/Standard.GER.JPG","width":583,"height":829}],"artists":[],"categories":[{"id":3612825,"name":"eBook","permalink":"ebook","url":"/category/ebook"}]},{"id":7277815,"name":"Estándar de la Compañía Versión 3.5 Junio 2012","permalink":"estandar-de-la-compania-version-3-5-junio-2012","position":3,"price":175.0,"default_price":175.0,"tax":0.0,"url":"/product/estandar-de-la-compania-version-3-5-junio-2012","status":"active","on_sale":false,"created_at":"2012-09-18T03:19:46.000Z","description":"EarthCheck es el único programa global de Benchmarking y Certificación para actividades sostenibles de viajes y turismo sustentado por la ciencia y el software EarthCheck. Los sistemas científicos específicos de EarthCheck fueron desarrollados por el Centro Cooperativo de Investigación para Turismo Sustentable en Australia durante un período de 10 años.\r\n\r\nEarthCheck está basado en los principios de la Agenda 21 para el Desarrollo Sostenible suscritos por 182 jefes de estado en la Cumbre de la Tierra de las Naciones Unidas en Río de Janeiro, en 1992. EarthCheck brinda un marco que permite a las organizaciones lograr los resultados deseados en materia de turismo sustentable, tal como se detallan en el informe final de la Cumbre Mundial para Desarrollo Sostenible celebrada en Johannesburgo en 2002.\r\n\r\nEl estándar de EarthCheck es reconocido por los Criterios Globales para Turismo Sostenible (GSTC), y cumple con el Acuerdo Mohonk, en el cual se detallan los lineamientos y principios para un programa internacional de  certificación en turismo sostenible.\r\n\r\nLa ciencia y las herramientas para generación de informes de EarthCheck están relacionadas con los Lineamientos sobre Inventarios Nacionales de Gases de Efecto Invernadero del Panel Intergubernamental para el Cambio Climático (IPCC), el Protocolo de Gases de Efecto Invernadero de la Comisión Mundial de Comercio para Desarrollo Sostenible (WBSCD), y la norma 14064 de la Organización Internacional Estandarización (ISO) de estándares para el registro de emisiones de gases de efecto invernadero.\r\n\r\nEarthCheck coopera con las principales organizaciones de viaje y turismo del mundo para lograr y mantener buenas prácticas medioambientales y sociales, generar los máximos beneficios para todas las partes interesadas y dar confianza a los consumidores interesados que buscan un programa creíble que tenga integridad, transparencia y rigor científico.\r\n\r\nLa marca EarthCheck implica un mejor desempeño desde el punto de vista medioambiental y social, mejores relaciones con la comunidad y ahorros derivados de un uso más eficiente de los recursos. Otorga reconocimiento y valor promocional para un mercado global de consumidores.\r\n","options":[{"id":23042015,"name":"Default","price":175.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/71390467/-/Standard.ESP.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/71390467/-/Standard.ESP.JPG","width":584,"height":828}],"artists":[],"categories":[{"id":3612825,"name":"eBook","permalink":"ebook","url":"/category/ebook"}]},{"id":7072033,"name":"公司标准   3.5版本  2012年6月","permalink":"3-5-20126","position":4,"price":175.0,"default_price":175.0,"tax":0.0,"url":"/product/3-5-20126","status":"active","on_sale":false,"created_at":"2012-08-27T06:15:57.000Z","description":"EarthCheck是全球唯一的以EarthCheck科学体系为基础，为旅游业的可持续发展进行基准评测和认证的项目。EarthCheck科学体系由澳大利亚旅游业可持续发展合作研究中心（STCRC）经过十余年的时间建立，专家团队每年对关键内容进行评估，以确保符合有关温室气体协议和认证要求的国际标准。\r\n\r\nEarthCheck以联合国21世纪议程的可持续发展原则为基础。这一原则在1992年联合国里约热内卢地球高峰会议上由182个国家的首脑一致赞成通过。EarthCheck为企业实现旅游可持续发展提供科学的框架和路径，体现了2002年在约翰内斯堡召开的可持续发展世界峰会最终报告中提出的倡议。\r\n\r\nEarthCheck标准得到全球旅游可持续发展标准（GSTC）的认可，并符合Mohonk 协议，该协议为国际旅游可持续发展认证项目提供了指导原则。EarthCheck科学体系和评测报告满足联合国政府间气候变化委员会（IPCC)关于国家温室气体清查指导原则，可持续发展世界商业委员会（WBCSD)温室气体条款，国际标准化组织（ISO)14064关于温室气体会计核算标准。\r\n\r\n为了实现并且保持良好的环境和社会实践，EarthCheck通过科学严谨的评测体系服务于主要的旅游机构和组织，为所有相关群体提供最大利益，也以其公正、透明和科学的平台为消费者提供负责任的选择。 \r\n","options":[{"id":22382515,"name":"Default","price":175.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/69370187/-/Standard.CN.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/69370187/-/Standard.CN.JPG","width":680,"height":958}],"artists":[],"categories":[{"id":3612825,"name":"eBook","permalink":"ebook","url":"/category/ebook"}]},{"id":7057685,"name":"EarthCheck Company Standard Ver 3.5 June 2012","permalink":"earthcheck-company-standard-ver-3-5-june-2012","position":5,"price":175.0,"default_price":175.0,"tax":0.0,"url":"/product/earthcheck-company-standard-ver-3-5-june-2012","status":"active","on_sale":false,"created_at":"2012-08-25T08:26:14.000Z","description":"EarthCheck is the only global Benchmarking and Certification program for sustainable travel and tourism underpinned by the science and software of EarthCheck. EarthCheck's scientific systems were developed by the Cooperative Research Centre for Sustainable Tourism in Australia over a 10 year period.\r\n\r\nEarthCheck is built on the Agenda 21 principles for Sustainable Development endorsed by 182 Heads of State at the United Nations Rio De Janeiro Earth Summit in 1992. EarthCheck provides a framework for organisations to achieve the desired outcomes for sustainable tourism as set out in the final report of the World Summit for Sustainable Development held in Johannesburg in 2002.\r\n\r\nThe EarthCheck standard is recognised by the Global Sustainable Tourism Criteria (GSTC) and complies with the Mohonk Agreement which outlines the guidelines and principles for an international sustainable tourism certification program.\r\n\r\nEarthCheck science and reporting is aligned with the Intergovernmental Panel for Climate Change (IPCC) Guidelines for National Greenhouse Gas Inventories, the World Business Council for Sustainable Development (WBCSD) Greenhouse Gas Protocol, and the International Organisation for Standardisation (ISO) 14064 range of standards for greenhouse gas accounting.\r\n\r\nEarthCheck partners with leading travel and tourism organisations to achieve and maintain good environmental and social practice, deliver maximum benefit to all interested parties and provide confidence for concerned consumers who are seeking a credible program which has integrity, transparency and scientific rigour.\r\n\r\nThe EarthCheck brand signifies better environmental and social performance, improved community interactions and savings through more efficient use of resources. It provides recognition and promotional support to a global consumer market.","options":[{"id":22343943,"name":"Default","price":175.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/69236299/-/CompanyStd3.5_ENG.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/69236299/-/CompanyStd3.5_ENG.JPG","width":452,"height":639}],"artists":[],"categories":[{"id":3612825,"name":"eBook","permalink":"ebook","url":"/category/ebook"}]},{"id":7056779,"name":"EarthCheck Flags","permalink":"earthcheck-flags","position":6,"price":32.0,"default_price":32.0,"tax":0.0,"url":"/product/earthcheck-flags","status":"active","on_sale":false,"created_at":"2012-08-25T05:35:09.000Z","description":"Join with similar communities and businesses all over the world by flying the flag.\r\n\r\nthe planet deserves more than half measures","options":[{"id":22341631,"name":"Default","price":32.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/69227411/-/EarthCheck_DTMD_Pata.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/69227411/-/EarthCheck_DTMD_Pata.jpg","width":858,"height":587},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/69243043/-/Park_Plaza_Beijing_West_Photo_with_Earth_Check_Flag__2_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/69243043/-/Park_Plaza_Beijing_West_Photo_with_Earth_Check_Flag__2_.JPG","width":448,"height":300},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/69243059/-/Dusit_Photos_2.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/69243059/-/Dusit_Photos_2.JPG","width":750,"height":1000}],"artists":[],"categories":[{"id":3615939,"name":"Flags","permalink":"flags","url":"/category/flags"}]}]