[{"id":3955682,"name":"Movement","permalink":"movement","position":1,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/movement","status":"active","on_sale":true,"created_at":"2011-06-20T17:06:40.000Z","description":"ONLY 20 COPIES OF THE PHYSICAL VERSION WILL BE MADE, WITH THE FIRST 5 SIGNED BY WEEKEND REVOLUTIONARIES.\r\n\r\n'Movement' is the 4th studio album by Australian electronic music project Weekend Revolutionaries. Written and recorded over the course of 2 months between November 2010 and January 2011, the album is the most fully realised long-player in the Weekend Revolutionaries catalogue to date.\r\n\r\nConsisting of lush, emotive soundscapes, propulsive club rhythms and urgent lead lines, 'Movement' is an examination of the connections developed between human beings in city life and the physical concept of moving from one place to another, particularly the urban commute in the metropolitan sprawls of places like Tokyo and London.\r\n\r\nStylistically 'Movement' could be considered a hybrid of the reverb-drenched 80s revivalist sounds of chillwave and the Balearic house music of 90s Ibiza, while retaining a sense of undeniable modernity. Certain elements hark back to the excitement and unpredictability of the Madchester rave scene and the exotic sounds of European underground disco. The sounds of New Order, M83 and Delorean are all recalled at various points in the record.\r\n\r\n'Movement' evokes nostalgic memories of club culture and heady all-night raves beneath seemingly endless sunsets and transports the listener to a different time and place with every song. There is an undercurrent of the urgency and tension of inner city nightlife running throughout the record. Most importantly, 'Movement' is certainly the most developed, forward-thinking, captivating and immersive Weekend Revolutionaries record yet.","options":[{"id":13141710,"name":"Special Edition with bonus 'Summer Forever' EP","price":24.99,"sold_out":false,"has_custom_price":true},{"id":13141712,"name":"Standard Edition","price":19.99,"sold_out":false,"has_custom_price":false},{"id":13141714,"name":"Super Deluxe 5CD Pack with 'Coastal Mentality', 'Post-Seachange', 'Surveillance', 'Summer Forever' and 'Movement'","price":69.99,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":4.99,"amount_with_others":4.99,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":9.99,"amount_with_others":9.99}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/38566568/-/Art600px.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/38566568/-/Art600px.jpg","width":600,"height":600}],"artists":[],"categories":[{"id":1618032,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2710058,"name":"Coastal Mentality","permalink":"coastal-mentality","position":2,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/coastal-mentality","status":"active","on_sale":true,"created_at":"2010-08-20T16:23:19.000Z","description":"LIMITED TO 20 COPIES\r\n\r\n'Coastal Mentality' is the debut studio album by the current incarnation of Australian one-man-band Weekend Revolutionaries. It will be released worldwide on April 27, 2011. The physical release will be limited to just 20 copies and will be available exclusive to the Weekend Revolutionaries Big Cartel Store.\r\n\r\n'Coastal Mentality' is an emotive synth-based album with ambient elements, and seeks to explore the inextricable relationship between atmospheric weather and emotion. Recorded over 6 months between September 2009 and March 2010, 'Coastal Mentality' contains 14 tracks of ethereal synth-pop and introspective ambient music.\r\n\r\nFrom the lush soundscapes of 'Lucid Experience' and 'Union Square', to the atmospheric breakdowns of 'Rain Shadow' and 'Away', and the anthemic pop of 'Dreams Run Dry' and 'Haze', 'Coastal Mentality' combines catchy pop melodies with downtempo ambient sounds to create a unique mix of optimism and reflection.\r\n\r\nPostage is $5 to NSW, $7 to Australian locations outside NSW, $10 to Asia and $12 to Africa, Europe and the Americas.","options":[{"id":9533192,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":3.99,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":9.99,"amount_with_others":9.99}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/26144075/-/coastalmentalityart.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/26144075/-/coastalmentalityart.jpg","width":800,"height":800}],"artists":[],"categories":[{"id":1618032,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2828812,"name":"Post-Seachange","permalink":"post-seachange","position":3,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/post-seachange","status":"active","on_sale":true,"created_at":"2010-10-29T08:59:43.000Z","description":"LIMITED TO 20 COPIES\r\n\r\n'Post-Seachange' is the second LP released by Australian electronic music project Weekend Revolutionaries. Recorded between March and July 2010, the album is more expansive in style and epitomises a more widescreen style for Weekend Revolutionaries. The physical release will be limited to just 50 copies and will be available exclusive to the Weekend Revolutionaries Big Cartel Store.\r\n\r\nThe companion album of 'Post-Seachange', entitled 'Coastal Mentality', was an emotive synth-based album with ambient elements, seeking to explore the inextricable relationship between atmospheric weather and emotion. 'Post-Seachange' seeks to delve conceptually into life after the physical and metaphorical 'seachange', exploring both coastal and urban elements of life.\r\n\r\nThe album consists of 16 tracks spread over 80 minutes, and epic tracks like 'Tunnels' and 'Fly and Fall' explore new ground in comparison to previous Weekend Revolutionaries material. 'Last Journey' and 'Different Island' are expansive soundscapes with melodic synth lead lines and openly present a sense of hope and ambition, while tracks such as 'Industry' and  'Overpass' convey a sense of anxiety and nostalgia respectively. The album encompasses a range of moods and is designed to be a unique experience for each individual listener.\r\n\r\n\r\nThe digital version of the album can be purchased <a href=\"http://weekendrevolutionaries.bandcamp.com/album/post-seachange>here</a>.","options":[{"id":9888730,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":4.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27384074/-/folder.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27384074/-/folder.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":1618032,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2828815,"name":"Surveillance","permalink":"surveillance","position":4,"price":19.99,"default_price":19.99,"tax":0.0,"url":"/product/surveillance","status":"active","on_sale":true,"created_at":"2010-10-29T09:02:56.000Z","description":"LIMITED TO 20 COPIES\r\n\r\nRecorded between July and October 2010, the third installment in the Weekend Revolutionaries trilogy is entitled ‘Surveillance’. The sound of the record is influenced by genres of music such as dubstep and jungle as well as the traditional Weekend Revolutionaries sound. The physical release will be limited to just 50 copies and will be available exclusive to the Weekend Revolutionaries Big Cartel Store.\r\n\r\nThe idea of the album is that each song is a chapter of a story, following a nameless, faceless character through a journey based on the fact that wherever we go we are being watched, be it surrounded by nature (the rain and storms), urban environments (train stations, factories) or even in transit from one place to another. The paranoia of being under constant surveillance is represented in the opening track of ‘Beneath’, where even in the apparent solitude of nature (in particular, rain), the persona cannot escape the feeling of being watched. ‘Beams’ is a sort of orientation, where the character tries to work out their place in the world. The first attempt at escape occurs on ‘Stations’, where the character attempts to find solace by jumping aboard a train. The attempt is unsuccessful, and the character finds himself/herself still trapped in the city. There is a sense of tension present throughout the album, best epitomised by the track ‘Air Vent’, where the crackles and hisses reverberate back and forth. On ‘Transit’, the character takes a flight out of the city in order to escape the paranoia and tension of constantly being watched, and this time the escape is successful, as the blissful feeling of having finally broken away on ‘Surface’ shows. The journey from ‘Beneath’ to ‘Surface’ is only complete at the end of the record.\r\n\r\nThe digital version of the album can be purchased <a href=\"http://weekendrevolutionaries.bandcamp.com/album/surveillance\">here</a>.","options":[{"id":9888734,"name":"Default","price":19.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.99,"amount_with_others":3.99,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27384114/-/folder.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27384114/-/folder.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":1618032,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]