[{"id":5812383,"name":"The Morning Came To Me LP","permalink":"the-morning-came-to-me-lp","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/the-morning-came-to-me-lp","status":"active","on_sale":true,"created_at":"2012-03-29T22:12:59.000Z","description":"\"The Morning Came To Me...It's been a long time coming, but we finally finished it literally at the last moments possible.\"\r\n-Kevin Kim in the \"The Morning\" Liner Notes\r\n\r\nA culmination of 2 years worth of work, this album was funded through Kickstarter by our fans, friends and family. Produced by Chad Bamford (Weezer, Plain White T's, Angels & Airwaves), we feel this album accurately portrays the TNB missionary statement of music for Christ. ","options":[{"id":18645909,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":6.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/57612643/-/Screen_Shot_2012-04-05_at_11.12.46_AM.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/57612643/-/Screen_Shot_2012-04-05_at_11.12.46_AM.jpg","width":998,"height":897}],"artists":[],"categories":[{"id":294024,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":363411,"name":"Break of Dawn LP","permalink":"break-of-dawn-lp","position":2,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/break-of-dawn-lp","status":"active","on_sale":false,"created_at":"2009-08-06T10:26:10.000Z","description":"Although often portrayed as joyful and painless, the Christian Walk (at least in America) may be better described as one filled with poor leadership, sorrows, mistakes, jadedness, and weariness. The scriptures are full of stories in which the patriarchs of our faith had emotional breakdowns (Elijah running from Jezebel, Joseph weeping over the betrayal of his brothers, David's mourning over the loss of an illegitimate child, the prodigal's reflection).\r\n\r\nThe Nehemiah Band's debut album \"Break of Dawn\" identifies with these sentiments in the christian life. The record presents topics such as being hurt by spiritual leaders, growing jaded to what was once youthful zeal, the aftermath of an emotionally promiscuous past, and gossip within the church.\r\n\r\nHowever, the songs do more than just identify with these sorrows!\r\n\r\nIn the biblical stories mentioned in parenthesis above, there are always follow up moments of restoration, like the breaking of a dawn. (Elijah's mountaintop encounter, Joseph's forgiveness and reconciliation, David's heartfelt psalms, the father's unconditional love).\r\n\r\nLikewise, through this album, The Nehemiah Band presents hope and remedy to the anxieties and hardships of the Christian life. Employing the power of lyric and song, the band makes efforts to rebuild the church and end the \"silent exodus\" (an epidemic of young people leaving the church after graduating high school).\r\n\r\nTheir independent debut album is set for release on the 29th of August 2009.\r\n\r\nTrack Listing:\r\n1 Words\r\n2 Fadeaway J\r\n3 To Do It My Way\r\n4 Dream Again\r\n5 i can hear the sound of a coming rain and the earth is about to shake\r\n6 Closer\r\n7 To The Fatherless\r\n8 I Live\r\n9 1 Thru 7\r\n10 Triple Reverse Psychology\r\n11 Press Into You\r\n\r\n*This is a CD Enhanced product. When inserted to your windows or mac based computer, you will gain access to more songs, videos, and a 75-page book laden with all things tnb, including lyrics, liner notes, biblical commentary, and member biographies. ","options":[{"id":1477149,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/2884297/-/cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/2884297/-/cover.jpg","width":376,"height":349}],"artists":[{"id":8430,"name":"The Nehemiah Band","permalink":"the-nehemiah-band","url":"/artist/the-nehemiah-band"}],"categories":[{"id":294024,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]