[{"id":14783688,"name":"Community Detox - February 2014","permalink":"community-detox-february-2014","position":1,"price":69.0,"default_price":69.0,"tax":0.0,"url":"/product/community-detox-february-2014","status":"active","on_sale":false,"created_at":"2013-11-12T01:40:37.000Z","description":"It’s back! My online Community Detox is the answer to fatigue, weight gain and low vitality! <strong>Kicking off February 1st 2014,</strong> join in the experience of a community who are <strong>passionate about achieving results</strong>, not just talking about it. Delivered via a closed Facebook group you have 24/7 accessibility to an endless supply of information. \r\n\r\n<strong>Sign up and receive:</strong>\r\n\r\n\r\n•\tthe official Community Detox book with all the information in one convenient location\r\n\r\n•\t4 weeks of menu plans, recipes & shopping lists\r\n\r\n•\thealth based informative 1-2 minute videos \r\n\r\n•\ta list of resources, a \"go to\" guide\r\n\r\n•\taccess to a 24/7 Facebook page where myself and my team will be there to answer questions and share tips. You will hear from a group of like minded individuals also looking for exceptional results. It's all about leveraging your results through your \"circle of influence\"!\r\n\r\n•\taccess to live Q&A's with leading industry experts\r\n\r\n•\taccess to CD member discount offers\r\n\r\n•\tinvites to CD events such as shopping tours, WICD brunch \r\n\r\n•\tinspiration quotes that will fire your engine \r\n\r\n•\ta buddy system if you don't have one\r\n\r\n•\tthe chance to have a product of your choice reviewed by our panel of experts\r\n\r\n•\t30 days of amazing support and positive energy\r\n\r\n•\tall the information you will ever need to guarantee you reach your health goal!\r\n\r\n\r\nMany of us are feeling tired, frumpy and bloated by this time of year and the easiest way to put the bounce back in your step is by detoxing. Environmental toxins, preservatives, pesticides, stress, alcohol and coffee shift your body into an acidic state where you easily put on weight and lack energy. By eliminating these harmful factors from your life your body will be able to return to its natural state of vibrant health.\r\n\r\n<strong>Detox is the perfect solution to alleviate:\r\n\r\n•\tWinter weight gain\r\n•\tRecurrent bloating and sluggishness\r\n•\tIrregular bowels\r\n•\tSkin breakouts\r\n•\tLethargy and fatigue</strong>\r\n\r\nThroughout detox I will be sharing with you over ten years of experience and information that my clients love. <strong>My menu plans, shopping lists, recipes and tips will help assist in a seamless transition to the very best version of yourself and ensure you get incredible results</strong>.\r\n\r\nWe have Resident Gurus that can answer your questions as well as many Preferred Practitioners that can help you on a personal level!   \r\n\r\nLast October the Community Detox was astounding and I couldn’t believe how much weight people lost and energy they gained.  What completely blew me away was <strong>how supportive everyone was and how motivating the group was. It was like having a team of people cheering you on and keeping you accountable</strong>.\r\n\r\nI thoroughly recommend joining up with a Detox buddy for some extra accountability. <strong>The group will keep you motivated and I will keep you excited the entire 30 days with my yummy food ideas!</strong>\r\n\r\nIf one of your goals is to lose weight then I highly recommend taking my <a href=http://emmasutherland.bigcartel.com/product/emma-s-weight-loss-drops>Weight Removal Drops</a> as they work synergistically to get better results.\r\n\r\n\r\nRead what previous Community Detoxers had to say:\r\n\r\n•\tEmma's Community Detox is awesome!!! She uses an online environment & social networking to create a motivating & inspiring group where participants access her amazing wealth of knowledge & passion and that of her hand picked experts to enable a complete focus on health and wellbeing for the month. Everything from nutrition, exercise, skin care, hormonal health and psychology is covered. I feel physically and emotionally fantastic as a result of doing the detox and importantly feel more knowledgeable, empowered & motivated to look after my health & wellbeing moving forward. Thanks Emma - you're a gem!!!\r\n\r\n\t•\tEmma Sutherland's Community Detox is the easiest way to Detox.  All you need is courage to start and the rest will be a piece of Cake (I mean Kale!).  The advice and support is something you cannot put a price on.  It has changed my life.  A couple of bad days lead to a whole new world of great days filled with energy, vitality and positive outlook.  I can't stop telling people about this program.  Emma, you have given so many the strength to change their lives, and you should be very proud of that.  \r\n\r\n\t•\tGroup therapy remote style! An online environment that provides collective support, motivation, advice & info sharing to keep the commitment to the detox process front of mind.\r\n\r\n•\tI would recommend Emma's community detox to anyone. So much effort is put into this to prepare you and help you through the whole journey. The closed community format gives you confidence to express yourself and to learn and share with the group, which is fantastic. Unlike a detox you may do at home by yourself this gives you support from Emma and the experts all the way through. It really is a life changing experience both physically and mentally. Everyone should embrace the chance to do this!","options":[{"id":47906955,"name":"Default","price":69.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127415832/-/EMMA-29.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127415832/-/EMMA-29.jpg","width":360,"height":240}],"artists":[],"categories":[{"id":3243419,"name":"Online Services","permalink":"online-services","url":"/category/online-services"}]},{"id":12946257,"name":"Acute Nutrition Question","permalink":"acute-nutrition-question","position":2,"price":9.95,"default_price":9.95,"tax":0.0,"url":"/product/acute-nutrition-question","status":"active","on_sale":false,"created_at":"2013-08-13T21:10:08.000Z","description":"Are you confused about nutrition and what you or your family should be eating? <strong>Do you work with mums and bubs who are having challenges that could be helped with the right nutritional advice?</strong>\r\n\r\nIf you are like so many of my clients or colleagues, you may find it challenging to access university qualified naturopathic health care – perhaps you are overseas, live interstate or are looking after a tiny baby at home. \r\n\r\nAs part of my training to become an International Infant Sleep Consultant, I have seen how critical it is to get the right nutritional advice - <strong>it can mean the difference between a baby who cries all night with colic or a baby who is comfortable and happy.</strong>\r\n\r\nPurchase your Acute Nutrition Question and then use my\r\n<strong><a href=http://www.emmasutherland.com.au/index.php/contact-me/>Contact Form</a> </strong>to send me your query. Don’t waste another minute with Dr Google, confusing health food aisles or conflicting advice when in a few simple steps you can access me!\r\n\r\nPlease note that recommended products are not included in the cost and you will receive one email reply - not a series of emails. Turnaround time is approximately 48 hours and the more information I have the more specific are my recommendations. \r\n\r\n<strong>\"I recently had Emma assist me in helping me sort out what was upsetting my seven month old sons stomach. Emma immediately identified the possible causes and made recommendations to adjust his diet accordingly. Since then I have noticed a huge improvement. Prior to dealing with Emma I had explored a lot of different kind of options/resources which did not help. \r\nI would recommend Emma to anyone who is experiencing any problems with their children. Emma was very friendly and quick to assist. Thanks very much Emma.\" Sheree Tualaulelei </strong>","options":[{"id":41285634,"name":"Default","price":9.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122731485/-/EMMA-06.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122731485/-/EMMA-06.jpg","width":360,"height":504}],"artists":[],"categories":[{"id":3243419,"name":"Online Services","permalink":"online-services","url":"/category/online-services"}]},{"id":12714270,"name":"50 Foods That Will Change Your Life","permalink":"50-foods-that-will-change-your-life","position":3,"price":35.0,"default_price":35.0,"tax":0.0,"url":"/product/50-foods-that-will-change-your-life","status":"active","on_sale":false,"created_at":"2013-08-01T11:56:58.000Z","description":"Get the facts. Get the recipes. Eat your way to wellbeing.\r\n\r\nMy book will inspire you to <strong>nourish yourself, become educated about the foods you need to eat and find a deep sense of connection with your food by learning its incredible health benefits.</strong>\r\n\r\nOur philosophy is that food really can be your medicine. By eating certain ingredients that address your health concerns you can improve your vitality!\r\n\r\nFrom increasing your vitality and boosting your brainpower to losing weight and preventing disease – these fifty familiar ingredients have a whole range of positive effects on women’s health. They taste pretty great, too.\r\n\r\nHome economist Michelle Thrift and I have teamed up and drawn on our extensive experience to give you the lowdown on how the foods we eat can change our lives.\r\n\r\nWith comprehensive information on the nutrients, vitamins, minerals and all the other good stuff, along with <strong>more than 250 ways to get the ingredients into your everyday diet – from handy tips to easy recipes –</strong> you have everything you need to make the right food choices for you.\r\n\r\nIf you want your copy personally signed simply send me an email at emma@emmasutherland.com.au when you place your order!\r\n\r\nIf you are ordering from overseas please order with Readings.com.au as they have good shipping prices.","options":[{"id":40453944,"name":"Default","price":35.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":10.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122143902/-/Book_Cover_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122143902/-/Book_Cover_.jpg","width":2088,"height":2244}],"artists":[],"categories":[{"id":5899293,"name":"Book","permalink":"book","url":"/category/book"}]},{"id":4887761,"name":"Emma’s 4 Day Liquid Detox","permalink":"emmas-4-day-liquid-detox","position":4,"price":28.95,"default_price":28.95,"tax":0.0,"url":"/product/emmas-4-day-liquid-detox","status":"active","on_sale":false,"created_at":"2011-11-20T10:28:10.000Z","description":"Successfully used on the popular TV show “Eat Yourself Sexy”, this 4 day liquid Detox is packed full of vitamins, minerals and anti oxidants.\r\n\r\nMany of us are feeling tired, frumpy and bloated by this time of year and the easiest way to put the bounce back in your step is by detoxing. Environmental toxins, preservatives, pesticides, stress, alcohol and coffee shift your body into an acidic state where you easily put on weight and lack energy. By eliminating these harmful factors from your life your body will be able to return to its natural state of vibrant health.\r\n\r\nIt is the perfect solution to alleviate:\r\n<ul>\r\n<li>Recurrent bloating and sluggishness</li>\r\n<li>Irregular bowels</li>\r\n<li>Consistent headaches</li>\r\n<li>Lethargy and fatigue</li>\r\n<li>Constant tiredness</li>\r\n<li>Liver sluggishness</li>\r\n</ul>\r\n<blockquote>“Emma’s 4 day detox is excellent! After the detox my skin was clearer, my energy levels were higher and I felt wonderful. The detox has also helped to kick start my weight loss plan and determine some food intolerances. Thanks Emma!” Catherine Aldous</blockquote>\r\n\r\n\r\nDesigned by leading Naturopath, Emma Sutherland, this 4 day Detox is not a water or juice fast but a nutrient dense cleanse that aims to flood your body with energy boosting foods. It is best completed over a Friday to Monday where you will have the opportunity to nurture and spoil yourself with long baths, massages, dry body brushing and simply taking some time out to focus on yourself.\r\n\r\nOther ways to pamper include giving yourself a manicure, pedicure or facial, having a cup of tea in bed, reading a book, playing your favourite music, an afternoon cat nap, cooking a lovely dinner, using candles every night, going to the movies, a yoga class, walking with a friend or a picnic by the sea.\r\n\r\nFor your investment of $28.95 you will receive my four day menu plan as well as all of the delicious recipes.\r\n\r\nI highly recommend taking my <a href=http://emmasutherland.bigcartel.com/product/emma-s-weight-loss-drops>Weight Removal Drops</a> in combination with completing your Detox Program as they work synergistically to get better results. My <a href=http://emmasutherland.bigcartel.com/product/detox-e-book>Detox eBook</a> explains the philosophies and practicalities of comprehensive detoxing and is a brilliant companion read.\r\n","options":[{"id":15919549,"name":"Default","price":28.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122463411/-/4D-b-cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122463411/-/4D-b-cover.jpg","width":773,"height":1000}],"artists":[],"categories":[{"id":2636271,"name":"e-books","permalink":"e-books","url":"/category/e-books"}]},{"id":6134485,"name":"My Top 10 Menu Plans","permalink":"my-top-10-menu-plans","position":5,"price":24.95,"default_price":24.95,"tax":0.0,"url":"/product/my-top-10-menu-plans","status":"active","on_sale":false,"created_at":"2012-05-08T09:37:08.000Z","description":"Do you lack time to organise your meals and feel confused about what foods you should be eating? Do you know that certain foods can help you reach your health goals? That these power foods actually provide a short cut? What if you could follow a therapeutic menu plan that has all the nutrients you need to fast track you way to success?\r\n\r\nA detailed 7 day menu plan for every occasion is the answer! I have spent years working with people and found using therapeutic menu plans to be very successful. Each day comprises of breakfast, lunch, dinner, snacks, fluids and also a bonus health tip to educate you on the best power foods possible. \r\n\r\n“Let food be thy medicine and medicine thy food” Hippocrates said over 2,000 years ago. Food is the most powerful medicine you can give your body and my menu plans offer you an opportunity for disease prevention and health promotion. \r\nTake the guess work out and put the power foods in! \r\n\r\nMy top 10 Menu Plans eBook includes plans for:\r\n\tEnergy Boosting\r\n\tDe-Stress\r\n\tRadiant Skin\r\n\tPost Pregnancy Back in Shape\r\n\tGluten free\r\n\tBig Event Countdown\r\n\tVegetarian\r\n\tSummer Healthy Eating\r\n\tWinter Healthy Eating\r\n\tBeating Insulin Resistance\r\n","options":[{"id":19571049,"name":"Default","price":24.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122463366/-/10M-b-cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122463366/-/10M-b-cover.jpg","width":773,"height":1000}],"artists":[],"categories":[{"id":2636271,"name":"e-books","permalink":"e-books","url":"/category/e-books"}]},{"id":5746957,"name":"Quick & Easy Juices and Smoothies","permalink":"quick-easy-juice-and-smoothie-ebook","position":6,"price":9.95,"default_price":9.95,"tax":0.0,"url":"/product/quick-easy-juice-and-smoothie-ebook","status":"active","on_sale":false,"created_at":"2012-03-21T13:33:02.000Z","description":"I absolutely love making juices & smoothies and for those of you who connect with me on Facebook you will have seen a few! As clients are always asking me for my favorite blends I have shared them with you in this eBook. Juices and smoothies are a brilliant way to get a concentrated dose of vital vitamins, minerals and antioxidants. By adding in your favorite Superfood it just gets better!\r\n\r\nSmoothies are my answer to breaky on the run or a quick dinner. Juices are amazing when the days are hot, you want to do a cleanse or just need a little extra energy. Experiment and come up with your own favorite blends!","options":[{"id":18446495,"name":"Default","price":9.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122463387/-/SJ-b-cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122463387/-/SJ-b-cover.jpg","width":773,"height":1000}],"artists":[],"categories":[{"id":2636271,"name":"e-books","permalink":"e-books","url":"/category/e-books"}]},{"id":6230375,"name":"Emma's Weight Removal Drops","permalink":"emma-s-weight-loss-drops","position":9,"price":29.95,"default_price":29.95,"tax":0.0,"url":"/product/emma-s-weight-loss-drops","status":"active","on_sale":false,"created_at":"2012-05-19T10:39:49.000Z","description":"The results from my extensive survey found that:\r\n\r\n<strong>34% of you have been on a diet with the aim of losing weight over 14 times!</strong>\r\n\r\nOver 1/3 of you have yo-yo dieted at least 4 times and reached your goal weight only to put it all back on again!\r\n\r\nI have seen that women often sabotage themselves emotionally when they are on a health journey and so I turned to Australian Bush Flower Essences. \r\n\r\n<strong>My Weight Removal Drops have been formulated to help you resist any self sabotage and gain inner strength!</strong>\r\n\r\nComparable to meditation, the effects of Australian Bush Flower Essences are to release negative beliefs and emotions held in the subconscious and to find the courage, strength and commitment to achieve your goals. \r\n\r\n<strong>My Weight Removal Drops are a tried and tested combination of these powerful essences and they are not only easy to take but safe and free of any side effects</strong>\r\n\r\nSimply place 7 drops under your tongue morning and night for best results.\r\n\r\n<strong>Ingredients</strong>\r\n<strong>Monga waratah</strong> – helps you find your inner strength and will power and is especially useful for people with addictions to sugar and starchy carbs\r\n<strong>Peach flowered tea tree</strong> – is perfect for when you run out of enthusiasm and motivation in your weight loss journey. Particularly useful for a “weight plateau” situation\r\n<strong>Pink flannel flower</strong> – this essence increase your natural ‘joie de vivre” and helps you take delight in the little things in life\r\n<strong>Silver princess</strong> – this essence gives you clarity on your life purpose, more motivation and a strong sense of direction\r\n<strong>Southern Cross</strong> – to help shift you out of a victim mentality and into a positive aspect of personal power\r\n\r\nPlace your order today and your Weight Removal Drops will be posted to you within 48 hours.\r\n\r\nPlease note – this product is not available outside Australia","options":[{"id":19869453,"name":"Default","price":29.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/61174447/-/Weight_loss.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/61174447/-/Weight_loss.jpg","width":425,"height":282}],"artists":[],"categories":[{"id":3027039,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":9409526,"name":"Cultivating Calm - Mindfulness Meditation and Relaxation MP3","permalink":"mindfulness-meditation-and-relaxation-mp3","position":10,"price":9.95,"default_price":9.95,"tax":0.0,"url":"/product/mindfulness-meditation-and-relaxation-mp3","status":"active","on_sale":false,"created_at":"2013-02-10T04:23:22.000Z","description":"This MP3 is an essential resource if you are feeling <strong>overwhelmed, stressed or anxious</strong>. By learning the skills of mindfulness you are not only <strong>giving yourself the gift of relaxation but also a calm state of mind</strong>. I highly recommend this resource to you! \r\n\r\nRecorded by <strong>Katy Vidler, Senior Clinical Psychologist</strong> working at Southside Health and Wellbeing in Sydney. Holding both an Honours degree in Psychology and a Masters degree in Clinical Psychology from Macquarie University, Katy works integratively within the principles of mind-body wholism, and has a passion for using mindfulness-based methods in her clinical work.\r\n \r\nKaty has completed several years of formal specialty training in the use of mindfulness in psychological interventions with the Hakomi Institute, as well as attended a range of additional mindfulness based professional development workshops, including Mindful Eating with Jan Chozen Bays MD. Her personal practice incorporates a range of mindfulness meditation methods, including silent retreats when possible. \r\n\r\nOver the years, Katy has developed several mindfulness-based group programs, and is currently running two adult groups, Cultivating Calm and Maintaining Calm, at the Sydney practice. Following numerous requests from her group participants, Katy has recently developed a Mindfulness Meditation & Relaxation CD, to assist busy people with regular practice at home.\r\n\r\nWith a keen interest in the relationship between body physiology, nutrition, and mental and emotional wellbeing, Katy recognizes that the appropriate “raw materials” obtained through diet, are required not only for optimal physical wellbeing, but also for optimal emotional and mental wellbeing. Supporting clients through the challenges of food-related habit change is often an essential aspect of the healing work required for transformation. \r\n\r\nKaty has found mindfulness practice to be especially helpful here, for both assisting with mindful eating, as well as helping clients cope with difficult physical symptoms such as cravings or detox symptoms, throughout the healing process.\r\n\r\n<strong>Practices</strong>\r\n\r\n1. Introduction 1.44\r\n\r\n2. Muscle Relaxation 1 (Long Version) 17.14\r\n\r\n3. Muscle Relaxation 2 (Short Version) 11.47\r\n\r\n4. Muscle Relaxation 3 (Fast Version: Relaxation Without Tensing) 4.55\r\n\r\n5. Diaphragmatic Breathing with a Long Exhalation 7.04\r\n\r\n6. Mindfulness Posture Instruction 2.10\r\n\r\n7. Guided Mindfulness of Breathing 6.41\r\n\r\n8.  Silent Mindfulness Practice with Bells 5.56\r\n\r\n9. Mindfulness of Internal States (breathing, posture, sensations, impulses, emotions, and thoughts) 12.05\r\n\r\n10. Mindfulness with Five Senses (hearing, smelling, tasting, touching, seeing) 10.04\r\n\r\n<strong>Please note, this product is best downloaded on a laptop not phone. Ensure you have a good internet connection as download time is 3 minutes duration</strong>\r\n","options":[{"id":29435009,"name":"Default","price":9.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/92465294/-/CD_COVER_J_peg_Mfl_relax.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/92465294/-/CD_COVER_J_peg_Mfl_relax.jpg","width":1000,"height":999}],"artists":[],"categories":[{"id":3380329,"name":"CD","permalink":"cd","url":"/category/cd"}]},{"id":8398728,"name":"Subsequent Online Consultation","permalink":"subsequent-online-consultation","position":11,"price":110.0,"default_price":110.0,"tax":0.0,"url":"/product/subsequent-online-consultation","status":"active","on_sale":false,"created_at":"2012-12-06T06:03:05.000Z","description":"If you are like so many of my clients, you may find it <strong>challenging to access naturopathic health care</strong> - perhaps you are overseas, live interstate or are looking after a tiny baby at home. What ever the case, <strong>this should not be an impediment to gaining access to high quality, bespoke healthcare</strong>. I beleive that no matter where you are, you deserve to not only have a practitioner by your side but also to achieve your health goals!\r\n\r\n<strong>How Does it Work</strong>:\r\nemail me via my Contact Form\r\nI will get in touch and work out a suitable time for your 1hour initial consultation\r\nyou fill out a questionnaire and send me copies of any blood tests, ultrasounds etc\r\nafter your appointment I will put together a comprehensive treatment plan, dietary recommendations, a script for any recommended products and a referral for any further tests I feel necessary\r\nwe will review your progress within a 4 week period to make any necessary adjustments \r\nonline fees - initial consultation AUD$170.00, subsequent AUD$110\r\n\r\n<strong>What is the Next Step to Hiring Your Virtual Naturopath?</strong>\r\nGo to my online store, purchase your appointment and email me. <strong>Don't waste another minute with Dr Google, confusing health food aisles or conflicting advice when in a few simple steps you can access me!</strong>\r\n\r\nPlease note that online consultations are not covered by Australian Health Funds and recommended products are not included in the consultation cost. ","options":[{"id":26427807,"name":"Default","price":110.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/82590333/-/Woman_with_Organic_Orange.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/82590333/-/Woman_with_Organic_Orange.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":3243419,"name":"Online Services","permalink":"online-services","url":"/category/online-services"}]},{"id":8398701,"name":"Initial Online Consultation","permalink":"online-initial-consultation","position":12,"price":170.0,"default_price":170.0,"tax":0.0,"url":"/product/online-initial-consultation","status":"active","on_sale":false,"created_at":"2012-12-06T06:01:21.000Z","description":"If you are like so many of my clients, you may find it <strong>challenging to access naturopathic health care</strong> - perhaps you are overseas, live interstate or are looking after a tiny baby at home. What ever the case, <strong>this should not be an impediment to gaining access to high quality, bespoke healthcare</strong>. I beleive that no matter where you are, you deserve to not only have a practitioner by your side but also to achieve your health goals!\r\n\r\n<strong>How Does it Work</strong>:\r\nemail me via my Contact Form\r\nI will get in touch and work out a suitable time for your 1hour initial consultation\r\nyou fill out a questionnaire and send me copies of any blood tests, ultrasounds etc\r\nafter your appointment I will put together a comprehensive treatment plan, dietary recommendations, a script for any recommended products and a referral for any further tests I feel necessary\r\nwe will review your progress within a 4 week period to make any necessary adjustments \r\nonline fees - initial consultation AUD$170.00, subsequent AUD$110\r\n\r\n<strong>What is the Next Step to Hiring Your Virtual Naturopath?</strong>\r\nGo to my online store, purchase your appointment and email me. <strong>Don't waste another minute with Dr Google, confusing health food aisles or conflicting advice when in a few simple steps you can access me!</strong>\r\n\r\nPlease note that online consultations are not covered by Australian Health Funds and recommended products are not included in the consultation cost. ","options":[{"id":26427762,"name":"Default","price":170.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/82590117/-/Fit_Woman.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/82590117/-/Fit_Woman.jpg","width":317,"height":379}],"artists":[],"categories":[{"id":3243419,"name":"Online Services","permalink":"online-services","url":"/category/online-services"}]},{"id":6536905,"name":"Planting the Seed for Conception Joy - MP3","permalink":"planting-the-seed-for-conception-joy","position":13,"price":9.95,"default_price":9.95,"tax":0.0,"url":"/product/planting-the-seed-for-conception-joy","status":"active","on_sale":false,"created_at":"2012-06-25T09:52:15.000Z","description":"A guided visualisation and affirmation journey created by psychologist Jacqui Manning. If you are having difficulty conceiving a baby, or if you want to create the healthiest emotional environment in which to conceive, then this CD is for you. \r\n\r\nDesigned to send you into a deep state of relaxation, these three tracks will help you to reduce any negative unconscious blocks and plant the seeds of positive growth and connection with your heart and body, helping your emotional state through the conception journey. \r\n\r\nWhen you are stressed, your body goes into 'fight or flight' response, switching off any systems deemed unnecessary at times of threat. This includes your reproductive system. By using this CD to relax, you are giving your body and mind a chance to be soothed at a very deep level, and allow you to cope with your path to conceiving. \r\n\r\nTrack 1 - a 30 minute guided visualisation, deeply healing, exploring and overcoming the blocks within\r\n\r\nTrack 2 - Affirmation seeds of peace, joy, love and acceptance for you and your womb/body (8 minutes)\r\n\r\nTrack 3 - Musical space to allow insights and learnings to come into your conscious mind (16 minutes) \r\n\r\nPlease note, this is an MP3 version","options":[{"id":20777371,"name":"Default","price":9.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/64479213/-/with_extra_seeds_373.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/64479213/-/with_extra_seeds_373.jpeg","width":709,"height":1000}],"artists":[],"categories":[{"id":3380329,"name":"CD","permalink":"cd","url":"/category/cd"}]},{"id":6230567,"name":"Fertility Made Easy","permalink":"fertility-made-easy","position":14,"price":39.95,"default_price":39.95,"tax":0.0,"url":"/product/fertility-made-easy","status":"active","on_sale":false,"created_at":"2012-05-19T12:01:30.000Z","description":"I have so many women asking me questions about their fertility – am I getting too old, am I eating foods that improve my chances of having a baby, am I having sex at the wrong time and missing that window of opportunity? These are just some of the issues that cause stress and anxiety to so many women. \r\n\r\nI have been working with couples in the area of fertility for over 10 years and every day I see the pain and frustration they feel. \r\nI designed this online course to assist as many couples as possible on their path to having a baby. \r\n\r\nI recognise that my clinic days are heavily booked and decided to make all my best resources available to everyone, no matter where you live! Each part of my e-course will be delivered to your inbox every 2 days, resulting in a 6 week journey to improved fertility. \r\n\r\nThese include:\r\n•\tDiscover the <strong>6 top conception myths</strong>\r\n•\tThe <strong>9 most important tips</strong> to promote fertility\r\n•\t<strong>5 ways</strong> to tell if you are ovulating\r\n•\t<strong>Male</strong> fertility Superfoods\r\n•\t<strong>Female</strong> fertility Superfoods\r\n\r\n<a href=http://fertilitymadeeasy.com.au/sign-up/>Click here to purchase</a>\r\n\r\nThis will enable you to digest the information and implement any changes before moving on to the next part. <strong>Step by step you will improve your fertility and be assured that you are on track! </strong>\r\n\r\nI only recommend <a href=http://emmasutherland.bigcartel.com/product/mygen-health-fertility-formula-for-women>MyGen Fertility Formula</a> as they have been carefully formulated by one of Australia’s leading fertility experts, naturopath Amanda Haberecht. They contain over 25 powerful and highly bioavailable nutrients that will optimise fertility in both men and women. For anyone looking for an express kick start to optimising their health, my <a href=http://emmasutherland.bigcartel.com/product/emmas-4-day-liquid-detox>4 Day Liquid Detox</a> is your answer. \r\n\r\n“The most significant changes we have experienced from Emma’s program are that we gained a lot of energy and whilst we still needed IVF, our fertility had improved. We now have a beautiful baby boy through 1 cycle of IVF – the first embryo implanted.” N.Forway & B.Coudounellis\r\n\r\n“Emma’s 4 day detox is excellent! After the detox my skin was clearer, my energy levels were higher and I felt wonderful. The detox has also helped to kick start my weight loss plan and determine some food intolerances. Thanks Emma!” Catherine Aldous\r\n\r\n<a href=http://fertilitymadeeasy.com.au/sign-up/>Click here to purchase</a>","options":[{"id":19869921,"name":"Default","price":39.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/64547853/-/612baby2-300x225.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/64547853/-/612baby2-300x225.jpg","width":300,"height":225}],"artists":[],"categories":[{"id":3243419,"name":"Online Services","permalink":"online-services","url":"/category/online-services"}]},{"id":4887741,"name":"The Art Of Detoxification ","permalink":"detox-e-book","position":15,"price":29.95,"default_price":29.95,"tax":0.0,"url":"/product/detox-e-book","status":"active","on_sale":false,"created_at":"2011-11-20T10:13:00.000Z","description":"Find out all you need to know about detoxing from an expert who has years of experience. \r\n\r\nWritten by Emma to enable her clients to gain more from their detox program and to educate and empower them. \r\n\r\nEmma works at the exclusive Golden Door Health Retreat presenting seminars and helping thousands of people through their detox program. \r\n\r\nThis detox book is the perfect addition to <a href=\"http://emmasutherland.bigcartel.com/product/emmas-4-day-liquid-detox\">Emma’s Detoxification Program!</a>","options":[{"id":15919379,"name":"Default","price":29.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/60227791/-/Detox_cover_v2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/60227791/-/Detox_cover_v2.jpg","width":773,"height":1000}],"artists":[],"categories":[{"id":2636271,"name":"e-books","permalink":"e-books","url":"/category/e-books"}]},{"id":5746975,"name":"MyGen Health Fertility Formula for Women","permalink":"mygen-health-fertility-formula-for-women","position":16,"price":52.95,"default_price":52.95,"tax":0.0,"url":"/product/mygen-health-fertility-formula-for-women","status":"active","on_sale":false,"created_at":"2012-03-21T13:37:21.000Z","description":"During my pregnancy & breast feeding time with Sophia I took the MyGen Health Fertility Formula as I believe it is the most comprehensive product on the market. It has been carefully formulated by one of Australia’s leading fertility experts, naturopath Amanda Haberecht.\r\n\r\nThe Mygen Health Fertility Formulas are new premium quality pre-natal and pregnancy supplements.  The preconception nutritional needs of men and women are very different.  Which is why Mygen Health has designed tailored formulas for both men and women.\r\n\r\nThe Fertility Formula for women is a comprehensive supplement that provides the building blocks to support normal fertility and pregnancy in health women and maintain the health of mother and baby.\r\n\r\nMygen Health Fertility Formula for women contains over 25 therapeutically active ingredients including:\r\n\r\n    Calcium Folinate – a source of folinic acid which quickly converts to the most active form of folate.\r\n    CoQ10 – a powerful antioxidant that is essential for cellular energy.\r\n    Vitamin D – a common deficiency, this vitamin supports healthy bone development.\r\n    Iodine – another common deficiency in pregnant women, iodine is necessary for hormone production and is critical in the 1st trimester of pregnancy.\r\n    Antioxidants – assist in protecting your body from the damaging effects of free radicals.\r\n\r\nRemember that not all supplements are the same! The Mygen Health formulas use ingredients that have clear and proven impacts, in forms that your body can absorb easily, and at concentrations high enough to provide benefit to you.\r\n\r\n30 capsules and 30 tablets = 1 month supply\r\n\r\nPrice includes postage within Australia, delivery within 3-5 working days","options":[{"id":18446571,"name":"Default","price":52.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56413985/-/FertilityFormulaWomen.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56413985/-/FertilityFormulaWomen.jpg","width":310,"height":293}],"artists":[],"categories":[{"id":3027039,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":5746969,"name":"Mygen Health Fertility Formula for Men","permalink":"mygen-health-fertility-formula-for-men","position":17,"price":52.95,"default_price":52.95,"tax":0.0,"url":"/product/mygen-health-fertility-formula-for-men","status":"active","on_sale":false,"created_at":"2012-03-21T13:36:18.000Z","description":"I believe MyGen Health Fertility Formula is the most comprehensive product on the market as it has been carefully formulated by one of Australia’s leading fertility experts, naturopath Amanda Haberecht\r\n\r\nThe Mygen Health Fertility Formulas are new premium quality pre-natal and pregnancy supplements.  The preconception nutritional needs of men and women are very different.  Which is why Mygen Health has designed tailored formulas for both men and women.\r\n\r\nThe Fertility Formula for men is a comprehensive supplement that provides the building blocks to support quality sperm production and hormone function in healthy men.  In addition, it maintains the prostate health and supports stamina and endurance.\r\n\r\nMygen Health Fertility Formula for men contains over 17 therapeutically active ingredients including:\r\n\r\n    Calcium Folinate – a source of folinic acid which quickly converts to the most active form of folate which supports healthy sperm production and is a blood tonic.\r\n    CoQ10 – a powerful antioxidant that is found in sperm cells, where it supports sperm motility and sperm cell function in healthy men.\r\n    Selenium – an important mineral for the formation and maturity of active sperm cells in healthy men.\r\n    Zinc – supports healthy testosterone levels and balance.  Zinc is also important in maintaining prostate health.\r\n    Antioxidants – assist in protecting your body from the damaging effects of free radicals. Sperm are particularly susceptible to free radical damage.\r\n\r\nRemember that not all supplements are the same! The Mygen Health formulas use ingredients that have clear and proven impacts, in forms that your body can absorb easily, and at concentrations high enough to provide benefit to you.\r\n\r\n30 capsules and 30 tablets = 1 month\r\n\r\nPrice includes postage within Australia, delivery within 3-5 working days","options":[{"id":18446565,"name":"Default","price":52.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56413945/-/FertilityFormulaMen.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56413945/-/FertilityFormulaMen.jpg","width":339,"height":326}],"artists":[],"categories":[{"id":3027039,"name":"Supplements","permalink":"supplements","url":"/category/supplements"}]},{"id":4413337,"name":"12 Keys to Effective Weight Loss","permalink":"12-keys-to-effective-weight-loss","position":18,"price":79.95,"default_price":79.95,"tax":0.0,"url":"/product/12-keys-to-effective-weight-loss","status":"active","on_sale":false,"created_at":"2011-09-10T03:34:43.000Z","description":"<ul>\r\n<li>Have you ever had a hard time losing weight?</li>\r\n<li>Have you, like over 1/3 of women, yo yo dieted at least 4 times to reach your goal weight only to put it all back on again?</li>\r\n<li>Are you part of the 34% of women that have been on a diet with the aim of losing weight over 14 times?</li>\r\n<li>Are you confused with conflicting information on weight loss and need a trusted and reliable source of knowledge?</li>\r\n</ul>\r\n\r\n<p>You may not believe that regaining your Mojo and losing weight is easy, but it is!</p>\r\n\r\n<p>After working with women for over 10 years helping them to regain their Mojo, I discovered 12 common problems that were impeding their ability to lose weight. After delving into the scientific research I realised that if we addressed these common problems, we started seeing successful weight loss.</p>\r\n<p>Each problem on its own did not seem huge or to have an obvious negative impact – but when you combine more than 2 or 3 problems, it created a block that stopped women from reaching their weight loss goals.</p>\r\n<p>I had the opportunity to put my program to the test when I was the Naturopathic Expert on the TV show “Eat Yourself Sexy”. These committed women went from frumpy to fabulous in only eight weeks! From this experience I wrote my popular online program <a href=\"http://www.8weekmojomaker.com.au\">8 Week Mojo Maker</a> to provide access to my menu plans, recipes and information rich videos to help women all over the world to regain their Mojo.</p>\r\n\r\nIn “12 Keys to Effective Weight Loss” I will explain and demystify these 12 common problems and share with you my strategies, tips and secrets to losing weight effectively. By sharing with you the solutions to each of these problems, I am following my life’s mission to help as many women get their Mojo back as possible, as well as short cutting your frustrations and disappointments in the area of weight loss.\r\n\r\nMost people believe that losing weight is difficult and challenging. The truth is that once the 12 Keys to Effective Weight Loss are addressed, weight loss is easy! This program is delivered via video so sit back and get ready to unblock your weight loss journey!\r\n\r\nI highly recommend my <a href=http://emmasutherland.bigcartel.com/product/emma-s-weight-loss-drops>Weight Loss Drops </a> to be used in conjunction with the program as they have been formulated to help you resist any emotional self sabotage and gain inner strength. The perfect way to kick start your weight loss journey is with my 4 Day Liquid Detox.\r\n\r\nThe program is a series of 13 videos which are downloadable upon purchase. Please note, the total file is 450MB so broadband internet is required.\r\n \r\nThe results and testimonials speak for themselves:\r\n\r\n<blockquote>“Commit to following Emma’s plan and you WILL lose weight.  If you follow it, it works.” Michelle Drube</blockquote>\r\n\r\n“Emma has turned my life around. I am eternally thankful for everything she has done and will continue to work with her because I know that I will always get the best results. Open yourself up to the possibility that IT WILL HAPPEN.” Rebecca Moroney\r\n\r\n“Give it a go and you will truly see and feel a huge difference. You can’t expect difference results by doing the same thing! This is what I have learnt with the program. Don’t look at it as a weight loss program, nor a diet, look at it as a lifestyle!” Sonia Sarkis\r\n\r\n“I was sluggish, depressed and a couch potato, with rolls of fat streaming over my jeans. Now, I’m energetic, active, happy and healthily pregnant without having put on any ‘fat’ weight, only baby weight” Amanda Anderson\r\n\r\n“<a href=http://emmasutherland.bigcartel.com/product/emmas-4-day-liquid-detox>Emma's 4 Day Liquid Detox</a> is excellent! After the Detox my skin was clearer, my energy levels were higher and I felt wonderful. The Detox has also helped to kick start my weight loss plan and determine some food intolerances. Thanks Emma!” Catherine Aldous\r\n","options":[{"id":14478271,"name":"Default","price":79.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/61176799/-/Fit_Woman.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/61176799/-/Fit_Woman.jpg","width":317,"height":379}],"artists":[],"categories":[{"id":2432941,"name":"Videos","permalink":"videos","url":"/category/videos"}]}]