[{"id":13432023,"name":"RETSEPTI \"Anthology Of Georgian Underground, Tbilisi\" CD (1987-92)","permalink":"retsepti-anthology-of-georgian-underground-tbilisi-cd-1987-92","position":1,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/retsepti-anthology-of-georgian-underground-tbilisi-cd-1987-92","status":"active","on_sale":true,"created_at":"2013-09-08T06:15:23.000Z","description":"A true pearl of the Soviet-era underground, well arranged unique mix of NWOBHM, dark-punk / cold-wave / death-rock, and garage with abrasive Georgian vocals, recorded 1989-90.  Raw & angry enough for the punks yet dark enough to please the post-punks.  Musically comparable to SECTION 25, GRAZDANSKAYA OBORONA, early KILLING JOKE, STOOGES, JOY DIVISION, SIEKIERA, etc.  Anglophones do not fear, this anthology will amaze!\r\n\r\n10 songs, professionally 24-bit re-mastered.  Deluxe gatefold ecopak cover, hand stamped inner-sleeve, plus 16 page booklet with lyrics / photographs / interview & history of underground music in the ex-Soviet Republic of Georgia.\r\n\r\n“A dark, desperate feel, interesting guitar work, and a twisted vocalist!” (MRR - Oct. 2006)  \r\n\r\n“very glad to have it” - Middle Eastern Division, Harvard University (May 2009).","options":[{"id":42993171,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.99,"amount_with_others":2.99,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.99,"amount_with_others":2.99,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":2.99}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123966387/-/retsepti.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123966387/-/retsepti.jpg","width":209,"height":200}],"artists":[],"categories":[{"id":4688333,"name":"CD","permalink":"cd","url":"/category/cd"}]},{"id":9594359,"name":"JERK WARD \"Too Young To Thrash\" 12\" (1982-84)","permalink":"jerk-ward-too-young-to-thrash-mlp-1982-84","position":2,"price":9.0,"default_price":9.0,"tax":0.0,"url":"/product/jerk-ward-too-young-to-thrash-mlp-1982-84","status":"active","on_sale":true,"created_at":"2013-02-22T18:10:11.000Z","description":"A teenage adrenalin overdose of frenetic, tight, and blazing Canadian hardcore thrash from the West Coast with guest appearances by the NEOS!\r\n\r\n17 songs total: full “Flesh & Bones” 1984 demo except one song replaced by an early version from “BYO - Medium Raw” comp tape 1982, and one unreleased track. Professionally 24-bit remastered, 100% authorized, packed with all original artwork + photos circa ‘82-84, booklet with detailed interview + art. Deluxe 140 gram 12” virgin vinyl, cut at 45 rpm for extra volume and power.  Hand numbered pressing of 300!  The long lost young fan offspring of the NEOS with Steve McBean (Pink Mountaintops, Mission of Christ), Jon London (MPA), and both Steve and Kev from the NEOS. (Supreme Echo, 2009)\r\n\r\nReviews: “warp-speed early-’80s hardcore...JERK WARD were friends of the NEOS, and you can hear their influence in the music....this LP sounds great considering it’s comprised of demo recordings...the fast stuff gives DRI, YOUTH KORPS, and STARK RAVING MAD a run for their money in the speed department, but far from being monochrome thrash, JERK WARD varies the tempos and also throws in weird guitar work to keep you on your toes. Lovingly compiled and well worth tracking down.” (MRR - Oct. 2009)\r\n\r\n...”spastic & angry, yet soaked with humor...this is truly a gem of a bygone era that is well worth picking up from both a historical standpoint as well as an unbelievably rockin’ one.” (Razorcake webzine).\r\n\r\nCANADIAN H/C PIONEERS FORMED IN 1981; REISSUE OF RARE 1984 DEMO, PLUS 1982 BONUS TRACKS WITH  SUPERB REMASTERING!","options":[{"id":30015535,"name":"Default","price":9.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":13.99,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":13.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":19.99,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/94280227/-/jwa.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/94280227/-/jwa.JPG","width":600,"height":593}],"artists":[],"categories":[{"id":4688563,"name":"12\" Mini-LP","permalink":"12-mini-lp","url":"/category/12-mini-lp"}]},{"id":9594273,"name":"TWITCH s/t 7\" EP (1973)","permalink":"twitch-s-t-7-ep-1973","position":3,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/twitch-s-t-7-ep-1973","status":"active","on_sale":true,"created_at":"2013-02-22T18:03:49.000Z","description":"Canada's long lost doom/proto-punk legends finally unleashed! Distancing themselves from the bustling local psych scene, they formed in 1971 on the rural outskirts of Vancouver becoming a hard rock trio unlike any other local group.  Band leader Ian prompted the guys to wear bloody horror-fantasy make-up and bizarre outfits, becoming the first (and only) in Vancouver to do so (also believed to be first to use smoke & fog) packing full house night after night. Late March / early April they did two recording sessions documenting the entirety of original compositions - a mere four songs resulting in two 45 singles.  The first 45 was issued in May and the second in August, both pressed in roughly 100 copies.   Comparable to early Pentagram, Crushed Butler, Edgar Broughton Band, Stone Bunny, Troyka, early Alice Cooper, Wicked Lady, Bang, Dust, and others. Brace yourselves folks, Twitch's story will rewrite Canadian underground history!  A true bone-cruncher! Now compiled onto one EP with orange repro labels, deluxe picture sleeve (not fold-over), and 16 page booklet with detailed history & tons of photos.  Fully authorized, limited edition of only 600 copies.  (Supreme Echo, 2012) \r\n\r\nReviews: \"...looking like Norwegian Death Metallers twenty years ahead of their time...obscuro 1973 Vancouver rockers who graduated from the Sixties teen garage scene, compiling their first two 45s over two sides. “Things” is the centerpiece, a brooding bad-trip sounding proto-punker that bridges the gap between Sixties garage and psych (even if the band held the burgeoning “psych” movement in disdain) which was backed with the biker-rock “Pickup Is Illegal on 401 (Hitchhiker’s Blues)”...\" - RK / Terminal Boredom, June 2012 \r\n\r\n\"Glam-rooted hard rock from Vancouver circa 1973, with the morbid death wish of Alice Cooper folded in as a last-ditch attempt for notoriety... a band that was musically ahead of its time, and was likely pushing things along to some degree...menacing, brooding, simple yet memorable downers, with a penchant for mean riffs and body paint...strange, but effective, and interesting enough to merit closer inspection by aficionados of both the era and the underground rock history of western Canada...\" - Doug Mosurock / Still Single, July 2012","options":[{"id":30015223,"name":"Default","price":8.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.99,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/94279171/-/twi.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/94279171/-/twi.JPG","width":1000,"height":996}],"artists":[],"categories":[{"id":4688493,"name":"7\" Vinyl","permalink":"7-vinyl","url":"/category/7-vinyl"}]},{"id":9594191,"name":"SPHEX \"Time b/w Leaving This Crazy City\" - 7\" 45 (1976)","permalink":"sphex-time-b-w-leaving-this-crazy-city-7-45-1976","position":4,"price":7.0,"default_price":7.0,"tax":0.0,"url":"/product/sphex-time-b-w-leaving-this-crazy-city-7-45-1976","status":"active","on_sale":true,"created_at":"2013-02-22T17:56:41.000Z","description":"This Canadian teenage group from small-town Ontario had their own mature sound, predating punk and surpassing all older groups in the region.  Recorded for a soundtrack at the Montreal National Film Board in 1976 and released in 1977, \"Time\" is a dynamic heavy rocker reminiscent of Bad Axe and other post-Sabbath groups, whereas \"Leaving This Crazy City\" is an incredible proto-punk kbd surprise!  \r\n\r\nOriginally issued as a private press, sleeveless gold labelled 45 in a very small edition (originals are worth over $200), now reissued with repro labels, deluxe picture sleeve (not fold-over), and 16 page booklet with detailed history & tons of photos.  For fans of the many other little known proto-punk hard rockers of the mid-70s.  Fully authorized, limited edition of only 600 copies.  (Supreme Echo, 2012)\r\n\r\nReview: Absolutely killer reissue...phased-out spacetime bliss, with teenaged hot licks splayed all over while the band steers the vessel with some surprisingly talented drumming and steady rhythms...a killer riff-driven hard rocker that chugs with a certain punk-like menace...it’s so rare these days to find unheard-of gems like this, and the quality of both tracks is pretty impressive. - RK / Terminal Boredom, June 2012.","options":[{"id":30014965,"name":"Default","price":7.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.99,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":9.99,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/94278635/-/sph.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/94278635/-/sph.JPG","width":998,"height":1000}],"artists":[],"categories":[{"id":4688493,"name":"7\" Vinyl","permalink":"7-vinyl","url":"/category/7-vinyl"}]},{"id":9594065,"name":"NORTHERN HAZE \"Sinnaktuq\" LP (1985-2010) *Blubber Vinyl","permalink":"northern-haze-sinnaktuq-lp-1985-2010-blubber-vinyl","position":5,"price":22.0,"default_price":22.0,"tax":0.0,"url":"/product/northern-haze-sinnaktuq-lp-1985-2010-blubber-vinyl","status":"active","on_sale":true,"created_at":"2013-02-22T17:42:13.000Z","description":"Hailing from the 69th parallel in the Arctic is a story unlike any other.  Born on the land to Nomadic parents and later settled in the hamlet community of Igloolik, these childhood friends grew up learning to play on toy instruments until becoming accomplished musicians and forming a group in 1977.  Their talent won success in the early '80s with contests, press coverage, and tours of isolated Northern communities until in '85 when CBC Radio invited them to travel 3000 km south to record an album.  The result became the first Canadian Inuit Rock/Metal album ever made and first Indigenous language rock album in North America.  Pressed in a tiny quantity of 500 copies for promotional use only, the LP quickly disappeared into the vortex of rare Canadiana.  Over the 1990’s and into the millennium, Northern Haze endured great hardship yet 35+ years on they still prevail.  In 2010, a new recording and a documentary film on the history of the group was produced on location in the Arctic.  Complete with traditional “ayaya” parts and sung entirely in Inuktitut, the end result is a heavy melodic rock/metal album played by veterans of the genre with a distinctly original character unlike anything heard before.  For these men who live two lives, the old ways of the past meet with those of the present; “Sinnaktuq” (their “dreams”) are truly embodied within the realization of this amazing deluxe collection of original material.  \r\n\r\n11 songs total: seven songs recorded 1985, one song recorded 2002, and three songs recorded 2010, ranging from tight and heavy NWOBHM (80's material) to heavy melodic doom-rock (contemporary material is like an Arctic Black Sabbath) !  Exclusive CBC license, 100% authorized, remastered, original cover art painstakingly restored, 12 page booklet packed with vintage photographs + art + detailed history.  The true Rock Shamans of the North! (Supreme Echo, 2012)\r\n\r\n\"In my opinion, this is the most important re-issue this decade. It contains a vital collection of Northern rock.\" - Robert Williston / Museum of Canadian Music, April 2012.\r\n\r\n\"...Black Sabbath / Vanilla Fudge / Blue Cheer-style molten rock with a pronounced Jimi Hendrix influence, all sung and recorded in the group’s native language, Inuktitut...fuses the 4,000-year-old Inuit tradition of “ayi ayi” songs with ‘70s stoner idioms...\" - Nick Green / Decibel Magazine, June 2012.\r\n\r\n\"...riffs cribbing straight from the church of Iommi with ripping and concise solos jammed liberally throughout. Sabbath-y, Motorhead-y in all the right places...\" - Matt Lee / Big Takeover (blog), Sept. 2012.\r\n\r\nARCTIC METAL LEGENDS FORMED IN 1978; REISSUE OF RARE 1985 LP, PLUS 2002/2010 BONUS TRACKS. BLUBBER VINYL ONLY 227 COPIES MADE, LIMITED 1 PER CUSTOMER.","options":[{"id":30014441,"name":"Default","price":22.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":13.99,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":13.99,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":19.99,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/94276955/-/NH.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/94276955/-/NH.JPG","width":1000,"height":988}],"artists":[],"categories":[{"id":4688511,"name":"12\" LP","permalink":"12-lp","url":"/category/12-lp"}]}]