[{"id":103097,"name":"Metallic Gold Snakeskin Silver Lined Cuff","permalink":"metallic-gold-snakeskin-silver-lined-cuff","position":1,"price":65.0,"default_price":65.0,"tax":0.0,"url":"/product/metallic-gold-snakeskin-silver-lined-cuff","status":"active","on_sale":false,"created_at":"2008-05-12T20:13:53.000Z","description":"It is our signature silver lined open cuff style, and is crafted from 100% Natural Genuine Snakeskin, hand dyed a BRGHT, metallic gold color! \r\nThis is indeed natural snakeskin, and NOT an embossed leather.\r\nTruly, this is one of the more luxurious snakeskins we have ever offered in the shop, we simply can't say enough about it. \r\nThis particular color is GORGEOUS. I can't stress it enough. We are so pleased to offer this in the shop, it is truly something unique. The gold has a true, rich, 14 karat hue. Not just a dusting of metallic powder, but it looks as if someone poured liquid gold all over the hide and it just stuck! It is so vibrant and bold, and just flat out sexy!\r\nThere are so many gorgeous undertones to this color as well, in the light, is is bright and vivid and a true yellow gold, and yet also has subtle deep copper hues visible!\r\n\r\nAnd the surface polishing adds a gorgeous luster which shimmers and shines beautifully in the sunlight.\r\n\r\n\r\nThis is the perfect cuff for anyone who demands to be noticed! The ultimate accessory for any rock chick, but it's also versatile enough to make that classy little black dress just POP!\r\n\r\n\r\nThe snakeskin is hand polished to give it a soft, slick sheen, which also gives it added durability.\r\n\r\n\r\nThe cuff is adjustable and we can size it to fit wrists from 5 inches up to 8 inches!\r\nThe interior is silver plated.\r\n\r\n♥ Additionally, due to the nature of the materials, each cuff will have it's own distinct markings/scale size/pattern and may differ slightly from the one shown.\r\nWhile we do pay careful attention to pattern placement and cut, no two will ever be exactly alike, and that is one of the joys of owning an exotic leather item!\r\n\r\nThe vast majority of our materials are by-product leathers. No endangered species were harmed in any way!\r\nPlease see our profile for more detailed info!!!\r\n\r\n","options":[{"id":511568,"name":"Default","price":65.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[]}]