[{"id":3941004,"name":"Banksy Donuts Print","permalink":"banksy-doughnut-print","position":1,"price":50.0,"default_price":50.0,"tax":0.0,"url":"/product/banksy-doughnut-print","status":"sold-out","on_sale":true,"created_at":"2011-06-17T16:40:08.000Z","description":"The original “Donuts” piece went on exhibit in a Bristol City Museum exhibit, titled, “Banksy Versus Bristol City Museum.”\r\n\r\nRead the original article about the <a href=\"http://urbanartmonster.com/banksy-donuts-print-now-available\">Banksy Donut Print</a> here. \r\n\r\nIn July of 2009, Pictures On Walls (POW) offered a “Donuts” print which measured 30 x 22 inches in chocolate and strawberry. Each print was limited to 299 and a special lottery system was implemented for the print where buyers needed to register before hand in order to be chosen for purchase.\r\n\r\nHere on <a href=\"http://urbanartmonster.com\">Urban Art</a> Monster, we're offering you another chance to own your own version of “Donuts” print by Banksy. This high quality print is a replica of the 2009 “Donuts” print offered on Pictures on Walls in 2009, complete with the Banksy signature on the bottom, right-hand corner (Note; this is not an original). This edition of “Donuts” is a limited edition of 100, printed on 45 lbs. Matte Litho-realistic paper. The print was created using archival ink and is a large 36 x 24 inches in size.\r\n\r\nRead more About the <a href=\"http://urbanartmonster.com/banksy-donuts-print-now-available\">Banksy Donut Print</a>.\r\n\r\n***UPDATE***\r\n\r\nDue to unforeseen complications with UrbanArtMonster.com, we've decided to offer the Banksy Donuts Print right here on our official Big Cartel store. You can still check out more photos and information about the Banksy print on UAM but you can only purchase it right here for a limited time and while supplies last (frame is NOT included). \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","options":[{"id":13105098,"name":"Default","price":50.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":7.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/38421400/-/banksy-Doughnuts.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/38421400/-/banksy-Doughnuts.jpg","width":350,"height":262}],"artists":[],"categories":[{"id":2186984,"name":"Posters","permalink":"posters","url":"/category/posters"}]}]