[{"id":3168587,"name":"Miracle Whey Protein Powder","permalink":"miracle-whey-protein-powder","position":1,"price":29.95,"default_price":29.95,"tax":0.0,"url":"/product/miracle-whey-protein-powder","status":"sold-out","on_sale":true,"created_at":"2011-01-21T21:23:17.000Z","description":"1 lb. container\r\n19grams of protein per serving with about 11 servings.\r\n\r\n<a href=\"http://www.lifefitnessnutritionals.com/contact\">Contact us</a> to see how you can get great discounts on bulk purchases!\r\n\r\n-Purchase 3 and get each for $27 plus shipping.\r\n\r\n-Purchase 6 and get each for $24 plus shipping.\r\n\r\n<strong>Why Miracle Whey Protein Powder?</strong>\r\n\r\nMade from all-natural grass fed cows' whey, providing more of nature's nutrients\r\n\r\nIs certified free of GMO ingredients, pesticides, and chemicals, protecting you from the damaging effects of chemicals and hormones*\r\n\r\nIs cold processed, and never processed with acid chemicals, thereby retaining all its natural goodness\r\n\r\nProvides all key amino acids, so you get all the protein building blocks your body needs*\r\n\r\nRetains maximum biological value with beneficial micronutrients intact*\r\n\r\nContains the highest concentration of leucine of any dairy product, said to increase energy levels and support building of muscle mass*\r\n\r\nContains water-soluble fiber, which supports healthy blood sugar levels* and prebiotic properties*\r\n\r\nContains 25% or more glycomacropeptides for immune support, high energy, muscle building and recovery after exercise*\r\n\r\nContains MCTs from all-natural coconut oil for easy digestion and fast energy*\r\n\r\nRich in glutamic acid and branch chain amino acids which aid muscle-building and recovery *\r\n\r\nContains all whey microfructures, immunoglobulins and lactoferins, promoting your healthy immune function and healthy flora balance*\r\n\r\nNo sugar, sugar alcohol or artificial sweeteners added that detract from the positive benefits of whey.\r\n\r\nIncludes the same immuno compounds that are found naturally in human breast milk -- responsible for providing newborns with their immune defense*\r\n\r\nPromotes satiety, so compulsive craving for refined carbs and sweets is curbed*\r\n\r\nComes in your choice of six delicious flavors with no aftertaste like some powders on the market. Available in vanilla, strawberry, chocolate, blueberry, banana and peanut butter (made from all-organic peanuts)","options":[{"id":10812875,"name":"Chocolate","price":29.95,"sold_out":false,"has_custom_price":false},{"id":10812877,"name":"Vanilla","price":29.95,"sold_out":false,"has_custom_price":false},{"id":10812879,"name":"Strawberry","price":29.95,"sold_out":false,"has_custom_price":false},{"id":10812881,"name":"Blueberry","price":29.95,"sold_out":false,"has_custom_price":false},{"id":10812883,"name":"Banana","price":29.95,"sold_out":false,"has_custom_price":false},{"id":10812885,"name":"Peanut Butter","price":29.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":10.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/30732395/-/miracle-whey-protein-powders.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/30732395/-/miracle-whey-protein-powders.jpg","width":500,"height":312}],"artists":[],"categories":[{"id":1835195,"name":"Protein","permalink":"protein","url":"/category/protein"}]},{"id":3021637,"name":"Sunshine Mist Vitamin D Spray","permalink":"sunshine-mist-vitamin-d-spray","position":2,"price":19.95,"default_price":19.95,"tax":0.0,"url":"/product/sunshine-mist-vitamin-d-spray","status":"sold-out","on_sale":true,"created_at":"2010-12-13T21:52:09.000Z","description":"How does this benefit you?\r\n\r\nQuite simply, the D3 in Sunshine Mist Vitamin D Spray comes in a form your body can start putting to use immediately.*\r\n\r\nIn short, you spray this fine-mist formula into your mouth, swallow, and the essential nutrients are delivered to your circulatory system, tissues and cells quickly. Each spray is approximately 1000 IU.\r\n\r\nBut wait -- there's even more...\r\n\r\nThe tiny nano-sized particles in each spray are designed to release the vitamin D3 in a steady, time-controlled manner, ensuring a longer-term benefit and boosting efficiency even further*.\r\n\r\nNeedless to say, when you combine the Sunshine Mist Vitamin D Spray time-release mechanism with its rapid absorption, you get one incredible product. A product that, in my opinion, is clearly superior to any vitamin D3 pill, tablet, capsule, gelcap, or liquid on the market today.\r\n\r\nWhat's more... There are no pills to swallow -- making it perfect for you if you're one of those people who hate to swallow pills.\r\n\r\nAs you probably know, vitamin D is an oil-soluble vitamin and there can be challenges absorbing it. This is why you only want to take an oil form of it and avoid the dry tablets. Better yet, I believe that the nano spray may be the best way to administer this vital nutrient.\r\n\r\nThe bottom line is that our Sunshine Mist Vitamin D Spray is stimulant-free, contains only natural ingredients, and tastes great! Best of all, it's packaged in a convenient pre-metered, non-aerosol,  container that easily fits in your purse or pocket. Last but not least, it's...\r\n\r\nWhy Our \"Nano\" Products are Safe\r\n\r\nOur manufacturer uses molecular mechanism based formulations consisting of highly concentrated oral spray, dropper, and beverage delivery systems in order to allow for absorption throughout the complete digestive system and to reduce first pass liver metabolism.\r\n\r\nThey have screened over a thousand raw materials and observed very large differences in particle size and solubility.   They then utilized a proprietary screening process to identify raw materials that have the smallest particle size combined with natural methods to balance the hydrophobicity (HLB/LogP) and ionic state (pKa, zeta potential) in a water based delivery vehicle. \r\n\r\nThey have identified numerous food approved, GRAS, and natural products to restore the solubility and bioavailability of most dietary supplements. Their technology delivers completely natural, NOT synthetic, molecules to your digestive system in a form that most closely mimics the hydrated structure found in nature.\r\n\r\nThe Safe \"Nano\" Formulation Process\r\n\r\nAfter extensive experimentation, our manufacturers found that the most effective methods to  enhance the solubility of raw materials is to use a panel of gentle natural methods to disperse (predigest) artificial amorphous aggregates to nanoparticles or smaller (i.e. solution, dispersion, emulsion).\r\n\r\nThey verify the small particle size by ultrafiltration and particle size analysis using laser diffraction.  Unlike the process used in most tablets, they do not add binders, fillers, flow agents, or other artificial excipients.  A brief summary of the natural methods used to make stabilized solutions are discussed below that vary for each raw material used in our molecular mechanism based formulations.\r\n\r\nSolvent is purified water to mimic 70% found in living systems.\r\nMild heat to provide kinetic energy to relax the crystalline lattice of aggregates.\r\nEmulsification with natural nano molecules (e.g. saponins, bile salts, phospholipids).\r\nUse only low energy mixing equipment that does not disrupt chemical bonds (i.e. mimic shear from chewing).\r\nUse natural co-solvents based on LogP and HLB of raw materials (e.g. vegetable glycerin).\r\nAdjust pH to for optimal ionization for solubility and to decrease microbial growth.\r\nAdjust ionic salts to stabilize charged molecules in solution (i.e. Zeta potential).\r\nUse natural preservatives such as rosemarinic acid, glycerine and potassium sorbate (low total dose in 780ul spray).\r\nAdd natural molecules to stabilize active ingredients (e.g. prevent hydrolysis, oxidation, precipitation).\r\nUse standardized raw materials for highest concentration of active ingredients (HPLC standardized).\r\nUse great tasting all natural flavorings and essential oils for improved compliance.\r\nUse natural sweeteners with specific health benefits (e.g. xylitol).\r\n","options":[{"id":10397153,"name":"Default","price":19.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.5,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/29301719/-/vitamin-d-spray-single-v2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/29301719/-/vitamin-d-spray-single-v2.jpg","width":208,"height":242}],"artists":[],"categories":[{"id":164126,"name":"Living Nutrients","permalink":"living-nutrients","url":"/category/living-nutrients"}]}]