[{"id":7522135,"name":"Embroidered Initial Necklace - Personalized.","permalink":"embroidered-initial-necklace-personalized","position":1,"price":38.0,"default_price":38.0,"tax":0.0,"url":"/product/embroidered-initial-necklace-personalized","status":"active","on_sale":false,"created_at":"2012-10-12T00:32:39.000Z","description":"Pick your own colors for this hand embroidered cursive initial necklace!\r\n\r\n+++ Featured! +++\r\n\r\nMy embroidered initial necklaces were featured on the TODAY show in December 2011 and in Better Homes and Gardens magazine in winter 2011!\r\n\r\n_________________________________________________________________________\r\n\r\nPlease read the following information carefully so that your order can be processed and shipped promptly!\r\n\r\n✄This necklace is hand embroidered with ANY Initial in either uppercase or lowercase cursive (see image for examples) - choose either your own first or last initial or that of a loved one or child!\r\n\r\n✄This is a great gift for any wife, girlfriend, mother, sister or friend! Don’t forget the babysitter, your secretary, class mom, child’s teacher and your neighbor!\r\n\r\n✄Also suitable for self-indulgent moments- spoil yourself! You deserve it! Don't you?!*\r\n\r\n✄Dress it up for the office or down for drinks with the girls!\r\n\r\n✄This item is handmade- all necklaces will be different and no two can ever be the same! Letter structure may vary slightly as this is my handwriting and not a font I trace.\r\n\r\n\r\n+++ What Customers Say +++\r\n\r\n“FANTASTIC!! … beautifully made…”\r\n\r\n“My wife loves her new necklace…”\r\n\r\n“The most beautiful necklace!!! My friend LOVED it…”\r\n\r\n“Bought these for my mom and mother in law as wedding gifts. Can't wait to give it to them. Beautiful.”\r\n\r\n“I absolutely love my necklace, it even looks cuter in person!”\r\n\r\n\r\n\r\n+++ Measurements & Materials +++\r\n\r\n✄Oval pendant is 2\" long from very top of the loop to very bottom of the pendant - and approx. 1\" wide.\r\n\r\n✄Circle pendant is 1 3/4 inches long from very top of the loop to very bottom of the pendant - and approx. 1 1/4\" wide.) * See images for example and size reference.\r\n\r\n✄Chain is 18 inches long with small clasp.\r\n\r\n✄Pendant & chain: silver toned. NOT sterling silver.\r\n\r\n✄Fabric & thread: 100% cotton\r\n_________________________________________________________________________\r\n_________________________________________________________________________\r\n\r\n\r\n▶▶▶ How to Order Your Own!\r\n\r\nWhen you add this item to your cart, you will see a space to leave a message - please include the following information in that space:\r\n▶ 1. Letter preference and case (upper or lower – see chart for examples)\r\n▶ 2. Color fabric you’d like\r\n(see third image – please be aware that while I do my best to photograph the colors true-to-life, all monitors display colors differently, please allow some variation between what you see on your screen and what you see in real life.)\r\n▶ 3. color thread you’d like (pretty much any color, too many to list, if I don’t have the color you want, I will let you know. *there is no true \"MINT\" color in thread, and navy threads usually just look black, a request for \"navy\" thread will be made with a dark blue.)\r\n▶ 4. Shape pendant you want – oval or circle\r\n\r\n\r\n\r\n##########################################################################\r\nVERY IMPORTANT :\r\nIf no color/ size/ initial preferences are listed at check out, I will contact you. If I don't hear back from you within five days of purchase I will make & ship a necklace to you that is the same colors, size and initial as the sample image in this listing!! Please please please leave your color and initial and pendant size preferences for me in the notes to seller!! Even if you want your necklace to be EXACTLY like the sample, please just say that in the note to seller so your shipment isn't delayed!\r\n##########################################################################\r\n\r\n\r\n✄My processing/ turnaround time is 3-7 business days.\r\n\r\n✄ For domestic shipment there are two different shipping speeds, please select your preference. Shipping speeds are ESTIMATES and do not include the time it takes to MAKE your order, that is the processing time.\r\n\r\n✄International shipping varies greatly by location but please allow 1-3 weeks as a general rule of thumb!\r\n\r\n✄Custom orders are not returnable!\r\n\r\n✄All necklaces come gift wrapped in tissue paper with ribbon!\r\n\r\n✄All necklaces displayed in this listing are examples only.\r\n\r\n✄Please do not sleep, shower or swim with your necklace on and be sure to treat it nicely!\r\n\r\n✄Please be mindful when purchasing this as a gift for a child as I recommend these for teens & adults!\r\n","options":[{"id":23774345,"name":"Default","price":38.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":4.0,"amount_with_others":0.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/73823399/-/DSC_0078.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/73823399/-/DSC_0078.jpg","width":1000,"height":665}],"artists":[],"categories":[]}]