[{"id":12691734,"name":"Matt Lambert ‘Hoth Vacation’ Fine Art Giclee Print Limited Edition","permalink":"matt-lambert-hoth-vacation-fine-art-giclee-print-limited-edition","position":1,"price":105.0,"default_price":105.0,"tax":0.0,"url":"/product/matt-lambert-hoth-vacation-fine-art-giclee-print-limited-edition","status":"active","on_sale":false,"created_at":"2013-07-31T12:01:08.000Z","description":"-50cm x 50cm\r\n \r\n- Printed by Eye for Colour and certified by the Fine Art Trade Guild.\r\n \r\n- Paper stock: Hahnemuhle – German etching paper 310gsm.\r\n \r\n- Signed Limited Edition of 50.\r\n\r\nIt is obvious that for most of the world’s citizens, the force that rules our lives is consumerism. Even more so than religion, it has the power and total attraction to rob us of reason and common sense. From the day we are born we are sold to. Our nostalgic memories of our childhood  toys mask the truth that in fact they are one of our early exposures to the seductive world of conspicuous consumption. Advertisers emphasise the glory of their products, flatter us by telling us what brilliant items we’ve chosen, and flatter us again by congratulating us on our ability to select from the bewildering range of goodies, only scare us once into keeping up with the ever growing steam train of acquiring “cooler stuff.” In fact, the offer is the freedom to dress, feed and behave identically like a herd of gloriously arrayed but nervy zebras – eat, sleep, procreate and provide lion feed.  Just as we eat, sleep, procreate and provide Board of Director dividends.\r\n \r\nNor is this situation confined to wicked Westerners.  The head of the Mongo tribe does not want a sharper tip to his throwing spear. No, he too is All Consuming.  He wants an AK47, a regular supply of Marlboro Lites, and an SUV preferably with tinted windows and definitely now.\r\n \r\nOur freedom to choose is an All Consuming myth. We are controlled by the dark side, whether that is North Korean dictator tyrants or the Style section of the Sunday Times.\r\n \r\nPlayful arrangements of unlikely figures is a signature of Matt’s work.\r\n \r\n“I am lucky to have experienced a huge variety of cultures in my life. I love to place characters from different worlds in my compositions. The odd juxtapositions creates interesting dialogues between the characters in these strange environments and I enjoy raising questions as to why they occupy the same space.”\r\n \r\nLambert works in oils on a variety of surfaces including canvas, board and even magazine cover. Sweeping loose marks combine with areas of fine detail, resulting in surfaces that are as rich and varied as his subject matter. His influences include African cultures, celebrity magazines, childhood memories, cinema, cultural symbols, urban landscapes, logos, superheroes and Star Wars.","options":[{"id":40381083,"name":"Default","price":105.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.99,"amount_with_others":8.99,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":20.0,"amount_with_others":20.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122088387/-/Matt_Lambert.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122088387/-/Matt_Lambert.jpg","width":600,"height":495}],"artists":[],"categories":[{"id":4321898,"name":"Prints","permalink":"prints","url":"/category/prints"}]},{"id":12691647,"name":"Henry Hate ‘Bruja’ Fine Art Giclee Hand Signed","permalink":"henry-hate-bruja-fine-art-giclee-hand-signed","position":2,"price":200.0,"default_price":200.0,"tax":0.0,"url":"/product/henry-hate-bruja-fine-art-giclee-hand-signed","status":"active","on_sale":false,"created_at":"2013-07-31T11:52:26.000Z","description":"Tattoo Flash 2012\r\n \r\nFine Art Giclee Print 16×20 310 g.s.m Embossed\r\n \r\nFine Black Glitter hand detailed £210 Signed and Numbered Only 10 in limited edition.\r\n\r\nHenry Hate is a self proclaimed lazy, loud foul mouthed, know it all brat whom knows nothing about art, music or tattoos.  Wanted in six international cities and five different time zones for crimes against passion, nature and human decency.  His brazen shamelessness knows no bounds.  Henry is still reputed for cooking up hair brained schemes and cock-a-mammie ideas the world over to keep from working a days honest living and giving into “The Man”.  Henry Hate was born 374 years ago atop the highest peak in the Tragic Kingdom of Orange County, and bares a minor resemblance to what is known as a Yeti or so he would have you think.  Many rum-ours and scandal still persist surrounding the true origin of Henry Hate, mostly at his insistence.\r\n \r\nWorld famous tattoo artist Henry Hate has had such celebrity clients as Amy Winehouse and works out of his tattoo studio in Shoreditch. A man with a big personality, his drawing style is incredible and the prints he produces are divine. This particular print has been hand touched with glitter by Henry and only 10 exist.\r\n \r\nThe colors are rich, vibrant and bold. This print would make a wonderful gift for any avid tattoo fan and is a definite investment piece.\r\n \r\n*FREE GIFT WITH THIS PURCHASE: ANGELIQUE HOUTKAMP’S PRINT ‘KIT KAT’*","options":[{"id":40380888,"name":"Default","price":200.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.99,"amount_with_others":8.99,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":20.0,"amount_with_others":20.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122088195/-/Bruja.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122088195/-/Bruja.jpg","width":617,"height":780}],"artists":[],"categories":[{"id":4321898,"name":"Prints","permalink":"prints","url":"/category/prints"}]},{"id":12691485,"name":"Meggs - Chimera","permalink":"meggs-chimera","position":3,"price":200.0,"default_price":200.0,"tax":0.0,"url":"/product/meggs-chimera","status":"active","on_sale":false,"created_at":"2013-07-31T11:33:40.000Z","description":"Growing up in the Eastern suburbs of Melbourne, David ‘Meggs’ Hooke, immersed himself in the worlds of drawing, cartoons, sci-fi films and skateboarding. In 2000 Meggs graduated from University with a Bachelor of Design and soon after became recognised for stencils and poster art on the streets of Melbourne. In 2004 Meggs became a founding member of the renowned ‘Everfresh Studio’ a unique collective of street artists known for large amounts of collaborative street work and aerosol murals. In 2010 Meggs art directed and designed the ‘Everfresh:Blackbook’ a 254 page publication documenting the studios members, lifestyle and artworks from 2004-2010.The Everfresh Crew have more recently had collective artworks exhibited as part of ‘Space Invaders’ at the National Gallery of Australia in Canberra, as well as being the first artists to exhibit at the National Gallery of Victoria’s (NGV) new NGVStudio space at Federation Square in Melbourne. Thus confirming this unique groups status as historically documented pioneering artists within Australia’s ‘graffiti & street-art’ culture.","options":[{"id":40378992,"name":"Default","price":200.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.99,"amount_with_others":8.99,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":20.0,"amount_with_others":20.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122087697/-/Meggs.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122087697/-/Meggs.jpg","width":700,"height":674}],"artists":[],"categories":[{"id":4321898,"name":"Prints","permalink":"prints","url":"/category/prints"}]},{"id":10192186,"name":"Cope2 - Naturalism","permalink":"cope2-naturalism","position":4,"price":130.0,"default_price":130.0,"tax":0.0,"url":"/product/cope2-naturalism","status":"active","on_sale":false,"created_at":"2013-03-27T12:30:36.000Z","description":"Edition Size: 60\r\n20 x 20 Inches Archival Pigment Print on 330gsm Fine Art Paper\r\n\r\n\"I called this piece Naturalism because the way this piece was done is naturally just how I do it. I'm natural in what I do. I pretty much just freestyle when I do pieces on walls or paintings. I never go with a planned outline or colors. When I do a painting I go about it the same way, I didn't want to call it Natural, so I liked \"Naturalism\". It was created in 2011 towards the end of the year. Sometimes I make paintings a few at a time and basically just used acrylics, enamel and some spray paint.\r\n\r\nThis is a dope painting. It is one of my favorite little canvases, I really do love this painting. I think it was 36 x 36 Inches. It's got a nice classic Cope bubble in pink and blue, right in the back that I used to love to do, just the PE in the back. It's got some pieces of a subway map. If you look at the top corner above the Cope tag in pink, there's a little collage piece of the Berlin subway map. Then all the way under the Naturalism, there's a piece of the New York City subway map. - Cope2","options":[{"id":31894516,"name":"Default","price":130.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.95,"amount_with_others":7.95,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":13.95,"amount_with_others":13.95}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/100145263/-/Cope2_-_Naturalism.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/100145263/-/Cope2_-_Naturalism.jpg","width":900,"height":900}],"artists":[],"categories":[{"id":4321898,"name":"Prints","permalink":"prints","url":"/category/prints"}]}]