[{"id":5759755,"name":"Photoshop for Bloggers","permalink":"photoshop-for-bloggers","position":1,"price":22.0,"default_price":22.0,"tax":0.0,"url":"/product/photoshop-for-bloggers","status":"active","on_sale":false,"created_at":"2012-03-23T01:20:13.000Z","description":"Are you a little intimidated by Photoshop?  Well, guess what?  You don't need to be anymore!\r\n\r\n<i>Photoshop for Bloggers</i> is an introductory guide for bloggers and shop owners and was designed to help you get over your Photoshop anxiety!\r\n\r\nThis e-book is a collaboration between <a href=\" http://www.acutedesigns.org/\">{Acute Designs}</a> and <a href=\"http://yellowheartart.blogspot.com/\">Yellow Heart Art</a> and is written in a user friendly {aka - not crazy tech-ey} language and is complete with step by step instructions and graphics.\r\n\r\nIf you are new to Photoshop or have had it sitting idle on your desktop for months, then you need this e-book in order to make the most of the program.\r\n\r\n<i>Photoshop for Bloggers</i> provides tutorials on:\r\n-creating a vignette on photos\r\n-re-touching photos\r\n-creating blog and shop banners/buttons {with and without photos}\r\n-creating silhouettes\r\n-basic photo editing\r\nand so much more!\r\n\r\nThis guide is meant for the beginner...the blogger who has been relying on free online programs and is intimidated by Photoshop.  The tutorials in this guide are written in either Photoshop 5 or Photoshop Elements.  Some tutorials can be applied to both programs.\r\n\r\nIf this is you - order now!  After ordering, a copy will be emailed to you within 24 hours.  If you don't receive it, please check your junk or spam folder just in case it gets stuck in there :).\r\n\r\n\r\n","options":[{"id":18485627,"name":"Default","price":22.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56542319/-/ps_for_bloggers_blog_size.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56542319/-/ps_for_bloggers_blog_size.jpg","width":475,"height":211}],"artists":[],"categories":[{"id":2614213,"name":"e-Books","permalink":"e-books","url":"/category/e-books"}]},{"id":4837085,"name":"Love Food: Lose Weight: e-Book","permalink":"love-food-lose-weight-e-book","position":2,"price":11.0,"default_price":11.0,"tax":0.0,"url":"/product/love-food-lose-weight-e-book","status":"active","on_sale":false,"created_at":"2011-11-13T08:21:40.000Z","description":"Love Food: Lose Weight\r\n\r\nA Level 1-10 Eating Plan that will help you to lose weight {and keep it off} while eating the foods you love.\r\n\r\nLove Food: Lose Weight is an e-book complete with a month's worth of daily eating plans, recipes, and tips to help you shed a few extra pounds and keep them off.\r\n\r\n                                   <b>Intro excerpt:</b></p>\r\n\r\n<i>One day, I woke up at the age of 25 and the pounds that I was able to evade in my youth now stuck to me.  I knew I wasn’t “fat” by most standards, but I was a little flabby and not happy with my body.\r\nFor years, I would try a new diet/exercise regimen and would end up quitting because….well because exercise and diets are typically horrible.  They are work. \r\n\r\n If you love food as much as I love food, then you want to eat it, not starve or deprive yourself just to look better.   And let’s get real - exercise is boring.  You feel amazing afterwards, but during?  During is the worst.  THE worst!\r\n\r\nI needed a plan that worked for my life.  Not a diet, not a gym membership {that I would never use}, but a plan. A plan that was realistic and maybe even a little fun.    And exercising while watching your favorite reality TV show makes it fun…or at least tolerable.\r\n\r\nBy making a few tweaks to my eating habits, I saw the pounds melt off.  I didn’t need to lose a ton of weight to feel or look better, just a little.  My husband was in the same predicament.  We both wanted to lose a few pounds {our initial goal was 10 each} and gain more energy.\r\n\r\nAfter a month, we both had lost 10 pounds, within 6 weeks, 15.  I was happy with losing 15 as I had far exceeded my goal, but I ended up losing a few more, and this was not on purpose\r\n\r\nAfter two months I was down 17 pounds and my husband was down 20.  The best part of this whole story?  We were able to keep it off.   No starving, major sacrifice, or gym membership required.</i></p>\r\n\r\n\r\nAfter purchase you will be sent a PDF file within 24 hours {often sooner}.  If you don't see the file within a day, please check your junk mail!","options":[{"id":15780593,"name":"Default","price":11.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/62813439/-/lf_lw_newest_logo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/62813439/-/lf_lw_newest_logo.jpg","width":200,"height":250}],"artists":[],"categories":[{"id":2614213,"name":"e-Books","permalink":"e-books","url":"/category/e-books"}]}]