[{"id":4858971,"name":"THE BOOK OF THE DEAD AND WOUNDED","permalink":"the-book-of-the-dead-and-wounded","position":1,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/the-book-of-the-dead-and-wounded","status":"active","on_sale":false,"created_at":"2011-11-16T07:14:20.000Z","description":"PRESS RELEASE\t\t\t\t\t\t6 FEBRUARY 2012\r\n\r\nALICIA BEE LAUNCHES THE BOOK OF THE DEAD AND WOUNDED AT BRUNSWICK BOUND BOOKSTORE.\r\n\r\nAfter a rock and roll concert launch at St Kilda Bowls Club in November, ALICIA BEE formally presents her second book to the literary crowd with ceremony and drinks at BRUNSWICK BOUND BOOKSTORE on  SATURDAY 18 FEBRUARY 2012.\r\n\r\nAustralian rock guitarist STEVE LUCAS will do a special guest performance at the launch between 3 -6pm to compliment readings.\r\n\r\nTHE BOOK OF THE DEAD AND WOUNDED poetry collection celebrates the lives of the deceased in prose, and asks those that are left behind to respond with meditation, tears and anger.\r\n\r\nALICIA BEE captures the limbo left from the grief and funerary process of loosing loved ones, which she likens to an injured state in a hospital. \r\n\r\nTributes to dead people are boxed in the first book section like a museum collection of lifelike stuffed animals; that remind us that our memories preserve mortality after the grave.\r\n\r\nThe cringe surrounding emotions, fear of discussions of suicide and melancholy, are made taboo in glorious detail in this important release designed to change your reaction to death.\r\n\r\nAlicia Bee writes about her relatives, friends and dead pets; exploring aging and the afterlife, in a book that tells us again that it is okay to think about the dead and the lessons they have taught us.\r\n\r\nIf poetry was ever described as depressing the form is taken as strength, for Alicia Bee revels in the dance of macabre arranging this dried flower display as a shrine for your bookshelf. \r\n\r\nAlicia Bee’s first title BATHERS ON THE BEACH is also available through Brunswick Bound bookstore.\r\n\r\nJoin us for the launch with music entertainment on Saturday 18 February afternoon in Brunswick.\r\n\r\nTHE GOOD FOLK CLUB presents a launch of THE BOOK OF THE DEAD AND WOUNDED poetry collection by ALICIA BEE with STEVE LUCAS performing a set on SATURDAY 18 FEBRUARY 2012 at BRUNSWICK BOUND BOOKSTORE at 361 SYDNEY ROAD from 3pm till 6pm, its $25 for the book.\r\n","options":[{"id":15841639,"name":"Default","price":25.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":4.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/47677765/-/DEADCOVERfront.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/47677765/-/DEADCOVERfront.jpg","width":453,"height":594}],"artists":[],"categories":[]},{"id":4903863,"name":"THE BOOK OF THE DEAD AND WOUNDED POETRY WALL HANGINGS","permalink":"the-book-of-the-dead-and-wounded-poetry-wall-hangings","position":2,"price":29.0,"default_price":29.0,"tax":0.0,"url":"/product/the-book-of-the-dead-and-wounded-poetry-wall-hangings","status":"active","on_sale":true,"created_at":"2011-11-22T12:00:16.000Z","description":"The Tibetan Book of The Dead, like the Egyptian scrolls, gives guidance for the afterlife of human souls.\r\nAlicia Bee’s own title ‘The Book Of The Dead And Wounded’ celebrates the lives of the deceased in prose, and captures the limbo left from the grief and funerary process as likened to a hospital state like that of the wounded.\r\nThe cringe surrounding emotions, fear of discussions of suicide and death are made taboo in glorious detail.\r\nHere several poems printed as wall hangings act as daily reminders that it is okay to think about the dead and the lessons they teach us.\r\n\r\n\r\n1. Dead, Dead, Dead.\r\n2. Ward 3 East Angliss.\r\n3. The Boy With The Scar On His Head.\r\n4. Black Swan.\r\nAll poems printed on canvas, poem and drawing by by Alicia Bee, Brunswick 2011, 25 x 20 x 3.5cm, 1/3, $29, \r\nexcept for;\r\n‘Dead Dead Dead’, poem printed on canvas with cotton + kangaroo fur, poem by Alicia Bee, Brunswick 2011, 167 x 96 x 1cm, 1/3 $199.\r\n\r\nAll poems are from The Book Of The Dead and Wounded released November 11 2011.\r\n","options":[{"id":15960827,"name":"Default","price":29.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":4.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48125353/-/blackswanpro.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48125353/-/blackswanpro.jpg","width":556,"height":1000}],"artists":[],"categories":[]},{"id":4903849,"name":"LONG DEAD RAT BONES","permalink":"round-dead-rat-bones","position":3,"price":79.0,"default_price":79.0,"tax":0.0,"url":"/product/round-dead-rat-bones","status":"active","on_sale":true,"created_at":"2011-11-22T11:54:32.000Z","description":"Good Mourning explores grief, aging, the dying of humans and animals. \r\nImages of dead pets along with a found object midden installation are displayed with photography and funeral music.\r\nDead cats, dogs, sheep, kangaroos, fish and chickens are a common fact of our human lives.\r\nIn our society humans indirectly kill more animals than they would ever count.\r\nLoss of pets can be seen to teach children about life cycles, but does the lesson get any easier later in life? For some the loss of a pet can be similar to loosing a life partner. \r\nSome people spend a fortune on pet portraits staged with formality as opposed to those who frame and enlarge any snap of their pet to keep.\r\nThen there are others who may get a taxidermist to stuff their dead pet so that it remains to be a part of their household. \r\nIncludes in this section are photographs of caged animal, snaps of pets and other photos of dead domesticated animals printed onto canvas.\r\nA kangaroo hide also reminds us of the billions of native animals killed each year by our roads, industry or human contact.\r\nAlso available;\r\n\r\n1. ‘Dead Deer’, photo printed on canvas, photo by Alicia Bee, 1996 Healesville, Brunswick 2011, 25 x 20 x 2cm, original artwork, $79.\r\n2. ‘Dead Goat’, photo printed on canvas, photo by Alicia Bee, 1996 Healesville, Brunswick 2011, 25 x 20 x 2cm, original artwork, $79.\r\n3. ‘Dead Rooster’, photo printed on canvas, photo by Alicia Bee, 1996 Selby, Brunswick 2011, 25 x 20 x 2cm, original artwork, $79.\r\n4. ‘Dead Cat x 3’, photo printed on canvas, photo by Alicia Bee, 1996 Selby, Brunswick 2011, 22.5 x 12 x 2cm, sepia, black and white 1/3 $39.\r\n5. ‘Long Dead Rat’, photo printed on canvas, photo by Alicia Bee, Brunswick 2011, 25 x 20 x 2cm, original artwork, $79.\r\n6. ‘Dead Miner’, photo printed on canvas, photo by Alicia Bee, Brunswick 2011, 25 x 20 x 2cm, original artwork, $79.\r\n7-19. ‘Dead Cat’, photo print, photo by Alicia Bee, 1996 Selby, Brunswick 2011, 10 x 15 cm, 1/25 $5.\r\n\r\nAll other art sale enquires available via email viewing through misspiggyjournalist@gmail.com\r\n","options":[{"id":15960811,"name":"Default","price":79.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":10.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56404535/-/longdeadrat6285.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56404535/-/longdeadrat6285.jpg","width":1000,"height":664}],"artists":[],"categories":[]},{"id":4858957,"name":"BATHERS ON THE BEACH","permalink":"bathers-on-the-beach","position":4,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/bathers-on-the-beach","status":"active","on_sale":true,"created_at":"2011-11-16T07:12:05.000Z","description":"Alicia Bee is a Melbourne journalist who freelances to write about music, and non-fiction subjects.\r\nLast year Alicia went to Hawaii for a holiday, and wrote about her experiences; these works diarise a portion of poetry during Winter 2010.\r\nFor the first time Alicia discusses her own physical scars as she compares herself to the world stage at another classic beach destination. \r\nIt is here in these on the road stories that Alicia prides herself by rebirthing the dharma bum title; by writing about Buddhism and unemployment as a mermaid. \r\nBathers On The Beach is her first collection of poems which covers issues of body image and happiness, amongst themes of clothing, planes, rabbits, music, and mud. \r\nTake your ballerina shoes and gumboots for the steep track to and from the beach.\r\n","options":[{"id":15841597,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":3.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/47677413/-/coverscan2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/47677413/-/coverscan2.jpg","width":706,"height":1000}],"artists":[],"categories":[]},{"id":4903827,"name":"GREY HAIR PHOTOGRAPHIC SERIES","permalink":"grey-hair-photographic-series","position":5,"price":79.0,"default_price":79.0,"tax":0.0,"url":"/product/grey-hair-photographic-series","status":"active","on_sale":true,"created_at":"2011-11-22T11:47:24.000Z","description":"ALICIA BEE PHOTOGRAPHER BIOGRAPHY\r\n\r\nAlicia Bee takes too many digital photographs. \r\nSome shots she took of beach rocks are used here in an essay of natural geology aging and human concepts of grey hair.\r\nAs a freelance journalist Alicia also published her photos with stories.\r\nLast year Alicia Bee released Bathers On The Beach collection of poetry that contained her own illustrations.\r\nAlicia plans to continue writing, drawing and taking more colorful photographs. \r\nAs a professional tradesperson Alicia Bee thinks it is okay to do more than one thing at once in her career. ‘Grey Hair’ is her first exhibition of photography and acts as a coming of age celebration.\r\n\r\nAlicia Bee has exhibited Grey Hair at;\r\nStudio 7A Brunswick Street Fitzroy May 2011\r\nShabana Jacobson Gallery Alexandre Parade Fitzroy May 2011\r\nBrunswick Street Galleries June 2011\r\nBurrinja Galleries September 2011\r\nStudio 7A Melbourne Fringe Festival Show Good Mourning October 2011.\r\n\r\n12 remaining from 34 pieces. Original artwork.\r\n\r\n1. Counting dead birds from main beach to Jan Juc. \r\n2. Main Road, Venus Bay. \r\n3. Holiday house linen.\r\n4. Kangaroo on beach road. \r\n5. Harbour Views.\r\n6. My best friend in Beaches.\r\n7. No swimming in the wet season.\r\n8. The secret life of us / Starfish in St Kilda.\r\n9. Salt water on wounds/ Long walk back up the cliff face.\r\n10. Not stopping in Geelong (pictured).\r\n11. Teenage diary, girl on a beach.\r\n12. Nirvana songs on the beach.\r\n\r\nAll photos are printed on canvas, photo by Alicia Bee, Skenes Creek 2008, Brunswick 2011, 25 x 20 x 3.5cm, original artwork, $79.\r\n\r\n","options":[{"id":15960763,"name":"Default","price":79.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":10.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48124897/-/notstoppingingeelong2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48124897/-/notstoppingingeelong2.jpg","width":1000,"height":750}],"artists":[],"categories":[]}]