[{"id":3229281,"name":"ghd IV styler - Limited Edition Pink styler","permalink":"ghd-iv-styler-limited-edition-pink-styler","position":1,"price":179.0,"default_price":179.0,"tax":0.0,"url":"/product/ghd-iv-styler-limited-edition-pink-styler","status":"active","on_sale":false,"created_at":"2011-02-03T07:56:11.000Z","description":"The ghd IV styler is the ultimate tool for creating beautiful hair, putting a multitude of fabulous hair styles at your fingertips. Let your creativity rule with big and bouncy waves, go sleek and glossy with perfectly straight locks or add flawlessly formed curls; with the ghd IV styler the choice is yours.\r\n\r\nGorgeously straight and sleek hair can easily be yours everyday with the ghd IV styler. It’s the essential straightener for smooth and luscious locks. A rounder barrel means that flirty flicks, voluminous waves and perfect curls can be effortlessly created without the need for extra styling tools like curlers or tongs. Have fun with your hair! Play with different hairdos, recreate your favourite celebrity style or give yourself a brand new look. With unique digital technology which controls the temperature for even better and faster styling, the ghd IV styler is all you need to experiment with your tresses","options":[{"id":10995307,"name":"Default","price":179.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31340277/-/ghd.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31340277/-/ghd.jpg","width":535,"height":300}],"artists":[],"categories":[{"id":1865513,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":3229233,"name":"Lady Million Fragrance by Paco Rabanne EDP 80 ml","permalink":"lady-million-fragrance-by-paco-rabanne-edp-80-ml","position":2,"price":75.0,"default_price":75.0,"tax":0.0,"url":"/product/lady-million-fragrance-by-paco-rabanne-edp-80-ml","status":"active","on_sale":true,"created_at":"2011-02-03T07:50:28.000Z","description":"Lady Million is fresh, floral and woody, like a nectar of voluptuous flowers, trailing delicately but still very present. Powerfully seductive, the sparkle of bitter orange with a touch of raspberry reveals the first breath. A burst of neroli follows, smooth and bright. But then the lethal weapon of heady orange blossom slips out of its sheath. Its narcotic sweetness bewitches and grabs all attention. Then, joining with Arabian jasmine underlined by gardenia, the blend soars into something more carnal, yet ever subtle. Now the obsessive pulsing of patchouli enters the fray, pacifying the honey with an addictive and terribly tempting sweetness. Amber spreads to become all enveloping, floating around the beauty, following each movement and offering its most beautiful facets.","options":[{"id":10995171,"name":"Default","price":75.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31339917/-/lady_million.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31339917/-/lady_million.jpg","width":300,"height":330}],"artists":[],"categories":[{"id":1865483,"name":"Fragrances","permalink":"fragrances","url":"/category/fragrances"}]}]