[{"id":176884,"name":"Malveillance \"Just Fuck Off\" cd","permalink":"malveillance-just-fuck-off-cd","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/malveillance-just-fuck-off-cd","status":"active","on_sale":false,"created_at":"2008-11-02T06:44:36.000Z","description":"Malveillance full-length \"Just Fuck Off\" cd (Industry001)\r\nCooperation with Suffering Jesus (Canada) + Sabbathid (Japan)\r\n\r\nTo put it simply, Malveillance d-beat through 22 song of hypnotic and fierce d-beat black metal from Quebec. \r\nAwfully catchy, and definitely quality material from this black metal kraut band with hypnotic, trance-like drum beats, with razor sharped guitars and intense vocals. \r\n\r\nAquarius Records said the following about the release :\r\n\"We love us our twisted, serpentine, ultra complex black metal, the weirder and more demented the better, truly wacked stuff. We love it epic and majestic, sludgy and creepy, but sometimes you just want it simple. Stripped down and furious. A single riff played over and over. A blasting drum beat that just bores full speed ahead.\r\nThus we have France's Malveillance, who manage to take what could be boring and generic and turns it into something fierce and fucked up and kind of frightening. We're beginning to think the French are to black metal, what the Japanese are to pretty much all other music. Whatever it is, twee pop, space rock, take a Japanese band and they can do it better and weirder. Same with France and black metal. Grim buzzing blackness? Find some weird French guy and he can make it sound like a black metal My Bloody Valentine or a blast of barbed white noise. Give them some simple punky black metal and they can turn it into a black spiked juggernaut foaming at the mouth, furiously trampling everything in its path. Malveillance are just that, although not exactly French, more sort of French Canadian, but still simple, punky, D-beat black metal, but infused with such fury that it becomes a droning black beast. It helps that every song is in the same key and played at the same tempo. It's like one hour long song split into 22 parts, or the exact same song played 22 times in a row. Totally repetitive and hypnotic and so mesmerizing. Ultimate black bliss achieved through pummel and repetition!!\r\nPlus how can you resist a record called Just Fuck Off, with a record cover of some guy in the shadows giving us the bird, with a note inside to the listener that says: \"Just Fuck Off... yeah yeah of course but keep one thing in mind; this \"fuck off\" is for all misanthropic losers holding this cd.\"\r\n(Note: Malveillance is from Quebec City, NOT France.)","options":[{"id":802552,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":2.0,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1148506/-/malveillancefuck.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1148506/-/malveillancefuck.jpg","width":729,"height":713}],"artists":[{"id":4962,"name":"Malveillance","permalink":"malveillance","url":"/artist/malveillance"}],"categories":[{"id":162659,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":176932,"name":"Malveillance \"Le Froid du Nord/L'Appel du Neant\" cd","permalink":"malveillance-le-froid-du-nord-lappel-du-neant-cd","position":2,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/malveillance-le-froid-du-nord-lappel-du-neant-cd","status":"active","on_sale":false,"created_at":"2008-11-02T09:21:53.000Z","description":"Malveillance \"Le Froid du Nord/L'Appel du Neant\" cd (Industry03)\r\nCooperation with Suffering Jesus (Canada) + Sabbathid (Japan)\r\n\r\nHere it is finally : the Malveillance re-issue of out of print tapes originally released by Harsh Brutal Cold, along with bonus tracks, new layout and surprise cover songs.\r\nNeedless to say we are very proud to have been part of this reissue, especially considering how much we love Malveillance, considering we co-released the previous 'Just Fuck Off' full-length cd with these same 2 labels.\r\nDefinitely quality material from this black metal kraut band with hypnotic, trance-like drum beats, with razor sharped guitars and intense vocals. This is definitely the most punk sounding Malveillance material produced, not so surprising considering there are 7 (!) Ramones covers on this cd, ditching these oh-so-tiring black metal and Burzum covers done by black metal artists; and instead going for the grandfathers of punk. Good choice, since these songs do sound as if they were Malveillance originals.\r\n\r\nSo this is for those who did not get to have a listen to the original cassettes, the completists, the fans, the punks, the metalheads.\r\n\r\nHere is the track listing :\r\n\r\n1. Effrondrement 01:49\r\n2. Coup Final 01:46\r\n3. Dans le Sang 02:14\r\n4. Le Froid du Nord 02:25\r\n5. Partisan de la Décadence 01:58\r\n6. Le Moment Viendra 01:56\r\n7. Commando 01:17\r\n8. Sterilize (feat. Vorago) 02:04\r\n9. I Can't Be 01:45\r\n10. Eat That Rat 01:24\r\n11. Commando 01:45\r\n12. I Don't Care 01:22\r\n13. Love Kills 01:26\r\n14. I Don't Wanna Be Learned+Tamed 01:19\r\n15. It's A Long Way Back 01:28\r\n16. Les Assoifes 01:34\r\n17. Conformisme (Fuck Off) 01:12\r\n18. Dans la Poussiere des Bombes 01:41\r\n19. L'avenement d'un Temps Nouveau 02:07\r\n20. Au Nom de la Science 01:48\r\n21. L'intolerance enfantee par la Peur 02:09\r\n22. L'extase de Vivre 01:58\r\n23. Comptez Vos Morts...Imbeciles 02:24\r\n24. Vos Idoles Sont des Merdes 01:14\r\n25. Vos Malheurs 02:34\r\n+ unreleased cover songs, we are not saying which ones yet !\r\n\r\nTracks 1-8 are from Le Froid du Nord, originally released on March 23rd, 2005;\r\nTracks 9-25 are from L'Appel du Neant, originally released January 12th, 2006 -Tracks 9-15 are Ramones cover songs.\r\n\r\nAquarius Records wrote about this release like this :\r\n\r\n\"What's more evil and metal and \"I don't give a fuck about humanity\" that slapping on some corpse paint and lurking in the forest for a perfectly grimm band photo? What's more cult than strapping on a bunch of spikes and spitting fire, while a photographer expertly captures the 'ritual' on film? What's more anti-social and BROOTAL than dousing yourself in blood, leering evilly at the camera, and holding as still as possible until the timer clicks and the camera catches your pure evil for eternity?\r\nWell how about just waking up, stepping in front of the mirror on your closet door, and snapping a picture of yourself in all your first thing in the morning, PINK tightie whiteies (pinkies?), socks, baseball jersey and bedhead, frowning grumpily and holding the digital camera in front of you in the mirror? ABSOLUTELY FUCKING NOTHING. Fuck posing and preening and make up and all that, nothing is more grim than the antisocial miscreant captured in his home, where he makes his sick sounds, and where he hides from all the filthy scum outside his front door. The colorful bedspread, the wood paneling, the vinyl tile flooring, the framed pictures above the bed, that stuff is all more intimate and personal and ultimately EVIL than any amount of forests and spiked armbands and bullet belts. Sorry for the rant, we're just a bit obsessed with the band photo on this Malveillance collection, which does in fact feature Mr. Malveillance in a t-shirt and pink undies, scowling at the mirror in his bedroom. Fucking awesome. And somehow, that sort of symbolizes the music of Malveillance pretty perfectly as well. Simple, stripped down, raw. Think Akitsa, Ildjarn, Bone Awl, that sort of super primitive\r\nblasting crusty brutality. But with Malveillance that sound is even more punk, more pummelingly straight ahead. ONE riff over and over and over, repeated to death, the vocals a raspy howl, the drums a D-beat pound, the production raw and lo-fi but still heavy and filthy and grimy and totally BAD ASS. In some ways, it reminds us a bit of a more punk, more blackened Brainbombs.\r\nThis is actually a collection gathering up two previous releases from 2005 and 2006, as well as a handful of bonus tracks from a little earlier. The crazy thing is, there are 7 or 8 RAMONES COVERS! And what's even weirder is they sound perfect, like they could be actual Malveillance jams, all filthied up, sped up, doused in buzz and grit, they sound pretty evil and grim, even the \"hey ho\" parts manage to sound a bit menacing.\r\nWhat more to say. We love this shit, and Malveillance does it as good, if not better than the rest, plus any metalhead with the balls to pose in pink undies and short hair on their record, deserves to have the grim corpse painted hordes bowing at their feet for sure!\"","options":[{"id":802691,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":2.0,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1149066/-/malveillancelappel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1149066/-/malveillancelappel.jpg","width":348,"height":348}],"artists":[{"id":4962,"name":"Malveillance","permalink":"malveillance","url":"/artist/malveillance"}],"categories":[{"id":162659,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":176934,"name":"Burmese/Cadaver Eyes split cd","permalink":"burmese-cadaver-eyes-split-cd","position":3,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/burmese-cadaver-eyes-split-cd","status":"active","on_sale":false,"created_at":"2008-11-02T09:29:27.000Z","description":"Burmese / Cadaver Eyes split cd (Industry002)\r\nCooperation inbetween .New.Scream.Industry. and Heart & Crossbones; released in January 2008. \r\n\r\nWe are extremely excited to say the least, not only to work with two bands we really love (Burmese and Cadaver Eyes); but also with Heart and Crossbone, who released some bands we love as well (Cadaver Eyes, bARBARA, Grave in the sky, amongst others..).\r\n\r\nThe Israelian band Cadaver Eyes is David Opp playing drums armed with triggers that activate a sampler alongside Eran \"zax\" Sachs who uses a no-input-mixer to help produce deep frequencies and drones. They describe what they do as \"octopus-like grinding machine\" , and i must say it gives a good idea of how it is, although it is best to hear it to make have a good idea of it all.\r\n\r\nBurmese. Two basses, no guitars, drums, one singer.\r\nThis is the San Francisco monster that takes influences as varied as WhiteHouse, Brutal Truth, Burzum, Swans, Landed and Dropdead to sculpt their sounds as noisy 16rpm grind, tantrum electronics, confrontational lyrics, assaults for the senses. Simply as a point of reference, these guys did a Whitehouse tribute cd on Planaria (entitled 'White : Interpretations of Whitehouse'), shared a split 7'' w/ 16 Bitch Pile Up on Not Not Fun, 2 full-length albums on tUMULt, the 'Men' album on Load, a split cd with Fistula on Crucial Blast. `Nuff said. Fucking brutal.\r\n\r\nAquarius Records had these comments for the release :\r\n''BURMESE / CADAVER EYES split (Heart & Crossbone / New Scream Industry) cd\r\nWe'd be hard pressed to think of ANY band that could hold their own on a split record with our very own local noiseniks Burmese. But if anyone can, it's Israeli noise combo Cadaver Eyes. But first off, holy shit are we psyched to have new music from Burmese. These guys are seriously sloooooow workers. Other than a handful of shows, we've heard nary a peep from these guys, there was the reissue of the tUMULt release on vinyl, but it's literally been years we've been waiting for a new record. Multiple lineup changes, disastrous tours, scrapped recordings, the sort of luck that has plagued these guys forever. But finally, they've beat the curse, and gotten us 11 new blasts of brutal, speaker shredding ultraviolence. Some confusion mix of Whitehouse style abstract noise, pummeling grind, damaged metal, freaked out power violence. \r\nThey may be down to one drummer, but they still have two bass players, and now THREE vocalists. They sound as good as ever, still furious and freaked out, sometimes offering up sprawling electronic dronescapes, sometimes, frantic flurries of lightning fast grind, sometimes convoluted lurching metallic crunch, and often all of the above at the same time. Hypnotic and heavy and seriously fucked up. Just another reminder, since they're loath to do it themselves outside of their sporadic releases, that these guys are quite possibly the best band in SF.\r\n\r\nBut then there's Cadaver Eyes, recorded live on WFMU, using just drums, vocals and no-input mixing board. And listening to this, it seems impossible that there's not two guitarists and multiple drummers and synths and who knows what else. The sound is dense and freaked out.\r\nSpastic spurts of strangled grind, long stretches of speaker shredding electronic buzz and skree, long drawn out abstract dronescapes of howling vox and pounding drum plods spaced WAY out, culminating in the nearly eight minute closer, beginning with the strangely titled \"Ba Yom Yom\" and finishing off with an absolutely unrecognizable cover of \"Sweet Home Alabama\", a convoluted blow out of maniacally howling vocals, sputtering percussive crunch, LOTS of feedback, and thick walls of rumbling crumbling distortion. Awesome. And about as UN-easy listening as we can imagine.''","options":[{"id":802697,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":2.0,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1149054/-/burmese-cadaver_eyes_album_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1149054/-/burmese-cadaver_eyes_album_cover.jpg","width":697,"height":697}],"artists":[{"id":4963,"name":"Burmese","permalink":"burmese","url":"/artist/burmese"},{"id":4964,"name":"Cadaver Eyes","permalink":"cadaver-eyes","url":"/artist/cadaver-eyes"}],"categories":[{"id":162659,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":176942,"name":"Malveillance \"Fuck Your Gimmicks\" t-shirt","permalink":"malveillance-fuck-your-gimmicks-t-shirt","position":4,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/malveillance-fuck-your-gimmicks-t-shirt","status":"active","on_sale":false,"created_at":"2008-11-02T10:00:15.000Z","description":"Malveillance \"Fuck Your Gimmicks\" T-shirt (Industry001.5)\r\nCooperation between .New.Scream.Industry. + Harsh Brutal Cold White ink on black t-shirt, 1 sided-pint, DIY printing, done manually.\r\n50 made in total, very very few remaining !\r\nSizes : S, M, L, XL.\r\n","options":[{"id":802715,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":7.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1149122/-/malveillance_shirt2copy01.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1149122/-/malveillance_shirt2copy01.jpg","width":800,"height":1000}],"artists":[{"id":4962,"name":"Malveillance","permalink":"malveillance","url":"/artist/malveillance"}],"categories":[{"id":162662,"name":"Tees","permalink":"tees","url":"/category/tees"}]}]