[{"id":396411,"name":"Understanding the VC Process","permalink":"understanding-the-vc-process","position":1,"price":49.99,"default_price":49.99,"tax":0.0,"url":"/product/understanding-the-vc-process","status":"active","on_sale":true,"created_at":"2009-09-14T09:38:54.000Z","description":"Mervin Evans - Understanding the Venture Capital Process is a 4 Data CD/ Audio CD / DVD Set. The reader must have a computer with a PDF Reader or Adobe Acrobat to use this product. Mervin Evans, is a highly respected crisis managemet consultant with offices in Los Angeles, CA. This package provides a step by step guide to getting a business funded by a Venture Capital firm You can get prepared for your VC process by learning what types of questions venture capitalists will ask, what intrigues them, their motives for asking specific questions, and what they want to hear. Venture Capital is the process by which investors fund early stage, more risk oriented business endeavors. A venture capital funding arrangement will typically entail relinquishing some level of ownership and control of the business. The investment is usually in the form of stock or an instrument which can be converted into stock at some future date. ","options":[{"id":1591511,"name":"Default","price":49.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3218287/-/41G8642D1AL__SS500_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3218287/-/41G8642D1AL__SS500_.jpg","width":464,"height":352}],"artists":[],"categories":[{"id":313846,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":396415,"name":"VC MADE  EASY","permalink":"vc-made-easy","position":2,"price":149.99,"default_price":149.99,"tax":0.0,"url":"/product/vc-made-easy","status":"active","on_sale":true,"created_at":"2009-09-14T09:41:35.000Z","description":"Learn How to Talk to Venture Capitalists \r\n\r\nThe process of venture funding will take several meetings. During most of the meetings, you and the venture capitalist will be dealing from the business proposal you previously sent him. It is necessary for the venture capitalist to understand your product or service. \r\n\r\nBringing along the actual product will go a long way in this process. Stay focused on your business plan. Meetings can sometimes last several hours and you may become talkative. Avoid mentioning any grandiose plans you may have for the future. Also, do not mention any products that were not covered in the business plan. Such conversation could present you as a dreamer, or someone who is trying to run before learning how to walk.\r\n","options":[{"id":1591525,"name":"Default","price":149.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3218331/-/vcxx.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3218331/-/vcxx.jpg","width":500,"height":500}],"artists":[],"categories":[{"id":313846,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":396416,"name":"REG  D  RULE  504","permalink":"reg-d-rule-504","position":3,"price":139.0,"default_price":139.0,"tax":0.0,"url":"/product/reg-d-rule-504","status":"active","on_sale":true,"created_at":"2009-09-14T09:43:46.000Z","description":"Reg D Rule 504 Made Easy! is a package of 6 Audio CD / DVD /Data CD Set.\r\n\r\n\r\nReg D Rule 504 Made Easy! is an exciting program that forces you to research and plan for the future. Each questions helps you define your funding package into a professional funding request. \r\n\r\nRule 504 : Offerings allow a business to raise a maximum of $1 million, less the total dollar amount of securities sold during the preceding 12 month period, under Rule 504, Rule 505 or Section 3 of the act. However, a business can raise only $500,000 by the sale of securities to persons residing in the states of Montana and Alaska, which have no disclosure laws applicable to the offering. For the states that do have disclosure laws, which are 48 out of the 50 states, a business can raise up to $1,000,000. Rule 504 has no prescribed disclosure requirements, no limit on the number of purchasers, and no investor sophistication standards. \r\n\r\nRule 504 is the most commonly used Regulation D exemption. Offerings that are exempt under Rule 504 are relatively simple to prepare, which reduces cost and delay and can generally be underwritten by the offering company (the securities being sold by the company's own officers, directors and employees). \r\n","options":[{"id":1591530,"name":"Default","price":139.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3218335/-/zregd.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3218335/-/zregd.JPG","width":552,"height":1000}],"artists":[],"categories":[{"id":313846,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":396421,"name":"FIX  THAT  CREDIT","permalink":"fix-that-credit","position":4,"price":19.95,"default_price":19.95,"tax":0.0,"url":"/product/fix-that-credit","status":"active","on_sale":false,"created_at":"2009-09-14T09:48:15.000Z","description":"Single  DVD  that Teach you how  to Fix Your Credit in 30 Days<P><object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/U3Az1EbWL1c&hl=en&fs=1\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/U3Az1EbWL1c&hl=en&fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"></embed></object>\r\n\r\n","options":[{"id":1591536,"name":"Default","price":19.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3218371/-/fixcredit.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3218371/-/fixcredit.jpg","width":738,"height":742}],"artists":[],"categories":[{"id":313846,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":396427,"name":"How to Start & Raise Capital for Your Business","permalink":"how-to-start-raise-capital-for-your-business","position":5,"price":129.99,"default_price":129.99,"tax":0.0,"url":"/product/how-to-start-raise-capital-for-your-business","status":"active","on_sale":true,"created_at":"2009-09-14T09:51:50.000Z","description":"How to Start & Raise Capital for Your Business is a 100 Page Workbook and 4 - Audio CD Package design new business organize their a Funding Plan.\r\n\r\nLynette A. Bigelow, President Bigelow Associates A Venture Matching Service\r\n\r\nBIGELOW ASSOCIATES provides a screening service for busy investors. BIGELOW ASSOCIATES reviews business plans and sends the investor only those business summaries that match the investor's interests. At the investor's request, BIGELOW ASSOCIATES provides an introduction to the prospective company. BIGELOW ASSOCIATES then leaves any discussions directly up to the two parties.\r\n\r\nBIGELOW ASSOCIATES provides an innovative introduction service for investors and entrepreneurs based on their mutual business interests. BIGELOW ASSOCIATES introduction service is selective, timely and confidential.\r\n\r\nBIGELOW ASSOCIATES addresses the critical funding needs of entrepreneurial ventures by providing a quick and cost-effective way for entrepreneurs to reach a variety of venture capital investment sources. BIGELOW ASSOCIATES can assisted companies in raising capital from $50,000 to more than $5,000,000. Transactions include equity, loans, and joint ventures.\r\n\r\nAbout the Author\r\nWhen Results Matter - Lynette Bigelow\r\n\r\nIf you are seeking start-up funding for a new business or funds for expanding your present business, your investors or banker will expect you to have a business plan available for their review. You Need to Know it! All businesses need a plan to define where they are going and how they are going to get there.\r\n\r\nA good business plan saves you money and time by focusing your activities, your marketing strategies, and business objectives, please create more profit centers. It's hard to take a business seriously when there is little or nothing in writing about its history, its current organization and management, its future direction, or position in the market place. This is why a business plan may be the most important business document that you will ever prepare.\r\n\r\nIt is time to get you funded! ","options":[{"id":1591546,"name":"Default","price":129.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/3218395/-/519X847NSRL__SS500_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/3218395/-/519X847NSRL__SS500_.jpg","width":500,"height":500}],"artists":[],"categories":[{"id":313846,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]