[{"id":4818815,"name":"TERMS AND CONDITIONS","permalink":"terms-and-conditions","position":1,"price":1.0,"default_price":1.0,"tax":0.0,"url":"/product/terms-and-conditions","status":"sold-out","on_sale":false,"created_at":"2011-11-10T16:47:26.000Z","description":"WHAT FORMS OF PAYMENT DO YOU ACCEPT?\r\n\r\nWe gladly accept Visa, MasterCard, American Express, Discover, or regular account payments all through PayPal.\r\n\r\n\r\nHOW SECURE IS THIS STORE?\r\n\r\nThis store uses PayPal for payments, and PayPal automatically encrypts your confidential information in transit from your computer to ours using the Secure Sockets Layer protocol (SSL) with an encryption key length of 128-bits (the highest level commercially available).\r\n\r\n\r\nDO I NEED A PAYPAL ACCOUNT TO PURCHASE FROM THIS STORE?\r\n\r\nNo, you are not required to have a PayPal account to purchase from this store. Please click \"Don't have a PayPal account?\" and continue payment with your creditcard.\r\nAlthough if you already have a PayPal account you may use it.\r\n\r\nSHIPPING?\r\n\r\nWe ship within 7 days by Post Danmark\r\nWe only ship in Denmark, but contact us if you have any special request. We will try our best to help you.\r\n\r\n\r\nMY PURCHASE ARRIVED DAMAGED; WHAT DO I DO?\r\n\r\nIf things should go wrong for any reason, here is what you do. All damaged or defective items must be returned with the original invoice and in the condition in which you received it. Indicate on the back of the invoice, or in an attached letter, why you are returning the item(s). If your order arrived damaged please return it right away so we can send you a replacement. Shipping charges will only be refunded in the case that the error was our responsibility. If you give us the wrong address or move to a new apartment without notifying us and your package is returned, we will charge you for shipping it to the correct location.\r\n\r\n\r\nRETURNS SHOULD BE SENT TO:\r\n\r\nTANK Artshop\r\nMejlgade 48a\r\n8000 Aarhus C\r\n\r\nHOW DO REFUNDS WORK?\r\n\r\nAll refunds, including any refunds for return shipping charges, will be credited to the credit card used in your purchase. We will do everything we can to refund quickly and you will be notified of your refund by e-mail.\r\n\r\nI'M NOT SATISFIED, WHERE DO I VENT MY FUSTRATIONS?\r\n\r\nIf you are not satisfied with our service please let us know. We will replace, repair, rebuild, resend, redo, re-stamp, and or reseal anything that disappears into shipping oblivion.","options":[{"id":15729315,"name":"Default","price":1.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/47272711/-/horizontal_solution_PP.gif","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/47272711/-/horizontal_solution_PP.gif","width":210,"height":80}],"artists":[],"categories":[{"id":2606629,"name":"Terms and conditions","permalink":"terms-and-conditions","url":"/category/terms-and-conditions"}]}]