[{"id":5293397,"name":"Jayne Cobb Hat Firefly Series Serenity Multi Color Ear Flap Hat","permalink":"jayne-cobb-hat-firefly-series-serenity-multi-color-ear-flap-hat","position":1,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/jayne-cobb-hat-firefly-series-serenity-multi-color-ear-flap-hat","status":"active","on_sale":false,"created_at":"2012-01-20T22:48:29.000Z","description":"Are there any Firefly fans out there? I loved the short run series Firefly and wish so much that another network would pick it up, so that I can get at least closure with the series...ya know what I mean. They tried with Serenity, but I need MORE!! lol<P>\r\n\r\nMy favorite character besides Capt. Mal is Jayne....so serious, but really a teddy bear.<P>\r\n\r\nMy friend got me hooked on the series and so in thanks I made him a Jayne earflap hat.<P>\r\n\r\nAnyone going to a Browncoats convention this year?<P>\r\n\r\nI make these hats for cosplay, conventions or just in support of a great television series. Can make it any size, just email me.<P>\r\n\r\nIt is made of soft cotton blends yarn and all details are handsewn on. You may handwash it and lay flat to dry. I make my items to last for years to come.\r\n\r\nAll my creations are created in a clean air environment.\r\n\r\nThank you for stopping by Fashion Diva Crochet.\r\n\r\nPlease make my shop a Favorite, as I am adding new and unique items all the time.\r\n\r\nSHIPPING PRICES ARE FOR THE US ONLY. IF YOU ARE OUT OF US, PLEASE EMAIL FOR AN EXACT SHIPPING QUOTE...THANK YOU!<P>\r\n\r\n<font color=\"red\"><B>Please come join my blog at <a h ref=\"http://fashiondivacrochet.blogspot.com\">Fashion Diva Crochet Blog where I will be showcasing the new crocheted items that I will be putting in my shops, as well as giving crochet tutorials and also I will be sharing my love for nail art and my designs and others designs and last but not least, I am on a weight loss journey goal that I will be sharing through eating low carb....won't you please come and be a part....","options":[{"id":17139189,"name":"Default","price":25.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/51973115/-/tn_100_0821.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/51973115/-/tn_100_0821.JPG","width":800,"height":600}],"artists":[],"categories":[{"id":2251977,"name":"Character Hats","permalink":"character-hats","url":"/category/character-hats"}]}]