[{"id":4755675,"name":"Invigorating Ginger & Lime Salt Scrub","permalink":"invigorating-ginger-lime-salt-scrub","position":1,"price":7.95,"default_price":7.95,"tax":0.0,"url":"/product/invigorating-ginger-lime-salt-scrub","status":"active","on_sale":false,"created_at":"2011-11-02T03:18:13.000Z","description":"\"A luxurious body treat designed to revive and invigorate. Made with energising ginger, refreshing lime and therapeutic dead sea salts to reveal brighter, more radiant skin.\"\r\n\r\n\"A natural range of honest and therapeutic body care.\" \r\n\r\nRemarkably, 60-70% of the products we directly apply to our skin each day will be absorbed into our tissues and bloodstream. Therefore it only makes sense to apply rich, nourishing, wholesome ingredients to bring out your skin’s potential. It is for this reason I have decided to create Be Beautiful skin & body care. \r\n\r\nMy products are living and I feel you will notice the difference compared to the conventional, generic, chemical-rich products found in most beauty departments. As a result the shelf life isn't dramatically extended by preservatives yet it will last for a good 12-18 months. \r\n\r\nAll Be Beautiful products are made by hand to ensure quality and only the finest, natural ingredients are used; nourishing plant oils, high quality essential oils, ethically sourced salts and so much more.\r\n\r\nI really believe in this product and hope you do too! Any questions please email rebecca@bebeautifulblog.org ","options":[{"id":15553215,"name":"Default","price":7.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.5,"amount_with_others":1.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":4.0,"amount_with_others":2.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46630347/-/photo.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46630347/-/photo.JPG","width":400,"height":316}],"artists":[],"categories":[]}]