[{"id":2525551,"name":"Testify \"Triviality Beyond Acceptance\"","permalink":"testify-triviality-beyond-acceptance","position":1,"price":13.99,"default_price":13.99,"tax":0.0,"url":"/product/testify-triviality-beyond-acceptance","status":"active","on_sale":true,"created_at":"2010-04-27T16:31:23.000Z","description":"Another great band to add to my aggravation of the \"first listen\" as they have 4 other releases prior..grrrrr! Real beefy Industrial/Metal stuff from Germany in the realms of Rammstein, Pitchshifter,NIN,Ministry and Skrew and ironically enough, a few I mentioned have had appearances on Testify's other releases and also KMFDM (I think this band just reversed their letters for a new name if I remember correctly). Besides extensive touring, Testify has been given a reasonable amount of airplay on MTV (that's a shock actually since I hardly see videos on there anymore). 11 tracks and mainly on the basis of the bizarre, abstract and unorthodox vocal/narration fixtures as well as the samples and loops used....phenomenal ideas to keep them very identifiable. It's very early in the New Year but hands down on this one so far for my best Industrial picks. vanrichter.net/testify.html","options":[{"id":8966841,"name":"Default","price":13.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24336371/-/triviality.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24336371/-/triviality.jpg","width":300,"height":300}],"artists":[{"id":42821,"name":"Testify","permalink":"testify","url":"/artist/testify"}],"categories":[{"id":1517171,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2526541,"name":"The Fair Sex \"Labyrinth\"","permalink":"the-fair-sex-labyrinth","position":2,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/the-fair-sex-labyrinth","status":"active","on_sale":true,"created_at":"2010-04-27T18:00:38.000Z","description":"The year is 2038 and Tancer is a young man who has been living for too long under the oppressive rule of Cyberbite, a global company that, by providing artifical lifeforms for human pleasure, has managed to subjugate mankind. This aggressive, industrial 6 song collection chronicles Tancer's quest to escape that life . Among the best cuts are \"Madadonia\", a surprisingly kinetic composition that relates his meeting with a traitorous ex - revolutionary, and the guitar/synthesizer duel of \"Get Lost\", which recounts Tancer's race through a massive underground labyrinth. The story itself (included in a separate seven - page document and also available on the internet). The music is dynamic,driving and dancable. The songs tend to advance the action rather than the written words, and although the overall results are mixed, sonically this \"cyberoperatic\" idea represents an interesting concept that deserves to be furtherexplored by both the listener and band. vanrichter.net/tfs.html","options":[{"id":8971401,"name":"Default","price":14.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24336651/-/laby.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24336651/-/laby.jpg","width":337,"height":334}],"artists":[{"id":42891,"name":"The Fair Sex","permalink":"the-fair-sex","url":"/artist/the-fair-sex"}],"categories":[{"id":1517171,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2526631,"name":"Girls Under Glass \"Equilibrium\"","permalink":"girls-under-glass-equilibrium","position":3,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/girls-under-glass-equilibrium","status":"active","on_sale":true,"created_at":"2010-04-27T18:05:08.000Z","description":"Equilibrium is the U.S. issue of Girls Under Glass' 1999 album of the same title, out on the Van Richter Records label. The album includes the original 9 tracks, plus a cover of Kraftwerk's \"Radioaktivitat\" by the Girls Under Glass side-project Trauma, as well as two additional hidden tracks. The first track, \"Roses of Death\", sets the tempo for the album - slow, melodic and definitely falling somewhere between goth-rock and goth-metal. The mixture of male and female vocals on this album is quite a change from the previous album, Firewalker, a very hard-edged industrial inspired album. The interplay of guitar/bass/drums and electronics is well done, with the electronics not overpowering, but complimenting the rest of the sound, such as the song \"New World Order\". \"Wings\" and Future Assault\" are some of the catchier songs, and \"Desire Lasts Forever\" has a unique, electronic vocal style that is refreshing. Equilibrium is a much mellower album than earlier works. The songs are well crafted, diverse, and stand the test of time, having been produced nearly seven years ago. This album would be a welcome addition to anyone who enjoys goth-rock/darkwave music with a bit of a metal edge to it. vanrichter.net/gug.html","options":[{"id":8971781,"name":"Default","price":14.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24337771/-/gug_equilib.gif","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24337771/-/gug_equilib.gif","width":343,"height":340}],"artists":[{"id":42911,"name":"Girls Under Glass","permalink":"girls-under-glass","url":"/artist/girls-under-glass"}],"categories":[{"id":1517171,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2526711,"name":"Sielwolf \"Metastasen\"","permalink":"sielwolf-metastasen","position":4,"price":13.99,"default_price":13.99,"tax":0.0,"url":"/product/sielwolf-metastasen","status":"active","on_sale":true,"created_at":"2010-04-27T18:07:50.000Z","description":"Fuck Nine Inch Nails and Minstry. When it comes to ultra-brutal and aggressive Industrial Mayhem there's a new sheriff in town and his name is Sielwolf. In construction lingo a sielwolf is a fast rotating ball, trimmed with razor sharp claws, cleaning canalization waste pipes. In metal lingo Sielwolf is a raging musical nightmare with razor sharp blast riffs and disturbingly chaotic, disjointed rhythms that smash into your skull until brain matter starts to seep out your ears. Ultra-wicked samples from genre classics like Cape Fear and Henry, Portrait of a Serial Killer are woven flawlessly into complex over-the-top brutal compositions that will linger long after the CD winds down. Clocking in at almost 75 minutes, Metastasen is a true test of human endurance. vanrichter.net/sielwolf.html","options":[{"id":8971981,"name":"Default","price":13.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24338131/-/metastasen.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24338131/-/metastasen.jpg","width":351,"height":353}],"artists":[{"id":42921,"name":"Sielwolf","permalink":"sielwolf","url":"/artist/sielwolf"}],"categories":[{"id":1517171,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":2526791,"name":"Underwater Pilots \"Tranquil Places\"","permalink":"underwater-pilots-tranquil-places","position":5,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/underwater-pilots-tranquil-places","status":"active","on_sale":true,"created_at":"2010-04-27T18:13:21.000Z","description":"Tranquil Places is the debut release for the German duo of Manuel G. Richter and Gregoire Vanoli, released in Europe in 2004, but now available in the U.S. on Van Richter Records. For being four years old, this is a quality synthpop release, with a few other musical influences to add some pizazz.The album starts out with its two strongest tracks, \"Loud and Clear\" and \"Welcome to the World\", both catchy tracks, almost making this album a must buy for these tracks alone. \"Loud and Clear\" has a strong, consistent beat, which, coupled with the vocals, makes this a memorable song. \"Welcome to the World\" is both more up-tempo, and at the same time, down tempo, vocally, giving it a futurepop kind of sound. Both songs will get stuck in your head.At times, the album sounds somewhat like Seabound or Depeche Mode, especially on \"Leaving Home\", where it seems like a fusion of the two, but in general, Underwater Pilots avoids sounding too much like other contemporary bands. There are also some treats on this album, like the quirky \"Ice Cream\", a strange song, which proves that this duo has a bit of a sense of humor, albeit a bit kinky. There's also a drum-n-bass infused track towards the end of the album called \"My Darkness\".The album finishes with two remixes, one of \"Loud and Clear\" by Dope Stars Inc. and one of \"Welcome to the World\" by Mimetic. The first remix definitely adds a more standard guitar/bass/drums sound that makes the remix interesting. The Mimetic remix is very IDM, which, while different from the original song, isn't as good.For an album that is already four years old, this album still sounds fresh. Tranquil Places, as a whole, is a great listen and has enough diversity in it to distinguish it from the sea of acts out there. I would definitely recommend picking up this album - you won't regret it vanrichter.net/up.html","options":[{"id":8972121,"name":"Default","price":14.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24338891/-/tranquil.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24338891/-/tranquil.jpg","width":350,"height":350}],"artists":[{"id":42931,"name":"Underwater Pilots","permalink":"underwater-pilots","url":"/artist/underwater-pilots"}],"categories":[{"id":1517171,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]