[{"id":4255075,"name":"Fiver","permalink":"fiver","position":1,"price":120.0,"default_price":120.0,"tax":0.0,"url":"/product/fiver","status":"active","on_sale":false,"created_at":"2011-08-14T08:00:32.000Z","description":"Name:  Fiver (5r)\r\nModel:  Prophet\r\nScale : 1/6\r\nSize:  8\"\r\n\r\n     Even for a Prophet, Fiver was special; his abilities seemed far beyond those of other Prophet models. His predictions made no sense to many, but always came true. He admitted his plan for the Last Stand had a low chance for success, but he also said it was the only choice. Many Protectors disagreed, but Flo came down with an iron fist, literally, and the robots followed the plan.\r\n\r\n     Fiver’s description of the bond between Protector and Human making them whole was also considered nonsense, but Ella and Flo proved him right yet again.","options":[{"id":14018731,"name":"Default","price":120.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":5.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":25.0,"amount_with_others":25.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41711503/-/5r-600.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41711503/-/5r-600.jpg","width":600,"height":600}],"artists":[],"categories":[{"id":2358595,"name":"PRCT Robots","permalink":"prct-robots","url":"/category/prct-robots"}]},{"id":4255091,"name":"Omar","permalink":"omar","position":2,"price":220.0,"default_price":220.0,"tax":0.0,"url":"/product/omar","status":"coming-soon","on_sale":false,"created_at":"2011-08-14T08:04:47.000Z","description":"Name:  Omar\r\nModel:  Bombshell\r\nScale : 1/8\r\nSize:  16\"\r\n\r\n\r\n     Omar, an obedient soldier, feels guilty to be one of the few Bombshell survivors of the Last Stand. It was not until after the final battle that Omar had experienced the feeling of guilt.  In the Last Battle, the Bombshells linked to create a giant shield that absorbed all of the energy that was meant to put an end to the human race. This  allowed Flo and a small team of Decimators to attack and destroy the enemy forces once and for all. Absorbing the vast enemy weaponized energy took time, and many of the Bombshells were destroyed.\r\n\r\nWhen this happened, as every atom of the shell was straining to stay whole, it would get eerily silent for a brief moment as air rushed into a space where it was never supposed to go. Then, with a loud crack, the shell would give, and the Bombshell would disintegrate in a spine-chilling sound that some described as the infinite scream.\r\n\r\nPerhaps it was the impact of the destruction of so many of the PRTCr's in such a small amount of both time and space, the air filled with silence and the scream-like sounds of matter ripping asunder in a cacophonous yet somehow musical refrain. Somehow in that experience, Omar gained a new understanding. He realized for the first time that he had choice, and he felt loss.\r\n\r\nOmar came to divide his existence into two time periods, Old Omar, the order-following, unfeeling machine and New Omar, who had choice and who could feel loss.","options":[{"id":14018765,"name":"Default","price":220.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41600663/-/bombshell.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41600663/-/bombshell.jpg","width":693,"height":693}],"artists":[],"categories":[{"id":2358595,"name":"PRCT Robots","permalink":"prct-robots","url":"/category/prct-robots"}]},{"id":4255099,"name":"Flo","permalink":"flo","position":3,"price":240.0,"default_price":240.0,"tax":0.0,"url":"/product/flo","status":"coming-soon","on_sale":false,"created_at":"2011-08-14T08:08:32.000Z","description":"Name:  Flo\r\nModel:  Decimator\r\nScale : 1/8\r\nSize:  14\"\r\n\r\nThe Decimator was the most powerful fighter, and most adaptable PRTCr. Only a handful of Decimators made it through the war, with many dying in the Last Stand.\r\n\r\nIn addition to a vast array of weaponry, the Decimators had lightning-fast reflexes, and the ability to analyze and adjust to rapidly changing conditions in the heat of battle. This ability included visualizing a long sequence of actions and reactions in nanoseconds. Because they were able to remain calm and coldly evaluate options and react with deadly, and sometimes suicidal, consequences many people assumed that Decimators were incapable of feeling.\r\n\r\nFlo was the first PRTCr to re-establish contact with humans 10 years after the Last Stand.  Flo's relationship with Ella made it clear that Decimators could, in the right circumstances, feel.\r\n","options":[{"id":14018775,"name":"Default","price":240.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41711775/-/flo-1100.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41711775/-/flo-1100.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":2358595,"name":"PRCT Robots","permalink":"prct-robots","url":"/category/prct-robots"}]}]