[{"id":12693711,"name":"A Espetacular Charanga do França","permalink":"ep-7-a-espetacular-charanga-do-franca","position":1,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/ep-7-a-espetacular-charanga-do-franca","status":"active","on_sale":false,"created_at":"2013-07-31T14:31:18.000Z","description":"<img src=\"http://gomagringadiscos.com/GG_webdata/7inch.png\" alt=\"LP\">\r\n\r\nEntre pesquisas de novos caminhos musicais e influências da música brasileira, do Jazz e das tradições Afro-Brasileiras, o saxofonista e compositor Thiago França apresenta ‘A Espetacular Charanga do França’.\r\n\r\n\tIdealizada em Janeiro de 2013, no periodo de pré-carnaval, a banda, liderada por Thiago França, propõe uma releitura das tradicionais charangas brasileiras, colocando-as num espaço de interpretação mais amplo onde se encontram, entre outros, Cumbia, Maxixe, Jazz, Samba e Ragga.\r\n\r\n<i>“1942, dia 11 de Outubro, dia da partida decisiva do campeonato Carioca, disputando Flamengo e Fluminense. Esse dia, contra todas as expectativas, a surpresa não veio do campo mas das arquibancadas quando, Jaime Rodrigues de Carvalho, accompanhado de 15 amigos músicos, fizeram ressoar o trombone, as duas clarinetes e a dezena de instrumentos de percussão trazidos com eles! Nascia a primeira Charanga brasileira!”</i>\r\n\r\n\tA Espetacular Charanga do França réune 7 músicos de sopro e percussão;\r\nThiago França no sax alto, composições e arranjos, Anderson Quevedo (sax barítono), Amilcar Rodrigues (trompete), Didi Machado (trombone), Samba Sam (surdo), Tony Gordin (percussão, bateria), Welington Pimpa Moreira (bateria, percussão).\r\n\r\n\tInteiramente acústico, o disco gravado, mixado e masterizado por Carlos Lima no estúdio paulista YB, apresenta 4 faixas explosivas em formato compacto que enriquessem a personalidade tradicional das Charangas. Uma atenção especial foi dada a cada etapa da gravação e da produção para preservar o tom e a qualidade acústica.\r\n\r\n\tA capa, interpretação visual do disco, é uma illustração assinada por Kiko Dinnuci. A impressão gráfica caracteriza-se pelo uso da técnica artesanal LetterPress realizada no Estudio Carimbo.\r\n\r\n\tOrgulhosamente, a Goma Gringa lança com exclusividade o compacto numa <b>edição limitada de 300 cópias</b>.\r\n\r\n<iframe width=\"100%\" height=\"350\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/15047902&amp;color=ff6500&amp;auto_play=false&amp;show_artwork=true\"></iframe>\r\n\r\n<hr color=\"#a3a3a3\" size=\"1\" width=\"100%\"> \r\n\r\n<b>4 faixas explosivas misturando Cumbia, Maxixe, Jazz, Samba e Ragga<br>\r\n\r\nCapa especial que se desdobra para se tornar um cartaz. Assinada por Kiko Dinucci e impressa em LetterPress<br>\r\n\r\nEstritamente limitado a 300 cópias!<br>\r\n\r\nESSENCIAL!</b>","options":[{"id":40385904,"name":"Default","price":45.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129609456/-/charanga_001.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129609456/-/charanga_001.jpg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129644862/-/charanga_003.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129644862/-/charanga_003.jpg","width":1000,"height":500},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129644676/-/charanga_004.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129644676/-/charanga_004.jpg","width":640,"height":640}],"artists":[{"id":222381,"name":"A Espetacular Charanga do França","permalink":"a-espetacular-charanga-do-franca","url":"/artist/a-espetacular-charanga-do-franca"}],"categories":[{"id":6946023,"name":"Vinil","permalink":"vinil","url":"/category/vinil"},{"id":5891532,"name":"Compacto","permalink":"compacto","url":"/category/compacto"}]},{"id":12693723,"name":"Quebrante","permalink":"7-quebrante-soundsytem","position":2,"price":45.0,"default_price":45.0,"tax":0.0,"url":"/product/7-quebrante-soundsytem","status":"active","on_sale":false,"created_at":"2013-07-31T14:32:26.000Z","description":"<img src=\"http://gomagringadiscos.com/GG_webdata/7inch.png\" alt=\"LP\">\r\n\r\nMais que uma banda, Quebrante é um conceito, uma experiência.\r\n\r\nIdealizada em 2002 pelo músico parisiense Matthieu Hébrard e o dj paulistano Will Robson, a dupla é o núcleo da banda cuja formação esta em constante movimento, feito de encontros musicais diversos, concretizados no estudio durante as gravações.\r\n\r\nO processo de criação do Quebrante tem como ponto de partida a realização de uma batida, numa linha hiphop, por Will. Batida na qual Matthieu vem dinamizar os graves tocando contrabaixo, sem pretensão, num fraseado simples ligado ao Funk e ao Dub. Loops, teclados, efeitos, scratchs e outros arranjos são addicionados até consolidar uma faixa que servirá de base para colaborações e intervenções músicais futuras.\r\n\r\nDe la vai a vida, e os seus encontros. Amigos músicos, cantores, amigos de amigos... a base fica tocando para quem quer ouvir e, a porta aberta para quem sente o suficiente de afinidade para participar do projeto colectivo. \r\n\r\nEnsaios, sessões de estudio, mais encontros, mais sessões, passo a passo, nota a nota, a escada criativa é subida, cada um trazendo uma pedra na construção de um projeto cada vez mais rico. Não tem direções fechadas, os músicos convidados ficam livres nas próprias interpretações pois o objetivo é de abrir novas perspectivas musicais. \r\n\r\nAssim, a cada ínicio de sessão fica apenas uma pergunta excitante no mente da nossa dupla: o que vai sair?\r\n\r\nO resultado é uma mistura fervente de antigo e de novo, de sonoridades e de influências tão variadas quanto as intervenções dos convidados.\r\n\r\nÉ nesse resultado que existe Quebrante! Quando de um núcleo de duas pessoas nasce uma colaboração criativa e musical de seis, sete ou oito pessoas que, além de tocar uma música genuína, formam uma verdadeira banda! Banda efêmera, sim, mas uma banda!\r\n\r\nEsse primeiro compacto apresenta 2 faixas com participações de Mzézung (baixo e voz), Will Robson (programação, voz e scratches), Marcelo Cabral (guitarra, teclado, synths e programação), Thiago França (saxofone), Dani Nega (voz), Stefanie Roberta (voz), Sergio Rezende (bateria), Daniel Bozzio (programação) e Rômulo Nardes (percussão).\r\n\r\nA capa é assinada por Julien Sappa (Regular Switch) e impressa com a técnica artisanal LetterPress realizada no Estudio Carimbo.\r\n\r\nOrgulhosamente, a Goma Gringa lança com exclusividade esse disco numa <b>edição limitada de 300 cópias</b>.\r\n\r\n<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/15106906&amp;color=ff6500&amp;auto_play=false&amp;show_artwork=true\"></iframe>\r\n\r\n<hr color=\"#a3a3a3\" size=\"1\" width=\"100%\"> \r\n\r\n<b>Primeiro compacto de uma banda em constante movimento<br>\r\n\r\nCapa especial que se desdobra para se tornar um cartaz. Assinada por Julien Sappa e impressa em LetterPress<br>\r\n\r\nEstritamente limitado a 300 cópias!<br>\r\n\r\nNÃO PERCA!</b>","options":[{"id":40385940,"name":"Default","price":45.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129610860/-/queb_001.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129610860/-/queb_001.jpg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129644940/-/queb_002.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129644940/-/queb_002.jpg","width":1000,"height":500},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129657834/-/queb_005.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129657834/-/queb_005.jpg","width":600,"height":600}],"artists":[{"id":222387,"name":"Quebrante","permalink":"quebrante","url":"/artist/quebrante"}],"categories":[{"id":6946023,"name":"Vinil","permalink":"vinil","url":"/category/vinil"},{"id":5891532,"name":"Compacto","permalink":"compacto","url":"/category/compacto"}]},{"id":12693675,"name":"Fela and Afrika 70 'Sorrow, Tears & Blood'","permalink":"lp-fela-kuti-sorrow-tears-blood","position":3,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/lp-fela-kuti-sorrow-tears-blood","status":"active","on_sale":false,"created_at":"2013-07-31T14:29:27.000Z","description":"<img src=\"http://gomagringadiscos.com/GG_webdata/LP.png\" alt=\"LP\">\r\nEstamos muito orgulhosos e felizes de lançar <i>'Sorrow, Tears and Blood'</i> em sua versão original completa, na sequência da recente redescoberta de uma sessão instrumental de seis minutos que precede a entrada dos vocais de Fela Kuti.\r\n\r\nO lado B é fiel à versão original e apresenta o igualmente excelente <i>‘Colonial Mentality’</i>.\r\n\r\nAlém do fato histórico de ser o primeiro disco de vinil do Fela a ser lançado no Brasil, este clássico está agora  disponível em sua forma original estendida pela primeira vez! Imperdível!\r\n\r\nLado A | Sorrow, Tears & Blood | 16'41''\r\n Lado B | Colonial Mentality | 14'36''\r\n\r\n<b>Estritamente limitado a 500 cópias com capa serigrafada!</b>\r\n\r\n<hr color=\"#a3a3a3\" size=\"1\" width=\"100%\">\r\n\r\n<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/121527800&amp;color=ff6600&amp;auto_play=false&amp;show_artwork=true\"></iframe>\r\n\r\n<hr color=\"#a3a3a3\" size=\"1\" width=\"100%\"> \r\n\r\n1977, dia 18 de fevereiro, madrugada, mil homens armados do exército nigeriano fazem ataque ao Fela e sua república Kalakuta, ambos vistos como um símbolo de rebeldia contra o estado opressor.\r\n\r\n<i>‘Sorrow, Tears and Blood’</i> foi um dos primeiros álbuns que Fela lançou após a destruição de Kalakuta.\r\n\r\nA faixa-título é uma das canções de protesto mais poderosas já registradas. Num grito apaixonado sobre a violência da polícia e do exército contra dissidentes políticos na África, <i>'Sorrow, Tears and Blood'</i> retrata com precisão o rastro deixado no ataque da  madrugada do dia 18 de fevereiro.\r\n\r\nFela canta como a polícia e o exército, invariavelmente, provocam \"tristeza, lágrimas e sangue\"(sorrow, tears and blood), enquanto os vocalistas respondem cantando \"...marca registrada...\" (dem regular trademark).\r\nFela declarou \"o álbum foi dedicado á memória daqueles que foram espancados, estuprados, torturados ou feridos durante o ataque em Kalakuta\".\r\n\r\nDecca, que era a gravadora do Fela, com medo de represálias por parte do governo, se recusou a lançar <i>‘Sorrow, Tears and Blood’</i>. Decisão a qual Fela respondeu ao criar o selo Kalakuta Records e ao fazer do álbum o lançamento de estréia da gravadora.\r\n\r\n<hr color=\"#a3a3a3\" size=\"1\" width=\"100%\"> \r\n\r\n<b>Primeiro lançamento em vinil do Fela no Brasil e lançamento de estréia da Goma Gringa!<br>\r\nEstritamente limitado a 500 cópias com capa serigrafada e encarte de alta qualidade!<br>\r\nUm clássico imperdível relançado em sua forma original estendida pela primeira vez!<br>\r\n\r\nNÃO PERCA!</b>","options":[{"id":40385802,"name":"Default","price":60.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122164179/-/Sorrow_Tears_and_Blood.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122164179/-/Sorrow_Tears_and_Blood.jpg","width":1500,"height":1500},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123720993/-/FELA-sorrow-BACK_web.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123720993/-/FELA-sorrow-BACK_web.jpg","width":1909,"height":1909},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123721116/-/2_web.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123721116/-/2_web.jpg","width":1498,"height":1172}],"artists":[{"id":222375,"name":"Fela Kuti","permalink":"fela-kuti","url":"/artist/fela-kuti"}],"categories":[{"id":6946023,"name":"Vinil","permalink":"vinil","url":"/category/vinil"},{"id":5891514,"name":"LP","permalink":"lp","url":"/category/lp"}]}]