[{"id":13557243,"name":"Vulcanet - Washing without water","permalink":"vulcanet-washing-without-water","position":1,"price":69.9,"default_price":69.9,"tax":0.0,"url":"/product/vulcanet-washing-without-water","status":"active","on_sale":false,"created_at":"2013-09-14T09:42:34.000Z","description":"Vulcanet\r\n\r\n\r\n<iframe width=\"330\" height=\"186\" src=\"//www.youtube.com/embed/6YDsqVC84BE?rel=0\" frameborder=\"0\" allowfullscreen></iframe>\r\n\r\n\r\n\r\n\r\n\r\nVulcanet ist ein innovatives Reinigungs- und Pflegeprodukt, mit dem sich Ihre Fahrzeuge (z.B. Custombikes, Motorräder, Oldtimer, Autos, etc.) ohne den Einsatz von Wasser umweltschonend und gründlich reinigen lassen. Mit Vulcanet sind Sie unabhängig von Waschanlagen. Sie können Vulcanet immer mit sich führen und Ihre Fahrzeuge ohne aufwändige Vorbereitungen vor Ort waschen ohne Wasser zu verbrauchen.\r\n\r\nEine Dose Vulcanet enthält 80 speziell für diesen Zweck gewebte Reinigungstücher, die mit einer patentierten Kombination hochwirksamer Moleküle imprägniert sind. Die wabenförmige Struktur der Reinigungstücher schliesst Schmutzpartikel ein, so dass bei korrekter Anwendung keine Kratzer entstehen. Spezielle Schmierstoffe helfen dabei Microkratzer zu vermeiden.\r\n\r\nDie behandelten Oberflächen werden nicht nur gereinigt, sondern gleichzeitig auch mit einer unsichtbaren Schutzschicht versiegelt. Da Vulcanet kein Silicon enthält, bleibt eine saubere, fettfreie und schmutzabweisende Oberfläche zurück. Alle mit Vulcanet behandelten Oberflächen werden abschließend mit dem beiliegenden Microfasertuch nachpoliert. So entsteht ein streifenfreier Glanz.\r\n\r\nAnwendungsbeispiele für Vulcanet\r\n\r\n    Lackoberflächen reinigen und konservieren\r\n    Kunststoffoberflächen auffrischen\r\n    Insektenreste von Scheinwerfern und Gabelholmen bzw. Kühlergrill und Stössfängern entfernen\r\n    Felgen und Reifenflanken säubern \r\n    Scheiben reinigen und entfetten\r\n\r\n\r\nVulcanet leistet einen aktiven Beitrag zur Umweltschonung\r\n\r\n    Eine Wäsche mit Vulcanet entspricht dem Gegenwert von 250 - 300 Liter Wasser\r\n    10 verbrannte Vulcanet Tücher entsprechen gerade einmal 3 Gramm Asche\r\n\r\n\r\nVerbrauchsbeispiele\r\n\r\n    Für die erstmalige Grundreinigung eines grösseren Motorrads brauchen Sie ca. 4 Tücher. Danach sind ca. 2 bis 3 Tücher für eine regelmäßige Reinigung nötig (je nach Witterung, alle 7 bis 15 Tage)\r\n    Für die erstmalige Grundreinigung eines viertürigen Fahrzeugs brauchen Sie etwa 8 bis 10 Tücher. Danach sind ca. 4 bis 5 Tücher für eine regelmäßige Reinigung nötig (je nach Witterung, alle 7 bis 15 Tage)\r\n\r\n\r\nLieferumfang\r\n\r\n    1 Dose Vulcanet mit 80 Reinigungstüchern und 1 Microfasertuch\r\n\r\n","options":[{"id":43465959,"name":"Default","price":69.9,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":9.5,"amount_with_others":9.5,"country":{"id":38,"name":"Switzerland","code":"CH"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124286391/-/Vulcanet.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124286391/-/Vulcanet.jpg","width":1279,"height":2048}],"artists":[],"categories":[]}]