[{"id":3482754,"name":"Personalized Family Name House Print - FREE SHIPPING (WORLDWIDE)","permalink":"personalized-family-name-print","position":1,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/personalized-family-name-print","status":"active","on_sale":false,"created_at":"2011-03-25T06:32:11.000Z","description":"NEED A GREAT GIFT IDEA?\r\n\r\nThis 8x10 Family Keepsake Print is a fun, contemporary and unique addition to any home's decor.\r\n\r\nFamily members names are artfully used to create a\r\none-of-a-kind design. These are professionally made, archival quality photographic prints, so they can be enjoyed for generations! They fit neatly into any 8x10 frame, but also look great matted and placed into a larger frame (mat and frame not included).\r\n\r\nThere is currently FREE SHIPPING on this item!! (USPS First Class). For faster delivery, a Priority Mail upgrade is available for an additional $5 (US ONLY). Contact me for more info.\r\n\r\n\r\nWhen ordering your print, please contact me with the following list:\r\n\r\n1. LAST NAME - (or if preferred, 2 last names... or the words \"OUR FAMILY\")\r\n\r\n2. FIRST NAMES - List 3-10 names in descending order (some families include pets!).\r\n\r\n3. DOOR QUOTE - Choose from the example quotes above or create a very short 2-3 word quote of your own.\r\n\r\nA draft of your custom print will be sent for your approval (1-2 days). After your approval of the design, allow 5-15 business days for delivery inside the United States and 15-20 business days outside the United States.\r\n\r\nLIMIT OF 10 NAMES PER PRINT for this listing. If you need more than ten names it's $1.00 per each additional name. Contact me for a reserved listing.\r\n\r\nThis design is also available as a 5x7 print for $15, and as a 11x14 print for $35. Contact me for more info.\r\n\r\nNEED 3 OR MORE? BULK DISCOUNTS ARE AVAILABLE. GET A PRINT FOR EVERYONE ON YOUR LIST AND SAVE! Contact me for more info. A reserved listing will be created for bulk orders.\r\n\r\nMAKES A GREAT GIFT FOR ANY OCCASION! ...Anniversaries, Birthdays, Housewarmings, and Holidays!\r\n\r\n\r\nYOUR SATISFACTION IS GUARANTEED!\r\n\r\nAll contents of this shop ©Gene Ploss ","options":[{"id":11716834,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/33835612/-/modified_photo_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/33835612/-/modified_photo_1.jpg","width":814,"height":1000}],"artists":[],"categories":[{"id":1981466,"name":"Art Prints","permalink":"art-prints","url":"/category/art-prints"}]}]