[{"id":3534734,"name":"Japan Benefit Cards","permalink":"japan-benefit-cards","position":1,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/japan-benefit-cards","status":"active","on_sale":false,"created_at":"2011-04-03T19:24:37.000Z","description":"Following the earthquake and tsunami of March 11th and the continuing events in Japan, we felt we had to act to help raise money for the relief efforts. We have created this stationery pack as a way to raise money for Japan as well as to celebrate and remind ourselves of the many unique and interesting things one finds in Japan. All money earned from the sale of these cards will be donated to the Japanese Red Cross.\r\n\r\nIn this series of 5 cards, we have focused on a few items that remind us of things we love about Japan. Each is a representation of an object associated with celebrations and happiness. \r\n\r\nThe five objects are:\r\n\r\nThe Daruma, a doll used by students, businessman and others for luck and to mark accomplishment.\r\n\r\nThe Maneki-Neko, the beckoning cat seen in the fronts of many restaurants and businesses.\r\n\r\nKagami Mochi, an offering plate for the New Year.\r\n\r\nHina Matsuri dolls, small dolls used in the celebration of Girl's day.\r\n\r\nKoi Nobori, Carp kites hung as part of the celebration of Boy's day on May 5th.\r\n\r\nThe back of each card also features a more detailed explanation of what each object is and how it is used.  \r\n\r\nThe cards are offset-printed on 100 lb. cover-weight using  Mohawk Paper's exclusive Loop Antique Vellum paper which is made from 100% post-consumer material. The matching envelopes (which are blank) are 70lb. text weight and are also made from 100% post-consumer materials.\r\n\r\nThe cards are 4.25 x 5.5 inches in size. \r\n\r\nIf you would like more information and to see more pictures, please visit us at our website, <a href=\"http://www.chaku-chaku.net/\">Chaku-Chaku.Net</a> \r\n\r\nThe paper and printing for this project was graciously donated by <a href=\"http://www.cutpasteandprint.com/\">cutpasteandprint</a>  in Huntingdon Valley, PA. \r\n\r\nPlease note, that we are not directly affiliated with the Red Cross, and your purchase will not be tax-deductible.","options":[{"id":11858078,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.5,"amount_with_others":1.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":5.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/34351498/-/JapanBenefit.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/34351498/-/JapanBenefit.jpg","width":1000,"height":665}],"artists":[],"categories":[{"id":1975350,"name":"Stationary","permalink":"stationary","url":"/category/stationary"},{"id":1975352,"name":"Greeting Cards","permalink":"greeting-cards","url":"/category/greeting-cards"},{"id":1975354,"name":"Gifts","permalink":"gifts","url":"/category/gifts"},{"id":1975356,"name":"Japan","permalink":"japan","url":"/category/japan"}]}]