[{"id":3610166,"name":"EMBRACE THE CHARMS - Hand Stamped Forged custom Sterling Silver Bracelet with Organic Open Disc and ","permalink":"embrace-the-charms-hand-stamped-forged-custom-sterling-silver-bracelet-with-organic-open-disc-and-2-","position":1,"price":65.0,"default_price":65.0,"tax":0.0,"url":"/product/embrace-the-charms-hand-stamped-forged-custom-sterling-silver-bracelet-with-organic-open-disc-and-2-","status":"active","on_sale":false,"created_at":"2011-04-17T02:23:16.000Z","description":"EMBRACE THE CHARMS - I adore creating this bracelet and would love to custom create one for you! \r\n\r\nThe hand formed bracelet captures an organic, forged, fine silver open circle disc which can be hand stamped with your choice of words, names, dates. I have used fine silver in this earthy open circle disc, which is 99% pure silver. The rustic disc charm slides onto the hammered, forged thick sterling silver bracelet, which has been hammered, texturized and soldered using old - world metalsmith techniques. Two additional hand cut, hammered charms slide on the bracelet in your choice of shape. Shapes available are square, circle, rectangle, diamond or heart. On the small charms you may choose an initial or two or a symbol, or short 3-4 letter word, and on the open circle organic disc, you may choose up to 21 characters in small font, including spaces.\r\n\r\nSymbols available are: a cross, heart, star, rustic pine tree, question mark, starfish, coffee, a cocktail, a paw print, an apple, a fish, a peace symbol, a flying bird, a sparrow bird, an infinity symbol or a horse head.\r\n\r\nThe jumprings I use in my designs are all handforged sterling silver, soldered and sturdy. The solder I use in my creations is LEAD-FREE STERLING SILVER SOLDER.\r\n\r\nThis beautiful bracelet will come WRAPPED and PLACED in a pretty gift bag, ready for gift giving or gift yourself!\r\n\r\nPLEASE NOTE: Delivery confirmation is included in USA shipments. You can add insurance for $1.75 extra too on domestic shipping. International shipping shall be via usps INTERNATIONAL FIRST CLASS, WHICH TAKES APPROX. 6-9 DAYS WORLDWIDE after creation. However, you may upgrade your shipment to include insurance. Please see my profile for shipping details. :O)\r\n\r\nThank you for viewing my personalized jewelry. Please check my shop for more selections as I love to customize and would really love to create something special for you!\r\n\r\ndesigns © 2001-2011 Accessory à la Mode\r\n\r\n","options":[{"id":12068198,"name":"Default","price":65.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35097618/-/embracethecharms.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35097618/-/embracethecharms.jpg","width":430,"height":229}],"artists":[],"categories":[]},{"id":3610142,"name":"Said in Spiral Bracelet - hand stamped custom personalized - you choose phrase, poem, quote - gr8 fo","permalink":"said-in-spiral-bracelet-hand-stamped-custom-personalized-you-choose-phrase-poem-quote-gr8-for-brides","position":2,"price":74.0,"default_price":74.0,"tax":0.0,"url":"/product/said-in-spiral-bracelet-hand-stamped-custom-personalized-you-choose-phrase-poem-quote-gr8-for-brides","status":"active","on_sale":false,"created_at":"2011-04-17T02:17:06.000Z","description":"Said in a Spiral BRACELET ~ Your custom words, poem, phrase, names stamped into a spiral design, which a secret heart section soldered to the back for another personal word, name or date.\r\n\r\nThis is a beautifully large and thick, sturdy hammered disc of \r\n1 1/4 inch wide. Able to fit your personalized phrase stamped round and round onto the organic disc circle. You can fit up to 78 characters including spaces. There is also a \"secret\" soldered shape on the other side where you may fit a special date or symbol or word or name. You can choose either a heart or circle or square for this shape on the opposite side. All components are pure sterling silver quality materials.\r\n\r\nThe disc pendant meets a hand forged chain link on one side and on the other side a double loop chain intertwined with a softer sterling chain. I thought the combo of the two chains gave a very light and airy look to the solid design of the spiral. The bracelet closes with a hand forged sterling silver clasp. The jumprings I use in my designs are all handforged, sterling silver, soldered and secure. Each bracelet is custom created with your size dimensions anywhere from approx. 6 to 8 inches, please specify size in the NOTES TO SELLER SECTION if ordering. Also, if you need a larger or smaller size you can let me know that there as well.\r\n\r\nThe entire piece has been given a beautiful light oxidized patina, then polished by hand to bring out the shine of the sterling silver.\r\n\r\nYou may choose words, names, a quote or phrase spread over the bar and disc or symbols too. Available symbols are, heart, star, cross, flower, horse head, sitting sparrow, flying bird, a sun, apple, a religious fish, an infinity symbol, a rustic pine tree, a question mark, a cocktail, or a coffee.\r\n\r\nThis designs meets simple sophistication & meaningful inspiration. It will go with your blue jeans to your little black dress! It has a funky edge and will get you noticed!\r\n\r\nIt is a wonderful gift for a best friend, a bridesmaid, maid of honor, birthday, anniversary, new mommy, easter, mothers day, graduation gift, or just because.\r\n\r\nThis necklace will come WRAPPED and PLACED in a beautiful gift bag ready for gift giving or gift yourself!\r\n\r\nDELIVERY CONFIRMATION IS INCLUDED IN USA SHIPPING PRICE. You may add insurance for $2.25 extra for USA shipments. INTERNATIONAL WILL GO via international FIRST CLASS, which takes approx. 5-9 days worldwide after completion of order, however, you may upgrade your shipment to include insurance as well. Please see my profile for shipping details :O)\r\n\r\nThank you for viewing my designs, the original hand stamped personalized jewelry listed on etsy. If it is a custom piece you wish for, please contact me as I would love to create something special for you :o) I have been hand-stamping jewlery since 2001 and adoring every moment. :O)\r\n\r\n© 2001-2011 Accessory à la Mode\r\n\r\n...custom created with heart, soul, love & care..for singing hearts\r\n\r\n","options":[{"id":12068080,"name":"Default","price":74.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35097440/-/1a1sis1first.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35097440/-/1a1sis1first.jpg","width":1000,"height":641}],"artists":[],"categories":[]},{"id":3610134,"name":"Two Toned - hand stamped sterling silver and antiqued copper soldered charm necklace - ready for you","permalink":"two-toned-hand-stamped-sterling-silver-and-antiqued-copper-soldered-charm-necklace-ready-for-your-cu","position":3,"price":64.0,"default_price":64.0,"tax":0.0,"url":"/product/two-toned-hand-stamped-sterling-silver-and-antiqued-copper-soldered-charm-necklace-ready-for-your-cu","status":"active","on_sale":false,"created_at":"2011-04-17T02:14:40.000Z","description":"Two Toned ~ This is a design from my RUSTIC LINE ~ a blend of oxidized sterling silver & aged and antiqued copper to meet a rustic look, an everyday, warm, lived in, comfortable feel!\r\n\r\nA thick handforged teardrop bail connects to a sturdy sterling silver chain and closes with a hammered, soldered clasp. The bail captures three charms. A copper/sterling silver blend square soldered charm will be handstamped with up to 4 large font letters or 5 smaller font, perfect to showcase a monogram, initials, or as shown in photo for example, an initial with a + in between to focus on two people in love. The second charm pendant is a sterling silver hammered bar which will hold approx. 11 hand stamped large font letters vertically or horizontally. Joining the other charm pendants is a copper/sterling silver soldered heart which can include one symbol if you desire or be left as shown in the photo with a hammered finish. \r\n\r\nThe pendants have been cut and forged and given a nice oxidized patina, then hand polished to bring out the contrast in the sterling silver and metals. \r\n\r\nThe chain is from 16\" to 18\" in length. Please specify your length choice in the NOTES TO SELLER SECTION when ordering, together with your personalization choice. If you prefer a longer chain, those accomodations can be met, please convo me for a quote :O) The necklace length will showcase your custom design. The jumprings I use in my designs are all handforged, sterling silver, soldered and secure. The solder I use is sterling silver LEAD-FREE solder.\r\n\r\nYou may choose words, names, a special date or symbols. Available symbols are, heart, star, cross, flower, horse head, sitting sparrow, flying bird, a sun, apple, a religious fish, an infinity symbol, a rustic pine tree, a question mark, a peace sign, a paw print, a cocktail, or a coffee cup.\r\n\r\nThis designs meets rustic casual style and simple sophistication. It will go with your blue jeans to your little black dress! It has a funky, hip edge and will get you noticed!\r\n\r\nTHIS NECKLACE WIll BE custom PERSONALIZED ESPECIALLY FOR YOU! \r\n\r\nThis necklace will come WRAPPED and PLACED in a beautiful gift bag ready for gift giving or gift yourself! No need to spend extra $$ on packaging as it will arrive to you fully ready for gifting :)\r\n\r\nThank you for viewing my designs. If it is a custom piece you wish for, please contact me as I would love to create something special for you :o)\r\n\r\n© 2001-2011 Accessory à la Mode\r\n\r\n......custom created with heart, soul, love & care..for singing hearts\r\n","options":[{"id":12068052,"name":"Default","price":64.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35097330/-/111_two_toned.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35097330/-/111_two_toned.jpg","width":570,"height":540}],"artists":[],"categories":[]},{"id":3610122,"name":"Personalized custom Hand Stamped Unisex Promise or Memory Ring sizes 5 to 15 of Sterling Silver You ","permalink":"personalized-custom-hand-stamped-unisex-promise-or-memory-ring-sizes-5-to-15-of-sterling-silver-you-","position":4,"price":31.0,"default_price":31.0,"tax":0.0,"url":"/product/personalized-custom-hand-stamped-unisex-promise-or-memory-ring-sizes-5-to-15-of-sterling-silver-you-","status":"active","on_sale":false,"created_at":"2011-04-17T02:12:40.000Z","description":"The original HANDSTAMPED PERSONALIZED RING...THIS listing is for one 6MM, nice sized, HANDCRAFTED, HAND-STAMPED PERSONALIZED PURE STERLING SILVER UNISEX RING which shall be customized with your word, name, date, memory, small quote, that you choose. You can choose up to 21 characters ON SMALLER SIZES and up to 26 or more on larger sizes. I can do letters, numbers and the \"+\", \"=\", \",\"-\".\",\"!\", \"&\" and more symbols or a heart, star, cross, horse head, sitting bird, flying bird, a sun, a paw print, a religious fish, a royal crown, a martini, a coffee, a question mark, a rustic pine tree, or an infinity symbol.\r\n\r\nIn old days they were called \"Promise Rings\" and couples would give to each other for weddings, engagements or commitments or to ask \"will you be mine?\".\r\n\r\nThe rings are also wonderful as a memory ring to remember a special date or time in your life or person who passed or preserve a cherished memory.\r\n\r\nFor a funky look you can also wear them in doubles or even triples on the same ring finger. You can easily stack 2 and 3 together as shown in the photos.\r\n\r\nI hand-tool each letter one at a time so no two will be exactly the same and shall have an artsy, hand-crafted feel. The ring will be oxidized and then buffed to enhance the lettering but keep the shine of the sterling silver.\r\n\r\nThe rings are available in whole & half sizes from size 5-15 1/2. If there are any questions, please do not hesitate to contact me as I am more than happy to help you.\r\n\r\nTHIS PIECE WILL COME IN A PRETTY GIFT BAG, WRAPPED & READY FOR GIFT GIVING OR GIFT YOURSELF!.\r\n\r\nPLEASE NOTE: USA Shipping will include delivery confirmation. Insurance is also available for $1.75 extra. INTERNATIONAL SHIPMENTS will be through usps first class international first class, which takes approx. 6-9 days worldwide after creation. However, you may upgrade your shipment to include insurance. Please see my profile for shipping details. :O) You pay only one flat rate for shipping for your whole order with me :o)!\r\n\r\nALSO PLEASE NOTE: IF YOU DO NOT KNOW YOUR RING SIZE, I HAVE A CHART TO FIND OUT, VERY EASY TO DO.\r\n\r\nThank you for viewing my personalized pieces!!!! Feel free to inquire about any special design you would like customized especially for you!\r\n\r\ndesigns © 2001-2011 Accessory à la Mode\r\n\r\n...custom created with heart, soul, love & care..for singing hearts\r\n\r\n","options":[{"id":12067986,"name":"Default","price":31.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35097274/-/111rings.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35097274/-/111rings.jpg","width":430,"height":269}],"artists":[],"categories":[]},{"id":3610108,"name":"ANGEL Mother - Hand Stamped Rustic Antiqued Copper - Skeleton Key Chain from the KEY SERIES can be c","permalink":"angel-mother-hand-stamped-rustic-antiqued-copper-skeleton-key-chain-from-the-key-series-can-be-custo","position":5,"price":26.5,"default_price":26.5,"tax":0.0,"url":"/product/angel-mother-hand-stamped-rustic-antiqued-copper-skeleton-key-chain-from-the-key-series-can-be-custo","status":"active","on_sale":false,"created_at":"2011-04-17T02:10:20.000Z","description":"ANGEL MOTHER~ from The KEY SERIES.. perfect for Mother's Day or birthday or just because. Also, this can be customized if you prefer. \r\n\r\nAn antiqued old vintage skeleton key, with an heirloom past and story, and a pewter angel wing charm, are paired with a hammered, oxidized, rustic, antiqued copper pendant, hand cut, sanded and buffed, and hand-stamped, one letter at a time, in an ARTSY FONT with this beautiful phrase..\"MOTHER...AN ANGEL WITH INVISIBLE WINGS\"...so fitting for MOM and such a true statement, wonderful for birthdays, or just because she is special. A handcut rustic sterling silver heart has been soldered in place on the pendant for that mixed metal look. Pendant is a beautiful size of 1 x 5/8\" x 1 1/4\". The skeleton key, pendant & charm are attached to sterling jumprings which connect to the key ring.\r\n\r\nThe key chain is sturdy and secure and soldered with only LEAD-FREE solder. The jumprings I use in my designs are all handforged sterling silver, soldered and sturdy.\r\n\r\nThe size of the key is approx. 1.5 inches. It looks as though it was from a victorian jewelry box. So old world and charming. The key will be slightly different from the one pictured but the same size.\r\n\r\nThis designs meets vintage charm and rustic chic. I have given it my signature rustic edge with texture, hammering, and natural oxidized patina. It is a modern version of skeleton key jewlery, hip & fresh.\r\n\r\nThis key chain will come WRAPPED and PLACED in a beautiful gift bag ready, in my new spring colors, ready for gift giving or gift yourself! IT IS READY TO SHIP!\r\n\r\nDELIVERY CONFIRMATION IS INCLUDED IN USA SHIPPING PRICE. You may add insurance for an extra charge. INTERNATIONAL WILL GO via international FIRST CLASS, which takes approx. 5-9 days worldwide if shipped as pictured. However, you may upgrade your shipment to include insurance. Please see my profile for shipping details. :O) YOU PAY ONLY ONE FLAT RATE SHIPPING PRICE FOR YOUR ENTIRE ORDER WITH ME; never extra charges for extra items :O)\r\n\r\nThank you for viewing my designs. If it is a custom piece you wish for, please contact me as I would love to create something special for you :o)\r\n\r\nEARTH FRIENDLY FACTOR: You are helping the environment as the sterling heart is created with 100% recycled sterling silver...so organic & GREEN . :O)\r\n\r\nTHIS DESIGN IS COPYRIGHT PROTECTED\r\ndesigns © 2001-2011 Accessory à la Mode\r\n\r\n...custom created with heart, soul, love & care..for singing hearts\r\n\r\n","options":[{"id":12067912,"name":"Default","price":26.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.5,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35097066/-/angel_mother.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35097066/-/angel_mother.jpg","width":570,"height":409}],"artists":[],"categories":[]}]