[{"id":15434247,"name":"Your Creative Peace: Now Available in 3 Separate Units","permalink":"your-creative-peace-now-available-in-3-separate-units","position":1,"price":7.0,"default_price":7.0,"tax":0.0,"url":"/product/your-creative-peace-now-available-in-3-separate-units","status":"active","on_sale":false,"created_at":"2013-12-09T12:48:56.000Z","description":" Welcome to the Your Creative Peace Program\r\n\r\nPrepare to live life more fully through your creativity and your faith in God.  This program guides you to follow your inner urgings to be a creative person while at the same time integrating your creative outlet with your Christian life.\r\n\r\nTHROUGHOUT the program, you will: \r\n-explore God's creativity\r\n-explore the beauty and VALUE of creativity\r\n-explore creativity as an act of worship\r\n-PINPOINT your creative journey\r\n-INTEGRATE YOUR CREATIVITY AND SPIRITUAL JOURNEY MORE DEEPLY\r\n\r\n**********NOW AVAILABLE IN SEPARATE UNITS************\r\n\r\n Unit 1: How to Move More Deeply into your Creative Voice\r\n\r\nThis unit is set up in 5 sections where you will explore a new creative venue or pick up a Creative activity that has long lain dormant.  The exercises will accommodate whatever outlet you wish to explore - simply come with the willingness to lean into creating your own creative peace.\r\n\r\n\r\nThrough stories, challenging questions and creative exercises, you will begin to learn how to listen to your creative muse, the Holy Spirit.  Each week offers three SETS OF exercises to challenge you both creatively and spiritually.\r\n\r\n\r\nThe material is available in a format where you can go at your own pace.  I also included a section of 10 ADDITIONAL formatted exercises that you can use to extend this time of finding your creative voice or you can use to start your own creativity group. \r\n\r\nHere are the sections: \r\nSection 1: God and Creator\r\nSection 2: God as Sustainer\r\nSection 3: God and joy giver\r\nSection 4: God as one who sees\r\nSection 5: God as faithful\r\n\r\n\r\nUnit 2: A Journey through the Psalms with Your Creative Expression\r\n\r\n\r\nThis is a 4 week invitation to take your enlivened creative spirit and use it as a devotional time with the book of Psalms.  Similar in structure as unit 1, this section begins to deepen the process of allowing the Bible to steep in your creative process.  These exercises will accommodate whatever outlet you wish to explore - simply come with the willingness to lean into creating your OWN CREATIVE PEACE.\r\n\r\nThis unit journeys through the Psalms and is broken down into four sections:\r\n\r\nSection 1: Why the Psalms\r\nSection 2: Breathe\r\nSection 3: Waiting\r\nSection 4: Movement in Body and Language\r\n\r\n Unit 3: A Look at the Collaboration Process\r\n\r\nThis unit explores how Creative Christians can work together in the collaboration process\r\n\r\nThe unit chronicles my journey with collaboration and challenges you to ask yourself difficult questions about the reasons you should and should not collaborate and the timing and structure of good and bad collaborations.\r\n\r\nSection 1: Are you Open?\r\nSection 2: Do You Need to Declutter\r\nSection 3: Are you Comfortable with Imperfection\r\nSection 4: Is There Beauty at the Finish Line?\r\n\r\nThis unit is similar in structure to the first two units\r\n\r\nDetails:\r\n- 6x9\r\n-Trade Paperback\r\n-each unit is approximately 110 pages \r\n\r\n\r\nEach Book includes this section:\r\nConversations with (More) Creative Christians\r\n\r\n\r\nIn 2010, I started to search for other Christians who were integrating their love for\r\nthe Lord with their creative mediums. I met Jennifer of Studio JRU through an\r\nonline e-course and approached her with the vision and she was incredibly\r\nsupportive. So much so that she allowed me to offer a giveaway on her blog.  This generous act opened me up to other Christian creatives who longed for this same type of\r\nconnection.\r\n\r\nThis unit offer interviews with women who have increased my\r\ncourage to move forward in search of others who love God and express it fully in\r\na creative fashion. These interviews will encourage you whether you are a would-be creative or full fledged creative who loves the Lord through her creative practices. I believe this will cause you to fall in love with God more and encourage you to never let go of your creative peace.\r\n\r\nArtists are:\r\nErin Leigh\r\nJan Avellana\r\nBeth Stone\r\nStephanie Amos\r\nDonna Wynn\r\nApril McCay\r\nMarsha Zimmerman\r\n\r\nAlso featured:\r\nSadee Schilling\r\nJennifer/ Studio JRU\r\nCatina Jane Gray\r\nAmy Lee Weeks\r\nValerie Weller\r\n\r\n","options":[{"id":50196063,"name":"Unit 1: Find and Deepen your Creative Voice","price":7.0,"sold_out":false,"has_custom_price":false},{"id":50196066,"name":"Unit 2: Journey Through the Psalms","price":7.0,"sold_out":false,"has_custom_price":false},{"id":50196069,"name":"Unit 3: A View into the Collaboration Process","price":7.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129077829/-/PicMonkey_Collage.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129077829/-/PicMonkey_Collage.jpg","width":1000,"height":1000}],"artists":[],"categories":[]},{"id":15149097,"name":"Linger: 30 Days of Journaling and Photographing Your Wonder Filled Life","permalink":"linger-30-days-of-journaling-and-photographing-your-wonder-filled-life","position":2,"price":12.95,"default_price":12.95,"tax":0.0,"url":"/product/linger-30-days-of-journaling-and-photographing-your-wonder-filled-life","status":"active","on_sale":false,"created_at":"2013-11-27T18:11:31.000Z","description":"Take 30 days and nourish your soul with art and quotes and questions and self portraits captured in the midst of your journalling process to bring you in the grace and the wonder and the soulfullness of a satisfied life no matter what circumstance you find yourself.\r\n\r\nEach day offers you a inspiring piece of mixed media art for your to linger over, a thought provoking quote, a question with space for you to answer right in the book. Plus there are several opportunities for you to pick up your camera and take a snapshot of yourself and write your thoughts about this life you are leading at this moment and make plans to create the life that you are longing for.\r\n\r\nYou CAN HAVE more meaning, more wonder, more magic infused into the essence of who you are. Prepare to fall in love with the person you are on a deeper level and to walk more deeply into the soul full life you are longing for.\r\n\r\nWon't you take the time to Linger?\r\n\r\nWHAT TO EXPECT:\r\neach day is laid out with a question and journaling space and a piece of art to help inspire your writing. At the end of each day is a quote that ties into this soul provoking journey. PLUS randomly throughout the 30 days you will be encouraged to take a self portrait and/or to draw a piece of art to capture your feelings at that point in time.\r\n\r\nDetails:\r\n6x9\r\nFull color cover\r\nFull color interior\r\n80 pages\r\n\r\nShips via USPS in 7-10 business days","options":[{"id":49209822,"name":"Default","price":12.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128353017/-/cartel_book_cover_3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128353017/-/cartel_book_cover_3.jpg","width":1734,"height":2280}],"artists":[],"categories":[]},{"id":15148992,"name":"Spark and Inspire: 30 Days of Soulful Insight to Spark your Business and Inspire your Soul","permalink":"spark-and-inspire-30-days-of-soulful-insight-to-spark-your-business-and-inspire-your-soul","position":3,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/spark-and-inspire-30-days-of-soulful-insight-to-spark-your-business-and-inspire-your-soul","status":"active","on_sale":false,"created_at":"2013-11-27T18:07:09.000Z","description":"30 days worth of questions that you can take and use as a 30 day diagnostic for your idea, vision or business.\r\n\r\nWhen you are smack dab in the middle of an idea or vision you want to bring to the forefront, you really want to hear from those who have felt the victories and the disappointments of taking such a brave leap. You want a community, inside advice with no expectations or strings attached because… well you need it.\r\n\r\nWithin these pages you will find the voices of over 40 creative entrepreneurs who run their businesses both online and in brick and mortar stores, who run workshops and sell in shows, who have a range of experiences and have been in business from 1 year to more than 25 years and who offer you no nonsense information on their processes and how they have been able to keep moving in tough economic times and how they have found a way to let good ideas go when the money was not in line with the dream. We are talking on a range of topics from collaborations to big leaps that did (and did not) come together as planned. We are talking about how to get at the soul of your business and how to stay excited about the work you offer the world.\r\n\r\nYou can peek at some of the questions over at http://www.sparkandinspire.com\r\n\r\nThe creative entrepreneurs inside this book:\r\nKelly Thiel\r\nStephanie Amos\r\nLeanne Wargowsky\r\nAlease McClenningham\r\nSonya McCllough\r\nJean Simrose\r\nJan Avellana\r\nNolwenn Petitbois\r\nKelly Warren\r\nLaura Otero\r\nStephanie Guimond\r\nShari Sherman\r\nDani Keith\r\nPaula Joerling\r\nValerie Weller\r\nPhyllis Dobbs\r\nCatherine Just\r\nKatie Clemons\r\nKat Sloma\r\nLaura Gaffke\r\nNatasa May\r\nJulene Ewert\r\nJodi Lebrun\r\nErin Fickert-Rowland\r\nLouise Gale\r\nCindy Silverstein\r\nKim Gann\r\nJuliette Crane\r\nJodene Shaw\r\nCarrie Schmitt\r\nValerie Hart\r\nElizabeth Gonzalez\r\nLisa Wilson\r\ne'Layne Koenigsberg\r\nMary Nasser\r\nAmanda Fall\r\nBeth Doan\r\nKatherine Quinn\r\nLiv Lane\r\nMandy Saile\r\nRobin Norgren\r\n\r\n41 artists\r\n30 questions\r\n\r\nHere is a sample of the questions:\r\n-Collaborations: a good idea?\r\n-Success in business is defined as….\r\n-THE HARDEST PART ABOUT PURSUING A DREAM IS . . .\r\n-The hardest part at year 2 of your business is….\r\n-What color is your Business?\r\n-In rapid fire fashion, write down 10 words that describe your business. Share your thoughts on these words.\r\n-WHAT WOULD YOU CONSIDER THE ‘FAVORITE’ MISTAKE IN YOUR BUSINESS?\r\n-The Balance question – WHAT DOES IT MEAN TO YOU AND HOW IS IT WORKING FOR YOU?\r\n-What do you need to STOP DOING in your business?\r\n-Who is your business muse?\r\n-Is it necessary for your business to line up with your soul purpose? What value is there to having that aligned?\r\n-Do you have a business mentor? What values does that offer to your experiences as a business owner?\r\n-What animal would represent your first year of business?\r\n-What business/businesses have you chosen to model your business after?\r\n-At this moment, what one idea do you need to start executing for your business? \r\n\r\nTestimonials:\r\n\r\n It is a treasure to read and I find myself coming back to it over and over again. It is filled with artist interviews and words of inspiration to help the artist looking for answers. I have read other works by this author and she pulls me in every time with her words of creative encouragement. I also love that it is a Kindle edition, because I carry my Kindle everywhere I go!! \r\n\r\n-Donna Wynn \r\n\r\nDetails:\r\n6x9\r\nTrade paperback\r\nFull color cover\r\nBlack and White Interior on white paper\r\n310 pages\r\n\r\nShips via USPS in 7-10 business days","options":[{"id":49208907,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128352546/-/cartel_book_cover_4.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128352546/-/cartel_book_cover_4.jpg","width":1564,"height":2086}],"artists":[],"categories":[]},{"id":15148914,"name":"Writer Girl: 42 Days of Exercises to Deepen Your Faith in Your Ability and Your Purpose for Writing","permalink":"writer-girl-42-days-of-exercises-to-deepen-your-faith-in-your-ability-and-your-purpose-for-writing","position":4,"price":6.95,"default_price":6.95,"tax":0.0,"url":"/product/writer-girl-42-days-of-exercises-to-deepen-your-faith-in-your-ability-and-your-purpose-for-writing","status":"active","on_sale":false,"created_at":"2013-11-27T18:02:32.000Z","description":"Writing is something that I have been drawn to since I was a little girl. I can still remember the first time I received a diary with a little gold key. The book was covered in flowers and my heart was imagining all the stories I would hide inside.\r\nTrouble is every time I sat down to write, nothing came to mind. I would just sit there listing things like what I ate that day or little bullet points about what I wore or how excited I was to begin writing but not knowing what to write about.\r\nI look back now and think about all the things I could have written about but the memories now are long faded. No one in \r\nmy immediate family wrote on a regular basis so there was no coach to guide me on how to move things along.\r\nThose memories moved me to create this book. I hope that a glimpse into my writing life might help you to begin your practice and deepen it to the point where you find your purpose for writing. I will share the starts and stops which are a natural progression of writing, especially if you have small children at home, a draining 9-5 job, are a single mom or a military spouse or just plain over committed in some form. I have been in each of these positions so I understand that each season brings plenty of obstacles that hinder the desire to grow creatively.\r\nI can say without a doubt you will experience a beautiful deepening in your creative life and in your relationship with God as you begin to set aside as little as 15 minutes a day to write or to create in whatever medium you choose. I encourage you to expand your idea of what a writing life looks like and to see ways in which you are creative in all areas of your life. I promise that this awareness will cause you to live life more fully.\r\n\r\nTestimonials:\r\n\r\nNot since Liz Lamoreux's book Inner Excavation have I experienced a book so deeply as Writer Girl. It is always easy to write to please other people but to write simply for ourselves takes a journey of honesty that many are reluctant to pursue. Robin extends an invitation to us to take that journey in such an unassuming yet encouraging manner. I highly recommend Robin's book to everyone as we all have a gift to write, we just have to write with our heart as Robin encourages us to do...and write for ourselves...as you will be surprised at what you learn. \r\n- \r\n  dbeverlyhills\r\n\r\n What a wonderful experience it was working my way through Robins book. Her writing is extremely beautiful and authentic. I found myself on several occasions saying the words \"YES\" and \" AMEN\" out loud as I read. The Priming the pump exercises at the end of each chapter were so thought provoking and deep. They really forced me to take a look at what was really holding me back in my writing vs all the excuses I had made in my head. This book was an absolute oasis for me at the end of each day. As well as a refreshing way to start my mornings. I will definitely be talking about and reading this book to my friends who are needing a creative jump start.\r\n-Lauren\r\n\r\n I have been loving this writing tool/guide. As someone who wants to explore my own writing capabilities, this guide has been helping me expand my writing skills with great prompts as well as personal writings of the author, Robin Norgren (who is very eloquent and creative).\r\n\r\nI love Robin Norgren's creativity and this book/writing tool gives me hope and encouragement about my own writing skills. It is truly helping me learn to express myself. \r\n-Cybil\r\n\r\n Robin's book opened my eyes and my heart to the wisdom within to write everyday, from a place of deep knowing within. I began writing on my blog everyday and also started maintaining a book/journal because I started to delve deep into my life and what was underneath all of it. The book, the gentle prompts, quotes and guidance on writing became somewhat of a therapy for me. I began to tap in to the wisdom within. I have also found my writing voice and this book has helped me welcome opportunities in my business and writing in a way that I never expected. Thank you Robin for this amazing book! \r\n-Aarathi\r\n\r\nSo far beyond a journal just for writers, this book is a deeply honest and insightful offering for any creative soul. Indeed, it was as though Miss Robin had been reading from the passionate.yet.all.too.chaotic pages of my own inner life! I had no expectation other than to see as through a window into the author's mind, possibly gleaning some hints of how to bring order to my own process as a budding creative.\r\nI found so much more! Perfectly accented with inspirational quotes, the themes such as Embracing one's own identity, Validation, Being intentional in my approach and even Quiet were, for me, a welcome departure from more mechanics-minded books for writers. You will find no pretense here. Robin shares openly and with such exquisite simplicity so as to draw the reader in, opening her life as one would open a front door to invite in guests. Then suddenly you are a guest no more. You will find a home here: a respite from the many wearying pursuits of life and art.\r\nThe \"Prime the Pump\" sections were a massive help to me in weeding through what's going on beneath the surface of so many scattered thoughts. What an unexpected journey! In fact, I'm getting ready to start working my way through Writer Girl a second time! As an added bonus, my Christmas list now has many more boxes checked as I think of family members and friends from many walks of life who will enjoy this journal. \r\n-Anonymous Scribbles \r\n\r\n\r\n\r\n\r\nWriter Girl has done just that! Given me the ability and courage to move through my own actions of negativity or inactivity into a more purposeful state of writing. I've learned to \"just let go and trust\" the process and my faith in His plan for me . . even if I do not feel worthy. Robin Norgren's prompts really let you dig deep to find that inner voice and to also nurture what is deep inside you so that you can lead a more fulfilling life . . even through the most mundane of days. I'm so glad I found this book and this teacher to prompt me along the way. My discovery of my own Writer Girl is just beginning as I plan to work this book again and discover more golden nuggets!! Thanks you Robin! What a great experience!!\r\n-CP Bunch\r\n\r\nDetails:\r\n6x9\r\nTrade Paperback\r\nFull color cover\r\nblack and white interior on white paper\r\n156 pages\r\n\r\nShips via USPS in 7-10 business days","options":[{"id":49208445,"name":"Default","price":6.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128352474/-/cartel_book_cover_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128352474/-/cartel_book_cover_2.jpg","width":1564,"height":2086}],"artists":[],"categories":[]},{"id":15148785,"name":"Your Creative Peace:  Find and Deepen Your Creative Voice While Communing with God","permalink":"your-creative-peace-find-and-deepen-your-creative-voice-while-communing-with-god","position":5,"price":14.95,"default_price":14.95,"tax":0.0,"url":"/product/your-creative-peace-find-and-deepen-your-creative-voice-while-communing-with-god","status":"active","on_sale":false,"created_at":"2013-11-27T17:56:29.000Z","description":"Prepare to live life more fully through your creativity and your faith in God. This program guides you to follow your inner urgings to be a creative person while at the same time integrating your creative outlet with your Christian life.\r\n\r\nTHROUGHOUT the program, you will:\r\n-explore God's creativity\r\n-explore the beauty and VALUE of creativity\r\n-explore creativity as an act of worship\r\n-PINPOINT your creative journey\r\n-INTEGRATE YOUR CREATIVITY AND SPIRITUAL JOURNEY MORE DEEPLY\r\n\r\n\r\nUnit 1: How to Move More Deeply into your Creative Voice\r\n\r\nThis unit is set up in 5 sections where you will explore a new creative venue or pick up a Creative activity that has long lain dormant. The exercises will accommodate whatever outlet you wish to explore - simply come with the willingness to lean into creating your own creative peace.\r\n\r\n\r\nThrough stories, challenging questions and creative exercises, you will begin to learn how to listen to your creative muse, the Holy Spirit. Each week offers three SETS OF exercises to challenge you both creatively and spiritually.\r\n\r\n\r\nThe material is available in a format where you can go at your own pace. I also included a section of 10 ADDITIONAL formatted exercises that you can use to extend this time of finding your creative voice or you can use to start your own creativity group.\r\n\r\nHere are the sections:\r\nSection 1: God and Creator\r\nSection 2: God as Sustainer\r\nSection 3: God and joy giver\r\nSection 4: God as one who sees\r\nSection 5: God as faithful\r\n\r\nUnit 2: A Journey through the Psalms with Your Creative Expression\r\n\r\n\r\nThis is a 4 week invitation to take your enlivened creative spirit and use it as a devotional time with the book of Psalms. Similar in structure as unit 1, this section begins to deepen the process of allowing the Bible to steep in your creative process. These exercises will accommodate whatever outlet you wish to explore - simply come with the willingness to lean into creating your OWN CREATIVE PEACE.\r\n\r\nThis unit journeys through the Psalms and is broken down into four sections:\r\n\r\nSection 1: Why the Psalms\r\nSection 2: Breathe\r\nSection 3: Waiting\r\nSection 4: Movement in Body and Language\r\n\r\nUnit 3: A Look at the Collaboration Process\r\n\r\nThis unit explores how Creative Christians can work together in the collaboration process\r\n\r\nThe unit chronicles my journey with collaboration and challenges you to ask yourself difficult questions about the reasons you should and should not collaborate and the timing and structure of good and bad collaborations.\r\n\r\nSection 1: Are you Open?\r\nSection 2: Do You Need to Declutter\r\nSection 3: Are you Comfortable with Imperfection\r\nSection 4: Is There Beauty at the Finish Line?\r\n\r\nThis unit is similar in structure to the first two units\r\n\r\nUnit 4: Conversation with (More) Creative Christians\r\n\r\n\r\nIn 2010, I started to search for other Christians who were integrating their love for\r\nthe Lord with their creative mediums. I met Jennifer of Studio JRU through an\r\nonline e-course and approached her with the vision and she was incredibly\r\nsupportive. So much so that she allowed me to offer a giveaway on her blog. This generous act opened me up to other Christian creatives who longed for this same type of\r\nconnection.\r\n\r\nThis unit offer interviews with women who have increased my\r\ncourage to move forward in search of others who love God and express it fully in\r\na creative fashion. These interviews will encourage you whether you are a would-be creative or full fledged creative who loves the Lord through her creative practices. I believe this will cause you to fall in love with God more and encourage you to never let go of your creative peace\r\n\r\n\r\n\r\n\r\nTestimonials:\r\nI downloaded this book onto my kindle and have read it through twice already. The author has written an inspiring and motivational book here. I consider it a must for any creative person looking for intermingling their faith with their creative life. I have read other works from Ms Norgren and each time I find myself after the book is completed, wanting more from her. She is sincere in her writing, definite about her faith in God, and motivational for the creative soul. Hurry and purchase this book for yourself and for others. What a joy to see such refreshing writing out there these days.- Donna Wynn\r\n\r\nDetails:\r\n6x9\r\nTrade Paperback\r\n412 pages\r\nFull color cover\r\nblack and white interior on cream paper\r\n\r\nShips via USPS in 7-1- business days","options":[{"id":49207920,"name":"Default","price":14.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.95,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128351781/-/cartel_book_cover_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128351781/-/cartel_book_cover_1.jpg","width":1633,"height":2208}],"artists":[],"categories":[]}]