[{"id":11702034,"name":"The ONE","permalink":"the-one","position":1,"price":134.0,"default_price":134.0,"tax":0.0,"url":"/product/the-one","status":"active","on_sale":false,"created_at":"2013-06-10T21:15:35.000Z","description":"THE ONE\r\n\r\nDeutsche Fassung weiter unten -\r\n\r\nThis is what we've been working on these last few months and we're incredibly proud to finally be able to present it to you. It's the ONE, the only pants you'll ever need. Seriously. These were born from our need for a decent looking pair of pants to get us through our daily life.\r\n\r\nThese are water- and wind-repellent. Breathing. Incredibly stretchy. Have a cut optimized for cycling and climbing. And they look damn good, with a shirt as well as with a more casual look. In short, we ride our bikes in these, we go bouldering in these and we're still wearing them while having a beer at the bar afterwards.\r\n\r\nAvailable in black and blue from next week on; more photos to follow.\r\n\r\nPre-order now, contact us for perfect sizing; due to the fact that the two of us make all of these right here in Leipzig, delivery might take three to four weeks.\r\n\r\n\r\n\r\nHieran haben wir die letzten Monate gearbeitet und sind stolz, sie euch endlich präsentieren zu können - die ONE, die einzige Hose, die Du je brauchst. Entstanden aus unserem Bedürfnis nach einer Hose, die uns durch den Alltag bringt.\r\n\r\nWasser- und windabweisend. Atmungsaktiv. Unheimlich dehnbar. Ein Schnitt, den wir zum Radfahren und Klettern konstruiert haben. Und verdammt gut aussehend, egal, ob mit einem Hemd oder lässigeren Klamotten. Um es kurz zu machen - wir fahren so zur Wand, wir bouldern darin und haben sie auch Abends in der Bar noch an.\r\n\r\nErhältlich in Schwarz und Blau ab nächster Woche; Fotos folgen.\r\n\r\nVorbestellungen schon jetzt möglich, meld' Dich bei uns für die perfekte Größe; da wir beide all das hier selbst herstellen, kann es drei bis vier Wochen dauern, bis Deine Bestellung Dich erreicht.","options":[{"id":36960678,"name":"Default","price":134.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":2.5,"country":{"id":16,"name":"Germany","code":"DE"}},{"amount_alone":10.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/115222386/-/2.1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/115222386/-/2.1.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":5514069,"name":"Pants","permalink":"pants","url":"/category/pants"}]},{"id":11569131,"name":"MERINO WOOL RIDING BEANIE","permalink":"merino-wool-riding-beanie","position":2,"price":24.0,"default_price":24.0,"tax":0.0,"url":"/product/merino-wool-riding-beanie","status":"active","on_sale":true,"created_at":"2013-06-04T11:52:21.000Z","description":"This is our beanie made from all-natural merino wool. It’s warm and keeps the wind away, but won’t get too hot. The wool is lightweight, breathable and soft, perfect for spring, summer and fall. On those rainy days or chilly summer nights, this is a must-have. Unlike other, heavier beanies, you won’t have a problem putting this one into the backpocket of your jersey - or pants.\r\n\r\nCut nice and tight, fits under any helmet, no matter if it’s for cycling or climbing. Looks good on your bike, on the wall and in the park.\r\n\r\nMade by us here in Leipzig-Lindenau.\r\n\r\nMight take up to one week for us to ship it; delivery depends on where you are.\r\n\r\nRide safe!","options":[{"id":36497502,"name":"S/M","price":24.0,"sold_out":false,"has_custom_price":false},{"id":36497505,"name":"L/XL","price":24.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.5,"amount_with_others":0.0,"country":{"id":16,"name":"Germany","code":"DE"}},{"amount_alone":5.0,"amount_with_others":2.5}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/113883390/-/beanie4.2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/113883390/-/beanie4.2.jpg","width":1000,"height":476}],"artists":[],"categories":[{"id":5231424,"name":"Hats","permalink":"hats","url":"/category/hats"}]}]