[{"id":15375561,"name":"Youthcrew 2014 Pre order ","permalink":"youthcrew-2014","position":1,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/youthcrew-2014","status":"active","on_sale":true,"created_at":"2013-12-06T14:59:18.000Z","description":"Co-release with Positive & Focused Records, ugly and proud, Trilob Records, We Stand Records, Akashic Records, True Spirit Records, Speedowax Records number 87,THIS IS A PRE-ORDER; WILL SHIP EARLY 2014\r\n\r\nThe 4th edition of this international 7inch compilation once again features some of world's best youth crew hardcore. Available on 5 different colours of vinyl.\r\n\r\nClearsight, Ukraine \r\nSafe and Sound, USA \r\nDedication, Brazil \r\nNothing Remains, Japan \r\nClean Break, Portugal \r\nKid Armor, USA \r\nRight Mind, Australia \r\nCut Loose, France\r\n\r\nME + YOU = YOUTH CREW\r\n\r\nP.S. the 5 colours package price is a little bit higher because it includes the difference in shipping between 1 and 5 records.£4.50 per unit to send to the states £7.20 for 5...that's what it cost me i always throw in extra records with orders ask anyone whos ord from me in the past, if you order the 5 pack you will be entered into the draw to win a Testpress any questions mail me at speedowax@gmail.com or www.facebook.com/speedowax Remember this a pre- order so records will ship as soon as i receive the records from the pressing plant Thank you.\r\n\r\nCo-release with Positive & Focused Records, Trilob Records, We Stand Records, Akashic Records, True Spirit Records, Ugly and proud Records","options":[{"id":49997856,"name":"5.00 u.k clear","price":5.0,"sold_out":false,"has_custom_price":false},{"id":49997859,"name":"5.00 uk white","price":5.0,"sold_out":false,"has_custom_price":false},{"id":49997862,"name":"5.00 uk Silver","price":5.0,"sold_out":false,"has_custom_price":false},{"id":49997865,"name":"5.00 uk pale blue","price":5.0,"sold_out":false,"has_custom_price":false},{"id":49997868,"name":"5.00 uk dark blue","price":5.0,"sold_out":false,"has_custom_price":false},{"id":49997871,"name":"7.50 world clear","price":7.5,"sold_out":false,"has_custom_price":true},{"id":49997874,"name":"7.50 world white","price":7.5,"sold_out":false,"has_custom_price":true},{"id":49997877,"name":"7.50 world silver","price":7.5,"sold_out":false,"has_custom_price":true},{"id":49997880,"name":"7.50 world pale blue","price":7.5,"sold_out":false,"has_custom_price":true},{"id":49997883,"name":"7.50 world dark blue","price":7.5,"sold_out":false,"has_custom_price":true},{"id":49997889,"name":"25.00 u.k 5 colors ","price":25.0,"sold_out":false,"has_custom_price":true},{"id":49997886,"name":"30.00 world 5 colors","price":30.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128928447/-/youthcrew14art.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128928447/-/youthcrew14art.jpg","width":960,"height":960}],"artists":[],"categories":[]},{"id":15172758,"name":"News 17/12/13 were shipping deadcuts 7\"s now","permalink":"black-friday-2013","position":2,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/black-friday-2013","status":"active","on_sale":true,"created_at":"2013-11-28T16:18:29.000Z","description":"Punk Rock Disc. Encapsulating some of the best underground UK bands, Rich goes for it again. We had the pop as hell disc 1, the skate as hell disc 2, the emo-dabbling disc 3, and now the 4th instalment - the most mature yet. Rocking us off is FISHTAKE. I've been desperate to hear them, and well... it's pretty average/half-decent poppy punk with an occasional 80s tinge. Grimsby's \"DISCOUNT meets FACE TO FACE\" lot LUNA:SUIT pop along next and take things up a gear, but I know they can do better. Closing side 1 is Brighton's melodic HC rock gods SCUTTLE with a track off their demo - fecking great stuff. Side 2 opens with our favourite gritpunks SOUTHPORT and \"Fallen on Your Feet\". I'm certain this has been on other comps and frankly it's not \"Deja Vu\" is it? (Well obviously it's not cos they're different songs but... oh y'know). But they rock and if it tickles your pickles you'll love the album. SCARPER! serve up a punkier number than what we've come to expect of their usual fayre - it's funky; I love SCARPER!. And closing procedures are the one and only EIGHTY-SIX, with their oft whored track \"Distance\". Waaaay more e** than their present direction, which is verging on out and out punk rock but a fucking awesome song - you know that one already. Is it me or did I tell Rich about them in the first place? Oh cool! (sorry, just realised as I was reviewing...!) Yep, top job once again.Martin (collective zine)","options":[{"id":49295868,"name":"Default","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128806089/-/speedocolor.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128806089/-/speedocolor.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":15145416,"name":"Vulgar Display -under darkness and prayer pre order color! ","permalink":"vulgar-display-under-darkness-and-prayer-pre-order-color","position":3,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/vulgar-display-under-darkness-and-prayer-pre-order-color","status":"active","on_sale":true,"created_at":"2013-11-27T15:46:00.000Z","description":"Pre- order now, Records ship   late  jan 2014 \r\n6 TRACK e.p from Dallas,  TX,     Strong  Hardcore e.p for fans of Will to die,Pantera,Bad habits,Worn out, Down to nothing,Rotting out<a href=\"https:/www.vulgardisplay.bandcamp.com\">here</a>\r\nwww.vulgardisplay.bandcamp.com<a href=\"https://vulgardisplay.bandcamp.com/\">here</a\r\n1-Final taste \r\n2-no god here\r\n3-Voices unknown\r\n4-archictects of corruption\r\n5-Guilty spared\r\n6-one eye open \r\nThis version is Only available by Directly ordering through this store, the record is on color vinyl with an exclusive sleeve  new band from Dallas, Texas/U.S.A., formed by members of END TIMES and HUMANERROR in spring 2012, dedicated to heavy and metallic evil Hardcore pretty much influenced by the \"HOLY TERROR HARDCORE\" style of the likes of INTEGRITY, INTEG2000, IN COLD BLOOD, FEAR TOMORROW, and ROT IN HELL (and this as far as I can say musically as well as lyrially and also in the artwork this \"HOLY TERROR\" influence showcases itself pretty clear and very well), for example and just that you get a impression of what's going on here, , giving us all in all six songs in about fourteen minutes in a great production sound. This fourteen minutes crush into your face like  brutal swung sledgehammer leaving your face a bloody mess, a sledgehammer of brutal deep shouted lead voices, bonedry and sharpcutting, metallic thrashing pretty multi-layered and incredible forceful guitars, harsh roaring bass playing and precise thundering raging dumming, fast and sharp edged songs but also filled with different styled parts that add a lot of diversity to the already very strong and grapping arranged interesting songmaterial. And btw, yes, this is a very early release by VULGAR DISPLAY, no doubt about it, but it's already also a very strong release by a great Hardcore band that we all should keep an open eye on and one interested ear open on it as well. A very promising band!!! Currently I'm thinking about to do an interview with them in the near future of this very blog and year. Great band, check them out asap, period!!! HARDCORE!!! FIST!!! (9 of 10 points)\r\n(http://vulgardisplay.bandcamp.com<a href=\"https://vulgardisplay.bandcamp.com/\">here</a>\r\n ","options":[{"id":49197126,"name":"4.00 postpaid u.k pre order 75 made","price":4.0,"sold_out":false,"has_custom_price":false},{"id":49197129,"name":"6.50 postpaid world 75 made","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128342955/-/vulgardisplay.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128342955/-/vulgardisplay.jpg","width":940,"height":940}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"},{"id":6598842,"name":"7\"s","permalink":"7-s","url":"/category/7-s"}]},{"id":14953395,"name":"machinist! Birthright with bonus Dying whale e.p ","permalink":"machinist-birthright-with-bonus-dying-whale-e-p","position":4,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/machinist-birthright-with-bonus-dying-whale-e-p","status":"active","on_sale":true,"created_at":"2013-11-19T17:19:35.000Z","description":"With their 2012 debut EP Black List, Machinist! kicked a few doors off the hinges, said their piece to whoever was on the other side and got the fuck out in under six minutes. It was a distorted reminder to cynics and snobs alike that DIY punk and hardcore was alive -- that guys under the age of 55 'got' punk and could write 60 second songs full of pulverising riffs and stupid-fast blast beats that also meant something. Whether it was Jeff Hill's opening disdainful cries of \"Failure failure / that's what they say to me\" or his uncompromising closing request to \"Put your fucking hands down / Get the fuck away from me / Let your hollow words drown / Don't pray at me\", Black List resonated through brute force and a strong will. Birthright is Machinist! turning their fiery gaze towards slightly less ambiguous victims. \r\n\r\nIf that all sounds like nothing more than mindless aggression and knackered kick drums, it's not -- Hill's moral compass is the center of everything that Machinist! does. His constant and open contempt for bigotry, oppression, homophobia and the like is the blood that runs through the band's veins, yielded like an axe and not in the least bit blunted. \"Another bigot in a black robe / scum of the earth / lower than low / dehumanizing denial of life / petty power trip refusal of rights\" he blasts out on title-track opener, a presumed attack on corrupted justice, being born into shit and ultimately the damage done. 'They' exercises even more brevity; a 24 second barrage of riffs and noise as 'they want you to believe / they want you on your knees' is repetitiously chanted with ferocious energy. It's the type of track that'll bridge the generation gap at basement shows -- the punk equivalent of a pitchfork protest that urges you to think for yourself and believe what you can actually see. \r\n\r\nThat idea is explored further on closer 'Success Build on Self Hate', a track I'd describe as 'explosive' if it weren't for the fact that it all is, which seems to dismiss religion as a roadblock for real social progress (''so eat your words and pray in your closet' ) -- a topic Hill & co interestingly first explored on Black List closer 'Prayed Upon'. This 'leave me alone' mantra is ever-present in the band's output (all 15 minutes of it), but it's never sanctimonious or stylised for mass consumption. It's probably incredibly fun to play live though -- all part of the paradox of playing fast-paced punk music whilst lopping off the heads of philistines and dogmatists in your lyrics. \r\n\r\nIn the end, it's one line in particular that dovetails Birthright in the most beautifully ungracious way imaginable: \"a million problems / we got no one to fucking solve them\", delivered with hapless distress over an amp-busting riff. That's Machinist!, right there.<a href=\"https://dying-whale.bandcamp.com/\">here</a>\r\n\r\nMACHINIST Shipping from 01/01/14 dew to pressing plant been backed up \r\n \r\nHARDCOR","options":[{"id":48512937,"name":"4.00 postpaid england","price":4.0,"sold_out":false,"has_custom_price":false},{"id":48512940,"name":"6.50 world","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128410065/-/dyingwhalebird.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128410065/-/dyingwhalebird.jpg","width":960,"height":960},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128410089/-/machinistwithlogoart.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128410089/-/machinistwithlogoart.jpg","width":960,"height":960}],"artists":[],"categories":[]},{"id":14926299,"name":"Fairlane Spot Beneath the Earth Pre order version 7 inch Vinyl","permalink":"opium-lord-the-calendrical-cycle-prologue-the-healer-7-inch-x","position":5,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/opium-lord-the-calendrical-cycle-prologue-the-healer-7-inch-x","status":"active","on_sale":false,"created_at":"2013-11-18T16:36:50.000Z","description":"Debut vinyl e.p influenced by  Quicksand, Samiam, Hum and Texas is the reason,Fairlane meld post-punk, post-hardcore and pop-punk styles to create a catchy Official debut e.p that is uniquely their own. Generating riffs and emotionally charged vocals abound as Fairlane Deliver Heartfelt  punk that not only captures the greatness of their influnces but also pleases fans of Basement,Balance and composure,Sainthood reps,Have mercy and Daylight \r\n<a href=\"https://fairlaneatl.bandcamp.com/\">here</a>\t\r\n1.\r\nRaincoat 03:33\r\n2.\r\nSpot Beneath the Earth 03:42\r\n3.\r\nSweet Lucidity 02:33\r\n4.tba \r\n5.tba\r\n\r\nRecorded at Led Belly Studio in Dawsonville, Georgia. \r\nMastered by Azimuth Mastering.\r\n\r\nreleased 14 Feb 2014 Pre- orders ship around/before this date\r\n\r\n: 90's rock alternative emo post punk ","options":[{"id":48405270,"name":"5.00 u.k","price":5.0,"sold_out":false,"has_custom_price":false},{"id":48405273,"name":"7.00 world","price":7.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129146595/-/fairlane7inch.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129146595/-/fairlane7inch.jpg","width":350,"height":350},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129147195/-/fairlane.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129147195/-/fairlane.jpg","width":960,"height":640}],"artists":[],"categories":[]},{"id":14926257,"name":"Winter warmer  2013 speedowax pack","permalink":"bad-habits-parting-words-7-inch-x","position":6,"price":13.0,"default_price":13.0,"tax":0.0,"url":"/product/bad-habits-parting-words-7-inch-x","status":"active","on_sale":true,"created_at":"2013-11-18T16:35:29.000Z","description":"10 speedowax recordsEvery blogger and has written about this cracking record from Step Aside and Speedowax pressed up some copies for the bands final show in October of this year. It's been remastered by Pirates Press too. I THINK this is one of the 25 pre-order versions of the record numbered 18/25 but I always find Speedowax pressing details slightly hard to follow (do you just make it up Rich? haha) Anyway great record and a great band.\r\n\r\n\r\n\r\nWrong Idea - What's Left Inside\r\n\r\n\r\n\r\nSpeedowax also recently put out this record by Wrong Idea who may or may not still be a band, I can't quite work it out (so many questions). They do feature two guys from Step Aside and play a similar style of stuff. This record is fantastic. 195 were pressed on this 'cloudy clear' vinyl.\r\n\r\n\r\n\r\nCross Me - S/T\r\n\r\n\r\n\r\nCross Me are a really good band and this 7\" is absolutely killer. I'd never heard of the band before reading the Speedowax description but I was immediately intrigued as they were likened to Expire and Rotting Out. You can read the description and an interview here, pick up a copy whilst you are there as this band are definitely in the vein of the bands they've played/toured with such as the aforementioned and Take Offense. By rights they should be the next band to blow up like those guys. This record is that good, especially as I presume it's their debut. Check it out!!\r\n88 of these pressed up with different coloured sleeves. Mines numbered 43.","options":[{"id":48405063,"name":"13.00","price":13.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128660247/-/allt.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128660247/-/allt.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":14887782,"name":"Old flings/Control group -split 7 inch mailorder only color vinyl","permalink":"old-flings-control-group-split-7-inch-mailorder-only-color-vinyl","position":7,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/old-flings-control-group-split-7-inch-mailorder-only-color-vinyl","status":"active","on_sale":true,"created_at":"2013-11-16T15:28:43.000Z","description":"Limited edition 37 numbered Dookie brown vinyl the rest were sold and numbered to 50 for Fest 2013 and sold out in five minutes. Old Flings started as an attempt to put some muscle behind singer and acoustic guitarist Matt Evans. It turned into a legitimate band that has a Hot Water Music influence but with, perhaps, a little more indie and punk sound. fans of Samiam,Hum,Smoking popes,Gameface check in.Control group are  Done lying Down Frontman Jeremy Parker's new Hot band Punky Tunesmiths with Building Tuneage Played in True Garage punk spirit.<a href=\"https://oldflings.bandcamp.com/\">here</a>dld-logoDone Lying Down were a band that I loved back in the mid 90’s.  With their punk rock stylings they really hit the right note with me.  I still regard their debut album “John Austin Routledge” as a firm favourite.  When I realised the band were playing live again (even if it’s a one off!), the chance to have a chat to them was too good to miss…\r\nHi chaps, cheers for chatting with us much appreciated.  So you have a one off show coming up, will there be much chance to rehearse with the band beforehand at all?  Or are you all just so professional it’ll be a seamless transition?\r\nGlenn: We hope to get in a couple of rehearsals if we can, but it’s not a big issue. Jeremy doesn’t need to remember lyrics as he depends on the audience if he forgets the words.\r\nJeremy: In theory we’re each relearning our parts independently in our separate countries. (Ali Mac lives in Denmark now, and I’m based in New York.) Last time we tried this it worked out great, and everything just came back as if we’d just finished a tour the week before.\r\nJames: We also had a band practice on Skype. We made it through half a song but the time delay made it pretty hard to stay in time. It was interesting though. Kinda free form. I think it was art:\r\nAliMac: We certainly aren’t particularly professional. I probably haven’t picked up a bass guitar in a couple of years. It’s amazing how muscle memory works with songs that are 20 years old though.\r\nbandPhotoSo what’s with the reunion show?  How did it come about?\r\nGlenn: we don’t like to think of the show as a reunion as we have never split up. James once pointed out that we’re just on a very slow tour!\r\nJeremy: I was surprised to learn that we haven’t played a show in about five years! Time flies when you’re doing other stuff! Usually, the rest of the band hassle me to book a trip to London, and we book a show around that trip. This time, with Ali Mac living in Denmark, it had as much to do with his schedule and availability. Based on when he could make the trip AND when I could make the trip, we hashed out some dates, then drummer extraordinaire James Sherry set about finding a venue, booking the date and promoting the gig. So James kind of makes it happen.\r\nJames: It’s true. I did.\r\nAliMac: I like to think of this as our 2013 world tour. We should do some T-shirts with just the one date on the back.\r\nAnd I presume it’s the original line up yeah?\r\nGlenn: Absolutely original line up that everyone is familiar with!\r\nJeremy: Yup.\r\nYou put a couple of albums out in the mid 90’s and a load of EP’s. Will this show feature the older stuff only? Or is there going to be some new stuff mixed in?\r\nJeremy: This show will feature the original material. I’m always concerned that the older stuff will sound dated, but I think we avoided a lot of the 90s cliches, and kind of have our own thing going on. Over the years I’ve heard some or our musical ideas appearing in other bands’ material. That’s both encouraging and frustrating. On the one hand, you’re like “hey! That was our idea!” On the other hand you’re like, “That must have been a good idea if someone else is doing it too.” So, to answer your question, it’ll be material that was all written during the most active period of the band, 1994 – 1997, but will also include songs that didn’t appear on the albums and EPs. There were some songs we only ever played live.\r\nWhat are you expecting the show to be like?\r\nGlenn: I expect the audience will be full of people who we know from when we were regularly touring. It’s a bit like doing a show for all your friends which is what we’re basically doing to catch up with old friends… Can’t wait!\r\nJeremy: I think it’ll be a lot of fun. We haven’t played together in ages, and for us it’s what we love to do. It’s a real treat to be able to snap into this role of band member and suddenly you’re in a band you love, that you almost forgot you were in. Does that make sense?\r\nJames: It’s hard to imagine but when we were originally together the internet was in its infancy but these days with social networking etc, it’s far easier to stay in touch with the people that like our band. We’re Facebook friends with a lot of the main people that used to come and see us back then so it’s easy to contact them all in one go and let them know about the show. It’s a great excuse to see old friends and rock the fuck out! The first time we did it was in 2006 – prior to that our last gig had been in 1997 at The Garage. In 2006 we played at the Bull & Gate in Kentish Town and it was so much fun to play again after a nearly ten year gap. All the fun, memories and music came rushing back and we had a ball. After that we played again in 2007 and then twice in 2008. Like I said, it’s just a very slow tour.\r\nAliMac: I expect too that it’ll mostly be a sea of familiar (positively middle-aged) faces. But it’s kinda interesting meeting the odd slightly younger fan who was really inspired by us back in the day, but wasn’t old enough to come and see us play live. Especially interesting because we didn’t take ourselves particularly seriously most of the time.\r\nI don’t want to spoil it, but answer me one thing…. Can we expect to hear “!$%*X? (Or Something)”?\r\nGlenn: Mmmmm how does that one go again? ;-)\r\nJeremy: Haha! Good question, Franko! Let me just say this: “You never thought I’d be the one to let you down.”\r\nWhy did the band call it a day in 97?\r\nGlenn: We all needed to get jobs and a life! But hey we never called it a day did we!!!\r\nJeremy: Heck no! We’re still very much active. Like an active volcano is active. Like a glacier is active. We’ve been working on a video for our latest track – it’s a fast motion video comprised of a series of photos of the band members taken once a day for the past 20 years. It’s coming out really well so far. It should take about another ten years to get the rest of the footage through the end of the fadeout. Once we finish that video, we’ll get back to our normal touring schedule. It was a really ambitious project. In retrospect maybe we should have just done a lip synch.\r\nAliMac: I’d love it if we could all get together again for a few weeks to write and record another album. I’d imagine that the results would make very interesting listening for us all.\r\nDone Lying DownI have a rough idea what you’ve been up to since then, but have you played in any other bands along the way?\r\nGlenn: We all have played in other bands in some form or another and regularly contribute to each other’s musical projects enthusiastically! For instance only last night I put a bit of guitar onto a song that Jeremy was working on and with the power of the internet it’s done within an hour between the US and UK. Back in the day when we were in separate countries it was bass, guitar and drums on a cassette and snail mail to be vocalised!\r\nJeremy: I don’t think any of us stopped making music. Every time someone visits me in New York we bust out the recording gear and create something. I guess it’s like if you get together with old fishing buddies, you go fishing. When you get together with old music buddies you make music. Most of the stuff we’ve recorded isn’t released publicly, but there have been a few projects that we’ve been involved with that have surfaced. Most notably, I’d like to mention James’ band “K-Line”. They were awesome! My current band, Control Group is OK. (controlgroupmusic.com)\r\nGlenn: Apparently I’m a member of Ambush at Junction Rock which is indeed an honour!\r\nJames: I’ll play drums for anyone that asks me really. I’m a total drum slut.\r\nAliMac: I’m totally loyal to DLD personally. Except when I’m not.\r\nWhat have you all been doing in the meantime?\r\nGlenn: These days I like to stick needles into old people and take their blood! (I’m in District Nursing as a Senior Phlebotomy Specialist and trainer) I’m also involved in Wound care in elderly who are housebound.\r\nJeremy: I learned how to program computers. I did music technology stuff at a company called Cakewalk. Then I got into video games making Rock Band® games at a company called Harmonix. When I moved from Boston to New York I joined a company called OMGPOP and made a game called “Draw Something”. I’ve been really lucky to be involved with really talented people, starting with the Done Lying Down crew! ( I should mention that Done Lying Down is available for download in Rock Band games: http://www.rockband.com/songs/artists/Done+Lying+Down)\r\nJames: I work in music still, running a promotions company with the legend that is Zac Leeks (his vocals feature on the song ‘Song For Freeloaders’ on the ‘Kontrapunkt’ album!) We look after press for bands such as Gallows, Converge, Enter Shikari, Pulled Apart By Horses and many more. I’ve been doing that now for ten years and we’re still going strong. Before that I used to be a music critic for Kerrang! and Metal Hammer and others but I’m ok now.\r\nAliMac: Went into software development and management for printing and then professional broadcast equipment. Now I’m working as an engineer for DR (the Danish equivalent of the BBC) using a lot of the equipment that I developed back in the UK. I am also close to finishing a new software product with an ex-colleague for enhancing stereo signals. Could become very important within the recording industry. http://richardbrice.net/francinstien_intro.htm\r\nWhich bands would you say influenced your sound?\r\nGlenn: Definitely the Dumfukadoodumdums where a major influence on our style and sound. Major feedback artists they were, or still are?\r\nJeremy: Yeah we stole a lot of our sound from the Dumfukadoodumdums. It’s too bad they didn’t go further. I would have thought they would be the band people remember from the 90s. For my own part, when I listen to our stuff I can remember where each stolen idea came from. Artists like Sade, They Might Be Giants, the “My Fair Lady” soundtrack…etc. Seriously. Our sound and style came from bands like Fugazi, Shellac, Girls Against Boys, and other Sub Pop or Touch and Go artists, but if you steal ideas from that stuff, then it doesn’t sound original. Steal an idea from Sade and it’s going to sound totally unique. I’m not saying we stole all our ideas, of course. We came up with a bunch of crazy stuff on our own. But the ideas we stole came from FAAAR away.\r\nAliMac: I think I decided I would to play guitar in a band after seeing T-Rex on TOTP. As a kid in the 70s I just loved Queen, but was also big into Bowie, Led Zep, and the power and simplicity of punk rock when it came along. In the 80s I got into U2, The Smiths, The Cure, REM and probably a quite lot of dodgy shit that’s best forgotten now. There was tonnes of other stuff obviously, but it’s a long time ago and the memory fades. I remember discovering Pixies at University after which began my love of American punk rock.\r\nI have vague memories of seeing you guys play with maybe The Wonder Stuff or Ned’s Atomic Dustbin?  Help me out here, did you play with those bands back in the day?\r\nGlenn: We deny everything!\r\nJeremy: Hahaha! Guilty as charged. On both counts.\r\nJames: We were victims of the 90s.\r\nAliMac: I remember we were rather split on whether to play with Neds. We did get to meet Baby Chaos who were well cool (gym-nasties anyone), and John Fatbeast ended up crashing at my flat and nearly crushing Ben Drakeford to death in his sleep. So it wasn’t all bad.\r\nWho stood out as being the best and worst bands you played shows with?\r\nGlenn: This is a difficult one as the worst bands far outstripped the best. We used to have a list of bands that we would invite to play an imaginary festival called the Suckfest! The list was written on our tour bus (the moonbus) wall and the list just got bigger and bigger, in fact we may have had to get a bigger bus! The best include Compulsion, Chumbawamba, Latimer, Killdozer, Sonar Nation… We actually got banned from playing with Sonar Nation (label mates) as we tended to over do it on the silliness and drunken antics front (like trashing dressing rooms, food fights, tour van surfing, and onstage beer drinking contests).\r\nJeremy: I don’t recall the Suckfest lineup, but I remember it took up most of the ceiling of the van.\r\nGlenn: Dodgy were the headliners!\r\nJeremy: haha! Oh yeah! And I think a couple of our manager’s other bands made the bill too :) I think you nailed the “best of” list there, Glenn. Other fun bands were Zimmerframes, Huge Baby… I think James really liked a band called Wormturf. James: Dude, Wormturf rocked!!\r\nGlenn: Hey not forgetting The Boys Girls Against!!! Yes GVsBs rocked when we played with them, cool guys.\r\nAliMac: And we also got to play with John Spencer, Killdozer, The Damned and The Misfits. Technically we also played with Shellac at a The Phoenix festival. Same stage, same day counts, right? Best tour was a month around Europe with Chumbawamba.\r\nHow about venues, what were your favourites to have played?\r\nGlenn: I always particularly enjoyed playing at the sadly much missed Duchess of York in Leeds, The Garage in Highbury, I enjoyed most of the mainland Europe venues. The cool thing about a lot of the venues we played is that when we returned there it was always good to see faces that regularly came to see the band and catching up with them. We had this guy Andy who followed the band around on one particular tour and he just appeared at a gig every night, so we just had to ask him where you at the venue last night. We got to know him quite well and he ended up coming with us in the moonbus for the rest of the tour. Wonder what he’s up to now huh? Andy Dixon was his name, must FB him up. We used to pick up hitch hikers on the way to venues and they would usually be going to see DLD that night, if not they were invited to the gig, came, and became friends. Some of those people will be at the gig on the 9th.\r\nAliMac: We virtually lived in The George Robey for a year, rehearsing and playing with bands like Huge Baby and Sonar Nation. I was particularly fond of the toilet in Camden (crap, what’s it called now) where I first met Jeremy and Glenn when they were playing as a three-piece with Glenn on bass – (a week later I was in the band). We played there quite a lot, and Jeremy used to pull stunts like chugging a bottle of whiskey and then flobbing up on the ceiling so that it would drop down on top of my hat. Great days!\r\nLostDLD5You managed to record for John Peel, how was that?\r\nJeremy: That was awesome every time. #1 it was an honour to record for John Peel. Probably the highest honour we ever received. #2 you get to record in an amazing studio. It’s the friggin’ BBC!! They had a massive closet full of every kind of mic you can imagine! The rooms were incredible! The gear was unbelievable! #3 you get paid for it! When you’re playing original rock music you never get paid for anything. But they pay you BY THE HOUR for playing your own songs! How awesome is that?!? Oh, and #4 then it gets played on the radio. On NATIONAL RADIO! *YOUR* songs getting played on *NATIONAL RADIO*!! …and they pay you for THAT! So yeah, I think that’s the best thing I’ve ever done in my life. Thank you John Peel wherever you are now.\r\nGlenn: I do not disagree!\r\nJames: I think of everything we did, the fact that Peel liked us is what I’m most proud of. He was amazing. Let’s face it, without him there would be NOTHING.\r\nAliMac: Ditto to all the above. Top man, much missed.\r\nIs there much in the unreleased back catalogue that could still see the light of day?\r\nJeremy: Good lord, yes. I think the last four track tape we recorded was the best collection of tunes we ever recorded. We rented a place in the middle of nowhere in Wales and went out there for a week to write and record. Those songs are some of the most original, catchiest, most emotive, most fun tracks we ever wrote. There are some duds in the collection, but there are definitely some gems. We may need to re-record them if we were going to do a proper release, or we could release the lo-fi demos. I’m not sure. Then again, if we had the time and the opportunity we could write new stuff. I think that would be more exciting.\r\nAliMac: Llanbedrock! We played that whole tape from Wales to Garret Lee (what’s off of Compulsion) and he fucking loved it. Wonder what he ever did with his career since? :-)\r\nWhat’s your biggest regret about your time in Done Lying Down?\r\nGlenn: Not having the IT technology that we have at our disposal now. Can you imagine we would be able to text each other in the back of the tour bus ;-) . I would love to have had an iPad or something back in the day!!! Not having the scope for fun and IT related mischief is always regrettable. Writing songs on the road would have been much easier although it was great fun doing it the way we did then on 4-track cassette sometimes pulling into a layby on the road somewhere and setting up the drum kit and recording drums for a tune and guitaring it up on the rest of the way to a gig. As a matter of a fact we had our equipment set up in the back of the moonbus for that inspirational on the road song idea moment. I have a pic of that set up somewhere and will post it on FB if I can find it, it could already be up there on one of our band members timelines?\r\nJeremy: I regret the artwork on the John Austin Rutledge Album, and some of the mixes on that disc. Like you’re saying, Glenn, if we had the technology back then we could have spent more time getting the artwork right, and perfecting the mixes. At the time we were spending loads of money by the hour for a studio that we weren’t familiar with. I was choosing reverbs on a machine I had never heard before, and using compressors I didn’t really know, listening on monitors I wasn’t familiar with. Some of those mixes really didn’t do the songs justice. And the artwork was atrocious. I apologize for all of that.\r\nJames: Like anything that’s fun, when you look back on it you wish it had gone on longer. At the time, real life was starting to take over and it was obvious we were not going to be able to make a living from the band and had probably got as big as we were going to get. We’d managed to do the band full time – from 93 – 96 we put out a bunch of EPs, two albums, wrote and recorded tons of songs, toured all over the UK and Europe, went to America, did more than I ever expected us to do. Yes, it would have been great to make a 3rd album but on the whole, I’m really happy with everything we did. We’ve all remained good friends and I look back on those days with so much fondness – we had a blast. I couldn’t have asked to be in a more rocking, fun band and play with a better bunch of people. We always had fun, there were very few bad times. We took great pride in what we did but we also stopped ourselves from taking it too seriously. The emphasis was always on FUN. I love them DLD guys.\r\nAliMac: No regrets. Those guys are still my best mates despite living in a different country and only getting together once a year or so for some proper banter. There was a time after we stopped, sorry… slowed down, when there was a large tinge of sadness that we had let such a great part of our lives go. But that is totally inevitable when you manage to pack such a lot of fun into such a short time period.\r\nAre there any plans after the show for the band?\r\nJeremy: The short answer is “no”. We’re taking it a day at a time. Personally, I’d love to record a new album, but I know the other guys have a lot of stuff going on. I’m not sure when we would get to do it. Me and Glenn just finished a collection of tunes where he recorded all the music at home and sent me the instrument tracks to overdub vocals on. That was really fun.\r\nGlenn: A nice cup of tea anyone?\r\nJeremy: I have to go pick up my food from the “Community Supported Agriculture” place. Thanks anyway. Are you having a cup of tea?\r\nGlenn: How Rude!\r\nJeremy: Why is that rude? (You cunt!)\r\nAliMac: I just bought a house with a basement. So we finally have a permanent space for DLD to write and record. Just 20 years late, but better late than never!\r\nThese days bands rely on the internet a whole lot, is there anywhere for people to still check out your material online?\r\nJeremy: Glenn, you want to post a couple of URLs or summit? We should make a Facebook page for the band or something. I think we have a MySpace page, right? https://myspace.com/donelyingdown/music/songs Do we have a YouTube channel?\r\nGlenn: There is www.donelyingdown.com although that probably needs to be updated although I think it still looks cool? There is lots of stuff up YouTube, lot’s of crap too ;-) We should definitely put some new tunes up on site some time?\r\nJeremy: Do we have a Friendster account? Hahaha!\r\nWhich bands do you recommend people check out currently?\r\nJeremy: Personally, I really like Speedy Ortiz. They sound like Tanya Donelly singing for Helium. Also Tame Impala – new retro psych from Australia. And I’m in love with a Connecticut band called Ovlov, but mostly because their band name is the name of Done Lying Down side-project VOLVO spelled backwards.\r\nGlenn: Check out Ambush at Junction Rock, a band that hails from the Boston/Northampton area, (where J Mascis hails from) they rock!\r\nJames: Check out Baby Godzilla. They’re totally nuts.\r\nAliMac: One of the last gigs I went to see was Dead Kennedys. Stupidly went to work the next day after hanging out with Irish Mark. Wasn’t pretty. I’d thoroughly recommend them circa 1980.\r\nAnd finally, if you could have one band reform for a show, who would it be and why?\r\nJeremy: I’d love to see a band called Slurp reform and play a show because 1: I love their album 2: I have a feeling they would put on a show in my living room because nobody else knows who they are and they wouldn’t be able to book a venue. So then I could do interpretive dance while they played, and writhe around on my couch without having to make an ass of myself in public. Maybe they’d even let me join in and sing backup or something.\r\nGlenn: I’d like to see the Dumfukadoodumdums reform, or perhaps they are still together?\r\nJames: Oh my, Slurp were amazing! I’d love to see Brainiac again. They were incredible. The death of their singer Tim in ‘97 was a total tragedy. They were destined for such great things.\r\nAliMac: Spor X7 did a great version of ‘(This is Not a) Love Song’, but I’d probably prefer to see a full set by either 18th Dye or Oingo Boingo. Right, I’m off to bed to listen to ‘Classic Rock’ by Slurp. Didn’t their singer keep phoning you up at weird times during the night James?\r\nThanks for chatting to us chaps, we’ll see you at the show, good luck!!!\r\nJeremy: Thanks for letting us talk about ourselves!! :)\r\nGlenn: Yeah thanks and make sure you come and say hi at the show.\r\nJames: Avit!\r\nAliMac: Large. Laters!\r\nwww.donelyingdown.com\r\n    ","options":[{"id":48266187,"name":"5.00 u.k","price":5.0,"sold_out":false,"has_custom_price":false},{"id":48266190,"name":"7.00 world","price":7.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127679808/-/senseless.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127679808/-/senseless.jpg","width":480,"height":360}],"artists":[],"categories":[]},{"id":14870865,"name":"kato buried with the rain green vinyl ","permalink":"kato-buried-with-the-rain-green-vinyl","position":8,"price":2.5,"default_price":2.5,"tax":0.0,"url":"/product/kato-buried-with-the-rain-green-vinyl","status":"active","on_sale":true,"created_at":"2013-11-15T17:09:43.000Z","description":"Presenting Kato a young up and coming snarly beast of a band, two halves presented in a 11 minute under the floor boards master piece, \r\nthe a-side is a shuddering beast, the  music= dark,bleak,punishing and claustriphobic, ruined and buried in a white noise back drop...flip the beast over for a lewd acts,full of hell inspired punk blaster...Presented on clear green vinyl in a sparse art sleeve....Kato's scattershot 2012 debut Came With Nothing / Left With Nothing was a noisy, relentless amalgamation of what seemed like so many styles and genres, stifling you from every which way with dozens of sonic arrangements inspired by early hardcore, sludge-tinted post-metal and European screamo. It was a blistering display of raw talent no doubt, but an argument could be made for the record trying to cover too much ground. Here on Buried With The Rain, and armed with an additional maturity and a greater vision, Kato still display that penchant for diverse and experimental song structures, but cleverly avoid the pitfall of sacrificing cohesion to allow for it.\r\n\r\nTake 'Yet His Shadow Still Looms', a gloomy bottom-of-the-ocean opener which sways from a distortion-heavy doom riff into a Russian Circles-esque cannon of propulsive guitars and bass, occasionally stopping for breath in the form of clean, forboding interludes. In a final wave of dissonance, heavy blackened vocal screams pierce through the mire, draining the last remaining specks of colour from the dark, cold canvas. You're let down gently with a couple of light guitar picks, but in a track that barely surpasses four minutes, your skull is still jolted in an eyebrow-raising number of sonic directions.\r\n\r\nLikewise, 'And All The Rats Still Gather' sets a suffocating scene before unleashing a barrage of distortion and tangible anger. A low ambience and that not-so-original Oppenheimer quote rumble on before eventually making way for some seriously impactful percussion and frantic riffage, this time joined immediately by those hopelessly moving screams. 'Dust of Earth' cranks the voltage even higher, introducing some crushing blast beats into the now familiar blend of high/low, stop/start dynamics. In a rare moment of decipherability, a ferocious cry of 'Remind me, that all I'm worth is worthless flesh and bone' is even heard, as if any more layers of depressingly thick smog were needed.\r\n\r\nWhilst Buried With The Rain only runs for three tracks and comes in at a breezy 15 minutes, the sheer emotive power that Kato manage to conjure in that time is remarkable for a band with only a handful of tracks to their name. It's a heavy, rough listen at the best of times; uncompromising even, but one that masterfully unites a blackened hardcore sound with the pulsating qualities of post-metal and sludge. I suppose the question now is whether Kato can sustain such a dystopian aesthetic for an entire full-length, but then again, perhaps they're content to just rattle a few cages in short, sporadic bursts.<a href=\"https://kat0.bandcamp.com/\">here</a>\r\n\r\nHARDCORE\r\n \r\nDOOM\r\n \r\nMETAL\r\n \r\nSKULLSMASHER\r\n \r\nGAZA\r\n \r\nRUSSIAN","options":[{"id":48201264,"name":"2.50 u.k only ","price":2.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127636686/-/Kato0001.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127636686/-/Kato0001.jpg","width":600,"height":604}],"artists":[],"categories":[]},{"id":14793636,"name":"coldfront s/t 7 inch ","permalink":"coldfront-s-t-7-inch","position":9,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/coldfront-s-t-7-inch","status":"active","on_sale":true,"created_at":"2013-11-12T14:02:53.000Z","description":"Fans of Such gold,Rust belt lights,Daggermouth CHECK in \r\npunk rock, catchy, awesome tunes  from Canada's new best kept secret.Limited four track e.p Record will ship on and around the 24/1/14\r\nOntario punk act, Coldfront, \r\n\r\n<a href=\"https:/coldfront905.bandcamp.com/\">here</a>\r\n\r\nThe EP was released on August 2, 2013 and is recommended for fans of Such Gold, Rust Belt Lights, Daggermouth and Living With Lions VINYL Rules","options":[{"id":47941827,"name":"4.00 U.K INC POSTAGE ","price":4.0,"sold_out":false,"has_custom_price":false},{"id":47941830,"name":"6.50 WORLD INC POSTAGE","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127440411/-/coldfrontsleeveart.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127440411/-/coldfrontsleeveart.jpg","width":350,"height":350}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"},{"id":6598842,"name":"7\"s","permalink":"7-s","url":"/category/7-s"}]},{"id":14683536,"name":"Cross me- Motive 7 inch Vinyl record pre order  88 made","permalink":"cross-me-motive-7-inch-vinyl-record-pre-order-88-made","position":10,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/cross-me-motive-7-inch-vinyl-record-pre-order-88-made","status":"active","on_sale":false,"created_at":"2013-11-07T13:21:12.000Z","description":"Amazing Hardcore from Milwalkie,Wisconsin,u.s.a r.i.y.l  Bent life,Expire,Rotting out,Will to die Vulgar display Mosh pits.\r\nAll copies come in a Poly bagged Fold over Card stock sleeve with a seperate lyric insert,Each copy is Hand stamped with a X and numbered and limited to 88 copies on the central lables, this is not a pre -order..  records are in stock,ready to ship out the same day \r\nPop across to www.crossme.bandcamp.com and check out the Riffs I tried something new when tackling this interview. Instead of trying to interview a band I’ve already listened to, I gave a shout on the interwebs. I asked people to send me bands that were underrated. Some kind soul in Wisconsin sent me Cross Me and I jammed their Demo for the rest of the day. From there I got in contact with Chris and he was down for an interview.\r\n\r\nWhat album/band got you into hardcore?\r\n\r\nIt was definitely a mixture of records, but I remember the first hardcore band I was seriously pumped on was Bane. Their live show is beyond captivating and from the first time I saw them I was hooked.\r\n\r\nWhat was your favorite show you have played so far?\r\n\r\nI think my favorite show we played was Fargo. We had sent that area a bunch of demos so by the time we got out there, the kids knew our songs. It was a wild show.\r\n\r\nYou guys had two releases this past year. How has the reaction been?\r\n\r\nWell I haven’t heard anyone say we suck so that’s a good thing I guess. Personally I haven’t received anything but positive feedback about the demo and the single “Bad Company”. I think kids are into it which is cool.\r\n\r\nWhat are the main themes of your songs?\r\n\r\nMostly being angry with people in my life. Every song on the demo is about a different person who failed me or fucked me over.\r\n\r\nIn the past a lot of the hardcore heavy hitters have come out of the coasts. However, it seems like the mid-west scene is thriving right now. Why do you think this is?\r\n\r\nThe Midwest has been on the uprise for a few years now. I just think people are getting together and writing sick records. Expire, Bent Life,Black Ice, Another Mistake. Homewrecker, Vice, etc etc. Midwest kids are hungry and they want to tour.\r\n\r\nWho would you say, right now, is the most underrated local band?\r\n\r\nOh man that’s really tough to say. Last time I was in Florida the locals killed it. Cold Hearted and Point Blank. Also a band called Tidal Wave from Phoenix. They’re sick as well.\r\n\r\nWhat is your favorite release of 2013 thus far?\r\n\r\nUnited States Of Mind by a mile. Take Offense took the game to a whole new level with that record. Definitely worth buying.\r\n\r\nIf you could play with any current band and any band that has broken up, who would they be?\r\n\r\nRollins Band and Ill Intent. That would be a fucking party.\r\n\r\nWhen are you guys coming to play the East?\r\n\r\nIn November we have a few dates on the east coast with Expire, TO, and Bent Life. Keep an eye out for that.\r\n\r\nShout outs?\r\n\r\nShout outs to all my Milwaukee brothers. Bent Life, Black Ice, Another Mistake, Take Offense, Upperhand, Ill Intent, The Beautiful Ones Speedowax x\r\n25 left as of 5/12/13\r\nCROSS ME “DEMO 2013” (Released March 2013)\r\n \r\nIf you live in Wisconsin you are excluded but quick… name one current hardcore band from Milwaukee not named Expire. How about Cross Me? Not ringing a bell? I got this demo for free at their recent show on Long Island where they opened for Expire. One of the guys in the band was just walking around handing out CD copies which made me WANT to like this that much more. We all bitch and moan about the internet and how hardcore much like a lot of our daily activities has become cold and faceless. Cross Me sez fuck that shit and regardless if this was free or not I am digging what these guys are doing. First off this is far from perfect but that’s what demos are for…working out the rough edges and building on the style and direction a band is trying to go in. The 5 songs here run about 11 minutes in total and Cross Me show that they got something cooking with a style that is not that far off from their homies in Expire. The track “Don’t Cross Me” shreds with blistering fast parts and to me is the direction I hope this band continues to move towards. “Motive” has a nice little short guitar solo towards the end and overall I really like the choppy drum style throughout. Nice start from these guys who play pretty much a straight up style of hardcore but toss in some twists and turns to make this a good band on the rise which I hope we hear more from soon.\r\n \r\nhttps://www.facebook.com/CrossMeHC\r\n \r\nhttp://crossme.bandcamp.com/album/demo-2013\r\n \r\n-CW<a href=\"https://crossme.bandcamp.com/\">here</a>\r\n","options":[{"id":47567148,"name":"4.00 postpaid u.k","price":4.0,"sold_out":false,"has_custom_price":false},{"id":47567151,"name":"6.00 postpaid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127157865/-/crossmeamerican.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127157865/-/crossmeamerican.jpg","width":480,"height":480},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127157823/-/crossmecover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127157823/-/crossmecover.jpg","width":924,"height":960},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127157838/-/crossmeback.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127157838/-/crossmeback.jpg","width":960,"height":643}],"artists":[],"categories":[{"id":6598842,"name":"7\"s","permalink":"7-s","url":"/category/7-s"}]},{"id":14682993,"name":"machinist! Birthright/Deadcuts/The no marks Double pack","permalink":"machinist-birthright-deadcuts-the-no-marks-double-pack","position":11,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/machinist-birthright-deadcuts-the-no-marks-double-pack","status":"active","on_sale":true,"created_at":"2013-11-07T12:34:22.000Z","description":"This includes one copy of each of the Two  new Speedowax releases On Split color vinyl, Anyone that know's me knows i like everything from Carcass to Tindersticks, Variety is the spice of life after all.. so Enjoy our top Tastes... from the Heartfelt Post punk of London's Deadcuts, to the Full on Assault on the senses of  Machinist! and save a quid or two just for being Punkrock and  open minded ...You rule if you pick this up... Listening to the new Coke bust as i type this (=","options":[{"id":47564667,"name":"6.00 uk post paid","price":6.0,"sold_out":false,"has_custom_price":false},{"id":47564670,"name":"8.00 world post paid","price":8.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127156404/-/deadcutswithlogo.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127156404/-/deadcutswithlogo.JPG","width":1050,"height":1050},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127156416/-/nomarkscats.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127156416/-/nomarkscats.jpg","width":960,"height":960},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127156443/-/machright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127156443/-/machright.jpg","width":640,"height":640}],"artists":[],"categories":[]},{"id":14682915,"name":"Machinist! Birthright TRIPLE pack","permalink":"machinist-birthright-triple-pack","position":12,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/machinist-birthright-triple-pack","status":"active","on_sale":true,"created_at":"2013-11-07T12:27:18.000Z","description":"This version includes 3 pieces\r\n1-Solid green/Translucent green split two tone vinyl\r\n1-Solid metallic Silver/Translucent Purple \r\n1-Semi -Translucent Orange Mix \r\n£8.00 Postpaid in the U.K, £10.00 Postpaid to the Whole wide World \r\nEach Copy comes Complete with Lyric insert Fold over Card stock cover and extra special  Full color picture disc style lables on every copy.\r\nFans of Ceremony,Harms way,Weekend nachos,Spine will enjoy this.<a href=\"https://machinistga.bandcamp.com/\">here</a>\r\n","options":[{"id":47564100,"name":"8.00 Postpaid in the u.k","price":8.0,"sold_out":false,"has_custom_price":false},{"id":47564103,"name":"10.00 postpaid worldwide","price":10.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127156212/-/machright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127156212/-/machright.jpg","width":640,"height":640}],"artists":[],"categories":[]},{"id":14682561,"name":"Deadcuts/the No marks 7 inch TRIPLE pack ","permalink":"deadcuts-the-no-marks-7-inch-triple-pack","position":13,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/deadcuts-the-no-marks-7-inch-triple-pack","status":"active","on_sale":true,"created_at":"2013-11-07T11:46:36.000Z","description":"This Pre- order version contains 1 of each of the following :\r\n1-Translucent Purple/Violet mix \r\n1-Translucent Red/metallic Silver two tone split vinyl\r\n1-Solid Grey with Cyan blue inside out swirl smash mix \r\nIn the u.k you can get All three Colour ways for £8.00 postage paid and if you live anywhere outside the u.k it only costs £10.00 postage paid.Shipping late November 2013\r\nDeadcuts Tracks are \r\n1-Without love we perish \r\n2-Caution exorcists \r\nThe No marks tracks are \r\n1-Renville road \r\n2-Coming around <a href=\"https://www.soundcloud.com/mk47/\">here</a> released and shipping from 16/12/13 ","options":[{"id":47562492,"name":"8.00 POSTPAID U.K","price":8.0,"sold_out":false,"has_custom_price":false},{"id":47562495,"name":"10.00 POSTPAID WORLD","price":10.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129209241/-/deadcutswaxxxx.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129209241/-/deadcutswaxxxx.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127155465/-/deadcutswithlogo.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127155465/-/deadcutswithlogo.JPG","width":1050,"height":1050},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127155252/-/nomarkscats.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127155252/-/nomarkscats.jpg","width":960,"height":960}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"},{"id":6598842,"name":"7\"s","permalink":"7-s","url":"/category/7-s"}]},{"id":14612304,"name":"Drugchurch Paul walker Color vinyl lp","permalink":"mystery-box-number","position":14,"price":15.66,"default_price":15.66,"tax":0.0,"url":"/product/mystery-box-number","status":"active","on_sale":true,"created_at":"2013-11-04T16:26:34.000Z","description":"One of my personal lps of the year Punkier faster Self defence family ...Kick ass ","options":[{"id":47330472,"name":"16.66 u.k post paid","price":15.66,"sold_out":false,"has_custom_price":false},{"id":47566137,"name":"23.66 World ","price":23.66,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129279966/-/drugchurchlime.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129279966/-/drugchurchlime.jpg","width":500,"height":667}],"artists":[],"categories":[]},{"id":14530479,"name":"Balance and composure- seperation color vinyl","permalink":"31st-october-2013-fright-night-6-66-special","position":15,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/31st-october-2013-fright-night-6-66-special","status":"active","on_sale":true,"created_at":"2013-10-31T10:53:32.000Z","description":"Green with a black blob ","options":[{"id":50459706,"name":"Default","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129280041/-/balancesplitcolor.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129280041/-/balancesplitcolor.jpg","width":764,"height":1024}],"artists":[],"categories":[]},{"id":14261550,"name":"The No marks/Deadcuts Split Extended player       ATOM088","permalink":"the-no-marks-deadcuts-split-extended-player","position":16,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/the-no-marks-deadcuts-split-extended-player","status":"active","on_sale":true,"created_at":"2013-10-18T15:55:12.000Z","description":"This is what you get when Members of Down and outs/short sharp shock(earache records)(Mark Magill)Crocodile god (Andy mason/Mark Murphy) and Marc Maitland Blocko Form a Super group= Perfect punk rock for fans of Broccoli,Senseless things,Leatherface,Chestnut road, on the Flipside You get the 24/7 Songwriting Talent of Mark Keds (Senseless things/Jolt) Mark Mccarthy (ex Queen adreana/current Wonder stuff member)Trevor Shappe(Miranda sex garden) Jerome Alexander (ex The Scuzzies) Fuzzy Sexual,Catchy,Shimmering,Beautiful,Real Heartfelt solid post punk class' Tuneage For fans of The Libertines,Pity sex,Technocolor teeth Two tunes to hammer into your Head and Your heart pressed on \"Random Color wax\" orders ship on and around the 28th of November 2013 Deadcuts are currently on tour with Babyshambles across the u.k  Vinyl colors are \"Catseye\" a mix of solid grey/blue smashed together,translucent violet/ Purple and blood/stone( clear red /silver twotone split dipped mix ","options":[{"id":46086498,"name":"4.00 inc UK postage  PURPLE UK","price":4.0,"sold_out":false,"has_custom_price":false},{"id":46086501,"name":"4.00 INC UK POSTAGE cats eye","price":4.0,"sold_out":false,"has_custom_price":false},{"id":46086504,"name":"4.00 INC UK POSTAGE stone ","price":4.0,"sold_out":false,"has_custom_price":false},{"id":46086507,"name":"4.00 INC UK POSTAGE RED","price":4.0,"sold_out":false,"has_custom_price":false},{"id":46086510,"name":"6.50 INC WORLD POSTAGEPURPLE","price":6.5,"sold_out":false,"has_custom_price":true},{"id":46086513,"name":"6.50 INC WORLD POSTAGEPINK","price":6.5,"sold_out":false,"has_custom_price":true},{"id":46086516,"name":"6.50 INC WORLD POSTAGEBLUE","price":6.5,"sold_out":false,"has_custom_price":true},{"id":46086519,"name":"6.50 INC WORLD POSTAGERED","price":6.5,"sold_out":false,"has_custom_price":true},{"id":46675107,"name":"25.00 includes test and four versions","price":25.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126285219/-/nomarkscats.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126285219/-/nomarkscats.jpg","width":960,"height":960},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127156056/-/deadcutswithlogo.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127156056/-/deadcutswithlogo.JPG","width":1050,"height":1050}],"artists":[],"categories":[{"id":6598842,"name":"7\"s","permalink":"7-s","url":"/category/7-s"}]},{"id":14260422,"name":"Collision- tiebreaker 16th birthday pressing 100 only stamped/numbered","permalink":"collision-tiebreaker-16th-birthday-pressing-100-only-stamped-numbered","position":17,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/collision-tiebreaker-16th-birthday-pressing-100-only-stamped-numbered","status":"active","on_sale":true,"created_at":"2013-10-18T14:53:41.000Z","description":"Awesome Punk rock like Real friends,State champs,Save your breath ,Set your goals Stick up kid,,Lifetime and Daggermouth with awesome artwork from JOHN GARETT SLABY( hes the guy that did the art for Floral green by Titlefight) ...Collision contains Members of Test of time (bridge 9 records) The Effort (Panic records) Choke up (Seasick recordings) Melodic punk rock played by Real deal HXC kids with Pitch perfect Harmonies Buzzsaw guitars and Heartfelt catchy punk anthems ...Records ship from 23rd of October 2013... Collision play fast, really fast. They definitely lean towards bands like Lifetime on the pop punk scale. Though Lifetime was never one of my favorite bands, Collision play with catchy enthusiasm and I'm particularly caught by the vocals and how clean & strong they sound.(i buy way to many records.com)<a href=\"https://wearecollision.bandcamp.com/\">here</a>","options":[{"id":46081014,"name":"3.00 inc u.k postage ","price":3.0,"sold_out":false,"has_custom_price":false},{"id":46081017,"name":"6.00 inc world postage","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126072924/-/collisiontyebreakerofficial.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126072924/-/collisiontyebreakerofficial.jpg","width":953,"height":960},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126073023/-/collisionbackcover.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126073023/-/collisionbackcover.jpeg","width":600,"height":604}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"},{"id":6598842,"name":"7\"s","permalink":"7-s","url":"/category/7-s"}]},{"id":14214096,"name":"Old flings/Control group -split 7 inch transition color vinyl","permalink":"old-flings-control-group-split-7-inch-transition-color-vinyl","position":18,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/old-flings-control-group-split-7-inch-transition-color-vinyl","status":"active","on_sale":true,"created_at":"2013-10-16T12:27:29.000Z","description":"Records came in today a few are different these are them xxxControl Group is a new band comprised of three singer-musicians with some impressive Indie cred: between them they have recorded three BBC Peel Sessions, won Best Original Score at the Spike Video Game Awards, sold 200,000 albums, got NME's Single Of The Week, won a Rock Band® National Championship, had a Swirlies’ song named after them, and toured with bands like Girls Against Boys, The Jon Spencer Blues Explosion, and The Damned. Having left their previous projects behind with the other detritus in rock music’s roiling wake, Control Group found each other in the creative petri dish of Brooklyn. There they set about discovering their new style, expressing the spirit of their surroundings. \r\nThe band say their inspiration derives from their method as much as from their musical influences. They spontaneously record their instrument parts without a master plan, like splattering paint on a canvas. Then each of the three takes ownership of a skeletal musical form and breathes emotion into it by adding vocals. Many tracks don’t make the cut, but some of these experiments result in wonderful, gut wrenching treasures. As singer Evan Reynolds observes, “The name Control Group is kind of ironic, because everything is so incredibly out of control.” \r\nThe band’s debut 7” single contains two such treasures. It’s a limited edition, hand-labeled, hand-packaged labor of love. Recorded mostly live in a Bed-Stuy basement, this record is gritty and raw. Its heavy dynamic shifts and dark sound capture the the band’s nervous energy. Control Group has already drawn comparisons to the Scottish trio Paws, London Pitchfork darlings Yuck, and the still-vital Western Mass veterans, Dinosaur Jr. The digital version of the single was actually mastered from the vinyl, so it retains all the graininess of its physical origins. “We liked the feel of the vinyl versions so much, we wanted to keep that sound in the digital versions”, says singer Darren Korb.","options":[{"id":45914625,"name":"4.50 u.k orders","price":4.5,"sold_out":false,"has_custom_price":false},{"id":45914628,"name":"6.50 world orders","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126455061/-/oldflingsspeedo.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126455061/-/oldflingsspeedo.jpg","width":640,"height":640},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126457722/-/oldflingsviolet.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126457722/-/oldflingsviolet.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126457731/-/oldflingsyellow.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126457731/-/oldflingsyellow.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126457743/-/oldflingsbrown.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126457743/-/oldflingsbrown.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126457755/-/oldflingssun.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126457755/-/oldflingssun.jpg","width":604,"height":453}],"artists":[],"categories":[{"id":6598842,"name":"7\"s","permalink":"7-s","url":"/category/7-s"}]},{"id":14136039,"name":"Speedowax 2013 releases 27   records Box set","permalink":"black-shapes-in-the-mourning-light-test-press","position":19,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/black-shapes-in-the-mourning-light-test-press","status":"active","on_sale":true,"created_at":"2013-10-12T16:01:43.000Z","description":"This Box set includes the 27 records we released in 2013 \r\nFlex/vices split 7 inch White vinyl\r\nFlex Void 7 inch Blue vinyl\r\nA Page of punk/wwamc split 7 inch Semi translucent vinyl split 7 inch\r\nWeight of the world No promised land translucent Violet vinyl 7 inch\r\nHippriests/Deadcuts split 7 inch Black vinyl\r\nBlack veins the cycle 7 inch Grey vinyl\r\nThe catharsis No control 7 inch split vinyl\r\nWorn out/ the Catharsis Split 7 inch Blue vinyl\r\nSupermutant grave steps 7 inch red vinyl \r\nChestnut road lp \r\nPassengers 7 inch\r\nThe catharsis Romance lp \r\nCross me 7 inch \r\nKickturn 7 inch\r\nbad habits 7 inch \r\nKato 7 inch \r\nMachinist! Blacklist 7 inch\r\nNew alaska/Chestnut road 7 inch red vinyl \r\nWrong idea 7 inch x1\r\nMothertrucker lp \r\nSnake road severed souls 7 inch\r\nOpium lord 7 inch \r\nHardships 7 inch\r\nOld flings Control group 7 inch\r\nDeadcuts No marks 7 inch step aside broccoli 7 inches etc\r\nShipped Via Dhl \r\nworldwide\r\n\r\n","options":[{"id":45631755,"name":"40.00 uk","price":40.0,"sold_out":false,"has_custom_price":false},{"id":50594331,"name":"70.00 world","price":70.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129385722/-/allt.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129385722/-/allt.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129385746/-/3lps.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129385746/-/3lps.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":14136030,"name":"Catharsis romance test press","permalink":"catharsis-romance-test-press","position":20,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/catharsis-romance-test-press","status":"active","on_sale":true,"created_at":"2013-10-12T16:00:38.000Z","description":"No need to beat around the bush here; The Catharsis’ Romance is an album you need to own. This is 32 minutes of the most uncompromising, unforgiving and down-right memorable hardcore and it’s a beautiful yet violent display of anger.\r\n\r\nRight, let’s get down to the nitty-gritty. Romance is a hardcore record at heart and fans of Bastions, Converge, Gallows and Palm Reader will have plenty to enjoy. But simply calling this a hardcore record would be doing it a serious injustice. The whole records flows and weaves its’ songs together with finesse and manages to bludgeon you with riffs at the same time. The guitar work from Ash, Mikey and Matt is hugely memorable, expertly played and comes with heaps of hardcore stomp. The riffing on Romance absolutely tears through this release and the thunderous bass pops and twangs, punctuating every chord.\r\n\r\nLet’s not forget vocalist Morgan and drummer Chris who play equally important parts. The drumming on Romance sounds like pure fury and Chris sounds like he’s destroying his body with this level of intensity. The drum work makes this release sound phenomenally huge. This is hardcore that doesn’t deserve to stay confined to the small stages.\r\n\r\nNow let’s talk about Morgan. Here’s a vocalist who embodies everything a front man should be. Despite being predominantly a screamer, his vocals are wonderful tales of loss, anger and heart break and his vocals are clear throughout the entire release. Morgan also does a fantastic job of avoiding the hardcore trope of simply screaming over the music with no real structure. Morgan’s vocals work with the rhythm of the songs and reinforce the visceral nature of this entire release. He even manages to muster a cheeky laugh on Heart Burner that manages to make him sound “human” despite the fact he’s tearing his throat apart for the majority of Romance. Morgan should be proud of his performance on Romance because he manages something most screamers can only dream of; he sounds truly honest.\r\n\r\nThe Catharsis have not only put together one of the best hardcore releases this year but it deserves to be recognised as one of the best heavy albums ever made. There is no filler, padding or interludes on Romance; everything was put on this record for a reason. A record this intense has no place being so accessibly catchy but The Catharsis have managed to do exactly that. Listen to this album and then tell everyone you know about it. It really is that good.\r\n\r\n10/10 uk scumscene review \r\n","options":[{"id":45631707,"name":"14.99 inc post uk","price":14.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125757135/-/testpressk.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125757135/-/testpressk.jpg","width":500,"height":494}],"artists":[],"categories":[]},{"id":14135997,"name":"SAINTHOOD REPS HEADSWELL","permalink":"test-press","position":21,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/test-press","status":"active","on_sale":true,"created_at":"2013-10-12T15:57:49.000Z","description":"","options":[{"id":45631599,"name":"Default","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129280185/-/sainthoodreps.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129280185/-/sainthoodreps.jpg","width":1500,"height":1500}],"artists":[],"categories":[]},{"id":14135727,"name":"deaththreat/rude awakening","permalink":"panic-strength-in-solitude-lp-grey-swirl","position":22,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/panic-strength-in-solitude-lp-grey-swirl","status":"active","on_sale":false,"created_at":"2013-10-12T15:38:45.000Z","description":"Two of the Northeast's finest join forces to bring the hardest split 12\" that's been released in years. Death Threat return after not releasing new material for four years with three new songs and a cover of Side By Side's \"Dead Serious\" while Rude Awakening return with four new songs of Madball-inspired hardcore after receiving critical acclaim for their debut 7\", \"The Awakening.\" For fans of Terror, Madball, Guns Up!, Trapped Under Ice and 100 Demons. LP includes digital download. On colored vinyl.","options":[{"id":45630591,"name":"16.00 INC U.K postage","price":16.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129336192/-/deaththreat.rudeawakening.hi.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129336192/-/deaththreat.rudeawakening.hi.jpg","width":300,"height":300}],"artists":[],"categories":[]},{"id":14135670,"name":"supertouch The earth is flat blue swirl","permalink":"supertouch-the-earth-is-flat-blue-swirl","position":23,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/supertouch-the-earth-is-flat-blue-swirl","status":"active","on_sale":true,"created_at":"2013-10-12T15:35:17.000Z","description":"First time on color wax for this classic ","options":[{"id":45630354,"name":"16.00 inc £3 postage costs","price":16.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125756235/-/supery.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125756235/-/supery.jpg","width":200,"height":200}],"artists":[],"categories":[]},{"id":14135625,"name":"wrong 7 inch","permalink":"noisecore-prophets-shatterhand-split","position":24,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/noisecore-prophets-shatterhand-split","status":"active","on_sale":true,"created_at":"2013-10-12T15:30:53.000Z","description":"Brothers Ned and Ben Russin of Title Fight teamed up with Uriah from Dead End Path to form Wrong, which steps away from the sound of the members' other projects and brings a dirty, raw hardcore punk sound that takes cues from Japanese bands like Bastard and GISM mixed with USHC sensibilities and a healthy dose of Discharge for good measure.","options":[{"id":50524416,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[]},{"id":14135226,"name":"Control group shoes of the people","permalink":"never-enough-our-will-is-done-7-inch","position":25,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/never-enough-our-will-is-done-7-inch","status":"active","on_sale":true,"created_at":"2013-10-12T15:01:48.000Z","description":"Members of Done lying down  and Daybreak playing Shudder to think,Polvo style Hardcore punk ","options":[{"id":45628695,"name":"6.00","price":6.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129337167/-/controlgrouptest.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129337167/-/controlgrouptest.jpg","width":960,"height":637}],"artists":[],"categories":[]},{"id":14134956,"name":"out of vogue ","permalink":"just-die-since-the-day","position":26,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/just-die-since-the-day","status":"active","on_sale":true,"created_at":"2013-10-12T14:44:06.000Z","description":"7 inch it's a rager kinda like tear it up meets a more punkier hives  but anyway OOV hail from Sweden and feature members of acts such as Abhinanda, Subject To Change, Eyes Shut and Division of Laura Lee among others. The Scandinavian scene always produced some the best Euro Hardcore bands and OOV are no exception, with a sound reminiscent of CIV or Uniform Choice.\r\n","options":[{"id":45627720,"name":"6.00 world","price":6.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129338238/-/OOVst300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129338238/-/OOVst300.jpg","width":300,"height":300}],"artists":[],"categories":[]},{"id":14134899,"name":"Abandon ship/Permanent Split 7 inch Extended player ","permalink":"energy-children-of-the-night","position":27,"price":2.5,"default_price":2.5,"tax":0.0,"url":"/product/energy-children-of-the-night","status":"active","on_sale":true,"created_at":"2013-10-12T14:42:11.000Z","description":"wesome split of great melodic hardcore from down south on this one. Aces.\r\n\r\nFirst up is The Permanent who have a sort of RAWK influenced Suicide File-y thing going on but still with a nice defined English slant and great lyrics. \r\n\r\nAbandon Ship is much more straight forward old school-ish hardcore with plenty of bollocks, Suicide file,The Horrorshow,\r\n\r\nOne of the best UK splits like this for ages. I have to say the Permanent just take it for me but its a tough one, I hope both get round to releasing a lot more as soon as possible...\"Damo\" Collective Zine ","options":[{"id":45627585,"name":"2.50 inc postage ","price":2.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128660163/-/as.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128660163/-/as.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":14134863,"name":"Banner/Dead wrong split 7 inch","permalink":"banner-dead-wrong","position":28,"price":2.5,"default_price":2.5,"tax":0.0,"url":"/product/banner-dead-wrong","status":"active","on_sale":false,"created_at":"2013-10-12T14:39:32.000Z","description":"split u.s hardcore red vinyl","options":[{"id":45627453,"name":"2.50 inc post","price":2.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125754543/-/deadwrong.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125754543/-/deadwrong.jpg","width":225,"height":225}],"artists":[],"categories":[]},{"id":14134734,"name":"Flying Kangaroo Alliance Hit the wall 7 inch","permalink":"flying-kangaroo-alliance-hit-the-wall","position":29,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/flying-kangaroo-alliance-hit-the-wall","status":"active","on_sale":true,"created_at":"2013-10-12T14:27:33.000Z","description":"7 inch splatter vinyl sounds like Flinch dum dum girls etc it;s cool","options":[{"id":45626955,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125754189/-/kanger.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125754189/-/kanger.jpg","width":225,"height":224}],"artists":[],"categories":[]},{"id":14134665,"name":"HAZE i cant help but get lost","permalink":"eric-matthews-fanfare","position":30,"price":3.33,"default_price":3.33,"tax":0.0,"url":"/product/eric-matthews-fanfare","status":"active","on_sale":true,"created_at":"2013-10-12T14:21:40.000Z","description":"Class' debut single from a  Young group that weld together Defeater and This will Destroy you into their sound","options":[{"id":45626700,"name":"Default","price":3.33,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129337704/-/hazw.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129337704/-/hazw.jpg","width":225,"height":225}],"artists":[],"categories":[]},{"id":14134611,"name":"Test of time inspired youth 7 inch color vinyl","permalink":"cracker-low","position":31,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/cracker-low","status":"active","on_sale":true,"created_at":"2013-10-12T14:14:33.000Z","description":"Test Of Time started very organically in the spring of 2012 among a group friends with a mutual admiration for the straight edge and a desire to form a band that was different from what was currently dominating the Boston scene. The band, featuring noted Boston, MA-area photographer Todd Pollock (vocals) alongside Charles Chaussinand (guitar, ex-No Harm Done, Offsides, Make Or Break), James Christopher (guitar/vocals, ex-The Effort), DJ Butler (bass) and Jeff Novak (drums), quickly self-recorded and self-produced their debut, ten-song EP \"Inclusion.\" Their B9 debut and follow-up to their 2012 demo is an aggressive onslaught of thoughtful and melodic youth crew hardcore likely to please fans of Youth Of Today, Turning Point and In My Eyes. 7\" includes digital download. On colored vinyl.","options":[{"id":45626436,"name":"6.00 uk post paid","price":6.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129337398/-/toft.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129337398/-/toft.jpg","width":250,"height":250}],"artists":[],"categories":[]},{"id":14134551,"name":"wrong 7 inc","permalink":"cigarette-crossfile-shatterhand-split-7-inch","position":32,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/cigarette-crossfile-shatterhand-split-7-inch","status":"active","on_sale":true,"created_at":"2013-10-12T14:09:21.000Z","description":"Titlefight members playing hxc punk","options":[{"id":45626268,"name":"6.00 uk post paid","price":6.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[]},{"id":14067690,"name":"YOUNG TURKS WHERE I LIE ","permalink":"young-turks-where-i-lie","position":33,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/young-turks-where-i-lie","status":"active","on_sale":true,"created_at":"2013-10-09T11:13:52.000Z","description":"MY Personal album of 2012  go it alone,Dtn,Sinking ships,Flex,Carry on ","options":[{"id":45385491,"name":"Default","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125584254/-/youngturksalbumcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125584254/-/youngturksalbumcover.jpg","width":1500,"height":1500}],"artists":[],"categories":[]},{"id":14067621,"name":"Truro proud to disagree Debut e.p numbered 100 only","permalink":"clarity-unstoppable-7-inch-vinyl","position":34,"price":2.5,"default_price":2.5,"tax":0.0,"url":"/product/clarity-unstoppable-7-inch-vinyl","status":"active","on_sale":true,"created_at":"2013-10-09T11:09:51.000Z","description":"Awesome Hardcore Tinged Skate punk from Wigan for fans of Satanic surfers,a wilhelm scream,Titlefight,Ten foot pole.","options":[{"id":45385278,"name":"Default","price":2.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129340461/-/trurocd.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129340461/-/trurocd.jpg","width":300,"height":150}],"artists":[],"categories":[]},{"id":14067561,"name":"Birds of a row lp collection","permalink":"guidance-the-age-of-vice-7-inch-black-vinyl","position":35,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/guidance-the-age-of-vice-7-inch-black-vinyl","status":"active","on_sale":true,"created_at":"2013-10-09T11:05:14.000Z","description":"This is a repress of the \"Rise Of The Phoenix\" 7\" and the \"Cottbus\" LP in grand full-length LP fashion from this Laval, France trio who blur the lines between hardcore, punk, and related sub-genres, offering something of substantial emotional weight to their listeners. Collectively carrying somber hearts and poignant souls, they navigate through melancholic seas to shape beautifully hook-laden songs unlike anything else out there today. This has a die-cut jacket and a printed inner sleeve in all of its layout majesty. Now available again on vinyl.","options":[{"id":45385110,"name":"15.50 uk postage inc","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/129338037/-/collected.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/129338037/-/collected.jpg","width":250,"height":250}],"artists":[],"categories":[]},{"id":14024034,"name":"Old flings/Control group -split color swirl 150 only ORANGE W/YELLOW","permalink":"old-flings-control-group-split-color-swirl-150-only-orange-w-yellow","position":36,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/old-flings-control-group-split-color-swirl-150-only-orange-w-yellow","status":"active","on_sale":true,"created_at":"2013-10-07T15:14:00.000Z","description":"This is a pre- order for the solid orange with yellow inside out swirl ...Records ship from the 14th of October \r\n1-Senseless (single \r\n2-Stranded feat Rebecca Flynt \r\nAwesome  Heartfelt punkrock for fans of Quicksand,Hum,Samiam,Gameface,Smoking popes,Alkaline trio.Heartfelt with a Hardcore underbelly\r\n1-Wrong sounds \r\n2-No justice just us \r\nN.y.c Punkrock with Brains.. for fans of Shudder to think,Done lying down,Polvo,Superchunk Shotmaker.","options":[{"id":45232113,"name":"4.50 u.k post paid","price":4.5,"sold_out":false,"has_custom_price":false},{"id":45232116,"name":"6.50 world post paid","price":4.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125468118/-/senseless.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125468118/-/senseless.jpg","width":480,"height":360}],"artists":[],"categories":[]},{"id":14022867,"name":"Bad habits parting words 7 inch","permalink":"bad-habits-parting-words","position":37,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/bad-habits-parting-words","status":"active","on_sale":true,"created_at":"2013-10-07T14:01:08.000Z","description":"Excile \r\ntwo faces\r\nsteel rage\r\nparting words\r\nbeaten path\r\ndiscard\r\nSix track debut from Hardcore from Florida I honestly cannot recall how I discovered Bad Habits, but I’m beyond glad I did. The band dropped a record by the name of “Parting Words” earlier this year and the album slays. Front to back, this is a fantastic hardcore album. Though sometimes a little “cookie cutter,” in the creation of their music, Bad Habits wrote a killer album and I would recommend it to everyone.\r\n\r\nTo be more specific in what I mean by saying “cookie cutter;” I am in no way using it in a negative connotation. “Parting Words,” is exactly what would come to mind when you think hardcore; from the tone of the guitars to the bass grooves to the drum parts and of course the pissed off front man. This is why this is a great album; it has everything you want to hear in a hardcore album.\r\n\r\nThe album kicks off with the song “Exile,” and right from the get go, you know you’re in for a wild ride. The muddy, evil bass line that starts this song off, sets you up to get punched in the face when the vocals kick in. The song doesn’t let up though. Front to back, the song will keep your head bobbing along.\r\n\r\nAnother killer track off the record is “Two Faces.” This song displays the guitarist ability, and almost has a thrash crossover feel especially with the opening riff, which has a very “Power Trip” feel to it. Even with that being said, the guys in Bad Habits manage to get the song to go in a heavier direction that will most definitely get your head bobbing.\r\n\r\nIf you are a fan of hardcore in any way, shape or form, “Parting Words” is an album I highly recommend for you. Bad Habits managed to write a record for all fans of hardcore and that alone should be enough reason to check out “Parting Words.”\r\n\r\nRating: 3.5/5I've been neglecting Speedowax for way too long. Especially, when I own a lot of the label's 2013 output! I felt I needed a break from the doom metal that I've been writing about this last week, so I decided to pick four of the latest seven inches to write about. Rich (Speedowax head-honcho) is a massive supporter of hardcore and has been putting out some top stuff over the last twelve months.\r\n\r\nThis first review features Bad Habits. I don't know too much about them other than their a four-piece hardcore band from Pensacola, Florida. They've been around since 2012. This record was pressed to celebrate the 16th birthday of Speedowax and each one was hand-numbered!\r\n\r\nTracklist:-\r\n\r\n1. Exile\r\n2. Two Faces\r\n3. Steel Cage\r\n4. Parting Words\r\n5. Beaten Path\r\n6. Discard\r\n\r\nThis is crossover as hell! Bad Habits throw out some great hardcore with a twist of thrash. The thrash-like vocals remind of Tom Araya at his most rabid, but with more energy. Exile features riffs that sound groovy and bring the beatdown. For a first seven-inch EP, this is really tight. Bad Habits get more ferocious as Two Faces starts. It’s got more of a punk edge than the record’s opener and there’s a great, understated solo. The dual vocals are more apparent in this song, with the crossover vox standing out next to the deeper hardcore vox.\r\n\r\nSteel Cage has wrestling written all over it. The slightly off-kilter intro might catch some people off guard, but it’s not long before they’re pounding again. They manage to fit a lot into a two-minute song and the melodic solo at the mid-point shows a hint of dramatic songwriting from the band. The title track is a moody interlude that prepares you for Beaten Path. Bad Habits get their groove on again during the build up and the rhythms from the drums will no doubt incite chaos live. The energy of the band comes across really well on their recorded output, which isn’t something you can say about every band. There’s plenty of volume in the recordings and it sounds meatier for it.\r\n\r\nDiscard starts in a sedate manner but it’s anything but when the verse kicks in. The drums fills are creative and bridge the gap between transitions well. Those deep hardcore bellows are almost bowel shaking. As the song and indeed the seven inch fades out, you’ll be feeling like you take on the world. That’s what hardcore does, it empowers you and gives you strength. This is recommended!\r\n\r\nParting Words is available to stream in it's entirety here:-\r\n\r\n \r\nIt's available from the above bandcamp page as a pay-what-you-want download.\r\n\r\nYou can get physical copies of the seven-inch from Speedowax here - http://constantrotation.bigcartel.com/products\r\n\r\nBad Habits don't seem to have a Facebook page or anything.\r\n\r\nSpeedowax Facebook - https://www.facebook.com/speedowax\r\nPosted by James Williams at 16:11 http://www(dot)mediafire(dot)com/download/bev3z3m7y3j47yd/Bad_Habits-Parting_Words.zip\r\n<a href=\"https://badhabitsfl.bandcamp.com/\">here</a>","options":[{"id":45228147,"name":"4.00 u.k","price":4.0,"sold_out":false,"has_custom_price":false},{"id":45228150,"name":"6.50 u.s.a ","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125465388/-/badhabitsart.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125465388/-/badhabitsart.jpg","width":1200,"height":1200}],"artists":[],"categories":[]},{"id":14021562,"name":"KICKTURN DEMO 7 INCH","permalink":"kickturn-demo-7-inch","position":38,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/kickturn-demo-7-inch","status":"active","on_sale":false,"created_at":"2013-10-07T12:02:06.000Z","description":"Losin it members gnarly supertouch style complete with numbered insert with lyrics and picture 97 made\r\n<a href=\"https://kickturnhc.bandcamp.com/\">here</a>","options":[{"id":45220218,"name":"4.00 post paid in the u.k","price":4.0,"sold_out":false,"has_custom_price":false},{"id":45220227,"name":"6.50 post paid world","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125462382/-/kickturn_sleeve_COVER.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125462382/-/kickturn_sleeve_COVER.jpg","width":504,"height":504}],"artists":[],"categories":[]},{"id":13989492,"name":"rude awakening/death threat split","permalink":"rude-awakening-death-threat-split","position":39,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/rude-awakening-death-threat-split","status":"active","on_sale":true,"created_at":"2013-10-05T15:18:10.000Z","description":"on triple b ...Bangers and shredders red wax","options":[{"id":45034473,"name":"Default","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125383557/-/deaththreat.rudeawakening.hi.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125383557/-/deaththreat.rudeawakening.hi.jpg","width":300,"height":300}],"artists":[],"categories":[]},{"id":13972272,"name":"Laughing in the face of The governer","permalink":"down-to-nothing-life-on-the-james-green-wax-lp","position":40,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/down-to-nothing-life-on-the-james-green-wax-lp","status":"active","on_sale":true,"created_at":"2013-10-04T15:39:47.000Z","description":"A mix of Satanic Surfers,Ten foot pole Skatepunk from the u.k ","options":[{"id":44938191,"name":"6.00 uk only ","price":6.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126501462/-/andy.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126501462/-/andy.jpg","width":1198,"height":1200}],"artists":[],"categories":[]},{"id":13972125,"name":"OLD FLINGS SPITE","permalink":"old-flings-spite","position":41,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/old-flings-spite","status":"coming-soon","on_sale":false,"created_at":"2013-10-04T15:28:10.000Z","description":"HUM MEETS QUICKSAND THROUGH A SAMIAM BLENDER INCLUDES SENSELESS,GRIP,AND MERRY GO ROUND PRESSED ON CLEAR VINYL OF 200 ONLY THIS IS A CLASSIC BUY OR DIE","options":[{"id":44937516,"name":"15.50 UK ONLY","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125340759/-/OLDFLINGSPITE.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125340759/-/OLDFLINGSPITE.jpg","width":225,"height":225}],"artists":[],"categories":[{"id":5838819,"name":"ignite record store awesome list","permalink":"ignite-record-store-awesome-list","url":"/category/ignite-record-store-awesome-list"}]},{"id":13972059,"name":"Tancred s/t topshelf quality record alert","permalink":"tancred-s-t-topshelf-quality-record-alert","position":42,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/tancred-s-t-topshelf-quality-record-alert","status":"active","on_sale":true,"created_at":"2013-10-04T15:23:42.000Z","description":"Slingshot Dakota meets early Discount...Beautiful heartfelt and real \r\nColor vinyl ...white or swirly lavender (purple to the human eye)\r\n","options":[{"id":44936871,"name":"15.50 postage included u.k","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125340492/-/tancredcolors.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125340492/-/tancredcolors.jpg","width":500,"height":500}],"artists":[],"categories":[]},{"id":13924341,"name":"Winter warmer pack of 6 7 inches fall 2013 ","permalink":"winter-warmer-pack-of-6-7-inches-fall-2013","position":43,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/winter-warmer-pack-of-6-7-inches-fall-2013","status":"active","on_sale":true,"created_at":"2013-10-02T12:34:30.000Z","description":"1-Step aside 7 inch red stamp SxE HARDCORE fans of In my eyes,Chain,Outlast etc etc.\r\n2-Cross me 7 inch( Hardcore fans of Fire and ice Expire Backtrack check in,on tour with Expire.\r\n3-Machinist! birthright 7 inch fans of Weekend nachoes, harms way,Black flag.\r\n4-Old flings/Control group split 7 inch Quicksand Samiam Smoking popes.\r\n5-wrong idea \"whats left inside\" 7 inch Fans of The first step, insted\r\n6-Bonus Secret 7 inch record\r\nThe most limited color version of each record will go in this package while stock lasts... \r\n","options":[{"id":44740866,"name":"12.00 uk only includes postage","price":12.0,"sold_out":false,"has_custom_price":false},{"id":44740869,"name":"15.00 world includes post","price":15.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125220186/-/wrongxidea.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125220186/-/wrongxidea.jpg","width":350,"height":350},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125220645/-/machright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125220645/-/machright.jpg","width":640,"height":640},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125220675/-/stepasidefrontandbackcovers_(1).png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125220675/-/stepasidefrontandbackcovers_(1).png","width":4200,"height":2100},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125220684/-/crossmecover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125220684/-/crossmecover.jpg","width":924,"height":960},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125220696/-/senseless.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125220696/-/senseless.jpg","width":480,"height":360}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"},{"id":5838819,"name":"ignite record store awesome list","permalink":"ignite-record-store-awesome-list","url":"/category/ignite-record-store-awesome-list"}]},{"id":13876518,"name":"Old flings/Control group -split 7 inch Test press","permalink":"old-flings-control-group-split-7-inch-test-press","position":44,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/old-flings-control-group-split-7-inch-test-press","status":"active","on_sale":true,"created_at":"2013-09-30T10:49:53.000Z","description":"","options":[{"id":44563914,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125098734/-/senseless.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125098734/-/senseless.jpg","width":480,"height":360}],"artists":[],"categories":[]},{"id":13876503,"name":"Cross me- Motive 7 inch Vinyl record pre order  test press","permalink":"cross-me-motive-7-inch-vinyl-record-pre-order-test-press","position":45,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/cross-me-motive-7-inch-vinyl-record-pre-order-test-press","status":"active","on_sale":true,"created_at":"2013-09-30T10:48:51.000Z","description":"5 only","options":[{"id":44563845,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125464926/-/crossme666.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125464926/-/crossme666.jpg","width":587,"height":599}],"artists":[],"categories":[]},{"id":13876491,"name":"Cross me- Motive 7 inch Vinyl record pre order  3 pack","permalink":"cross-me-motive-7-inch-vinyl-record-pre-order-3-pack","position":46,"price":12.0,"default_price":12.0,"tax":0.0,"url":"/product/cross-me-motive-7-inch-vinyl-record-pre-order-3-pack","status":"active","on_sale":true,"created_at":"2013-09-30T10:47:55.000Z","description":"allCROSS ME “DEMO 2013” (Released March 2013)\r\n \r\nIf you live in Wisconsin you are excluded but quick… name one current hardcore band from Milwaukee not named Expire. How about Cross Me? Not ringing a bell? I got this demo for free at their recent show on Long Island where they opened for Expire. One of the guys in the band was just walking around handing out CD copies which made me WANT to like this that much more. We all bitch and moan about the internet and how hardcore much like a lot of our daily activities has become cold and faceless. Cross Me sez fuck that shit and regardless if this was free or not I am digging what these guys are doing. First off this is far from perfect but that’s what demos are for…working out the rough edges and building on the style and direction a band is trying to go in. The 5 songs here run about 11 minutes in total and Cross Me show that they got something cooking with a style that is not that far off from their homies in Expire. The track “Don’t Cross Me” shreds with blistering fast parts and to me is the direction I hope this band continues to move towards. “Motive” has a nice little short guitar solo towards the end and overall I really like the choppy drum style throughout. Nice start from these guys who play pretty much a straight up style of hardcore but toss in some twists and turns to make this a good band on the rise which I hope we hear more from soon.\r\n \r\nhttps://www.facebook.com/CrossMeHC\r\n \r\nhttp://crossme.bandcamp.com/album/demo-2013\r\n \r\n-CW\r\n the versions","options":[{"id":44563815,"name":"Default","price":12.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125464896/-/crossme666.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125464896/-/crossme666.jpg","width":587,"height":599}],"artists":[],"categories":[]},{"id":13876455,"name":"machinist! Birthright test press","permalink":"machinist-birthright-test-press","position":48,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/machinist-birthright-test-press","status":"active","on_sale":true,"created_at":"2013-09-30T10:45:37.000Z","description":"5 only help us pay for other records next year","options":[{"id":44563752,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125098620/-/machright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125098620/-/machright.jpg","width":640,"height":640}],"artists":[],"categories":[]},{"id":13822953,"name":"machinist! Birthright Clear orange mix","permalink":"machinist-birthright-clear-orange-mix","position":49,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/machinist-birthright-clear-orange-mix","status":"active","on_sale":true,"created_at":"2013-09-27T12:36:44.000Z","description":"100 only postage costs to the states cost £4.50 see below","options":[{"id":44382819,"name":"4.50 u.k post paid","price":4.5,"sold_out":false,"has_custom_price":false},{"id":44382822,"name":"6.50 world post paid","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125005179/-/machright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125005179/-/machright.jpg","width":640,"height":640},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125340216/-/postagecosts.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125340216/-/postagecosts.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":13822809,"name":"machinist! Birthright Clear purple/solid grey mix","permalink":"machinist-birthright-clear-purple-solid-grey-mix","position":50,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/machinist-birthright-clear-purple-solid-grey-mix","status":"active","on_sale":true,"created_at":"2013-09-27T12:27:32.000Z","description":"100 only","options":[{"id":44382309,"name":"4.50 postpaid u.k","price":4.5,"sold_out":false,"has_custom_price":false},{"id":44382312,"name":"6.50 postpaid world","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125005182/-/machright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125005182/-/machright.jpg","width":640,"height":640}],"artists":[],"categories":[]},{"id":13822767,"name":"machinist! Birthright Clear green/solid green two tone split","permalink":"machinist-birthright-clear-green-solid-green-two-tone-split","position":51,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/machinist-birthright-clear-green-solid-green-two-tone-split","status":"active","on_sale":false,"created_at":"2013-09-27T12:22:12.000Z","description":"100 only","options":[{"id":44382186,"name":"4.50 post paid uk","price":4.5,"sold_out":false,"has_custom_price":false},{"id":44382249,"name":"6.50 post paid world","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125005191/-/machright.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125005191/-/machright.jpg","width":640,"height":640}],"artists":[],"categories":[{"id":5801886,"name":"up and coming","permalink":"up-and-coming","url":"/category/up-and-coming"}]},{"id":13701876,"name":"Wrongxidea whats left inside \"test\" 10 only","permalink":"wrongxidea-whats-left-inside-test-10-only","position":53,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/wrongxidea-whats-left-inside-test-10-only","status":"active","on_sale":true,"created_at":"2013-09-21T12:32:31.000Z","description":"TEST PRESS TO HELP OUR LABLE KEEP GOING ","options":[{"id":43959027,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124646745/-/wrongxidea.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124646745/-/wrongxidea.jpg","width":350,"height":350},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124646751/-/Kato0005.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124646751/-/Kato0005.jpg","width":600,"height":602}],"artists":[],"categories":[]},{"id":13620546,"name":"Step aside Final show pressing 100 only","permalink":"step-aside-final-show-pressing-100-only","position":55,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/step-aside-final-show-pressing-100-only","status":"active","on_sale":true,"created_at":"2013-09-17T15:22:37.000Z","description":"New remastering via Pirates press limited to 100 copies Numbered with Rad new hardcore cover (not pictured) Stamped lables \r\nRED 1-25\r\nBLUE25-50\r\nBLACK 51-100\r\nPre orders receive RED or Blue First come first serve\r\nSent off to the plant within four weeks to hit the final show deadline white lable we lose money on every copy for the core \r\n\r\n","options":[{"id":43681815,"name":"5.00 postpaid in the u.k","price":5.0,"sold_out":false,"has_custom_price":false},{"id":43681818,"name":"7.00 postpaid worldwide","price":7.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124445094/-/stepasidefinalscanart.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124445094/-/stepasidefinalscanart.jpg","width":960,"height":960}],"artists":[],"categories":[]},{"id":13618797,"name":"Wrongxidea whats left inside Judge green pre order","permalink":"wrongxidea-whats-left-inside-judge-green-100-made","position":57,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/wrongxidea-whats-left-inside-judge-green-100-made","status":"active","on_sale":true,"created_at":"2013-09-17T13:51:12.000Z","description":"This is the \"judge green\" Mix of this flawless SXE Youth crew honest focused and strong Hardcore ...with Amazing artwork from EV of Mindset \r\nr.i.y.l Get the most,The first Step,Mindset,Our Turn etc \r\nRecorded/mixed by Taylor Young \r\nMastered by Brad boatright\r\nUpcoming track on the forthcoming React comp not inc in the six tracks on the 7 inch Represented here.\r\n10/10/13 Shipping \r\nThis version is a Semi translucent Green marble Drop down the menu to order the record if you live outside the u.k <a href=\"https://wrongxidea.bandcamp.com/\">here</a>","options":[{"id":43676985,"name":"4.00 inc u.k postage","price":4.0,"sold_out":false,"has_custom_price":false},{"id":43676988,"name":"6.50 inc world postage","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124441278/-/wrongxidea.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124441278/-/wrongxidea.jpg","width":350,"height":350}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"}]},{"id":13597554,"name":"a page of punk/werewolves split First press leftovers","permalink":"a-page-of-punk-werewolves-split-first-press-leftovers","position":58,"price":2.5,"default_price":2.5,"tax":0.0,"url":"/product/a-page-of-punk-werewolves-split-first-press-leftovers","status":"active","on_sale":true,"created_at":"2013-09-16T16:14:33.000Z","description":"Limited to 15 in numbered exclusive sleeve new cover made as i had 15 leftover records You have to laugh at this release, you really do, and I don’t mean that in any derogatory way, but check out the number of tracks: English band Werewolves on Motorcycles get to display a quartet of its songs which is a decent amount for a split 7-inch. However, Japanese band A Page of Punk manage to cram thirteen (yes, 13!) tracks onto its allotted side of this amazing release; quite a disparity but one that neither helps nor hinders one band over the other.This split is probably the most insane speedowax has ever put out, at least it’s the most insane thing I’ve ever heard. A Page of Punk is an insane Japanese thrash band in the vein of Nice View, Breakfast and Razors edge. If you look at the track list you may think they get an unfair amount of songs but almost all of their songs are only seconds long. They don’t have time to fuck around so they blaze through their side of the split with amazing precision. I fucking love this band so much! Werewolves On Motorcycles have a fantastic fucking name but the band doesn’t quite live up to it (to be fair who could?). They remind me of an early 2000′s hardcore band that blends in rock and a touch of screamo. They’re pretty good but I feel I’d be way more into them fifteen years ago (fuck typing that makes me feel old as shit). They’ve only got four songs on here but they make the most of it with them. Werewolves On Motorcycles put forth a good effort and a great name, they were good but their side of this couldn’t come close to touching A Page Of Punk’s. If you like hardcore, fast punk, thrash or power violence then I highly recommend checking this out, it’s pretty incredible all around.\r\nA Page Of Punk\r\n1. FuckYou12341234\r\n2. Fuck, Fuck\r\n3. F.U.C.K.Y.O.U.\r\n4. 背中に何かが乗っかってるぜ\r\n5. 俺が欲しいのはそれではない\r\n6. 腕時計をぶち壊せ\r\n7. Pressure\r\n8. Punk&Beer\r\n9. Just Like Masai\r\n10. Borstal Breakout\r\n11. Little Bitch\r\n12. カナシイ\r\n13. Unlisted Extra Track\r\nWerewolves On Motorcycles\r\n14. World War III\r\n15. The Burning Moon\r\n16. Beastmaster\r\n17.life for a point.\r\n\r\nA Page of Punk obviously have a love of the word ‘fuck’ (and here I’d advise anyone of a particularly sensitive nature to skip the next line) as the opening trio of tracks are “Fuck You 12341234,” “Fuck, Fuck” and “F.U.C.K.Y.O.U.” They play frantic punk rock that is trashy and all over the place in highly enjoyable, short and sharp blasts. In addition to their own songs, there are covers of The Specials’ “Little Bitch” (including the same riff that the Dandy Warhols once lifted from the song), Sham 69’s “Borstal Breakout” and also “Don’t Look Back in Anger,” originally by Oasis – all of which add a unique take on the songs. It must be noted that I detest Oasis with a passion but A Page of Punk has managed to actually get me to sing along with one of the thankfully defunct Manchester band’s songs for the first time in my life – no mean feat there. Also, you must check out the lyrics to “Just Like Masai” – simple but hilarious. In fact, that applies for all of the band's self-penned songs, too.\r\n\r\nOn a more sedate (well, not at all really but it is a tad less bonkers) note the other side of this slab of vinyl offers up Werewolves on Motorcycles, hailing from Stoke-on-Trent, a band which are also worthy of some high praise for four mighty songs that have their roots in the meaty sound of bands such as Motorhead and Discharge ,along with the odd moment here and there that is more post-punk influenced. All of this band’s offerings are good, featuring a big, thunderous sound that is a bit more ‘normal’ in comparison to A Page of Punk’s approach. The whole package adds up to one hell of a substantial release that, I have to say, is a ‘must buy’ record.\r\n\r\n","options":[{"id":43599894,"name":"2.50 u.k inc post","price":2.5,"sold_out":false,"has_custom_price":false},{"id":43599897,"name":"6.50 world inc post","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124387215/-/apageofpunkred.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124387215/-/apageofpunkred.jpg","width":350,"height":350},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124387191/-/atomo51vinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124387191/-/atomo51vinylscan.jpeg","width":600,"height":602},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124387164/-/atom053scanb.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124387164/-/atom053scanb.jpeg","width":600,"height":605}],"artists":[],"categories":[]},{"id":13543281,"name":"Old flings/Control group -split 7 inch fest version color vinyl","permalink":"old-flings-control-group-split-7-inch-fest-version-color-vinyl","position":59,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/old-flings-control-group-split-7-inch-fest-version-color-vinyl","status":"active","on_sale":true,"created_at":"2013-09-13T15:23:06.000Z","description":"50 available thru mail on Dookie brown swirl with a different color sleeve.","options":[{"id":43412523,"name":"4.50 u.k","price":4.5,"sold_out":false,"has_custom_price":false},{"id":43412526,"name":"6.50 world","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124250562/-/senseless.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124250562/-/senseless.jpg","width":480,"height":360}],"artists":[],"categories":[]},{"id":13542501,"name":"Anne Dreampunx","permalink":"anne-dreampunx","position":60,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/anne-dreampunx","status":"active","on_sale":true,"created_at":"2013-09-13T14:42:20.000Z","description":"","options":[{"id":43410261,"name":"15.50 ik post inc","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124248615/-/annedr.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124248615/-/annedr.jpg","width":300,"height":300}],"artists":[],"categories":[]},{"id":13542339,"name":"The World is a beautiful place and i'm no longer afraid to die whenever","permalink":"the-world-is-a-beautiful-place-and-i-m-no-longer-afraid-to-die-whenever","position":61,"price":15.5,"default_price":15.5,"tax":0.0,"url":"/product/the-world-is-a-beautiful-place-and-i-m-no-longer-afraid-to-die-whenever","status":"active","on_sale":true,"created_at":"2013-09-13T14:35:14.000Z","description":"Whenever, If Ever is the highly anticipated and long-overdue debut full-length for the atmospheric, indie rock band from Willimantic, CT. Having released several EPs and splits, The World Is A Beautiful Place &amp; I Am No Longer Afraid To Die deliver an album so huge that these other releases have only hinted at their true potential. Arguably one of the most talked about and exciting current bands in the Connecticut/New Northeastern United States, The World Is A Beautiful Place And I Am No Longer Afraid To Die has toured with the likes of Finch, Tigers Jaw, Hostage Calm and more. Now available again on colored vinyl. Vinyl version includes digital download. On colored vinyl.","options":[{"id":43409685,"name":"15.50 uk postage ","price":15.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124248228/-/thebeut.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124248228/-/thebeut.jpg","width":500,"height":320}],"artists":[],"categories":[{"id":5838819,"name":"ignite record store awesome list","permalink":"ignite-record-store-awesome-list","url":"/category/ignite-record-store-awesome-list"}]},{"id":13354407,"name":"The Catharsis - Romance  limited offer vinyl record 12 inch lp £6.50","permalink":"the-catharsis-romance-7-limited-offer","position":62,"price":6.5,"default_price":6.5,"tax":0.0,"url":"/product/the-catharsis-romance-7-limited-offer","status":"active","on_sale":true,"created_at":"2013-09-04T12:37:43.000Z","description":"To celebrate the Punk Heat Blast \"AMOUR\"been lifted off as the Second video the vinyl is reduced for a limited time as we want you to get into it T/C rule ON TOUR WITH HEIGHTS e Catharsis Romance LP limited to swamp green record store day exclusive vinyl. Debut LP by Birmingham’s rising sons. For fans of Converge, Trap Them And Have Heart. Fierce rhythm,turburlent riffs,aggessive vocals,resulting in a whirlwind of intence hardcore played by a a band that doesent soley listen to hardcore as hardhitting as it is accessable to a diverse fanbase 10 blistering tracks including the O'recluce single which has been picked up by kerrang tv and radio, the band are on tour inc dates with Black Flag ,Miss May I, And Feed The Rhino.\r\n\r\nThis their debut lp is pressed on swamp green for a record store day exclusive to indie record stores only this is only the start for this young band from Solihull West mid's <a href=\"https://thecatharsishc.bandcamp.com/\">here</a>","options":[{"id":42722349,"name":"6.50 u.k only","price":6.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124250232/-/Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124250232/-/Cover.jpg","width":160,"height":160}],"artists":[],"categories":[]},{"id":13284447,"name":"MotherTrucker The power of independent Trucking shipping now","permalink":"mothertrucker-the-power-of-independent-trucking-shipping-now","position":63,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/mothertrucker-the-power-of-independent-trucking-shipping-now","status":"active","on_sale":true,"created_at":"2013-08-31T16:27:46.000Z","description":"My mates are in this band its great...if your into Pelican,Explosions in the sky,TE,this will destroy you,Kyuss without the vocals we made 300 all on Translucent Purple vinyl members of Opium lord ...thers a download card as well inserted... ATOM071 split with Carnage club and Field recordsThe first time I encountered Birmingham natives Mothertrucker, I expected them to just be a silly band with a silly name and silly song titles. Two out of three assumptions ain’t bad I suppose, but I very quickly came to realise that there’s nothing silly at all about these Brummie-based riff-mongers’ incredible brand of sludgy, instrumental post-metal. Now onto their sixth scintillating release of powerful, individual and talent-laden groove, it would be all too easy for the four-piece to crank out some half-baked riffs, chunk in some 4-4 beats and steal half of Isis’ well-worn chord progressions, but that’s never been what these particular ‘Truckers are about at all.\r\n\r\nAt just 30minutes long, ‘The Power of Independent Trucking’ takes on the guise of a mini-album or extended EP in the same fashion as previous Mothertrucker outputs in the form of the ‘Trebuchet’ compilation or the debut release ‘The Last Ride of Dr. Sanchez’, but yet it manages to take you on a musical journey that very few complete full lengths would be capable of mastering. Opener ‘Career Ender’ begins with a familiar and sleepily Mogwai-esque progression of near-acoustic pangs of emotion before slamming your forehead into a barstool of hardened, blunt-faced riffs from the guitars of Charlie Butler and Chris Scrivens. There’s simply never going to be room or a need for vocals in anything this band chooses to do as the gathering layers of strings and murky electronic pastiches speak to each other and to the listener as words and spells unto themselves.\r\n\r\nAmazing Song-Title Numero Uno hits next with the brilliantly-monikered ‘Reef Do All the Work, The Beatles Get all the Credit’ – a sentiment I’m sure many a classic rock fan would agree with or at least enter into a debate to clarify. Somewhat thankfully, Mothertrucker spend the next six minutes sounding nothing like either Reef or The Beatles as they barrow-roll through fields of gloriously differentiated riffing scales; in the process, incorporating more musical styles into one song than many bands will achieve in an entire career. Heavy-handed drummer Bruce Goodenough once again proves he’s the anchor of this star-gazing collective and his complex patterns of omni-metal stick-work advise and inspire his trio of guitarists forward. At times here, Mothertrucker touch on bits of everything from space rock, jazz, shoegaze, indie rock, stoner and sludge before arriving at a final riff that could have made it onto Machine Head’s ‘Burn My Eyes’ debut. And that’s no insult. This is a stunning challenging and inventive piece of music.\r\n\r\nAfter the storm of ‘Reef do all the yada yada yada…’, ‘Vigo the Carpathian’ (spot the obscure Ghostbusters reference!) is like the rainbow shining through the fading drizzle. Tom Moffat’s chunky basslines sit cosily beneath Butler and Scrivens experimentally picked solos as they grace and complement each other; slowly building up into a crescendo that will bring a grin to the face of any Pelican or ASIWYFA fan. There’s a sense of something eerie building at the finale, but Goodenough’s skilful crash-cymbals ensure that this is a puddle of muted aggression rather than a second downpour of devastating misery.\r\n\r\nIt’s about time for another ridiculously funny song-title isn’t it? Are you ready? You sure? I don’t think that you are… It’s genuinely difficult to write about a song named ‘Duff McKagan’s Kagan Wagon’ without descending into a giggling fit of sniggering schoolgirl proportions. TEE HEE HEE HEEEEE! See… Not the most immediately noticeable track on TPOIT from a musical point-of-view, this ode to Guns n’ Roses’ long-suffering bass-player is a gently strummed piece for the most part which then opens out into some slow n’ low stoner riffage and a searing Cult of Luna-ist background solo. Chin-stroking stuff.\r\n\r\nAs the feedback growls into the brief burst of Earth-worship that is ‘The Southern Teeth’, a gentle wave of sorrow gracefully rains down on the parade of magnificent riffs you’ve just gorged yourself on. It’s the post-metal equivalent of feeling like you’ve just walked into a packed wake whilst wearing a Batman and/or Robin costume. Not to worry though, we still have the hopeful beginning of closer ‘Crypt Stalker’ to pick us up from our guilt-ridden slump. Goodenough’s drums flake and cackle like Dick Dastardly concocting another devious scheme as Moffat’s belching bass throb grows ever louder. By the finale, Butler and Scrivens are in on the action too and all four musicians power out into a devastatingly heavy and thoroughly unhinged finale that sits somewhere between the mountains of Earthless’ madness and the genius, dancing finesse of Russian Circles.\r\n\r\nTo see how much this humble Midlands act have grown over the past ten years or so has been an absolute triumph and a pleasure and I’ve no hesitation in commending ‘The Power of Independent Trucking’ for all of its achievements to any of our readers . Silly sounding titles? Yes, maybe, but don’t come looking here for silly music, you’ll only find yet another highly intelligent and expertly-formed burst of progressive metal from these goddamn Mothertruckers.Instrumental music is a tough one to crack. With no vocals to rely on, instrumental musicians have to focus on making their music interesting enough to engage a listener and this means having melodies strong enough that they don’t need to be bolstered by a vocalist. Few get the balance right but every now and then a band comes along and gets it so right that you hardly notice their complete absence of vocalist. One such band are Birmingham’s post metal legends Mothertrucker who return with a 6 track mini album called ‘The Power of Independent Trucking’.\r\n\r\nThere’s a bizarrely humorous naming convention running throughout this release as the whole thing starts off with the slow burner ‘Career Ender’ which is nothing but a career ender. The song builds and builds with dramatic tension and is finally broken by the heavily distorted guitar work from Charles Butler and Chris Scrivens. These two men form the powerhouse of Mothertrucker’s sound as they effortless drift in and out of delicate, ambient melodies and monstrous, eardrum-bursting riffage.\r\n\r\nThe guitar work is tight and brilliantly structured throughout the entire release and the band never milk a riff for more than it’s worth. A great example of this comes on ‘Reef Do All the Work, The Beatles Get All the Credit’ (another fantastically daft song title). The song is constantly evolving and throwing even more melodies into the mix before it settles on one massive riff that carries the song to its close but not before the addition of a brilliant solo that adds a wonderfully ethereal quality to the band’s music.\r\n\r\nAlso impressing me is the sheer volume of influences that penetrate the band’s sound. You can hear elements of Kyuss, Sunwølf, Ancients and Cult of Luna seeping their way into everything Mothertrucker do and it makes for both a beautifully relaxing and punishing listening experience. You can really visualise yourself listening to ‘The Power of Independent Trucking’ as you take a long road trip through the Mojave Desert with the soft-top down. This record is giving me visions! Well, I think it’s the record…\r\n\r\nMothertrucker’s ‘The Power of Independent Trucking’ is a very special release that is equal parts post metal and sludge. It’s beautiful yet aggressive in equal measures and it does something a lot of instrumental music has a hard time with; it stays interesting. There’s not a dull moment on ‘The Power of Independent Trucking’ and you’d be a fool to miss this release.\r\n\r\n9/10","options":[{"id":42472335,"name":"6.00 u.k","price":6.0,"sold_out":false,"has_custom_price":false},{"id":42472338,"name":"20.00 world ","price":6.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123593040/-/mothert.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123593040/-/mothert.jpg","width":796,"height":770}],"artists":[],"categories":[{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"},{"id":5838819,"name":"ignite record store awesome list","permalink":"ignite-record-store-awesome-list","url":"/category/ignite-record-store-awesome-list"}]},{"id":13260768,"name":"bad habits test press","permalink":"bad-habits-test-press","position":64,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/bad-habits-test-press","status":"active","on_sale":true,"created_at":"2013-08-30T10:58:28.000Z","description":"special sleeve ltd selling these to raise funds for new 7\"s next month","options":[{"id":42392415,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123532464/-/badhabitstest.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123532464/-/badhabitstest.jpg","width":853,"height":960}],"artists":[],"categories":[]},{"id":13260747,"name":"Kickturn demo 7 inch test press","permalink":"kickturn-demo-7-inch-test-press","position":65,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/kickturn-demo-7-inch-test-press","status":"active","on_sale":true,"created_at":"2013-08-30T10:57:34.000Z","description":"Members of losin it postage inc sellng these to raise funds for upcoming singles next month More Kickturn 7\"s in jan 2014","options":[{"id":42392355,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123532437/-/kicy.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123532437/-/kicy.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124646046/-/Kato0005.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124646046/-/Kato0005.jpg","width":600,"height":602}],"artists":[],"categories":[]},{"id":13050357,"name":"Old flings/Control group -split 7 inch Both colorways","permalink":"old-flings-control-group-split-7-inch-both-colorways","position":66,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/old-flings-control-group-split-7-inch-both-colorways","status":"active","on_sale":true,"created_at":"2013-08-19T15:35:28.000Z","description":"This gets you Both colorways for a nice price Shipping on and around the 16th September.","options":[{"id":41650881,"name":"8.00 uk postpaid","price":8.0,"sold_out":false,"has_custom_price":false},{"id":41650884,"name":"10.00 usa/world postpaid","price":10.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122995431/-/senseless.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122995431/-/senseless.jpg","width":480,"height":360}],"artists":[],"categories":[]},{"id":13020519,"name":"Old flings/Control group -split 7 inch tri color vinyl 150 only","permalink":"old-flings-control-group-split-7-inch-inside-out-swirl-vinyl","position":68,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/old-flings-control-group-split-7-inch-inside-out-swirl-vinyl","status":"active","on_sale":true,"created_at":"2013-08-17T15:19:02.000Z","description":"This is the other color","options":[{"id":41551788,"name":"4.50 uk post paid","price":4.5,"sold_out":false,"has_custom_price":false},{"id":43323669,"name":"6.50world post","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122918277/-/senseless.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122918277/-/senseless.jpg","width":480,"height":360}],"artists":[],"categories":[]},{"id":12805905,"name":"Chestnut road/New alaska split ep TEST PRESS","permalink":"chestnut-road-new-alaska-split-ep-test-press","position":69,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/chestnut-road-new-alaska-split-ep-test-press","status":"active","on_sale":true,"created_at":"2013-08-06T12:13:33.000Z","description":"this comes in a yellow sleeve limited to 10 only 2 available\r\nhelp us pay for the next releases on speedowax as well as gaining a true rare item","options":[{"id":40809984,"name":"20.00","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124648857/-/Kato0005.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124648857/-/Kato0005.jpg","width":600,"height":602}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"}]},{"id":12805191,"name":"Chestnut road/New alaska split ep triple pack","permalink":"chestnut-road-new-alaska-split-ep-triple-pack","position":70,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/chestnut-road-new-alaska-split-ep-triple-pack","status":"active","on_sale":true,"created_at":"2013-08-06T11:02:31.000Z","description":"you get 3 different colored versions  in this pack for a punk price and a secret bonus (=","options":[{"id":40807821,"name":"6.00 uk post paid","price":6.0,"sold_out":false,"has_custom_price":false},{"id":40807824,"name":"15.00 world","price":15.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122376849/-/Chestnut_Road_Sleeve_red.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122376849/-/Chestnut_Road_Sleeve_red.jpg","width":4252,"height":4252}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"}]},{"id":12754614,"name":"New alaska/Chest nut road red sleeve 100 made","permalink":"new-alaska-chest-nut-road-red-sleeve-100-made","position":71,"price":2.5,"default_price":2.5,"tax":0.0,"url":"/product/new-alaska-chest-nut-road-red-sleeve-100-made","status":"active","on_sale":true,"created_at":"2013-08-03T13:59:48.000Z","description":"These are RED....versions New Alaska provide not only a heavy alternative but a more experimental slant on the sounds of punk and hardcore. They utilize The Avalanches-esque speech samples that add another interesting element to their already expansive sound. They also express a great knowledge of punk bands gone by on their Facebook feed. The thinking man’s hardcore band indeed!>> When we last left Toulouse, France-based Chestnut Road, the punk-pop notables had populated the flip of a recent split with Varsity Drag with some cracking numbers including a cover of Lemonheads' \"Falling.\" We wrote about that split here in January, and we saw some Facebook photos recently suggesting that a supply of the record has finally made its way to the States. In the meantime, Chestnut Road has kept busy putting together yet another split single due out Aug. 26, this one with Birmingham, England-based post-hardcore outfit New Alaska. One of Chestnut Road's contributions to that new split, a pummelling rocker called \"Trust,\" pleasantly echoes the energy and emotion and big friggin' guitars of '90s feel-bad geniuses Jawbreaker and Garden Variety (particularly this one). In addition to \"Trust,\" Chestnut Road's side includes the number \"Shell;\" New Alaska's side contains the cuts \"Caustic,\" \"White Walls\" and \"Black Bones.\" The split is being sold in a limited edition of 300 vinyl 7\" discs. The songs are being pressed into translucent red media, and these will be available in one of four different-colored sleeves (black, blue, green, red). Brassneck Records will issue the disc exclusively in a green sleeve, while Speedowax Records will use a blue sleeve. It's anybody's guess what a red or black sleeve means or who might be selling them (could it be...), but just go ahead and pre-order the thing from Brassneck right here, why don't you? Then stream \"Trust\" -- which is not a 7 Seconds tune.Value for money this one, featuring 5 tracks squeezed into its 7 inches of red vinyl. The New Alaska tracks will be familiar to anyone who was wise enough to pick up their Finer Lines of Tomorrow CD EP, as all three are culled from that release – but presented on vinyl here for the first time. ‘Caustic’ is bass heavy, with almost chanted verse vocals driving the song through to conclusion. ‘White Walls’ features a super strong chorus which compels fists to fly into the air, while the drums (across all three tracks) force feet to stamp. ‘Black Bones’ is a lovely beast, the movement in the riffs and the way the vocals are stretched taut over them like ligaments is New Alaska in a nutshell. A tight, taut, glorious riff machine.\r\n\r\nFrench trio Chestnut Road are a far looser proposition (not that that’s a bad thing, just a different side of the coin – appropriately enough). Their two tracks ‘Trust’ and ‘Shell’ are evocative of the British skate-punk bands of the early 90s – especially Mega City Four – catchy, noisy, great stuff.\r\n2 new songs by a band responsible for one of the absolute best records of the year. These 2 are just as incredible as anything on their full length, with strong influence by some of my very favorite bands. I've said before, if you ever even remotely liked bands like Broccoli, Hooton 3 Car or Leatherface; Chestnut Road/New alaska split is a must buy.\r\n8.5 out of 10 <a href=\"https://newalaskabandcamp.com/\">here</a>","options":[{"id":40605369,"name":"2.50 uk","price":2.5,"sold_out":false,"has_custom_price":false},{"id":40605372,"name":"6.00 world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122247132/-/Chestnut_Road_Sleeve_red.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122247132/-/Chestnut_Road_Sleeve_red.jpg","width":4252,"height":4252},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124295748/-/newalaskaredrec.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124295748/-/newalaskaredrec.jpeg","width":600,"height":596}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"},{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"},{"id":5838819,"name":"ignite record store awesome list","permalink":"ignite-record-store-awesome-list","url":"/category/ignite-record-store-awesome-list"}]},{"id":12668898,"name":"flex double pack","permalink":"flex-double-pack","position":72,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/flex-double-pack","status":"active","on_sale":true,"created_at":"2013-07-30T12:51:21.000Z","description":"includes both 7s in a numbered Pink/black enverlope","options":[{"id":40306548,"name":"5.00 uk post paid","price":5.0,"sold_out":false,"has_custom_price":false},{"id":44733702,"name":"7.00 world","price":7.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122031105/-/fgr.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122031105/-/fgr.jpg","width":604,"height":453}],"artists":[],"categories":[{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"}]},{"id":12668880,"name":"Broccoli/Pinto split 7 inch","permalink":"broccoli-pinto-split-7-inch","position":73,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/broccoli-pinto-split-7-inch","status":"active","on_sale":true,"created_at":"2013-07-30T12:49:54.000Z","description":"unearthed some stock ...new artwork hardcover limited numbered out of 53 ...handpainted lables covers are costing a bit extra than normal ...mailorder only.blue and green colorways available in this item cover is different to those pictured ","options":[{"id":40306461,"name":"4.00 postpaid england","price":4.0,"sold_out":false,"has_custom_price":false},{"id":40306464,"name":"6.50 world","price":6.5,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125755902/-/BrocPinto.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125755902/-/BrocPinto.JPG","width":300,"height":225},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124609434/-/broccolisleevescan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124609434/-/broccolisleevescan.jpeg","width":600,"height":602},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124609401/-/broccolisleevscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124609401/-/broccolisleevscan.jpeg","width":600,"height":602}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"}]},{"id":12556164,"name":"te therefore the illusion post paid in the u.k","permalink":"te-therefore-the-illusion-post-paid-in-the-u-k","position":74,"price":17.0,"default_price":17.0,"tax":0.0,"url":"/product/te-therefore-the-illusion-post-paid-in-the-u-k","status":"active","on_sale":true,"created_at":"2013-07-24T15:41:15.000Z","description":"Amazing instrumental post rock from japan like Explosions in the sky meets Pelican this is an awesome record ships outside the sleeve in a crucifix style American mailer","options":[{"id":39917640,"name":"Default","price":17.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121757529/-/telp.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121757529/-/telp.jpg","width":225,"height":225}],"artists":[],"categories":[{"id":5838819,"name":"ignite record store awesome list","permalink":"ignite-record-store-awesome-list","url":"/category/ignite-record-store-awesome-list"}]},{"id":12460155,"name":"Mistress/Sally split 7 inch E.P","permalink":"mistress-sally-split-7-inch","position":75,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/mistress-sally-split-7-inch","status":"active","on_sale":true,"created_at":"2013-07-19T14:38:08.000Z","description":"Mistress vomit up \"DVDA\", an especially frantic blast of extreme distortion and piercing shrieking nabbed from their debut album on Rage Of Achilles, renowned for getting five K's in Kerrang! Make of that what you will. For once, the Eyehategod references aren't totally unwarranted (although this would be EHG in their rarer, faster moments) and it's mixed in with an almost industrial precision. Laugh-a-freaking-minute. \r\n\r\nSally definitely err more towards the stoner end of the spectrum, with fat, fuzzed-out guitars, turgid rhythms and a singer who actually sings, but in a really cool strained manner. Their album's coming out on Rise Above, which is a totally apt label for this kind of thing. Epic and doom-laden stuff but tuneful all the same. Damn fine. \r\n\r\nSo there you have it - two exceedingly loud, but still pretty different-sounding bands providing a couple of corking tunes. Can't go wrong with that. Finally a word about the vinyl itself: this is a one-sided record, with half-and-half black/white coloured vinyl that looks cool spinning around at 33 rpm. Sweet.\r\n","options":[{"id":39575400,"name":"3.00 postpaid in the uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39575403,"name":"6.00 postpaid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598445/-/mistressblack.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598445/-/mistressblack.jpeg","width":600,"height":594},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598436/-/mistresssallyvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598436/-/mistresssallyvinylscan.jpeg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598454/-/mistresssallybside.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598454/-/mistresssallybside.jpeg","width":600,"height":591},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523634/-/mitir.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523634/-/mitir.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523622/-/mif.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523622/-/mif.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":12460119,"name":"Rhythm collision Travis cut Vanilla pod atom018 ep","permalink":"rhythm-collision-travis-cut-vanilla-pod-atom018-ep","position":76,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/rhythm-collision-travis-cut-vanilla-pod-atom018-ep","status":"active","on_sale":true,"created_at":"2013-07-19T14:35:39.000Z","description":"PUNKROCK from Stiff little fingers meets Ruts from Americas Clobberers and Two Veterans of the U.K underground all on one Translucent slab of Orangeness  RC amazing, nice, tight US pop punk. TRAVIS CUT serve up a beauty - classic, chuggy stuff with a chorus to die for. VANILLA POD serve up a treat in the shape of \"SIR 26\". I relish anything new of this band's and it starts of pretty fucking smart with a grungey bass/drums intro before launching into basic pop punk with octave chords, tempo changes, etc. - yeah, nice stuff!! Top buy...","options":[{"id":39575202,"name":"3.00 post paid in the uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39575205,"name":"6.00 post paid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124608723/-/atom018sleevescana.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124608723/-/atom018sleevescana.jpeg","width":600,"height":608},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124608747/-/sleevescanvinyl18.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124608747/-/sleevescanvinyl18.jpeg","width":600,"height":605},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124608765/-/sleevescanbside.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124608765/-/sleevescanbside.jpeg","width":600,"height":609},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523568/-/frs.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523568/-/frs.jpg","width":604,"height":453}],"artists":[],"categories":[{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"}]},{"id":12460092,"name":"Dead inside dead from the inside/demo","permalink":"dead-inside-dead-from-the-inside-demo","position":77,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/dead-inside-dead-from-the-inside-demo","status":"active","on_sale":true,"created_at":"2013-07-19T14:32:49.000Z","description":"","options":[{"id":39575100,"name":"3.00 post paid in the uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39575103,"name":"6.00 post paid the world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598655/-/deadinsidecoverscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598655/-/deadinsidecoverscan.jpeg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598601/-/deadinsidevinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598601/-/deadinsidevinylscan.jpeg","width":600,"height":598},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598646/-/deadinsidebcoverscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598646/-/deadinsidebcoverscan.jpeg","width":600,"height":599},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523478/-/di.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523478/-/di.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":12441189,"name":"snake road debut 7 inch","permalink":"snake-road-debut-7-inch","position":78,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/snake-road-debut-7-inch","status":"active","on_sale":true,"created_at":"2013-07-18T15:40:57.000Z","description":"Snapcase vocal style meets Thunderous Baroness Riffmasters Philadelphia hardcore punk. That’s the three-word description bassist Travis Collison offers of his band, Snake Road. He’s not wrong. But fortunately for him, and the rest of the rocking world, Snake Road’s ‘Severed’ EP goes well beyond the straight hardcore motif.\r\n\r\n‘Immunity’ pairs a straight rock n’ roll riff with the type of vocal agro typically reserved for the crust set. At barely over 1-minute long though, it’s over just as you’re starting to feel it might be on of the greatest things you've ever heard. ‘Reminder’ follows and is a step in the more directly hardcore direction, including a great chugging bridge.\r\n\r\nDrummer Jeff Barow begins ‘My Undoing’ with rolling double-bass thunder, paving the way for the most metallic riffing (and soloing!) yet from guitarist/vocalist Jordan Berk. ‘Loft’ is perhaps the most straight hardcore track on the record, and lacks some of the dynamics of the rest of the record. ‘Revered and Venerated’ slows the tempo, layer building upon layer in the intro before bursting into a Snapcase-era hardcore mid-section which itself returns to the slow crush.\r\n\r\n‘Past, Present, Mirror’ almost lapses into the same territory as ‘Loft’ before Berk’s picks up the lead vocal in counterpoint to vocalist/guitarist Jimmy Brady, adding some needed variety. ‘Still Breathing’ joins ‘Immunity’ and ‘My Undoing’ as one of the best tracks on ‘Severed,’ an intro and outro reminiscent of vintage Sick Of It All, complete with some fine bouncing bass work from Collison, sandwiching a hardcore rock n’ roll middle.\r\n\r\nAnd that’s one of the things that sets this record apart from so many of its brethren, it eschews hidebound conventions and instead lets itself roam wherever the members of Snake Road take it. Brady’s vocals attack in a way that’s familiar to anyone who spent time listening to late ‘90s/early ‘00s hardcore, but they avoid coming across as simply part of the bludgeon, instead standing out as a musical unit of their own.\r\n\r\nAnd the guitars? All praise to a band willing to set the goddamn compression aside and let the shred ride. It is a sound for sore ears, and much appreciated in this age when everything seems to have to get crammed into the same middle bandwidth as everything else.\r\n\r\nSnake Road released ‘Severed’ electronically last year, but have been picked up by the UK’s Speedowax label for release of a vinyl 7” version. The band is also playing frequently along the east coast, so keep your eyes open and check them out when you can.<a href=\"https://snakeroad.bandcamp.com/\">here</a>","options":[{"id":39496926,"name":"3.00 postpaid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39496929,"name":"6.00 postpaid world","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121475364/-/snakeroadcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121475364/-/snakeroadcover.jpg","width":350,"height":350},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124600125/-/snakeroadvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124600125/-/snakeroadvinylscan.jpeg","width":600,"height":602},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124600110/-/snakeroadscanback.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124600110/-/snakeroadscanback.jpeg","width":600,"height":605},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523184/-/snake_road.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523184/-/snake_road.jpg","width":640,"height":450},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121475421/-/snakeroadtestcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121475421/-/snakeroadtestcover.jpg","width":320,"height":160}],"artists":[],"categories":[]},{"id":12441051,"name":"passengers where we belong 7 inch vinyl record","permalink":"passengers-where-we-belong","position":79,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/passengers-where-we-belong","status":"active","on_sale":true,"created_at":"2013-07-18T15:30:47.000Z","description":"1-Bound for Blood \r\n2-Heat Storm \r\n3-Fathers day \r\n4-The Gold price \r\n5-Where we Belong \r\n6-Animal \r\nFemale Fronted American Hardcore if You like 7 generations,Gather,Punch,Oathbreaker,Kingdom,WolfxDown chuck this on your Turntable ..if you order two we will send you Two different color records/sleeves ...Vinyl ships the same day unless ord with a pre order I'm about to rock your world, boys and girls. I got the pleasure of seeing Passengers last summer with Dead In The Dirt, Torch Runner, and Eddie Brock, and they blew me away. Playing fast hardcore with elements of heavy and dark hardcore, respectively, they blend sub-genres in a way that is reminiscent of Have Heart (who they do a kick ass cover of), Converge, and they're better than your favorite band.\r\n\r\nThis is hardcore at its finest:\r\n\r\n\"Bound By Blood\" - Beginning with a pleasantly dissonant riff, and fast punk drums, similar to Jane Doe-era Converge, vocalist Alissa rips into the verse with haunting, Sylvia Plath-esque lyrics, \"Mother, how dare you?\" Providing a more personal, literary style of lyrics than most hardcore bands out now (or ever, for that matter), Passengers rip through this song, alternating between faster, aggressive riffs and bone-shattering riffs akin to your favorite 90s hardcore bands.\r\n\r\n\"Heat Storm\" - Like I said, previously, Passengers kicks immeasurable ass, and not just sonically. I think, honestly, one of the areas that shines the most is Alissa's ability to write lyrics that stray from traditional hardcore messages and themes, and even themes like relationships and hardship--that are prominent in hardcore--are dealt with in such a way that the term \"cliche\" or \"boring\" isn't even in my vocabulary. And, if you follow my reviews, you know that I get bored very easily with hardcore bands, after being in the scene for 8 years. And, yes, there's feedback in this song, so you know I'm into it. Beautifully picked bridges, similar to the best tracks on Have Heart's Songs To Scream At The Sun, scale up and down under Alissa's screams of, \"Searching for myself; Searching for that feeling of winter.\"\r\n\r\n\"Father's Day\" - I've never been so pumped for a slower, heavier riff in my life. Passengers offers us a slow, menacing bass line, accompanied by the ceaseless crashing of cymbals, providing a wall of sound while the guitars ring out and Alissa belts out one of the better narrative parts on the album. Just when they get into rhythm, the drums and guitar kick up to circle pit speeds, \"It's this twitch in my face, it's a dead give away. My thoughts are never quiet.\" I can't explain in words the feeling I got when I heard the ending of this song the first time; immaculately timed feedback, heavy hitting drums, and Alissa yelling, \"This isn't safe! No, this isn't a safe place!\" Chills--for me, and for you.\r\n\r\n\"The Gold Price\" - Very few bands have ever done critiques on commercialism and consumerism without being cheesy or cliche. Passengers is one of those very few bands, and thank god (whichever one you please). Like poetry, with realistic images in place of general statements, this song--the shortest on the album--rages through one minute and forty-four seconds of pure, aimed aggression. The guitars, bass, and drums work overtime to rip through the track, dueling Alissa as she spits gold venom. \"We earn this living at the cost of living. This is the rest of your life. Mindless, hungry, starving, feed me.\"\r\n\r\n\r\n\"Where We Belong\" - This intro; this is it. It's not very often that hardcore bands embrace true beauty at the sake of their \"hardcore credibility,\" and it's even less often that bands embrace beauty without losing any credibility at all. This is controversial, but I think that, without a doubt, this song is more beautiful and effective as a hardcore song (not emotional hardcore or melodic hardcore) than any Verse or Have Heart song. There, I said it. That's all I'll say--go listen to it for yourself.\r\n\r\n\"Animal\" - This is the most lyrically powerful song I've heard ever. Another controversial statement, but when you listen to it, I swear to god you'll agree. Coming from Alissa's personal experience with sexual abuse in the drunken party scene, this song is filled with more righteous anger and justified rage than 99% of songs in any genre, ever, and the music follows suit--crushing, angry, violent, pure; this song is true.\r\n\r\nPassengers, since I saw them a year ago, has blown me away with every listen-through, and this time was no different. With pure rage, aggression, and a full harness of both instrumental proficiency and songwriting ability, Passengers is your new favorite band. Buy their album, see them live, bring them veggie burgers, and listen to them daily--it'll remind you why you loved hardcore in the first place.","options":[{"id":39496482,"name":"5.00 uk post paid","price":5.0,"sold_out":false,"has_custom_price":false},{"id":39496485,"name":"7.00 world post paid","price":7.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124652619/-/passengerscoverscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124652619/-/passengerscoverscan.jpeg","width":600,"height":613},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124652640/-/passengersvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124652640/-/passengersvinylscan.jpeg","width":600,"height":598},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124652655/-/passengersbscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124652655/-/passengersbscan.jpeg","width":600,"height":611},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123249429/-/Passengers_zpsbc9ed5cb.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123249429/-/Passengers_zpsbc9ed5cb.jpg","width":1024,"height":409}],"artists":[],"categories":[{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"}]},{"id":12440193,"name":"Sun wolf Midnight moon ","permalink":"sun-wolf-midnight-moon","position":80,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/sun-wolf-midnight-moon","status":"active","on_sale":true,"created_at":"2013-07-18T14:23:00.000Z","description":"Sunwolf II – Midnight Moon (Speedowax/Invektiv Records/ArkNoise/Colossus Tapes)\r\nLP/CD/CASS/DL\r\nAvailable 29th April 2013\r\n\r\nLeeds duo Sunwolf are releasing the follow up to Beyond The Sun – Louder Than War’s Brett Savage likes what he hears.\r\n\r\nIt seems like such a short amount of time has passed since Sunwolf arrived seemingly fully formed into this world and released the wonderfully doom-y ‘Beyond The Sun’. Reminiscent of avant metallers Sunn O)))), Earth and the downtuned riffing of Sleep, it was a confident debut that promised much. Midnight Moon progresses these ideas and shows that Sunwolf are working on a much broader canvas than last time and seemingly unwilling to plough a golden rut of a handful of ideas.\r\n\r\nSellanraa opens the album with a dark, sullen ambience that blooms into so some epic heavy guitar groove. Although not necessarily an indication as to where the rest of the album is heading, it is pretty much a statement of intent: there is a lot of skyward ambition here. Nevermind a Midnight Moon, Sunwolf seem to be attempting to swallow up that fiery ball in the sky. There are certainly echoes of Earth – especially around the Pentastar era, with unvarying riffing that builds in intensity with each pass. ‘Prey To Melancholy’ heads off into a black hole, circular and doomy until it escapes its own gravity and ascends to post-rock territories. Title track, Midnight Moon, picks up immediately after, recalling the previous song’s theme and melody. There is a touch of Mogwai at their gloomiest here.\r\n\r\n- See more at: http://louderthanwar.com/sunwolf-midnight-moon-album-review/#sthash.4IFL7Uve.dpufMortar and Bricks lightens the tone, at once being jazz inflected, sparse and diverting from the previous minor key dourness. This is a bold move and works magnificently here, giving the album far more breadth than initial expectations allowed. In Earnest is in a similar vein, reminding me of the sunnier aspects of Earth’s ‘Bees That Made The Honey..’; a short summery waltz of high lonesome Americana.\r\n\r\nPlateau (pts 1&2) is where Midnight Moon really reaches it high point. It is hard not to imagine peyote streaked visions of cooling desert plateaus, just as your initiation is about to begin. Part 1 sets the scene with an unsettling drone, whilst Part 2 opens with Ennio Morricone-style plucks (yep, an overworked reference, but incredibly fitting here) , until the sky rips open with a loud, overbearing rumble, jangling your already perturbed senses. Imagine Carlos Castenada leading you back from a terrifying comedown. Sunwolf prove themselves to be as masterful at mining this sandblasted seam as much as Barn Owl or Headdress. The Glacial River ends the album proper with a frosty, lysergic ambience. This provides a reserved ending to an at times ferocious album. If you ordered the album online, then you get the bonus track ‘Hollow Mountain’, which is full on, driving Sleep-style riffing and an added pleasure.\r\n\r\nLeeds has plenty of great bands to offer at the minute, and Sunwolf are certainly not letting the city down. Given this duo’s rapid rate of work, how long will it be before we see another album? Expectations are high, chaps!\r\n\r\n- See more at: http://louderthanwar.com/sunwolf-midnight-moon-album-review/#sthash.4IFL7Uve.dpuf","options":[{"id":39493572,"name":"8.00 uk post paid","price":8.0,"sold_out":false,"has_custom_price":true},{"id":39493575,"name":"17.00 postpaid europe","price":10.0,"sold_out":false,"has_custom_price":false},{"id":39493578,"name":"20.00 postpaid world","price":10.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121472793/-/sunwolfbigcartel12.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121472793/-/sunwolfbigcartel12.png","width":1417,"height":1417}],"artists":[],"categories":[]},{"id":12375651,"name":"hardships too fast to slow down","permalink":"hardships","position":81,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/hardships","status":"active","on_sale":true,"created_at":"2013-07-15T15:40:16.000Z","description":"Slayer influnced fire and ice Modern life is war from Leeds","options":[{"id":39273996,"name":"3.00 inc post in the uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39489951,"name":"6.00 inc post world","price":6.0,"sold_out":false,"has_custom_price":true},{"id":39489954,"name":"test press 2 only uk","price":15.0,"sold_out":false,"has_custom_price":true},{"id":39489957,"name":"test press 2 only world","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121470285/-/hardshipscoverforbigcartel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121470285/-/hardshipscoverforbigcartel.jpg","width":300,"height":300},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124599075/-/hardshipsredscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124599075/-/hardshipsredscan.jpeg","width":600,"height":602},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124599147/-/hardshipsbcover.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124599147/-/hardshipsbcover.jpeg","width":600,"height":606},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121522671/-/hso.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121522671/-/hso.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":12375618,"name":"crocodile god/broccoli Split 7 inch Extended player ","permalink":"crocodile-god-broccoli","position":82,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/crocodile-god-broccoli","status":"active","on_sale":false,"created_at":"2013-07-15T15:39:24.000Z","description":"practically flawless. Totally and utterly relentless melodic punk rock, with vocals that are almost the Leatherface sound, but not quite so rough. And here is the twist. It somehow verges on pop. Don't ask me how. You just can't intentionally stick feedback in there, play at 250mph, and not 'sing', yet make a pop sounding song can you? Yep. Broccoli do it here. Flip it over for Crocodile god, great  fast paced melodic punk, 90s UK punk, or just punk music in general this is worth picking on Translucent Blue vinyl from Speedowax with love xx ","options":[{"id":39273936,"name":"3.00 postpaid u.k","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39490203,"name":"6.00 postpaid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124385232/-/atom044scansleevefront.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124385232/-/atom044scansleevefront.jpeg","width":600,"height":606},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124385283/-/atom044scanvinyl.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124385283/-/atom044scanvinyl.jpeg","width":600,"height":604},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124385292/-/atom044scanvinylbside.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124385292/-/atom044scanvinylbside.jpeg","width":600,"height":607}],"artists":[],"categories":[]},{"id":12375549,"name":"Weight of the world no promised land- Translucent Violet vinyl ","permalink":"weight-of-the-world","position":83,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/weight-of-the-world","status":"active","on_sale":true,"created_at":"2013-07-15T15:34:07.000Z","description":"Atom057:Furious Passionate Lyrics about \"real topics \" in this world..along with their melodic yet traditional style Hardcore influnced  by Go it alone,Battery,Section 8. Florida's WotW deliver 5 Anthemic pieces of well constructed,tortured Heartfelt art delivered with sincere honest punk rock integrity that is the real deal as it is awesome \r\n1-Rational man \r\n2-Park place \r\n3-Sunrise \r\n4-Boardwalk\r\n5-No promised land \r\nRecorded by Daniel Colombo at Iceman studios \r\nPhotography by JL Schnabel and Garrett Elkins \r\nLyrics by Dilon Dente \r\nwww.weightoftheworld.bandcamp.com www.facebook.com/weightoftheworldhc www.facebook.com/speedowax Please Listen, Like Buy \r\nWeight of the World also refers to a hardcore band from South Florida. Initially, the band started as Mitch Zientz and Dillon Dente; writing all songs and recording the songs themselves. They have a 3-song demo cassette that was recorded between 2009 and 2010 and a 5 track cassette titled “No Promised Land” that was released in 2011.Both are available on their bandcamp at weightoftheworld.bandcamp.com\r\n","options":[{"id":39273741,"name":"3.00 post paid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39490512,"name":"6.00 post paid world","price":3.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122202822/-/wotwoffical.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122202822/-/wotwoffical.jpg","width":500,"height":500},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121522725/-/we.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121522725/-/we.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/122202873/-/wotwbluecoverreal.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/122202873/-/wotwbluecoverreal.png","width":1044,"height":523}],"artists":[],"categories":[{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"}]},{"id":12375492,"name":"broccoli found","permalink":"broccoli-found","position":84,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/broccoli-found","status":"active","on_sale":true,"created_at":"2013-07-15T15:30:29.000Z","description":"","options":[{"id":39273267,"name":"3.00 post paid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39490635,"name":"6.00 postpaid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124386501/-/atom045sleevescan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124386501/-/atom045sleevescan.jpeg","width":591,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124386528/-/atom045vinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124386528/-/atom045vinylscan.jpeg","width":598,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124386543/-/atom045sleevescanbside.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124386543/-/atom045sleevescanbside.jpeg","width":600,"height":606}],"artists":[],"categories":[]},{"id":12375462,"name":"deathbed/douglas Split 7 inch Orange vinyl","permalink":"deathbed-douglas-flag-sleeve","position":85,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/deathbed-douglas-flag-sleeve","status":"active","on_sale":true,"created_at":"2013-07-15T15:29:24.000Z","description":"90's Hardcore inspired heaviness from Deathbed and Douglas blast early 2000 style melodic core like Movielife,Silent majority,Glassjaw only they hail from Wales Already released split singles with Gameface,Ataris,they also toured the u.k with Movielife Glassjaw in their prime.DEATHBED is an Atlanta-based straight edge band heavily influenced by some of the best of 90′s hardcore such as Buried Alive, Harvest, 108, and Culture. Be sure to check them out! Douglas Driving melodic hardcore / punk-rock along the lines of Movielife, Jawbox, Drive like jehu,Samiam but with a unique British feel to it","options":[{"id":39273186,"name":"3.00 postpaid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39490563,"name":"6.00 postpaid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124607796/-/deathbedvinylscansleeve.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124607796/-/deathbedvinylscansleeve.jpeg","width":600,"height":609},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124607838/-/deathbedvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124607838/-/deathbedvinylscan.jpeg","width":600,"height":605},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124607817/-/deathbedbsidesleevescan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124607817/-/deathbedbsidesleevescan.jpeg","width":600,"height":605},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121476456/-/douglas_-_deathbed.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121476456/-/douglas_-_deathbed.jpg","width":320,"height":237}],"artists":[],"categories":[]},{"id":12375372,"name":"no control/the catharsis","permalink":"no-control-the-catharsis","position":86,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/no-control-the-catharsis","status":"active","on_sale":true,"created_at":"2013-07-15T15:22:52.000Z","description":"Hailing From Atlanta Touring with the likes of Deathbed,Weight of the world,Will to die Gnarly out of control hardcore from No control flip the beast for Awesome Tuneage from T/C hailing from the u.k Featuring the anthem O'RECLUCE and one other exclusive cut \r\ngreen vinyl is sold out but we have a handful left on Black wax","options":[{"id":39272766,"name":"3.00 post paid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39490746,"name":"6.00 post paid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121471644/-/catharsissplit-bigcartel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121471644/-/catharsissplit-bigcartel.jpg","width":400,"height":400},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124646259/-/ncgreen.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124646259/-/ncgreen.jpeg","width":600,"height":598},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121474971/-/nocontrolcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121474971/-/nocontrolcover.jpg","width":503,"height":503},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124646271/-/tcinsert.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124646271/-/tcinsert.jpeg","width":600,"height":598},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124646280/-/ncinsert.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124646280/-/ncinsert.jpeg","width":600,"height":598}],"artists":[],"categories":[]},{"id":12375339,"name":"black shapes in the mourning light 7 inch Cyan blue ","permalink":"black-shapes-in-the-morning-light","position":87,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/black-shapes-in-the-morning-light","status":"active","on_sale":true,"created_at":"2013-07-15T15:21:31.000Z","description":"Dangerous hardcore band from the u.k playing the sort of music i love in the vein of American nightmare,Hope con,Dead hearts theres even shades of Will haven here in Gareth's out of control vocals with Riffs built upon Riffs Added to the 11 minute Attack on the senses leaving you Breathless and Happy you delved into their under world,The vinyl is on Solid Blue with a foldover sleeve and Lyric insert released by Speedowax records Black Shapes is a new force in the UK Hardcore scene. Bearing members of November Coming Fire and Jairus, the band has already released a EP and single in its 1,5 years of existence. October the 31th saw the birth of the band’s second EP, In The Mourning Light, which is a 11 minute long raging Hardcore Punk storm.\r\n\r\nIn The Mourning Light starts off with ‘Beyond The Grey’, a song that blends hardcore riffing with stomping grooves and breakdowns, more melodic parts and desperate vocals. This track basically sums up all the things Black Shapes is about.\r\n\r\n\r\nTracks like ‘Behind My Dead Eyes’ and ‘Thunderous’ mostly impress because of their lyrical content. Words like “Just the beauty of all the love that i’ve ever felt, and I’ll be sleeping sound as they lower my body down” show the grimness that is present on this EP. The overall vibe is very dark and gloomy anyway, something that is very well reflected in the tongue in chic title.\r\n\r\nThe EP was recorded by Steve Sears, who also worked with Gallows. This is something that is most present on ‘Rose And Lace’, as singer Gareth Evans sound quite like ex-Gallows frontman Frank Carter.\r\n\r\nBlack Shapes certainly isn’t the most unique and groundbreaking band on the planet, but they put out a solid EP with some nice Hardcore tunes. Only makes you wonder what a full length album and live show would be like.\r\n\r\nIn The Mourning Light – Track list:Beyond The Grey\r\nRose And Lace\r\nThunderous\r\nBehind My Dead Eyes\r\nIn The Mourning Light is available physically as a 7” vinyl on Speedowax Records and digitally on their own Bandcamp as ‘pay what you want’ release.\r\n\r\nBlack Shapes: Facebook / Twitter / Tumblr\r\n\r\nWritten by Niels KosterSince the band’s face melting debut EP was released, we’ve been keeping a close eye on London’s Black Shapes. It’s worth noting that the band have changed their line up fairly significantly since then before we carry on – Gareth Evans of November Coming Fire is now on vocals and Mike Ager of Jairus has taken over on bass duties.\r\n\r\nThis leaves the band sounding quite different (especially vocally), and it almost feels little unfair to compare the two EPs because of it. Still, it’s got the same teeth that the debut does, and fans of London hardcore will have a fucking good time with ‘In The Mourning Light’.\r\n\r\nHere, the bookending ‘Beyond The Grey’ and ‘Behind My Dead Eyes’ are the best on offer, but as with their debut, ‘In The Mourning Light’ feels like a mere taster of things to come. 11 minutes pass by swiftly and effortlessly, and as an invitation to come and see the band live, it’s second-to-none. The four track all display a great amount of natural hunger for heavy music, and it’s a fine listen because of it. Even better is that the band have taken on the admirable model of letting people have their music for whatever price they deem worthy for the EP (digitally), and it’s a proving an excellent way of getting their name out there following a similar approach first time around.\r\n\r\nOnce ‘In The Mourning Light’ is released, the momentum will most definitely  be with Black Shapes, and though they’re arguably retreading some UK hXc ground, they’re doing it guns blazing and with some fantastic riffs. A band well worth checking out before everyone else catches on in the very near future.\r\n\r\nTOM AYLOTT","options":[{"id":39272625,"name":"3.00 postpaid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39492315,"name":"6.00 postpaid world","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39492318,"name":"20.00 test press 1 only","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124597095/-/blackshapesvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124597095/-/blackshapesvinylscan.jpeg","width":600,"height":602},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124597107/-/blackshapesvinylscan2.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124597107/-/blackshapesvinylscan2.jpeg","width":600,"height":602},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121471851/-/blackshapesfullvinyl.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121471851/-/blackshapesfullvinyl.jpg","width":480,"height":360}],"artists":[],"categories":[]},{"id":12375306,"name":"chestnut road lp vinyl Clear milky record","permalink":"chestnut-road-lp","position":89,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/chestnut-road-lp","status":"active","on_sale":true,"created_at":"2013-07-15T15:19:09.000Z","description":"Back up in the store sorry but we took them down while the band were on tour in the u.k ...so they could sell their copies..fans of Broccoli and Hooton 3 carChestnut Road come from France and are quite clearly channelling bands that created punk music heavy on melody and a bit of gruffness; yes, it’s the usual suspects including Leatherface and Husker Du, but let’s be honest, that’s a mighty fine sound and one which many of us never tire of, so who’s particularly bothered if a bunch of French youngsters want to add their own take on a popular style of music? Not me. \r\n\r\nOn my first listen to this self-titled album, I felt like I was being taken back to a time in the late 1980s / early 1990s when this kind of sound was on heavy rotation on my turntable, from the likes of the aforementioned illustrious duo as well as bands such as HDQ (a pre-Leatherface outfit), (early) Lemonheads and the Cateran. Many bands through the annals of punk history have adopted a similar approach, and Chestnut Road are yet another keeping the flag flying for this sound. This ten-track release highlights that the three members of the band have certainly paid attention when listening to these kind of bands as they have managed to make this sound nostalgic yet fresh enough to repel any thoughts of “not another band mining this sound to death” coming to mind.\r\n\r\nThe sound is of a beefy quality with the vocals being slightly held back in the mix and the drums not being lost or hidden as is the way on some recordings; it’s pretty faithful to the sound some of the finer exponents of melodic punk rock as noted above had and in doing so, hits the sweet spot with me, as it brings back many memories from when I was in my early/mid 20’s lapping up bands that had a similar approach.\r\n\r\nBeyond the fact that Chestnut Road knock out some pretty good songs, I have to credit them with having the balls to throw in a damn fine instrumental track too and “Greener Grass” is one of those tunes where you keep waiting for a vocal to kick in but at the end, you’re not bothered as it’s made its presence known without any addition. This track also contains more of a Dickie Hammond (HDQ/Leatherface guitarist) influence than any of the others on the album and I imagine it would also be a great opening track for the band's live performance.\r\n\r\nAnother thing I like about this record is that the second side is slightly stronger than the first, with no weaker moments which could highlight a front loading of the vinyl with the better songs; basically Chestnut Road is consistently good from start to finish but my favourite tracks are to be found in the latter half of the release. One of these comes in the form of my favourite track, “Worthless”, which is just a fantastic song and an excellent way to conclude what is a highly enjoyable album, worthy of many, many plays now and in the future.\r\n","options":[{"id":39272520,"name":"8.00 uk post paid","price":8.0,"sold_out":false,"has_custom_price":false},{"id":39490890,"name":"17.00 europe post paid","price":17.0,"sold_out":false,"has_custom_price":true},{"id":39490893,"name":"20.00 world post paid","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121470996/-/chestnutroadlpcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121470996/-/chestnutroadlpcover.jpg","width":1000,"height":1000},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124597566/-/cnrvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124597566/-/cnrvinylscan.jpeg","width":592,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121474140/-/chestnutall.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121474140/-/chestnutall.jpg","width":480,"height":480}],"artists":[],"categories":[]},{"id":12375270,"name":"will to die mass grave Translucent Lemon yellow vinyl","permalink":"will-to-die-mass-grave","position":90,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/will-to-die-mass-grave","status":"active","on_sale":true,"created_at":"2013-07-15T15:16:09.000Z","description":"Tough American Hardcore with enough Beatdowns and Solid Riffs to get a Mosh party Going Influnced by Sepultura,Leeway and Madball ....Check out Embers ...it contains Riffs that shouldent exsist..","options":[{"id":39272412,"name":"3.00 postpaid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39490950,"name":"6.00 post paid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124295880/-/willtodiepurple.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124295880/-/willtodiepurple.jpeg","width":600,"height":604},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124295868/-/willtodieyellowmix.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124295868/-/willtodieyellowmix.jpeg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124609032/-/willtodiebscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124609032/-/willtodiebscan.jpeg","width":600,"height":603}],"artists":[],"categories":[]},{"id":12375258,"name":"vices/flex 5 Track Split 7 inch Vinyl record","permalink":"vices-flex","position":91,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/vices-flex","status":"active","on_sale":true,"created_at":"2013-07-15T15:15:07.000Z","description":"Vices from Florida offer up a unique No warning meets '90s Hardcore Blend that delivers Killer tunes that will keep you coming back to the turntable to spin this bad boy time and time again \r\n1-Rolling Stones \r\n2-Meddlin' kids \r\nFlip over the wax to get three singalong anthems from\r\nFlex \r\n1-Wont let it win\r\n2-Proud to be UnAmerican \r\n3-Holding on \r\nFans of Go it alone,Down to nothing,Backtrack,No warning check in... Vinyl ships the same day unless ord with a Pre order.. Vinyl pics are down below if you order two you,ll get two different sleeves and colorways...thanks alot ","options":[{"id":39272292,"name":"3.00 postpaid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39491115,"name":"6.00 postpaid world","price":6.0,"sold_out":false,"has_custom_price":true},{"id":39491118,"name":"15.00 test press 1 only uk","price":15.0,"sold_out":false,"has_custom_price":true},{"id":39491121,"name":"20.00 test press world","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121471140/-/flexsplit-bigcartelburgundy.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121471140/-/flexsplit-bigcartelburgundy.jpg","width":400,"height":400},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124387389/-/atom056vinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124387389/-/atom056vinylscan.jpeg","width":600,"height":609},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121522938/-/bv.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121522938/-/bv.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121473447/-/flexall.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121473447/-/flexall.jpg","width":433,"height":433},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124387527/-/atom056vinylscanbside.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124387527/-/atom056vinylscanbside.jpeg","width":600,"height":606}],"artists":[],"categories":[]},{"id":12375249,"name":"flex void/demo 8 Track 7 inch color vinyl e.p","permalink":"flex-ep","position":92,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/flex-ep","status":"active","on_sale":true,"created_at":"2013-07-15T15:14:25.000Z","description":"Passionate American Hardcore \r\n1-Intro \r\n2-Void \r\n3-Los Angeles\r\n4-Diagnosis \r\n5-Don't forget\r\n6-Death bed\r\n7-Flexed youth\r\n8-Losing control \r\nFans of Carry on,Go it Alone,Down to nothing Chuck this in your Record collection ...see the Pictures of the vinyl down below,Record ships the same day if not ordered with Pre order thanks  www.facebook.com/speedowax Various shades of Blue vinyl if you order Two you will get two Different versions ","options":[{"id":39272121,"name":"3.00 postpaid u.k","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39491337,"name":"6.00 postpaid world","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39755832,"name":"20.00 test press 1 only","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121473420/-/flexdemocover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121473420/-/flexdemocover.jpg","width":1200,"height":1194},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598337/-/flexvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598337/-/flexvinylscan.jpeg","width":600,"height":603},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598361/-/flexvinylscanbside.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598361/-/flexvinylscanbside.jpeg","width":600,"height":602},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121522992/-/download.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121522992/-/download.jpg","width":259,"height":194},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598340/-/flexvinylsleeveb.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598340/-/flexvinylsleeveb.jpeg","width":600,"height":593}],"artists":[],"categories":[{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"}]},{"id":12375231,"name":"worn out/the catharsis split Royal Translucent blue vinyl","permalink":"worn-out-the-catharsis","position":93,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/worn-out-the-catharsis","status":"active","on_sale":true,"created_at":"2013-07-15T15:13:35.000Z","description":"Man these cats are awesome gnarly hardcore from Florida for fans of the mighty Down to nothing,Guns up,Fire and ice,Backtrack...three tunes of Ace HXC ...Flip the Beast for Two Classic Hardcore Anthems from The Bastard sons...The Catharsis for fans of Empire of Rats,Norma jean,Trap them and Every time i Die \r\nPressed on High Quality Vinyl...the Winners choice.","options":[{"id":39272085,"name":"3.00 postpaid uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39491436,"name":"6.00 postpaid world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121474584/-/wornout.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121474584/-/wornout.jpg","width":300,"height":296},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124645545/-/WornOut0002.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124645545/-/WornOut0002.jpg","width":600,"height":601},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124645515/-/WornOut0005.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124645515/-/WornOut0005.jpg","width":600,"height":603},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124645539/-/WornOut0006.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124645539/-/WornOut0006.jpg","width":600,"height":605},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523043/-/wer.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523043/-/wer.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":12375204,"name":"black veins the cycle will 7 inch solid Grim Grey Vinyl","permalink":"black-veins","position":94,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/black-veins","status":"active","on_sale":true,"created_at":"2013-07-15T15:12:04.000Z","description":"Dark Dwellings of Integrity,Full of Hell,Isis,His hero is gone,From ashes rise A389,Headfirst,King of the monsters,Holy terror\r\npresented in foldover art sleeve with insertBlack Veins are an absolutely crushing three piece from Birmingham (the world’s most metal city), who play bleak, foreboding hardcore that’ll have Trap Them fans leaping out of their seats. There are many bands playing this style of dark hardcore at the moment, especially in the UK, but Black Veins stand out above the crowd with their interesting songwriting, thick, sludgy undertones and sheer, unbridled rage. The band have just released a new 7″ entitled ‘The Cycle Will Cease To End’, which could well be their most accomplished work to date. Opening up with a harrowing dirge that brings to mind early Swans, it doesn’t take long before the trio lunge head first into some of the most furious, breakneck hardcore you’ll hear outside of the new Nails record.\r\n\r\nEvidently we’re not the only ones paying attention either – in their short time as a band, these guys have already put out records on labels like Speedowax and Witch Hunter Records, and played shows with hardcore legends like Negative Approach and Integrity. We got in touch with Black Veins to find out what the future holds for one of the UK’s most promising hardcore acts…\r\n<a href=\"https://blackveins1.bandcamp.com/\">here</a>\r\n","options":[{"id":39271971,"name":"3.00 inc post uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39491736,"name":"6.00 inc post world","price":6.0,"sold_out":false,"has_custom_price":true},{"id":39491739,"name":"15.00 test press 1 only uk","price":15.0,"sold_out":false,"has_custom_price":true},{"id":39491742,"name":"20.00 test press 1 only world","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598019/-/blackveinscoverscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598019/-/blackveinscoverscan.jpeg","width":600,"height":607},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598028/-/blackveinsvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598028/-/blackveinsvinylscan.jpeg","width":600,"height":598},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124598046/-/blackveinsbackcoverscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124598046/-/blackveinsbackcoverscan.jpeg","width":600,"height":606},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121471392/-/blacksveinskk.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121471392/-/blacksveinskk.jpg","width":800,"height":800},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523283/-/gb.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523283/-/gb.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":12375198,"name":"deadcuts/hip priests black vinyl 5 left","permalink":"deadcuts-hip-priests","position":95,"price":3.0,"default_price":3.0,"tax":0.0,"url":"/product/deadcuts-hip-priests","status":"active","on_sale":true,"created_at":"2013-07-15T15:11:11.000Z","description":"Senseless things fans take note this is Mark keds new punk band swimming in Sex and broody Soul and swagger with shimering guitars electric fuzz sweat and Attitude...Slap the wax over for Sonic  fueled garage punk stomper from Ex Headchecks,X RAYS a beast of a tune ....Comprising perilous poetry and haunting riffs, Deadcuts encapsulate a feral mysticism and deadbeat glamour. From the Senseless Things to Jolt, the wraith like Keds has exerted an influence on the English music scene for more than a decade. He is the silent voice on the Libertines eponymously titled second album, having co-written, Can’t Stand Me Now, and can affect the tide of modish change with a lyric and a line-up as the mood takes him. Deadcuts guitarist Jerome Alexandre cut his teeth with The Skuzzies, Deadcuts had shaken the foundations with a post punk, post brit pop sonic assault on the senses. From the opening guitar noise and the first few chords along with their glam scruff look something told me that Deadcuts might be quite good. Thirty minutes later and my initial reaction had been proved wrong, they weren't quite good, they were fucking great!\r\n\r\nA trip to their facebook page the next day revealed a lot more about Deadcuts to me. It turns out singer and guitarist Mark Keds had been in the Senseless Things (a late 80's early 90's indie guitar band.) Bassist Mark McCarthy played in The Wonder Stuff, and Goth Rockers Queen Adrena, Drummer Trevor Sharpe had hit the skins for Miranda Sex Garden, while the guitarist with a look of Johnny Thunders about him was Jerome Alexander formerly of The Skuzzies. With that sort of pedigree, and a rich and varied list of influences from Johnny Thunders to Death In June and The Birthday Party to Prince. it is no wonder the Deadcuts are a....cut above yer average Rock'n'Roll band.\r\n\r\nThe piercing twin guitar attack, solid Semtex bass and the machine gun drums hammer their songs into yer head and heart, these are tunes that absorb and engulf the listener before spitting them out shaking and twitching on the floor. The throaty and drawling vocals add to the full throttle aural assault. Never mind being a breath of fresh air in the stale stagnant Rock'nRoll world of the noughties Deadcuts are like a tornado; ripping it all up with their sleazy sonic soundscapes, like a punked-up Psychedelic Furs. Deadcuts are a psyched up primal, tribal and feral howl in the face of mediocrity.\r\n\r\nI dunno if the 4 track CD of theirs which I picked up at the gig is their new single or what, but it's well worth tracking down, but while you do that, here's a selection of songs from their soundcloud page for you to Enjoy or Destroy! ","options":[{"id":39271956,"name":"3.00 inc post uk","price":3.0,"sold_out":false,"has_custom_price":false},{"id":39491766,"name":"6.00 inc post world","price":6.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121474611/-/hippriestssplit.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121474611/-/hippriestssplit.jpg","width":500,"height":500},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124608021/-/deadcutsvinylscan.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124608021/-/deadcutsvinylscan.jpeg","width":600,"height":604},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523067/-/dfg.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523067/-/dfg.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":12374838,"name":"Snake road Severed souls 7 inch vinyl e.p 101 only","permalink":"snake-road-severed-souls-pre-order","position":96,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/snake-road-severed-souls-pre-order","status":"active","on_sale":true,"created_at":"2013-07-15T14:40:20.000Z","description":"Snapcase style vocals riffs upon riffs music blend of heavy-rock-meets-punk-backbone that quickly garnered the attention of those in the know. Combining elements of metallic punk reminiscent of early From Ashes Rise, the band infuses this fundamental core with riff motifs from the Mastodon and Baroness end of the spectrum for a refreshing take on punk rock. <a href=\"https://snakeroad.bandcamp.com/\">here</a>","options":[{"id":39270555,"name":"4.00 uk inc post","price":4.0,"sold_out":false,"has_custom_price":false},{"id":39491547,"name":"8.00 world inc post","price":4.0,"sold_out":false,"has_custom_price":false},{"id":39491550,"name":"20.00 test press 1 only","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124296096/-/snakeroadrw.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124296096/-/snakeroadrw.jpeg","width":600,"height":602},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124296105/-/snakeroadwhiteeeeee.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124296105/-/snakeroadwhiteeeeee.jpeg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124296111/-/snaje.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124296111/-/snaje.jpeg","width":600,"height":597}],"artists":[],"categories":[{"id":5792898,"name":"speedowax pre order","permalink":"speedowax-pre-order","url":"/category/speedowax-pre-order"}]},{"id":10701282,"name":"The Catharsis - Romance rsd with bonus bitter seeds ep","permalink":"the-catharsis-romance-lp-vinyl-exclusive-record-store-day-colourway","position":97,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/the-catharsis-romance-lp-vinyl-exclusive-record-store-day-colourway","status":"active","on_sale":true,"created_at":"2013-04-22T16:25:41.000Z","description":"Birmingham's bastard sons, The Catharsis bring you their ear shredding debut 'Romance' AWESOME with a capital A \r\nSpecial limited pressing for 'Record Store day' on swamp green or cum in the shower clear we will throw in a copy of Bitter seeds vinyl record with every order.No need to beat around the bush here; The Catharsis’ Romance is an album you need to own. This is 32 minutes of the most uncompromising, unforgiving and down-right memorable hardcore and it’s a beautiful yet violent display of anger.\r\n\r\nRight, let’s get down to the nitty-gritty. Romance is a hardcore record at heart and fans of Bastions, Converge, Gallows and Palm Reader will have plenty to enjoy. But simply calling this a hardcore record would be doing it a serious injustice. The whole records flows and weaves its’ songs together with finesse and manages to bludgeon you with riffs at the same time. The guitar work from Ash, Mikey and Matt is hugely memorable, expertly played and comes with heaps of hardcore stomp. The riffing on Romance absolutely tears through this release and the thunderous bass pops and twangs, punctuating every chord.\r\n\r\nLet’s not forget vocalist Morgan and drummer Chris who play equally important parts. The drumming on Romance sounds like pure fury and Chris sounds like he’s destroying his body with this level of intensity. The drum work makes this release sound phenomenally huge. This is hardcore that doesn’t deserve to stay confined to the small stages.\r\n\r\nNow let’s talk about Morgan. Here’s a vocalist who embodies everything a front man should be. Despite being predominantly a screamer, his vocals are wonderful tales of loss, anger and heart break and his vocals are clear throughout the entire release. Morgan also does a fantastic job of avoiding the hardcore trope of simply screaming over the music with no real structure. Morgan’s vocals work with the rhythm of the songs and reinforce the visceral nature of this entire release. He even manages to muster a cheeky laugh on Heart Burner that manages to make him sound “human” despite the fact he’s tearing his throat apart for the majority of Romance. Morgan should be proud of his performance on Romance because he manages something most screamers can only dream of; he sounds truly honest.\r\n\r\nThe Catharsis have not only put together one of the best hardcore releases this year but it deserves to be recognised as one of the best heavy albums ever made. There is no filler, padding or interludes on Romance; everything was put on this record for a reason. A record this intense has no place being so accessibly catchy but The Catharsis have managed to do exactly that. Listen to this album and then tell everyone you know about it. It really is that good.\r\n\r\n10/10\r\n\r\n\r\nTrack listing \r\n1. Funeral \r\n2. Dead Man Talking \r\n3. Stray Dogs \r\n4. Heart Burner \r\n5. Spirit Lifter \r\n6. Styx \r\n7. Amour \r\n8. Leave Me Here \r\n9. O'Recluse \r\n10. Romance\r\n\r\nFor fans of: Gallows,Empire Of Rats,Converge ,Trap Them","options":[{"id":33557556,"name":"green vinyl bonus single","price":10.0,"sold_out":false,"has_custom_price":false},{"id":33557559,"name":"cum in the showerVinyl bonus single","price":10.0,"sold_out":false,"has_custom_price":false},{"id":34691898,"name":"test pressing romance","price":25.0,"sold_out":false,"has_custom_price":true},{"id":37433526,"name":"sold out","price":10.0,"sold_out":false,"has_custom_price":false},{"id":37433529,"name":"sold out","price":10.0,"sold_out":false,"has_custom_price":false},{"id":37433532,"name":"clear ","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":4.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":12.0,"amount_with_others":12.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121476351/-/Cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121476351/-/Cover.jpg","width":160,"height":160},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/114637866/-/romance_vinyl.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/114637866/-/romance_vinyl.jpg","width":640,"height":584},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121476372/-/TheCatharsispromophotoThrashHits.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121476372/-/TheCatharsispromophotoThrashHits.jpg","width":500,"height":300},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124654494/-/WornOut0007.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124654494/-/WornOut0007.jpg","width":600,"height":600}],"artists":[],"categories":[{"id":5003659,"name":"Albums","permalink":"albums","url":"/category/albums"}]},{"id":10384465,"name":"History of the hawk lp future ruins Vinyl pre opium lord ","permalink":"kato","position":98,"price":8.0,"default_price":8.0,"tax":0.0,"url":"/product/kato","status":"active","on_sale":true,"created_at":"2013-04-06T16:04:30.000Z","description":" History of the hawk future ruins 15 cuts of manically varied,getically heavy,deliberately intence,chaotic and tight intelligent real deal abrasive music. r.i.y.l pg 99,refused,at the drive in,yacopsae,isis,drive like jehu,majority rule etc ...band members went on to form the behemoth that is \"opium lord\"....who's dark dwellings you can hear   creeping into the sound of this opus...the limited one time only deluxe  press vinyl version is presented in a glass cut printed pocket sleeve art inserts numbered limited stamped \r\n<a href=\"https://soundcloud.com/cvlnation/sets/cvlt-nation-ritual-opiumlord/\">here</a>","options":[{"id":32519767,"name":"8.00 uk inc post","price":8.0,"sold_out":false,"has_custom_price":false},{"id":32765596,"name":"18.00 europe  hoth","price":18.0,"sold_out":false,"has_custom_price":true},{"id":34299771,"name":"20.00 world hoth","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121476417/-/historyofthehawkcoverlp.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121476417/-/historyofthehawkcoverlp.jpg","width":300,"height":300},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124645740/-/WLTP.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124645740/-/WLTP.jpg","width":500,"height":502},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523160/-/hothout.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523160/-/hothout.jpg","width":225,"height":225},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121471467/-/historyofthehawksleeves.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121471467/-/historyofthehawksleeves.jpg","width":604,"height":453}],"artists":[],"categories":[]},{"id":10384450,"name":"Super mutant- grave steps Translucent \"Tasting Blood\" Red Vinyl","permalink":"super-mutant","position":99,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/super-mutant","status":"active","on_sale":true,"created_at":"2013-04-06T16:04:01.000Z","description":"Thunderous Creative Stereo Destroying Technical  Power violence With Shades of Sensibility Tuneage Buried Deep With in The Grooves\r\n1-Hole\r\n2-Tasting Blood\r\n3-Grave Steps \r\n4-Polarized\r\n5-...And Gnashing \r\nwww.supermutant.bandcamp.com \r\n13.34 in Total Florida Attacks <a href=\"https://supermutant.bandcamp.com/\">here</a>","options":[{"id":32519752,"name":"4.00 postpaid england","price":4.0,"sold_out":false,"has_custom_price":false},{"id":32764627,"name":"6.00 postpaid world","price":6.0,"sold_out":false,"has_custom_price":true},{"id":32764630,"name":"15.00 postpaid uk test press","price":15.0,"sold_out":false,"has_custom_price":true},{"id":32764633,"name":"20.00 postpaid world test press","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/111292137/-/supermutantbigcartel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/111292137/-/supermutantbigcartel.jpg","width":504,"height":504},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124295604/-/supermutantredlables.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124295604/-/supermutantredlables.jpeg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121475007/-/preorderstamp.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121475007/-/preorderstamp.jpg","width":274,"height":184},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523127/-/sm.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523127/-/sm.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124295640/-/supermutantbackart.jpeg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124295640/-/supermutantbackart.jpeg","width":600,"height":605}],"artists":[],"categories":[{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"}]},{"id":10384444,"name":"machinist! blacklist 16th birthday speedowax press 7 inch vinyl","permalink":"chestnut-road","position":100,"price":4.0,"default_price":4.0,"tax":0.0,"url":"/product/chestnut-road","status":"active","on_sale":true,"created_at":"2013-04-06T16:03:25.000Z","description":"The first of a series of mega limited edition records to celebrate 16 years of running a non profit punk hardcore lable we present Machinist! playing fast heavy hardcore in the vein of Weekend Nachos,Ceremony and Harms way \r\n1-keys\r\n2-of my tongue\r\n3-tusk and teeth\r\n4-teen wolf \r\n5-prayed upon It’s not long into Machinist!’s Black List EP that you start to feel a warm nostalgia wash over you, like when you’re shopping for food supplies and find a box of cereal you thought they’d stopped selling, or when you glimpse a dusty Street Fighter II Turbo cab in a cinema. This is a throwback hardcore EP that channels the proper roots of the genre. No arbitrary clean singing, no slow interludes with a 1950’s film sample, just 7 minutes of cutthroat riffs, raw production and one hell of a message.\r\n\r\nIndeed, vocalist Jeff Hill says what he means and means what he says. It’s easy for a lot of hardcore bands to lose their direction in the midst of a furious blast beat or wave of distortion, but Black List is an EP built on lyrical content, ranging from mortality to the abuse of power over the course of its five short tracks. Like Modern Life is War’s seminal Witness LP, you find yourself drawn into what is being said, and invariably agreeing, or at least relating. \r\n\r\nOn the production side, everything fits well into the mix. Kenny Gill has generally given all the instruments their time to shine, without cancelling each other out. The riffs are clear, the drums pound in the back, and the vocals stay prevalent throughout. Perhaps the bass could be upped a notch, but whatever. A lot of modern releases tend to end up with a washed out sound, or even worse, an overly synthetic sound. Black List is a solid balance between clarity and sincerity. \r\n\r\nSo, there you have it. Georgia’s Machinist! have administered a highly enjoyable dose of ‘old school’ hardcore. If you’re into stuff like Ceremony and Trash Talk, check out Machinist! If you’re not, check out Machinist!\r\n\r\n\r\n8 copies left as of 7/10/13","options":[{"id":32764813,"name":"4.00  postage included u.k","price":4.0,"sold_out":false,"has_custom_price":false},{"id":37796517,"name":"6.50 postage included world","price":6.5,"sold_out":false,"has_custom_price":true},{"id":37796520,"name":"20.00 test press world postage","price":20.0,"sold_out":false,"has_custom_price":true},{"id":37796523,"name":"20.00 test press world","price":20.0,"sold_out":false,"has_custom_price":true},{"id":37796526,"name":"20.00 package deal 6 pack postpaid","price":20.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124645551/-/Machinist0007.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124645551/-/Machinist0007.jpg","width":600,"height":617},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124645554/-/Machinist0012.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124645554/-/Machinist0012.jpg","width":600,"height":600},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121523142/-/ash.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121523142/-/ash.jpg","width":604,"height":453},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/121476396/-/mach.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/121476396/-/mach.jpg","width":315,"height":315},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/124645593/-/Machinist0010.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/124645593/-/Machinist0010.jpg","width":600,"height":617}],"artists":[],"categories":[{"id":5792928,"name":"speedowax shipping now","permalink":"speedowax-shipping-now","url":"/category/speedowax-shipping-now"}]}]