[{"id":7861953,"name":"Girls of Moscow / Boys of Moscow","permalink":"girls-of-moscow-boys-of-moscow","position":2,"price":14.95,"default_price":14.95,"tax":0.0,"url":"/product/girls-of-moscow-boys-of-moscow","status":"active","on_sale":true,"created_at":"2012-11-06T21:31:35.000Z","description":"Two books for the price of one! Girls of Moscow one side, Boys of Moscow the other, with the two meeting in the middle. Each side gives a frank photographic appraisal of Moscow’s youth by the Russian photographers, Elena Rostunova and Alexei Platonov. The book is filled with the faces of students, street urchins, gangsters, models, actors, shop assistants, socialites, office workers and army cadets. Set against a backdrop of imposing and often bleak Moscow cityscapes, we glimpse a place where everything, yet nothing, seems possible. One where youthful faces tell the story of their parents’ Soviet past, and their own current hunger for Western ideals. We view a portrait of youth, whose futures are written within a landscape of political unease. Yet this is a portrait of youth, and we cannot escape its physicality: proud (or shy), compelling, flirtatious, unadorned, innocent, but often with a sexual energy that is never far from the surface.\r\n\r\nBoys of Moscow has an introduction by Aliona Doletskaya. An iconic figure both in her native Russia and throughout the fashion world, Aliona was long time Editor-in-chief of Russian Vogue, and is now at the helm of Russian Interview. Girls of Moscow has an insightful Western take on the female Muscovite and is written by Shaun Walker, Moscow correspondent of The Independent.","options":[{"id":24816120,"name":"Default","price":14.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.8,"amount_with_others":1.8,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":4.5,"amount_with_others":3.25}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/85741025/-/capri_moscow_book_imagesml.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/85741025/-/capri_moscow_book_imagesml.jpg","width":591,"height":591},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/85741469/-/IMG_0728bsml2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/85741469/-/IMG_0728bsml2.jpg","width":525,"height":787},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/85741541/-/IMG_5136bsml2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/85741541/-/IMG_5136bsml2.jpg","width":518,"height":787}],"artists":[],"categories":[]}]