[{"id":5413109,"name":"Freerange Vol.4: Almost Home","permalink":"freerange-vol-4-almost-home","position":1,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/freerange-vol-4-almost-home","status":"active","on_sale":false,"created_at":"2012-02-07T02:36:37.000Z","description":"“What is the use of a house if you haven't got a tolerable planet to put it on?”\r\nHenry Thoreau, 20 May, 1860. \r\n\r\nThe concept of home is more complex now than it has ever been before.  It is so many things: a house, a place, a country, an idea, a memory, a feeling of comfort or familiarity, a group or population of people.  It is a place where you belong, a place you can return to, a place where you’ve settled. It is a lot of places. It might not even be a place at all. \r\n\r\nIn this issue, our contributors explore home – as a place and a sense -  by literally climbing their local landmarks, by poking around the concept of shelter as a human right, by questioning our cultural interpretations, and more. Some of these enquiries seem timeless, stretching back to before humans were even humans, others are very much topical, predicaments of the 21st Century.\r\n\r\nUltimately home is the whole planet, the universe and beyond. We share our home with billions of other humans, and billions upon billions of other species. As we “make ourselves at home” here, let’s not forget we’re not the only ones. Maybe it is best for everyone if we remain always and evermore “almost home.”\r\n\r\nFeaturing: \r\n\r\nUnsettlement in the 21st Century by Hana Bojangles.\r\nHome Is a Time Not a Place/Make Yourself at Home by Barnaby Bennett. \r\nGoing... gone: Kiribati and The Hungry Tide by Tania Leimbach.\r\nColor Me English: Migration and Belonging Before and After 9/11 by Minna Ninova.  \r\nGriha and Graha: Where Do We Belong, Where Is Our Home? by Raj Sahai. \r\nHomebody by Claire Hollingsworth.. \r\nRaise the Earth; Returning Home, Quietly. Ross T. Smith. \r\nHome in the Driveway By Ruby Usa\r\nClimbing Inside the Giant by Elizabeth Rush\r\nAlmost Home by Ben Brown.\r\nIllustrations by Shakey Mo.\r\nThe Lambess Family. Photography by Noel Meek. \r\n\"The Right to a Home\". A Human Rights Perspective on Forced Migration by Joe Cederwall, \r\nPhotography by  Alexandra Clark \r\n\r\nEdited by Barnaby Bennett, Gina Moss, Kate Shuttleworth, Em Hollosy  \r\nDesign by Irina Belova","options":[{"id":17478187,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":3.0,"country":{"id":31,"name":"New Zealand","code":"NZ"}},{"amount_alone":10.0,"amount_with_others":12.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/53162387/-/Free_Range4_AlmostHome_001.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/53162387/-/Free_Range4_AlmostHome_001.jpg","width":698,"height":1000}],"artists":[],"categories":[{"id":1214951,"name":"Magazine","permalink":"magazine","url":"/category/magazine"},{"id":1214961,"name":"Book","permalink":"book","url":"/category/book"}]},{"id":4106911,"name":"Chur Chur: Stories from the Christchurch Earthquake","permalink":"chur-chur-stories-from-the-christchurch-earthquake","position":2,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/chur-chur-stories-from-the-christchurch-earthquake","status":"active","on_sale":false,"created_at":"2011-07-18T06:19:07.000Z","description":"On the 22nd February 2011 the people of Christchurch experienced  the most destructive earthquake in New Zealand’s young recorded  history. It was the third large earthquake to hit the region in the past six months, the first being a 7.1 earthquake on the 4th September 2010. 182 people have died, thousands are homeless, scores of buildings have been destroyed, and the central city is still closed to the public. This special issue of Freerange is a window into the experiences of some who are affected.\r\n\r\n“Many people are still homeless and jobless, and some have lost loved ones. I can get my head around the physical damage that Christchurch has sustained, but the emotional I find hard to understand.  I wish I could assure my friends that it will be over soon… but it won’t. I can’t relate to their trauma and shock, to the stress they are living in, and I can’t share their burden of a life so changed by one event. But I can listen to their stories and I hope that helps. That is what this special edition of Freerange is about. Let’s listen, it’s the least we can do.”\r\n\r\nGina Moss\r\n\r\nAll proceeds from the sale of this book go to a school rebuilding project that Architecture for Humanity are doing in Christchurch.","options":[{"id":13584939,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":6.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":2.0,"amount_with_others":3.0,"country":{"id":31,"name":"New Zealand","code":"NZ"}},{"amount_alone":9.0,"amount_with_others":9.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40105543/-/CHCH_covers_forweb.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40105543/-/CHCH_covers_forweb.jpg","width":706,"height":1000}],"artists":[],"categories":[{"id":1214951,"name":"Magazine","permalink":"magazine","url":"/category/magazine"},{"id":1214961,"name":"Book","permalink":"book","url":"/category/book"}]},{"id":3728452,"name":"Freerange Vol.3: The Trickster","permalink":"freerange-vol-3-the-trickster","position":3,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/freerange-vol-3-the-trickster","status":"active","on_sale":false,"created_at":"2011-05-10T10:10:29.000Z","description":"At Freerange, tricksters and their many guises intrigue us. From the ancient Greek Odysseus to Roald Dahl’s Fantastic Mr. Fox, we grew up on stories of subversive characters that sprinkle chaos into our ordered society. The stories of our wise and brutal ancestors tell us tales of events from long before we laid our bare feet upon the earth. Folklore, mythology and religion are filled with brilliant forces of light and dark, played out by a myriad of colourful characters including that of the trickster. Most cultures still have these characters, both real and fictional. They are the mischievous rule breakers, artful swindlers, punks and independent outlaws. They hold an important purpose: to push boundaries, to enter realms others are afraid of, to stir the waters, provoke thought and discussion, to speak truth to power. Featuring writing by: Hana Bojangles, Minna Ninova, Warwick McCallum, Joe Cederwall, Claire Hollingsworth, Micaela Sahar, Gina Moss, Toby Huddlestone, Byron Kinnaird, Shalimma R, Joseph Tipa, Rozzy Middleton, Federico Monsalve, Greta Gillies, Mathew Landers, Anne Marie Vennel.","options":[{"id":12490430,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":3.0,"country":{"id":31,"name":"New Zealand","code":"NZ"}},{"amount_alone":5.0,"amount_with_others":9.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36312086/-/FR3_coverimage.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36312086/-/FR3_coverimage.jpg","width":392,"height":567}],"artists":[],"categories":[{"id":1214951,"name":"Magazine","permalink":"magazine","url":"/category/magazine"},{"id":1214961,"name":"Book","permalink":"book","url":"/category/book"}]},{"id":2109521,"name":"Freerange Vol. 2: Violence and Gardening","permalink":"freerange-vol-2-violence-and-gardening","position":4,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/freerange-vol-2-violence-and-gardening","status":"active","on_sale":true,"created_at":"2010-03-26T08:31:50.000Z","description":"This is the second small step in Freerange’s mission to gather, develop, and conceptualise contemporary wisdoms, to continue the project of re-discovering meaning and purpose in our multi-faceted time. As much as we may love them, Freerange is not really about chickens and pirates, it is about developing wisdom. It is not widely appreciated how fundamentally radical the time we live in is. The post-WWII world has seen a phenomenal growth in the accessibility of human knowledge. From the depths of a jungled Sri Lanka to the deserts of the Middle East we can now access many of the world great knowledge sources more easily than ever before.\r\n\r\n    Intellectually, emotionally, culturally and spiritually we cannot be anything but a reflection of the world we exist in. The contemporary exchange of knowledge has changed the world we now live in and it is one that is vastly different to that experienced by our ancestors, as their world was to their ancestors. We need to start plotting a route through the competing truths of today. Our suggestion is that we become pirates not privateers, neutral angels not cowboys, intellectual probes not ideologues, fly-by-nighters, crepuscular raiders, freerange chickens, foxes not hedgehogs. When Lucifer fell out from heaven he was assisted by the seldom-mentioned neutral angels, a group that sits in the space between the absolutes of ideology and anarchy. We have the freewill to act strategically, make moral judgments, change our minds, make mistakes, create ambiguity, culture jam, exist in geographies of subversion, outwit and cunningly create.\r\n","options":[{"id":7628261,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":3.0,"country":{"id":31,"name":"New Zealand","code":"NZ"}},{"amount_alone":5.0,"amount_with_others":9.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/20205911/-/Front_Cover_Freerange_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/20205911/-/Front_Cover_Freerange_2.jpg","width":472,"height":668}],"artists":[],"categories":[{"id":1214951,"name":"Magazine","permalink":"magazine","url":"/category/magazine"},{"id":1214961,"name":"Book","permalink":"book","url":"/category/book"}]},{"id":1977801,"name":"Freerange Vol. 1: The Self and the City","permalink":"freerange-vol-1-the-self-and-the-city","position":5,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/freerange-vol-1-the-self-and-the-city","status":"active","on_sale":true,"created_at":"2010-03-16T10:07:00.000Z","description":"Freerange is the published workings of a large and diverse group of people aiming to create some critical reflections on our respective places in the world. ‘This process will take place over a dozen editions which will evolve and develop ovcr the coming months and years. We start with a theme that tackles subjects both the large and personal. The Self and the City,  two uncompromising and seemingly  incomprehensibly complex issues.\r\n\r\nThe city, in all its glorious forms, has now become the dominant form of human habitation, and the ’self’ as progressively redefined in the 20th Century has become the fundamental instrument for measuring human consciousness. It is often quoted that 2007 marked first time in human history that more humans lived in urban conditions than elsewhere. Our current abilities of comprehension characterised by divisions of knowledge into discrete disciplines, is unable to grasp the awesome complexity of the city and its explosive mix of contradictory human desires and needs. To even discuss the concept of the city is problematic as it implies a set accepted of definitions or ideas that apply to all humans in urban conditions.\r\n\r\nFreerange issue #1 contains NEW writings about the city:\r\nThe Hungry City by Tigilau Saili,\r\nIndigenous Urban Realities by Ripeka Walker,\r\nUrbino by Rajarshi Sahai,\r\nNesting in the City by Dale Fincham,\r\nVanity and Urbanity by Felicity Morris,\r\nHome, Space and Virtuality by Sally Ogle,\r\nDialogue on Street Theatre by Noel Meek,\r\nFollow your Heart by Mark Kingsley,\r\nand old writing with pretty Koolages by Rem Koolhaas . ","options":[{"id":7195761,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.0,"amount_with_others":3.0,"country":{"id":31,"name":"New Zealand","code":"NZ"}},{"amount_alone":5.0,"amount_with_others":9.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/18927611/-/freerange_001_theselfandthecity-cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/18927611/-/freerange_001_theselfandthecity-cover.jpg","width":787,"height":554}],"artists":[],"categories":[{"id":1214951,"name":"Magazine","permalink":"magazine","url":"/category/magazine"}]}]