[{"id":5522885,"name":"Coral Discs on Silver","permalink":"coral-discs-on-silver","position":1,"price":59.0,"default_price":59.0,"tax":0.0,"url":"/product/coral-discs-on-silver","status":"active","on_sale":false,"created_at":"2012-02-22T04:48:01.000Z","description":"Richest red bamboo coral discs are polished to a high shine that makes then the perfect companion for the gleaming sterling components.\r\nStacked bamboo coral are separated by tiny stamped Karen Hill tribal beads and dangle from beneath decorative half moon sterling posts. The coral has the appearance of an expensive stone and yet still keeps the organic feel with their chunky asymmetrical shapes. Although they are sanded and polished, the coral is a natural organism and does include some slight markings. I have chosen the purest pieces for this design with the natural inclusions being extremely minimal while still adding a uniqueness to the earrings.\r\n\r\nLength 1 1/4 inches from the post to the tip of the granulated disc on bottom. Of course all components are sterling silver.\r\n\r\nE-310","options":[{"id":17797097,"name":"Default","price":59.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/54219455/-/E-310_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/54219455/-/E-310_1.jpg","width":851,"height":948}],"artists":[],"categories":[]},{"id":5522871,"name":"Blue Hunger","permalink":"blue-hunger","position":2,"price":85.0,"default_price":85.0,"tax":0.0,"url":"/product/blue-hunger","status":"active","on_sale":false,"created_at":"2012-02-22T04:46:05.000Z","description":"There are certain things we feel to be beautiful and good, and we must hunger after them. How can we ever be satisfied without them until our feelings are deadened?\" George Eliot\r\nA definite satisfaction is found when wearing this bracelet. The flawless lampwork compliments the beauty of the natural stones while the sterling brings a sophisticated brightness to the piece.\r\n\r\nComponents: Etched matte lampwork pillows with blue/aqua designs on white base. Blue quartz pillows in opaque to translucent sky blue and aqua, are capped in sterling. Swarovski crystal and faceted blue quartz rondelles. Swarovski crystal and Hill Tribe flower charm dangles. All findings sterling. Ornate wire rectangular toggle clasp from Bali.\r\n\r\nLength 7inches. best fit 6 inch wrist.\r\n\r\nB-289","options":[{"id":17797057,"name":"Default","price":85.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/54219335/-/B-289_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/54219335/-/B-289_1.jpg","width":988,"height":1000}],"artists":[],"categories":[]},{"id":4247627,"name":"Treasure Hunt","permalink":"treasure-hunt","position":3,"price":135.0,"default_price":135.0,"tax":0.0,"url":"/product/treasure-hunt","status":"active","on_sale":false,"created_at":"2011-08-12T18:48:53.000Z","description":"Pearls, as bronze as skin in summer, adorn your neckline and hold a pendant that reveals striking color.\r\n\r\nThis lampwork pendant by noted glass artist Trey Cornette, is a real find. Matte oval with a bright yellow base, it is decorated with swirls of turquoise edged in brown and accented with more turquoise spots.\r\n\r\nThe 'chain' of top drilled fresh water pearls is in a delicious chocolaty bronze. Each pearl has a wonderful sheen that gives off varying shades of color as the light hits it.\r\n\r\nLength is 16 inches with a 2 inch extender. Closure is with an antiqued copper lobster clasp.\r\n\r\nAll artisan jewelry is not created equal. Alameda Studios provides quality and originality in wearable art that feels as good to look at as it does to wear. The difference is in the details.","options":[{"id":13996537,"name":"Default","price":135.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41526705/-/N-120-135__1_.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41526705/-/N-120-135__1_.JPG","width":722,"height":800}],"artists":[],"categories":[]},{"id":2799464,"name":"Otherwordly Love","permalink":"otherwordly-love","position":4,"price":82.0,"default_price":82.0,"tax":0.0,"url":"/product/otherwordly-love","status":"active","on_sale":false,"created_at":"2010-10-13T21:23:48.000Z","description":"The contrast between the gleaming and the natural create an exceptional bracelet. Shining hand torched glass art beads, discs and smooth black onyx are presented in stark contrast to the earthy, matte lampwork focal bead and the natural lava stone. The metals are predominantly sterling, with some brass and copper accents that contrast nicely and help bring the piece together for a decidedly otherworldly look.\r\n\r\nA heart shaped toggle of textured sterling from the Hill Tribes of Thailand provides closure. Charm dangles of fresh water pearls in bronze and pink adorn the bracelet ends.\r\n\r\nCurrently it is 7 1/2 inches long, this bracelet may be custom fit for you at no additional cost.\r\n\r\nB-261","options":[{"id":9803121,"name":"Default","price":82.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27079194/-/B-261_82.JPG","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27079194/-/B-261_82.JPG","width":610,"height":703}],"artists":[],"categories":[]},{"id":2799472,"name":"PureMagic","permalink":"puremagic","position":5,"price":78.0,"default_price":78.0,"tax":0.0,"url":"/product/puremagic","status":"active","on_sale":false,"created_at":"2010-10-13T21:28:04.000Z","description":"This Brazillian Oco Geode pendant has been honed, polished and edged in sterling silver transforming a simple stone into a glittering jewel with a middle that reveals glistening tiny quartz crystals called druzy. These crystals form within a stone when ground water carrying dissolved silica is forced into a porous area of the rock. After a period of rapid cooling, the clear crystals form in the rock cavities providing you with a shimmering jewel to use for adornment. \r\n\r\nThe pendant is strung on a sturdy handcrafted Hill Tribe rollo chain (sterling), and measures 21 inches long.\r\n\r\nClosure is with a large sterling, rectangle lobster claw clasp.\r\n\r\nItem ID: N-140 \r\n","options":[{"id":9803135,"name":"Default","price":78.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27079274/-/N-138.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27079274/-/N-138.jpg","width":1000,"height":779}],"artists":[],"categories":[]}]