[{"id":690511,"name":"SORTED! book","permalink":"sorted-book","position":1,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/sorted-book","status":"active","on_sale":false,"created_at":"2009-11-22T02:23:21.000Z","description":"$20.00 plus 10% GST and shipping\r\n\r\nThe ultimate guide to organising your life - once and for all\r\n\r\nLissanne's bestselling book contains 42 organising 'recipes' covering everything from work and paper to on the go and living. With over 250 organising tips this practical and inspiring book will solve your organising woes for just $20.\r\n\r\nIt’s so popular, it’s been translated into 4 languages and reprinted many times.  It's also been nominated for an international award for  \"exhibiting organising principles in an entertaining and informative manner.\"\r\n\r\nAll books are signed by Lissanne for the purchaser unless you tell us otherwise. If you have multiple books on order, or your purchase is a gift, please let us know in the \"add special instructions to merchant\" in the \"review your payment\" screen (after you have entered your credit card.\r\n\r\n<b>Feedback</b>\r\n<i>This is a fantastic little 'bible' for getting your life into order in the most literal sense. It's easy to read, can be used as a reference for looking at one topic at a time, has a sense of humour and reality, and touches on the psychology of mess and organisation. Very timely for me and really changed my approach to a lot of things. Thanks Lissanne! I also subscribe to her blog and newsletter, which is really worthwhile.\r\n</i>June girl 66 (via Shelfari)\r\n\r\n<i>SORTED is one of my favourite organizing books I own, I have read this many times and it is always useful and has lots of good ideas and advice.</i>\r\nMichelle K (via Shelfari)\r\n\r\n<i>I feel like my best friend has come over to my house, held my hand and said “it’s going to be alright, we can do this together”.</i>\r\nRaquel\r\n\r\n<i>Received my copy of your book SUPER fast after I ordered it and I have to say - it's brilliant! I've already implemented a couple of the recipes and read it cover to cover. It's concise, to the point and very user friendly. Well done Lissanne and thanks again - as a full time working mother with a family of four and elderly parents to assist on a regular basis I am extremely time poor but now I can actually see some light at the end of my tunnel and it's not a train!! </i>\r\nDeb S \r\n\r\n<i>I most certainly found your book a lifesaver!  I have read it cover to cover and refer to it regularly on my sorting journey. So far I have sorted my home office (which involved FILLING a council bin with recycling!!!), my kitchen & bathroom cupboards and my baby's nursery. Slowly but surely getting there!  My husband thinks I am highly amusing as my new favourite phrase is \"visual clarity\".\r\n\r\n<i>So thank you so much for your inspirational book - there are so many resources out there on getting organised but a lot of them just make you feel guilty for being disorganised - whereas yours was completely empowering. Cheers!</i>\r\nMelanie\r\n\r\n<i>Dearest Lissanne\r\nYou are an absolute angel! Thank you thank you thank you thank you for that writing that book.... I have read it from cover and to cover...and have STARTED! So far, I've gone through all my financial paperwork and personal important documents (like bank statements, super, motor vehicle receipts, etc) and have thrown out... (wait for it....) 3 plastic bags of unnecessary documents! Included in all that, are all the cards, letters and notes I've received for the past 10 years, that I've hoarded around for nothing...\r\n\r\nNow all my documents have dwindled down to two small folders worth of documents. I've started to de-clutter everything from beauty products to shoe collection! \r\n\r\nAgain....THANK YOU THANK YOU THANK YOU. I've recommended your book to all my friends, and even my boyfriend has started becoming more organized at work! We work together, and he spent a record 40 minutes yesterday de-cluttering his desk and removed papers from there that date back to May!  You are amazing! Keep up the good work.  </i>\r\n</i>Ruth F / ACCOUNTANT\r\n\r\n<i>I was browsing through my books earlier and came across one of my favourites: ‘Sorted’, by Lissanne Oliver! I bought it when it was first released and it was one of the few self-help books I have ever a) read from cover to cover, b) followed advice from and c) kept. \"</i>\r\n\r\n<i>I love 'sorted' It has helped me.</i>\r\nHelen Warman","options":[{"id":9793795,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":4.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":15.0,"amount_with_others":12.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41699847/-/sorted_book_bestseller.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41699847/-/sorted_book_bestseller.jpg","width":256,"height":320}],"artists":[],"categories":[{"id":474591,"name":"Books","permalink":"books","url":"/category/books"},{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"}]},{"id":5044779,"name":"Organising comic books - Set of 6","permalink":"set-of-6-organising-comics-printed","position":2,"price":30.0,"default_price":30.0,"tax":0.0,"url":"/product/set-of-6-organising-comics-printed","status":"active","on_sale":false,"created_at":"2011-12-09T16:37:42.000Z","description":"Score the entire set of 6 comic books by bestselling author Lissanne Oliver \r\n\r\n$30.00 plus 10% GST and shipping\r\n\r\n<b>#1 - LIAM RUNS LATE</b>\r\nLiam runs late - more than once. He's in trouble! Liam needs to lean to prioritise so he can balance his wants and needs. How does this 12 year old fix the problem? Read the comic to find out!\r\nChallenge: Prioritising\r\nLesson: want versus need\r\n \r\n<b>#2 - STEF AND HER STUFF</b>\r\nChallenge: too much stuff\r\nLesson: How much is enough?\r\nStef has a problem with too much stuff. This funky 15 year old loves to shop and she's very creative, so she really needs all those resources. But Stef comes undone... the impact of all that stuff is costing her.\r\n\r\n<b>#3 - LOLA LOSES IT</b>\r\nChallenge: a tidy bedroom\r\nLesson: Have a plan\r\n7 year old Lola needs to tidy her room. But it all seems too hard! She doesn't know where to start! She tries to sort things out... but then she completely loses it. She would really rather watch TV.\r\n\r\n<b>#4 - LUKE GETS LOST</b>\r\nChallenge: laziness\r\nLesson: a little work now for a lotta lazy later on!\r\nLuke is super lazy, and like many 9 year old kids, he’d rather read, play games and avoid anything resembling work. Luke doesn’t think it’s a big deal, until something goes horribly wrong. \r\n\r\n<b>#5 - CATHERINE CATCHING UP</b>\r\nName: Catherine\r\nChallenge: drowning in detail\r\nLesson: perfect is hard work\r\nCatherine needs to catch up – she’s has a lot on her plate and is behind in everything.  Easily lost in the detail, this 14 year old perfectionist crams a lot onto her to do list – everything seems important. How does Catherine keep the balance & find time for her.\r\n \r\n<b>#6 - KIMI AND HER CLUTTER</b>\r\nChallenge: Clutter\r\nLesson: Define it, Deal with it\r\nKimi is only 9 years old but she keeps EVERYTHING.  It's starting to affect her concentration and she's a bit overwhelmed by her clutter. But what is clutter exactly? How can she deal with it if she doesn't understand what it is and how to get rid of it?\r\nRead about her journey and discover some tips along the way.\r\n\r\nNEW! This is the entire series of organising comics from bestselling author Lissanne Oliver.\r\n\r\n<b>FEATURES:</b>\r\n\r\n•content rich\r\n•easy to digest\r\n•includes learning outcomes\r\n•includes worksheets\r\n•visually rich\r\n•professional artists illustrations\r\n•stories based on real kids/teens\r\n\r\nOrganising is a valuable life skill that underpins success. These books will help you in your journey, and are a valuable teaching aid.\r\n\r\nEach comics is 16 pages, printed on recycled stock with a 150gms cover, saddle stitched, finished size A5.\r\n\r\n<b>REVIEWS</b>\r\n\r\n\"Really great. One comic made me switch off the Telly and spend 30min organising myself ;) \"organisationally challenged apartment owner\r\n\r\n\"A great resource\" primary school teacher\r\n\r\n\"Brilliant tips I can use and stories the kids relate to\" busy mum of three\r\n\r\n\"A fantastic resource that you can revisit.\" Working mum of two boys under 7\r\n\r\n\r\n\r\nWhen you're ready to purchase, click \"add to cart\" at the bottom of this page.\r\n","options":[{"id":19422691,"name":"Default","price":30.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":10.0,"amount_with_others":7.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125929485/-/sorted_comics.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125929485/-/sorted_comics.png","width":267,"height":379},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/59719279/-/reading.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/59719279/-/reading.jpg","width":640,"height":519},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/125929503/-/Stef_Decluttering.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/125929503/-/Stef_Decluttering.jpg","width":269,"height":313}],"artists":[],"categories":[{"id":474591,"name":"Books","permalink":"books","url":"/category/books"},{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":1622043,"name":"kids/teens","permalink":"kids-teens","url":"/category/kids-teens"}]},{"id":2798210,"name":"Lessons in Letting Go: Confessions of a Hoarder","permalink":"lessons-in-letting-go","position":3,"price":22.0,"default_price":22.0,"tax":0.0,"url":"/product/lessons-in-letting-go","status":"active","on_sale":false,"created_at":"2010-10-13T05:05:48.000Z","description":"On sale for $22, normally $27\r\n\r\nWe love this book and you will too.  Check out our interview with Corinne at http://blog.sorted.net.au/2010/09/27/lessons-in-letting-go-confessions-of-a-hoarder/\r\n\r\n$27.00 plus 10% GST and shipping\r\nPaperback, 248 pages\r\n\r\nA funny, appealing and big-hearted memoir of how one of Australia's leading comic talents, Corinne Grant, learned to reconcile love, loss, lack of cupboard space and far too much stuff.\r\n\r\n\"It took a year to drag myself out of the mess. A year in which I lost my dearest friend and then promptly lost my way. A year in which I ran away overseas, came back and then ran away again. A year in which I learnt to let go, learnt to forgive and learnt to grow up. It was a big year. It was a lot of work. And I head-butted two people. Accidentally.\"\r\n\r\nLessons in Letting Go is an honest, uproariously funny and sometimes moving memoir of the year in which Corinne Grant decides to do something about her hoarding. From every scrunchie she's ever owned, to every pencil case and magazine, it's time for it all to go. Problem is, getting rid of the stuff turns out to be much harder than she initially thought.\r\n\r\nThis delightful memoir is about hoarding and about how the things we hold on to can end up dictating our lives. Warm, funny, candid and insightful, Lessons in Letting Go is about the pain - but also the necessity and the joy - in learning to let go.\r\n\r\nAbout Corinne Grant\r\n\r\nCorinne got her start in TV as a regular Good News Week panellist in 1999 but her first full time TV gig was as one of the original members of Rove. In 2001 she took on a second job on ABC's The Glasshouse until it wrapped in 2006. Corinne is an accomplished stand-up, MC, presenter, writer and broadcaster and has performed both nationally and internationally. She has also appeared on everything from Spicks and Specks to Dancing With The Stars to Good News Week. She has co-hosted successful national radio shows, performed countless solo live shows and appeared everywhere from the Sydney Opera House to the Kalgoorlie Arts Centre. Her natural, down-to-earth charm and her quick wit have made her one of Australia's best known, and most warmly regarded, performers.","options":[{"id":9799352,"name":"Default","price":22.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.0,"amount_with_others":4.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":20.0,"amount_with_others":15.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27066558/-/Lessons_in_letting_go.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27066558/-/Lessons_in_letting_go.jpg","width":194,"height":297}],"artists":[],"categories":[{"id":474591,"name":"Books","permalink":"books","url":"/category/books"},{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":1622045,"name":"ON SALE","permalink":"on-sale","url":"/category/on-sale"}]},{"id":732041,"name":"Services","permalink":"services-training","position":4,"price":1.0,"default_price":1.0,"tax":0.0,"url":"/product/services-training","status":"active","on_sale":false,"created_at":"2009-11-25T07:15:32.000Z","description":"Have you used our services?  This is where you can pay your account by credit card.\r\n\r\nSimply specify how many dollars in the quantity box - eg if our fee is $240.00 (ex GST) the quantity is \"240\".  10% GST will then be calculated for you before your final payment is confirmed.\r\n\r\nThank you for your business!\r\n","options":[{"id":2809631,"name":"Services","price":1.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/6576821/-/Team_SORTED.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/6576821/-/Team_SORTED.jpg","width":319,"height":214}],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"}]},{"id":4876341,"name":"Gift Vouchers","permalink":"gift-vouchers","position":5,"price":1.0,"default_price":1.0,"tax":0.0,"url":"/product/gift-vouchers","status":"active","on_sale":false,"created_at":"2011-11-18T10:11:14.000Z","description":"Would you like to give or receive our services?  You can do that, right here!\r\n\r\nYou can purchase any amount you like, from $1 upwards.\r\n\r\nSimply specify how many dollars you would like in the quantity box.  10% GST will then be added at checkout before your final payment is confirmed.  \r\n\r\nYour gift voucher will be posted direct to the purchaser so you can pass it onto the lucky recipient.\r\n\r\nThank you for your business!\r\n","options":[{"id":15886967,"name":"Default","price":1.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48710567/-/Picture_4.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48710567/-/Picture_4.png","width":1000,"height":450}],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"}]},{"id":3387270,"name":"Professional Organiser Training - Unit 1 Consult with Confidence","permalink":"professional-organiser-training-2011","position":6,"price":1.0,"default_price":1.0,"tax":0.0,"url":"/product/professional-organiser-training-2011","status":"active","on_sale":false,"created_at":"2011-03-07T12:09:35.000Z","description":"All you need to succeed!\r\n\r\nThis full day intensive is held in Melbourne, Victoria, Australia, four times a year. Please contact us for all content, learning outcomes, delivery information and registration form.\r\n\r\nThis class offers different prices depending on if you score the early bird discount or not! You can save 20% off the full price (please contact us for full details). To purchase:\r\n\r\n1.  Please press \"add to cart\"\r\n\r\n2.  Then specify how many dollars in the quantity box EXCLUDING GST eg if our fee is $960 (including GST) the quantity is \"873\"\r\n\r\n3. The press \"proceed to checkout\"\r\n\r\n10% GST will automatically be added at checkout before your final payment is confirmed.","options":[{"id":48738570,"name":"Friday February 28th 2014","price":1.0,"sold_out":false,"has_custom_price":false},{"id":48738573,"name":"Friday May 16th 2014","price":1.0,"sold_out":false,"has_custom_price":false},{"id":48738576,"name":"Friday August 29th 2014","price":1.0,"sold_out":false,"has_custom_price":false},{"id":48738579,"name":"Friday November 28th 2014","price":1.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/39548619/-/All_you_need.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/39548619/-/All_you_need.jpg","width":212,"height":225}],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":2445403,"name":"Workshops/Training","permalink":"workshops-training","url":"/category/workshops-training"}]},{"id":15336732,"name":"Professional Organiser Training - Unit 2 So you think you can organise? ","permalink":"unit-2-so-you-think-you-can-organise","position":7,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/unit-2-so-you-think-you-can-organise","status":"active","on_sale":true,"created_at":"2013-12-04T22:56:23.000Z","description":"All you need to succeed!\r\n\r\nCONTENT\r\n\r\nThis one hour class tests your organising mettle so you can deliver better services to your clients. This class shares creative tricks and tips.\r\n\r\nLearning outcomes:\r\n\r\n•test your problem solving skills\r\n•learn creative ways to fix your clients bugbears\r\n•improve your technique.\r\n\r\nDELIVERY\r\n\r\n•Prior to class, you will be sent a PDF handout. \r\n•You will need a computer with Skype installed and working audio (no camera needed). \r\n•You will be able to interact, ask questions, and view the content via your computer.\r\n\r\n20 questions and 20 answers – all delivered on line, many with visual examples.\r\n\r\nThis class offers different prices depending on if you score the early bird discount or not! To qualify for 50% off, you must book and pay at least 1 week in advance of your class date. Please use the discount code EARLY2\r\n\r\n$88 including GST. 10% GST will automatically be added at checkout before your final payment is confirmed. ","options":[{"id":49875828,"name":"Sunday March 2nd@ 8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885152,"name":"Sunday May 18th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885155,"name":"Tuesday September 2nd @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885158,"name":"Tuesday December 2nd @8pm","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":1622045,"name":"ON SALE","permalink":"on-sale","url":"/category/on-sale"},{"id":2445403,"name":"Workshops/Training","permalink":"workshops-training","url":"/category/workshops-training"}]},{"id":15336948,"name":"Professional Organiser Training - Unit 3 PO General Knowledge","permalink":"professional-organiser-training-unit-3-po-general-knowledge","position":8,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/professional-organiser-training-unit-3-po-general-knowledge","status":"active","on_sale":true,"created_at":"2013-12-04T23:03:00.000Z","description":"All you need to succeed!\r\n\r\nCONTENT\r\n\r\nThis one hour class tests your organising mettle so you can deliver better services to your clients. This class shares creative tricks and tips.\r\n\r\nLearning outcomes:\r\n\r\n•test your problem solving skills\r\n•learn creative ways to fix your clients bugbears\r\n•improve your technique.\r\n\r\n20 questions and 20 answers – all delivered on line, many with visual examples.\r\n\r\nDELIVERY\r\n\r\n•Prior to class, you will be sent a PDF handout.\r\n•You will need a computer with Skype installed and working audio (no camera needed).\r\n•You will be able to interact, ask questions, and view the content via your computer.\r\n\r\nThis class offers different prices depending on if you score the early bird discount or not!  To qualify for 50% off, you must book and pay at least 1 week in advance of your class date. Please use the discount code EARLY3\r\n\r\n$88 including GST. 10% GST will automatically be added at checkout before your final payment is confirmed. ","options":[{"id":49876236,"name":"Monday March 3rd @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885665,"name":"Monday May 19th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885668,"name":"Wednesday September 3rd @ 8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885671,"name":"Wednesday December 3rd @8pm","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":1622045,"name":"ON SALE","permalink":"on-sale","url":"/category/on-sale"},{"id":2445403,"name":"Workshops/Training","permalink":"workshops-training","url":"/category/workshops-training"}]},{"id":15336999,"name":"Professional Organiser Training - Unit 4 Dear Lissanne","permalink":"professional-organiser-training-unit-4-dear-lissanne","position":9,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/professional-organiser-training-unit-4-dear-lissanne","status":"active","on_sale":true,"created_at":"2013-12-04T23:04:42.000Z","description":"CONTENT\r\n\r\nThis one hour class enables you to unleash your wildest questions! Lissanne will provide answers about what it’s like to work as a Professional Organiser.  Freestyle session, informal, and designed to explore questions in depth if necessary.  Submit your top 3 questions 24 hours prior to the class commencement.\r\n\r\nLearning outcomes:\r\n\r\n•a minimum of 3 questions relating to the Professional Organising industry will be answered and discussed in depth\r\n•learn answers to your most important questions\r\n•feel better equipped to work in the industry.\r\n\r\nDELIVERY\r\n\r\n•Prior to class, you need to email your top 3 questions to SORTED!\r\n•You will need a computer with Skype installed and working audio (no camera needed).\r\n•You will be able to interact, ask questions, and view the content via your computer.\r\n\r\nThis class offers different prices depending on if you score the early bird discount or not!  To qualify for 50% off, you must book and pay at least 1 week in advance of your class date. Please use the discount code EARLY4\r\n\r\n$88 including GST. 10% GST will automatically be added at checkout before your final payment is confirmed. ","options":[{"id":49876353,"name":"Friday March 7th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885362,"name":"Tuesday May 20th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885365,"name":"Thursday September 4th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885368,"name":"Thursday Dececmber 4th @8pm","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":1622045,"name":"ON SALE","permalink":"on-sale","url":"/category/on-sale"},{"id":2445403,"name":"Workshops/Training","permalink":"workshops-training","url":"/category/workshops-training"}]},{"id":15337032,"name":"Professional Organiser Training - Unit 5 Personality Crisis","permalink":"professional-organiser-training-unit-4-personality-crisis","position":10,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/professional-organiser-training-unit-4-personality-crisis","status":"active","on_sale":true,"created_at":"2013-12-04T23:05:17.000Z","description":"All you need to succeed!\r\n\r\nThis one hour class gives you an overview of some common personality types you might encounter working as a Professional Organiser. Five personality types are explored and character traits are discussed.\r\n\r\nLearning outcomes:\r\n\r\n•explore different personality types leaving you better informed to consult with a range of people\r\n•raise awareness of common catch phrases and issues potential clients present with\r\n•be informed and be prepared even if you have little consulting experience.\r\n\r\n\r\nDELIVERY\r\n\r\n•Prior to class, you will be sent a PDF handout.\r\n•You will need a computer with Skype installed and working audio (no camera needed).\r\n•You will be able to interact, ask questions, and view the content via your computer.\r\n\r\nThis class offers different prices depending on if you score the early bird discount or not!  To qualify for 50% off, you must book and pay at least 1 week in advance of your class date. Please use the discount code EARLY5\r\n\r\n$88 including GST. 10% GST will automatically be added at checkout before your final payment is confirmed. ","options":[{"id":49876485,"name":"Wednesday March 5th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885734,"name":"Wednesday May 21st @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885737,"name":"Friday September 5th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885740,"name":"Friday September 5th @8pm","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":1622045,"name":"ON SALE","permalink":"on-sale","url":"/category/on-sale"},{"id":2445403,"name":"Workshops/Training","permalink":"workshops-training","url":"/category/workshops-training"}]},{"id":15337071,"name":"Professional Organiser Training - Unit 6 More Case Studies","permalink":"professional-organiser-training-unit-6-more-case-studies","position":11,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/professional-organiser-training-unit-6-more-case-studies","status":"active","on_sale":true,"created_at":"2013-12-04T23:06:15.000Z","description":"PLEASE NOTE: THIS CLASS IS ONLY AVAILABLE TO GRADUATES OF UNIT 1.\r\n\r\nCONTENT\r\n\r\nCase studies are one of the most popular elements of Unit 1: Consult with Confidence. This is a unique opportunity to put your skills to the test.\r\n\r\nUsing a series of photographs of real life client situations, this one hour class provides you with valuable consulting experience. What’s your strategy in each situation? Apply what you’ve learned in Unit 1 and then find out what really happened on the job and see the after photos. Two case studies are explored in each one hour class. The case studies are designed to put your learning to the test, are challenging and fun.\r\n\r\nLearning outcomes:\r\n\r\n•test your strategic skills\r\n•explore diverse, real life client case studies.\r\n•feel more practiced in dealing with any type of client.\r\n\r\nDELIVERY\r\n\r\n•Prior to class, you will be sent a PDF handout.\r\n•You will need a computer with Skype installed and working audio (no camera needed).\r\n•You will be able to interact, ask questions, and view the content via your computer.\r\n\r\nThis class offers different prices depending on if you score the early bird discount or not!  To qualify for 50% off, you must book and pay at least 1 week in advance of your class date. Please use the discount code EARLY6\r\n\r\n$88 including GST. 10% GST will automatically be added at checkout before your final payment is confirmed. ","options":[{"id":49876617,"name":"Thursday March 6th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885878,"name":"Thursday May 22nd @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885881,"name":"Friday September 6th @8pm","price":80.0,"sold_out":false,"has_custom_price":false},{"id":49885884,"name":"Saturday December 6th @8pm","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":1622045,"name":"ON SALE","permalink":"on-sale","url":"/category/on-sale"},{"id":2445403,"name":"Workshops/Training","permalink":"workshops-training","url":"/category/workshops-training"}]},{"id":15338178,"name":"Organising DIY","permalink":"organising-diy","position":12,"price":1.0,"default_price":1.0,"tax":0.0,"url":"/product/organising-diy","status":"coming-soon","on_sale":false,"created_at":"2013-12-05T00:00:47.000Z","description":"Coming soon!","options":[{"id":49880565,"name":"Default","price":1.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":2445403,"name":"Workshops/Training","permalink":"workshops-training","url":"/category/workshops-training"}]},{"id":5074091,"name":"SORTING workshops","permalink":"sorting-workshops","position":13,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/sorting-workshops","status":"coming-soon","on_sale":false,"created_at":"2011-12-14T01:00:38.000Z","description":"Bring you unsorted paperwork, photos, memorabilia, craft supplies, receipts, study notes, recipes etc for a fun sorting workshop.  We provide the time, space and expertise to get organised on a budget. Declutter your life!\r\n\r\nYou'll benefit from:\r\n\r\n•4 hours sorting time\r\n•expert advice and supervision\r\n•professional archival advice\r\n•motivation\r\n•free tips\r\n•tea, coffee and juice\r\n•delicious afternoon tea\r\n•a large table to work at\r\n•organising tools (secure shredding, paperclips, staplers etc)\r\n•storage and product advice\r\n•plenty of how-to information\r\n•great company!\r\nall for $66/per workshop.\r\n\r\nSo if it’s time to get your tax paperwork in order or begin sorting you photos, please join us.\r\n\r\nYou needn’t feel that sorting your stuff is something you have to try and make happen at home or work.\r\n\r\nBring your boxes of stuff, your computer, your bags of flotsam jetsam. Untangle your wool!  Sort and cull your digital photos. \r\n\r\nPlaces are strictly limited to only 15 people per class, so don’t delay in booking.\r\n\r\nLesley Sanders / Memory preserver\r\nLissanne Oliver / Organiser Extraordinare\r\n\r\nTIME: 1:30 - 5:30pm\r\n\r\nVENUE: TBC\r\nPUBLIC TRANSPORT: TBC\r\nTIP: Use a wheely suitcase to bring your stuff - much easier than boxes and bags to wrangle there and home.\r\n\r\nDATES:  Sorting workshops will be back in 2013!\r\n\r\nFeedback:\r\n<i>•Very motivating and supportive.\r\n•A positive and fun environment to finally get started on a tedious and long overdue job [tax paperwork].\r\n•Great new ideas about filing.\r\n•Excellent afternoon tea.\r\n•Great resources and ideas for resources.\r\n•Thanks for a great workshop!\r\n•Great upbeat environment and music.\r\n•Enjoyed intro and participants intro. \r\n•Delicious afternoon tea- plunger coffee wow!\r\n•Lissanne and Lesley a 5 star team!\r\n•Nice to have dedicated time with no interruptions.\r\n•Yummy food. </i>\r\n\r\nPlease note: your purchase will appear as $60 as the GST is not calculated until you are through the PayPal checkout.\r\n\r\nSo we can ensure your needs are catered to, please advise if you:\r\n\r\n•have dietary requirements/allergies or\r\n\r\n•will be bringing a computer or\r\n\r\n•have any disability that we can assist with on the day (eg low vision, mobility etc)\r\n","options":[{"id":20686529,"name":"Default","price":60.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/49818663/-/before_and_after.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/49818663/-/before_and_after.jpg","width":1000,"height":456}],"artists":[],"categories":[{"id":474611,"name":"Organising","permalink":"organising","url":"/category/organising"},{"id":2445403,"name":"Workshops/Training","permalink":"workshops-training","url":"/category/workshops-training"}]}]