[{"id":2818259,"name":"MaxiMoisture Nettle & Hibiscus Shampoo- Lavender","permalink":"nettle-and-hibiscus-hair-shampoo","position":1,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/nettle-and-hibiscus-hair-shampoo","status":"active","on_sale":true,"created_at":"2010-10-24T05:02:34.000Z","description":"Give your hair the love and care it deserves with our effective; yet gentle sulfate-free MaxiMoisture Nettle & Hibiscus Shampoo.  Made with nettle, hibiscus, and other safe, natural ingredients, our shampoo was specially formulated to moisturize, regenerate, grow, and thicken your hair while it cleanses.  The 100% lavender fragrance is heavenly as well as soothing and the results are simply amazing. \r\n\r\nMaxiMoisture Nettle & Hibiscus Shampoo is rich in vitamins A, C, E, proteins, amino acids and potent oils like rosemary for the glossy shine you desire and beautiful hair you deserve.  \r\n\r\nIngredients: Aqua (Purified Water), Certified Organic herbal blend of Rosa Rubiginosa (Organic Rosehip), Anthemis Nobilis (Organic Chamomile), Lavandula Angustifolia (Organic Lavender), Equisetum Arvense (Organic Horsetail herb), Tagetes Erecta (Organic Marigold), Arctium Lappa (Organic Burdock Root), Helianthus Annuus (Organic Sunflower) Oil, Citrus Grandis (Organic Grapefruit) Extract, Rosmarinus Officinalis (Organic Rosemary), Persea Gratissima (Certified Biodynamic Avocado) Oil, Macadamia Ternifolia (Certified Biodynamic Macadamia) Oil, Organic Lotus Bean Gum; Decyl glucose, Coco Polyglucose, Aloe Barbadensis (Organic Aloe Vera) Extract, Soy Lecithin, Avena Sativa (Oatmeal) Protein, Simmondsia Chinensis (Organic Jojoba) Oil, Panthenol (Vitamin B5), Citrus Aurantium Dulcis (Orange) Extract (Vitamin C), Organic Glycerin (Vegetable), Lavandula Angustifolia (Lavender) Oil, Biotin (Vitamin B7), Urtica Dioica (Stinging Nettle), Hibiscus sabdariffa (Hibiscus), Hydroxymethylglycinate, Trifolium Pratense (Canadian wildcrafted Red Clover) Oil  – Certified Vegan Friendly","options":[{"id":9855524,"name":"8 fl oz. (237 ml.)","price":14.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722103/-/MM_LS_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722103/-/MM_LS_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722087/-/MM_LS.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722087/-/MM_LS.jpg","width":361,"height":336},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42169887/-/shutterstock_124501.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42169887/-/shutterstock_124501.jpg","width":721,"height":1000}],"artists":[],"categories":[{"id":1673847,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":4026447,"name":"MaxiMoisture Nettle & Hibiscus Lavender Conditioner","permalink":"maximoisture-nettle-hibiscus-conditioner","position":2,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/maximoisture-nettle-hibiscus-conditioner","status":"active","on_sale":true,"created_at":"2011-07-03T13:46:12.000Z","description":"If you’re tired of heavy conditioners that weigh your hair down and strip it of its natural beauty, MaxiMoisture Nettle & Hibiscus Conditioner is just what you’ve been looking for.  It adds a light, subtle coating that keeps your hair looking as well as feeling fresh and manageable.  It improves the pH balance of your hair, helping you to look your best any time in any weather while relaxing you with the scent of lavender.\r\n\r\nMaxiMoisture Nettle & Hibiscus Conditioner is made with natural ingredients you know and love like Rosehip oil, Pro Vitamin B, and Glycerin...as well as less common ingredients like oatmeal and electrolytes. It also is rich in vitamins B, C, E, with proteins as well as rosemary oil for the glossy shine you desire and crave. The result:  glossy, touchable hair with a wonderful elasticity that will hold your favorite style and reduce the effects of static electricity.  Use MaxiMoisture Nettle & Hibiscus Conditioner and your hair will look better than you ever imagined\r\n\r\nDirections:  Apply to damp hair. Leave on for 1-2 minutes, comb through, then rinse. Follow up with your favorite Wisely Made moisturizer.\r\n\r\nIngredients: Aqua (Purified Water), Certified Organic herbal blend of Rosa Rubiginosa (Organic Rosehip), Anthemis Nobilis (Organic Chamomile), Lavandula Angustifolia (Organic Lavender), Equisetum Arvense (Organic Horsetail herb), Tagetes Erecta (Organic Marigold), Arctium Lappa (Organic Burdock Root), Helianthus Annuus (Organic Sunflower) Oil, Citrus Grandis (Organic Grapefruit) extract, Rosmarinus Officinalis (Organic Rosemary) Extract, Persea Gratissima (Certified Biodynamic Avocado) Oil, Macadamia Ternifolia (Certified Biodynamic Macadamia) Oil, Certified Organic Lotus Bean Gum; Salvia Officinalis (Sage) Oil Alcohol (natural emulsifier), Aloe Barbadensis (Organic Aloe Vera) Extract, Organic Guar Gum, Sea Brine Electrolyte, Panthenol (Vitamin B5), Citrus Aurantium Dulcis (Orange) Extract (Vitamin C), Simmondsia Chinensis (Jojoba) Oil, Avena Sativa protein (Oatmeal protein), Alpha Tocopherol (Vitamin E), Organic Glycerin (Vegetable), Biotin (Vitamin B7), Hibiscus sabdariffa (Hibiscus) Extract, Urtica Dioica (Stinging Nettle) Extract, Lavandula Angustifolia (Lavender) Essential Oil, Hydroxymethylglycinate, Trifolium Pratense (Canadian wildcrafted Red Clover) Oil  – Certified Vegan Friendly","options":[{"id":13350153,"name":"Default","price":14.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722255/-/MM_LC_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722255/-/MM_LC_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722263/-/MM_LC.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722263/-/MM_LC.jpg","width":361,"height":336},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42169895/-/shutterstock_124501.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42169895/-/shutterstock_124501.jpg","width":721,"height":1000}],"artists":[],"categories":[{"id":1673847,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":2818265,"name":"MaxiMoisture Nettle & Hibiscus Shampoo for Color Treated and Damaged Hair","permalink":"resurrection-hair-treatment","position":3,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/resurrection-hair-treatment","status":"active","on_sale":true,"created_at":"2010-10-24T05:05:40.000Z","description":"Give your hair the extra love and care it deserves with our effective; yet gentle sulfate-free shampoo is specially formulated for Color Treated or Damaged Hair.  Made with nettle, hibiscus, and other safe, natural ingredients, MaxiMoisture Nettle & Hibiscus Shampoo was specially formulated to moisturize, regenerate, grow, and thicken your hair while it cleanses.  Our 100% natural fragrance of cherry citroni will seduce you as your hair is being naturally treated and rejuvenated.\r\n\r\nAmongst many other effective ingredients, our MaxiMoisture Nettle & Hibiscus Shampoo has beta carotene. It is the precursor to Vitamin A and is rich in Vitamin E, both of which are beneficial to hair.  It also has the Australian Kakadu plum which studies have found to have the highest content of natural Vitamin C of any fruit on Earth. \r\n\r\nYour hair will thank you for it because when these ingredients are combined it will assist in treating and preventing hair loss, promoting healthy hair growth, reducing breakage and maintaining your hair once it is nursed back to health.\r\n\r\nDirections: Apply to wet hair and scalp. Repeat if necessary. Follow every time with MaxiMoisture Nettle & Hibiscus Conditioner for Color Treated and Damaged Hair to get luxuriously beautiful hair. \r\n\r\nIngredients: Aqua (Purified Water), Certified Organic herbal blend of Rosmarinus Officinalis (Organic Rosemary), Arctium Lappa (Organic Burdock Root), Tagetes Erecta (Organic Marigold), Rosa Rubiginosa (Organic Rosehip), Anthemis Nobilis (Organic Chamomile), Lavandula Angustifolia (Organic Lavender), Equisetum Arvense (Organic Horsetail herb), Helianthus Annuus (Organic Sunflower) Oil, Citrus Grandis (Organic Grapefruit) extract, Persea Gratissima (Certified Biodynamic Avocado) Oil, Macadamia Ternifolia (Certified Biodynamic Macadamia) Oil, Organic Lotus Bean Gum; Decyl glucose, Coco Polyglucose, Avena Sativa (Oatmeal) Protein, Sucrose Cocoate, Panthenol (Vitamin B5), Simmondsia Chinensis (Organic Jojoba) Oil, Biotin (Vitamin B7), Hibiscus sabdariffa (Hibiscus) Extract, Urtica Dioica (Stinging Nettle) Extract, Citrus Aurantium Dulcis (Orange) Extract (Vitamin C), Beta Carotene (Vitamin A), Alpha Tocopherol (Vitamin E), Citrus Grandis (Organic Grapefruit) Oil, Citrus Aurantium Bergamia (Organic Bergamot) Oil, Cananga Odorata (Organic Ylang-ylang) Oil; Hydroxymethylglycinate, Trifolium Pratense (Canadian wildcrafted Red Clover) Oil ~ Certified Vegan Blend\r\n\r\nFormula of Integrity- The Wisely Made brand means the product has been chosen and prepared with integrity and in excellence with the highest quality standards for the customer as well as the environment. All of our products are:\r\n\tFree of artificial preservatives\r\n\tFree of artificial colors and fragrances\r\n\tFree of chemical additives, sulfates\r\n\tFree of Petroleum and its byproducts\r\n\tCruelty-free, Vegan friendly, no testing on animals\r\n","options":[{"id":9855536,"name":"8 oz. (224 ml.)","price":14.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722519/-/MM_CCS_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722519/-/MM_CCS_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722527/-/MM_CS.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722527/-/MM_CS.jpg","width":361,"height":336},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42756545/-/shutterstock_82765501.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42756545/-/shutterstock_82765501.jpg","width":667,"height":1000}],"artists":[],"categories":[{"id":1673847,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":4026441,"name":"MaxiMoisture Nettle & Hibiscus Conditioner For Color Treated and Damaged Hair","permalink":"maximoisture-nettle-hibiscus-conditoner-for-color-treated-and-damaged-hair","position":4,"price":14.99,"default_price":14.99,"tax":0.0,"url":"/product/maximoisture-nettle-hibiscus-conditoner-for-color-treated-and-damaged-hair","status":"active","on_sale":true,"created_at":"2011-07-03T13:42:51.000Z","description":"If you’re tired of heavy conditioners that weigh your hair down and strip it of its natural beauty, MaxiMoisture Nettle & Hibiscus Conditioner Color Treated and Damaged Hair is just what you’ve been looking for.  It adds a light, subtle coating that keeps your hair looking as well as feeling fresh and manageable.  It improves the pH balance of your hair, helping you to look your best any time in any weather while seducing you with the scent of cherry citroni.\r\n\r\nThis special formulation of MaxiMoisture Nettle & Hibiscus Conditioner has beta carotene to assist those with Color Treated and Damaged Hair. It is the precursor to Vitamin A and is rich in Vitamin E, both of which are beneficial to hair. Your hair will thank you for since it will assist in treating and preventing hair loss, promoting healthy hair growth, reducing hair breakage and maintaining your hair once it is nursed back to health.\r\n\r\nMaxiMoisture Nettle & Hibiscus Conditioner for Color Treated and Damaged Hair is made with natural ingredients you know and love like Rosehip oil, Vitamin B, C, E, and Glycerin...as well as less common ingredients like oatmeal and electrolytes. The result:  glossy, touchable hair with wonderful elasticity that will hold your favorite style and reduce the effects of static electricity.  Use MaxiMoisture Nettle & Hibiscus Conditioner Color Treated and Damaged Hair and your hair will look better and feeling than you ever imagined. This is all natural luxury at its best.\r\n\r\nDirections:  Apply to damp hair. Leave on for 1-2 minutes. Follow up with your favorite Wisely Made hair moisturizer.\r\n\r\nIngredients: Aqua (Purified water),  Certified Organic herbal blend of Rosmarinus Officinalis (Organic Rosemary), Arctium Lappa (Organic Burdock Root), Tagetes Erecta (Organic Marigold), Rosa Rubiginosa (Organic Rosehip), Anthemis Nobilis (Organic Chamomile), Lavandula Angustifolia (Organic Lavender), Equisetum Arvense (Organic Horsetail herb), Helianthus Annuus (Organic Sunflower) Oil, Citrus Grandis (Organic Grapefruit) extract, Persea Gratissima (Certified Biodynamic Avocado) Oil, Macadamia Ternifolia (Certified Biodynamic Macadamia) Oil, Organic Lotus Bean Gum; Cocos Nucifera (Coconut Butter emolient) extract, Organic Guar Gum, Salvia Officinalis (sage) Oil Alcohol, Aloe Barbadensis (Aloe Vera) Extract, Tussilago Farfara (Coltsfoot medicinal plant) Extract, Symphytum Officinale (Comfrey) Extract (Vitamin U), Sea Brine Electrolyte, Panthenol (Vitamin B5), Avena Sativa (Oatmeal) Protein, Simmondsia Chinensis (Jojoba) Oil, Anthemis Nobilis (Chamomile) Oil, Prunus Amygdalus Dulcis (Almond) Oil, Biotin (Vitamin B7), Hibiscus sabdariffa (Hibiscus) Extract, Urtica Dioica (Stinging Nettle),  Citrus Aurantium Dulcis (Orange) Extract (Vitamin C), Beta Carotene (Vitamin A), Alpha Tocopherol (Vitamin E), Citrus Grandis (Organic Grapefruit) Oil, Citrus Aurantium Bergamia (Organic Bergamot) Oil, Cananga Odorata (Organic Ylang-ylang) Oil; Hydroxymethylglycinate, Trifolium Pratense (Red Clover) Oil  – Certified Vegan Friendly","options":[{"id":13350141,"name":"8oz (237 ml)","price":14.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722543/-/MM_CCC_rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722543/-/MM_CCC_rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722551/-/MM_CC.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722551/-/MM_CC.jpg","width":361,"height":336},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42756585/-/shutterstock_82765501.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42756585/-/shutterstock_82765501.jpg","width":667,"height":1000}],"artists":[],"categories":[{"id":1673847,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":4026459,"name":"MaxiMoisture Hair Pomade","permalink":"butter-me-up-hair-pomade","position":5,"price":11.5,"default_price":11.5,"tax":0.0,"url":"/product/butter-me-up-hair-pomade","status":"active","on_sale":false,"created_at":"2011-07-03T14:02:50.000Z","description":"Make no mistake about it: hair is dead.  But it can be coated and conditioned to be stronger, softer, and healthier.  MaxiMoisture Hair Pomade is a masterful blend of pure moisturizers that penetrate each hair shaft.  Our proprietary combination of ingredients can minimize hair loss by conditioning and strengthening your hair, as well as nourishing your scalp.  It also promotes hair growth by restoring hair cells necessary to make your hair soft, healthy and strong. \r\n\r\nMaxiMoisture Hair Pomade properties are of safe ingredients such as Shea butter, Jojoba oil, Illipe butter, Horsetail Extract, Coconut Oil, and Pomegranate Oil, to address some major concerns while healing, revitalizing and rejuvenating damaged and weak hair.\r\n\r\nDirections:  Use daily as a moisturizer on scalp and/or or to assist in styling to result in hair that is healthy, strong, and sensational\r\n\r\nIngredients:\r\nUnrefined Social Justice Butyrospermum parkii (Shea Butter) Fruit, Aloe barbadensis (Organic Aloe) Leaf Juice, Cocos nucifera (Coconut) Oil, Simmondsia chinensis (Jojoba) Seed Oil Shorea stenoptera (Illipe) Seed Butter, Olea europaea (Olive) Fruit Oil, Candelilla (Euphorbia cerifera ) Wax, Limnanthes alba (Meadowfoam) Seed Oil, Caprylic/Capric Triglyceride, Rubus Idaeus (Raspberry) Seed Oil, Achillea millefolium (Yarrow) Leaf Extract, Punica granatum linn (Pomegranate) Oil, Salvia officinalis (Sage) Leaf Extract, Equisetum arvense (Horsetail Extract), Utica dioica (Nettle) Leaf Extract, Lavandula angustifolia (Lavender) Flower Extract, Ricinus communis (Castor) Seed Oil, Tocopherol (Vitamin E), Rosmarinus officinalis (Rosemary) Leaf Extract, Melaleuca alternifolia (Tea Tree) Oil, Cymbopogon flexuosus (Lemongrass) oil, Azadirachtin indica (Neem) Oil Citric Acid and Silver Citrate (Tinosan SDC), Potassium Sorbate ","options":[{"id":13350171,"name":"8 oz","price":22.5,"sold_out":false,"has_custom_price":true},{"id":30693805,"name":"4 oz","price":11.5,"sold_out":false,"has_custom_price":false},{"id":30693808,"name":"1 oz","price":3.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722887/-/MM_HP_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722887/-/MM_HP_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722895/-/MM_HP.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722895/-/MM_HP.jpg","width":361,"height":336},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/39271659/-/shutterstock_73359076_shea_butter1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/39271659/-/shutterstock_73359076_shea_butter1.jpg","width":1000,"height":662}],"artists":[],"categories":[{"id":1673847,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":4165626,"name":"Resurrection Hair Treatment","permalink":"ressurrection-hair-treatment","position":6,"price":11.5,"default_price":11.5,"tax":0.0,"url":"/product/ressurrection-hair-treatment","status":"active","on_sale":false,"created_at":"2011-07-28T18:19:52.000Z","description":"The Resurrection Hair Treatment is for the hair that is either on its way to the point of no return or close to it.  This treatment will revive your hair and keep it in the best condition when used as directed.  Along with using Unrefined Fair trade Shea Butter and Organic Aloe Juice, we have incorporated Avocado oil, Rosemary and Lemongrass Extracts, for strengthening and fortifying your hair. \r\n\r\nThe Hemp Seed, Eggs, Honey, and Kosher Vegetable Glycerin are terrific for their moisturizing agents, because they assist in restoring the cells that have been damaged by harsh chemicals used in relaxers, bleaching and coloring as well as improve gloss and texture, increases moisture retention, and improves manageability and body.\r\n\r\nWe have several ingredients that are used to treat the scalp.  In doing so, they will prevent and control common hair problems by removing impurities and reducing pore clogging in the scalp.  This will improve the general look as well as condition of hair as it grows.  It can also be used as a scalp treatment to improve the strength, sheen and body of the hair.\r\n\r\nDirections: Massage from scalp to hair ends on damp hair, cover with shower cap; apply heat for 15-30 minutes then rinse. Use once a week or as often as needed.\r\n\r\nIngredients:\r\nUnrefined Social Justice Butyrospermum parkii (Shea Butter) Fruit,  Aloe barbadensis (Organic Aloe) Leaf Juice, Water, Rosmarinus officinalis (Rosemary) Leaf Extract,  Lavandula officinalis (Lavender) Extract, Mentha piperita (Peppermint) Leaf Extract,  Rosa damascena (Rose), Extract, Yucca Schidigera (Yucca) Leaf Extract, Equisetum arvense (Horsetail) Leaf Extract, Urtica dioica (Nettle) Leaf Extract, Cymbopogon citratus (Lemongrass) Extract,  Melissa officinalis (Melissa) Leaf Extract, Persea gratissima (Avocado) Oil, Cannabis sativa (Hemp) Seed Oil, Olea europaea (Olive) Fruit Oil, Cocos Nucifera (Coconut) Oil, Kosher Glycerin, Emulsifying wax, DL-panthenol (Pro-Vitamin B5), Methylsulfonylmethane (MSM),  Egg Yolk Powder, Hydroxypropyltrimonium Honey, Acacia Gum, Hydrolyzed Soy Protein, Palm Stearic Acid, Citric Acid and Silver Citrate (Tinosan SDC), Potassium Sorbate\r\n\r\n","options":[{"id":30693847,"name":"4 oz","price":11.5,"sold_out":false,"has_custom_price":false},{"id":13751884,"name":"8 oz","price":22.5,"sold_out":false,"has_custom_price":true},{"id":30693850,"name":"1 oz","price":3.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722991/-/Res_Tx_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722991/-/Res_Tx_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48723007/-/Res_TX.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48723007/-/Res_TX.jpg","width":361,"height":336},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40694270/-/shutterstock_8476453_blonde_having_a_really_bad_hair_day.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40694270/-/shutterstock_8476453_blonde_having_a_really_bad_hair_day.jpg","width":667,"height":1000}],"artists":[],"categories":[{"id":1673847,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":2835784,"name":"MaxiMoisture Hair Oil ","permalink":"all-inclusive-hair-oil-8-fl-oz-237ml","position":7,"price":16.5,"default_price":16.5,"tax":0.0,"url":"/product/all-inclusive-hair-oil-8-fl-oz-237ml","status":"active","on_sale":true,"created_at":"2010-11-02T06:01:30.000Z","description":"Give your hair everything it needs to gain strength, shine, bounce and to look beautiful with MaxiMoisture Hair Oil, our all-natural hair oil.  We’ve combined powerful natural herbs and potent natural oils so you can restore, rejuvenate, and preserve your hair in a state of natural ‘perfection.’ \r\n\r\nFinally, You can stop worrying about hair loss, slow growth, damage, dryness, weakness, dandruff and other ‘hair’ problems, and concentrate on things that really matter...like enjoying life.\r\n\r\nDirections:  Use as a hot oil treatment or daily moisturizer on your scalp and/or hair. \r\n\r\nIngredients: Persea gratissima (Avocado) Oil, Cocos nucifera (Coconut) Oil, Silybum Marianum Seed (Milk Thistle Seed) Oil, Olea europaea (Olive) Fruit Oil, Simmondsia chinensis (Jojoba) Seed Oil, Caprylic/Capric Triglyceride, Achillea millefolium (Yarrow) Leaf Extract, Salvia officinalis (Sage) Leaf Extract, ( Equisetum arvense) Horsetail Extract, Utica dioica (Nettle) Leaf Extract, Lavandula angustifolia (Lavender) Flower Extract, Tocopherol (Vitamin E), Ricinus communis (Castor) Seed Oil, Glycine Soja (Soybean) Oil (and) Aloe Barbadensis Leaf Extract, Vaccinium Macrocarpon (Cranberry) Seed Oil, Azadirachtin indica (Neem) CO2 Extract, Calendula officinalis (Calendula) CO2 Extract, Rosmarinus officinalis (Rosemary) Oil, Melaleuca alternifolia (Tea Tree) Oil, Citrus paradisi (Grapefruit) Oil, Calendula officinalis (Calendula) Flower\r\n\r\n","options":[{"id":13349841,"name":"Default","price":16.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722823/-/MM_HO_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722823/-/MM_HO_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/39271827/-/shutterstock_44956963_running_oil.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/39271827/-/shutterstock_44956963_running_oil.jpg","width":725,"height":1000},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48722831/-/MM_HO.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48722831/-/MM_HO.jpg","width":361,"height":336}],"artists":[],"categories":[{"id":1673847,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":8524671,"name":"Herbalicious Tea Rinse","permalink":"herbalicious-leave-in-tea-rinse","position":8,"price":13.99,"default_price":13.99,"tax":0.0,"url":"/product/herbalicious-leave-in-tea-rinse","status":"active","on_sale":false,"created_at":"2012-12-13T04:00:24.000Z","description":"Our Herbalicious Tea Rinse is as natural as it gets just like the rest of our products. We have combined the best herbs and essential oils to promote hair growth strength, shine, scalp circulation, reducing breakage and healing. It can be used as a pre-treatment, after hair washing or as an everyday product. We offer various sizes as well to accommodate your needs. Either way, be prepared for the all natural goodness. \r\n\r\n**Directions**:\r\n\r\nBoil 1 ¼ cup of distilled water, turn off heat and add 1 tsp of herbs. Cover and let it steep for about 20 minutes. Strain it; put the liquid into a spray bottle. Spray onto hair. It can be used for pre-washing and a leave-in for post washing as well as for daily use.\r\n\r\n**FYI**:\r\nOne teaspoon of our herbs makes 1 cup of liquid. So in assuming you use 1 tsp of herbs at a time:\r\n1 ounce size= 6 tsp ($0.33/tsp)= 6 uses\r\n4 ounce size= 24tsp ($0.29/tsp)= 24 uses\r\n8 ounce size= 42 tsp ($0.33/tsp)=42 uses\r\n16 ounce size= 96 tsp ($0.29/tsp)= 96 uses\r\n Our customers found that with daily use, this one cup of liquid lasted between a week to 2 weeks (This will vary according to hair length, thickness and usage).\r\n\r\n\r\n**Ingredients**:\r\n\r\nUrtica dioica (Stinging Nettle) leaf, Equisetum arvense (Horsetail ) flower, Hibiscus sabdariffa (Hibisucs) flowers, Lavandula officinalis (Lavender) buds, Ocimum basilicum (Basil) leaves, Mentha piperita (Peppermint) leaves, Achillea millefolium (Yarrow) leaf, Azadirachta indica (Neem) leaf, Foeniculum vulgare (Fennel) Seed, Calendula flower, Althaea officinalis (Marshmallow) Root, Arctium (Burdock) Root, Rosehip Bacopa monnierri (Brahmi), Phyllanthus emblica(Amla)leaf, Rosmarinus officinalis (Rosemary) Essential Oil, Melaleuca (Tea Tree) Essential Oil, Citrus paradisi (Grapefruit) Essential Oil\r\n\r\n**Some Herbal Properties**\r\n\r\nStinging Nettle- medicating antibacterial, anti fungal, helps with dandruff, itchiness, germicide, strengthens hair and nails, controls stubborn cases of dandruff and other scalp disorders\r\n\r\nHorsetail- very high in sulfur, silicic acid and amino acid, helps healing dandruff, scalp buildup and reduces hair loss\r\n\r\nBurdock- assists with hair loss\r\n\r\nRosemary- promotes circulation to scalp, renews activity in dormant hair follicles and promotes hair growth\r\n\r\nBasil - effective hair conditioner, hair growth stimulant\r\n\r\nFennel Seed- prevents hair breakage, strengthens hair\r\n\r\nYarrow leaf- promotes hair growth\r\n\r\nCalendula- promotes hair growth and strengthens hair roots\r\n\r\nBrahmi- proper nourishment to reach hair roots and promote growth, reduces hair loss, good for scalp and follicle health\r\n\r\nAmla- filled with Vitamin C and assists with hair loss, premature greying, darkens hair, hair growth ","options":[{"id":28690474,"name":"8 ounces","price":13.99,"sold_out":false,"has_custom_price":false},{"id":26787099,"name":"16 ounces","price":27.99,"sold_out":false,"has_custom_price":true},{"id":28690476,"name":"4 ounces","price":6.99,"sold_out":false,"has_custom_price":true},{"id":28690478,"name":"1 ounces Try Me size","price":1.99,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/83848869/-/shutterstock_115507378.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/83848869/-/shutterstock_115507378.jpg","width":1000,"height":667}],"artists":[],"categories":[{"id":1673847,"name":"Hair","permalink":"hair","url":"/category/hair"}]},{"id":3010153,"name":"Pick-Me-Up Peppermint Orange Shower Gel","permalink":"peppermint-orange-shower-gel","position":9,"price":8.99,"default_price":8.99,"tax":0.0,"url":"/product/peppermint-orange-shower-gel","status":"active","on_sale":true,"created_at":"2010-12-10T23:28:49.000Z","description":"Pick-Me-Up Peppermint Orange Shower Gel \r\nGet your days (and nights) off to a beautiful start with our sulfate-free shower gel.  Nourish your skin with a rich, velvety lather made with a blend of invigorating peppermint, sun-kissed natural citrus, strawberry seeds and other all-natural ingredients.\r\n  \r\nWe use nothing but the best ingredients in our products. Macadamia Oil, Avocado oil, Coconut Oil, Hemp Seed Oil, Oatmeal Protein, Vitamin C is just a few of the ingredients that will be responsible in keeping your skin soft while providing deeply moisturizing. This is all natural luxury at its best.\r\n\r\nPick-Me-Up Peppermint Orange Shower Gel will leave your skin feeling soft, smooth, clean, and beautiful. It’s fabulous all natural fragrance will give you the pick-me-up you need to get you moving.  \r\n\r\nDirections: Apply to sponge, loofah or cloth and lather generously all over your body. Rinse and follow up with your favorite Wisely Made moisturizer\r\n\r\nIngredients:Aqua (Purified Water), Certified Organic Herbal Blend of Rosa Rubiginosa (Organic Rosehip), Anthemis Nobilis (Organic Chamomille), Lavandula Angustifolia (Organic Lavender), Equisetum Arvense (Organic Horsetail herb), Tagetes Erecta (Organic Marigold), Arctium Lappa (Organic Burdock), Helianthus Annuus (Organic Sunflower) Oil, Prunus Amygdalus Dulcis (Organic Sweet Almond) Oil, Vitis Vinifera (Organic Grapeskin) Extract, Organic Rosmarinus Officinalis (Organic Rosemary), Persae Gratissima (Certified Biodynamic Avocado) Oil, Macadamia Ternifolia Seed (Certified Biodynamic Macadamia) Oil, Certified Organic Lotus bean gum; Certified Organic Essential Oil Blend of Lavandula Angustifolia and Rosmarinus Officinalis (Lavender & Rosemary blend), Olea Europaea (Olive) Oil, Coco Polyglucose [Natural Vegetarian surfactant from Solanum Tuberosum (Potato) or Cocos Nucifera (Coconut) Oil], Organic Glycerine (Vegetable), Cannabis Sativa (Organic Hemp Seed) Oil, Panthenol (Vitamin B5), Cyamopsis Tetragonolobus (Organic Guar Gum), Avena Sativa (Whole Oat) Protein, Citrus Aurantium Dulcis (Tangerine) Extract (Vitamin C), Citrus Aurantium Dulcis (Organic Sweet Orange) Oil, Hydroxymethylglycinate, Trifolium Pratense (Canadian wildcrafted Red Clover) Extract, Fragaria vesca (Strawberry) Fruit Seed - Certified Vegan Friendly \r\n\r\n","options":[{"id":10362585,"name":"8 fl oz. (237 ml.)","price":8.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48723175/-/Pep_Orange_SG_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48723175/-/Pep_Orange_SG_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48723183/-/PEP_Org_SG.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48723183/-/PEP_Org_SG.jpg","width":296,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/39270899/-/peppermint_orange.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/39270899/-/peppermint_orange.jpg","width":695,"height":1000}],"artists":[],"categories":[{"id":1757327,"name":"Skin","permalink":"skin","url":"/category/skin"}]},{"id":4026403,"name":"Relax-Me Lavender Shower Gel","permalink":"relax-me-lavender-shower-gel","position":10,"price":8.99,"default_price":8.99,"tax":0.0,"url":"/product/relax-me-lavender-shower-gel","status":"active","on_sale":true,"created_at":"2011-07-03T13:05:00.000Z","description":"Begin your days (and nights) off with a sense of tranquility with our sulfate-free shower gel.  Nourish your skin with a rich, velvety lather made with a blend of soothing lavender, blueberry seeds, and other all-natural ingredients.  \r\n\r\nWe use nothing but the best ingredients in our products. Macadamia Oil, Avocado oil, Coconut Oil, Hemp Seed Oil, Oatmeal Protein, Vitamin C is just a few of the ingredients that will be responsible in keeping your skin soft and deeply moisturized. This is all-natural luxury at its best.\r\n\r\nRelax-Me Lavender Shower Gel will leave your skin feeling smooth, clean, and beautiful. Its fabulous natural fragrance will give you the relaxing feeling you need to get you through whatever is in store for you.\r\n\r\nIngredients: Aqua (Purified Water), Certified Organic Herbal Blend of Organic Rosa Rubiginosa (Organic Rosehip), Anthemis Nobilis (Organic Chamomille), Lavandula Angustifolia (Organic Lavender), Organic Equisetum Arvense (Horsetail herb), Tagetes Erecta (Organic Calendula), Arctium Lappa (Organic Burdock), Helianthus Annuus (Organic Sunflower) Oil, Prunus Amygdalus Dulcis (Organic Sweet Almond) Oil, Vitis Vinifera (Organic Grapeskin) Extract, Rosmarinus Officinalis (Organic Rosemary), Persae Gratissima (Certified Biodynamic Avocado) Oil, Macadamia Ternifolia Seed (Certified Biodynamic Macadamia) Oil, Certified Organic Nelumbo nucifera (Lotus bean) gum; Certified Organic Essential Oil Blend of Lavandula Angustifolia and Rosmarinus Officinalis (Organic Lavender & Organic Rosemary) in Olea Europaea (Organic Olive) Oil, Coco Polyglucose, Glycerin (Vegetable), Sativa Seed (Certified Organic Hemp) Oil, Panthenol (Vitamin B5), Cyamopsis Tetragonolobus (Guar Gum), Avena Sativa (Whole Oat) Protein, Acidum Citricum (Citric Acid), Certified Organic Lavandula Angustifolia (Lavender) Oil, Hydroxymethylglycinate, Trifolium Pratense (Canadian wildcrafted Red Clover) Extract, Vaccinium myrtillus (Blueberry) Fruit Seeds - Certified Vegan Friendly ","options":[{"id":13350039,"name":"Default","price":8.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48723695/-/RM_Lav_SG_Rept.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48723695/-/RM_Lav_SG_Rept.png","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/39270875/-/shutterstock_3704836_lavender_towel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/39270875/-/shutterstock_3704836_lavender_towel.jpg","width":1000,"height":665}],"artists":[],"categories":[{"id":1757327,"name":"Skin","permalink":"skin","url":"/category/skin"}]},{"id":4026465,"name":"Touch Me There Shea Butter Body Lotion","permalink":"the-better-butter-moisturizing-body-lotion","position":11,"price":16.5,"default_price":16.5,"tax":0.0,"url":"/product/the-better-butter-moisturizing-body-lotion","status":"active","on_sale":true,"created_at":"2011-07-03T14:12:26.000Z","description":"Touch Me There Shea Butter Body Lotion soothes rough, dry or chapped skin on contact thanks to its ‘star’ ingredient Fair Trade Shea Butter.  Its unparalleled ability to revitalize, soften and maintain skin moisture absorbs quickly without leaving a greasy residue.  All you feel is luxuriously soft and supple skin.\r\n\r\nDirections:  Apply Touch Me There Shea Butter Body Lotion after your shower bath and any time you want to give your skin a moisturizing treat.\r\n\r\nIngredients:  Aqua (Purified Water), Certified Organic herbal blend of Rosa Rubiginosa (Organic Rosehip), Anthemis Nobilis (Organic Chamomile), Lavandula Angustifolia (Organic Lavender), Equisetum Arvense (Organic Horsetail herb), Tagetes Erecta (Organic Marigold), Arctium Lappa (Organic Burdock Root), Helianthus Annuus (Organic Sunflower) Oil, Citrus Grandis (Organic Grapefruit) extract, Rosmarinus Officinalis (Organic Rosemary) Extract, Persea Gratissima (Certified Biodynamic Avocado) Oil, Macadamia Ternifolia (Certified Biodynamic Macadamia) Oil, Certified Organic Lotus Bean Gum; Certified Organic Shea Butter, Organic Aloe Barbadensis Leaf Juice (Aloe Vera), Polyglyceryl Stearate (Natural Essential Fatty Acid from Coconut/ Palm Kernel Oil), Theobroma Cacao (Cocoa Butter), Organic Glycerin (Vegetable), Panthenol (Vitamin B5), Rosa Mosqueta (Organic Rose Hip Oil), Hypericum Perforatum (Organic St. John’s Wort Oil), Calendula Officinalis (Calendula Oil), Tocopheryl Acetate (Vitamin E), Retinal Palmitate (Vitamin A Oil), Organic Guar Gum, Organic Jojoba Oil, Organic Sweet Almond Oil, Organic Frankincense Oil, Organic Rosewood Oil, Organic Bergamot Oil, Hydroxymethylglycinate (Earth-friendly plant-based/salt preservative), Trifolium Pratense (Canadian wild crafted Red Clover) Oil – Certified Vegan Friendly","options":[{"id":13350179,"name":"Default","price":16.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48723807/-/TMT_Lotion_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48723807/-/TMT_Lotion_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/39271675/-/shutterstock_74104429_shea_butter_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/39271675/-/shutterstock_74104429_shea_butter_2.jpg","width":675,"height":1000}],"artists":[],"categories":[{"id":1757327,"name":"Skin","permalink":"skin","url":"/category/skin"}]},{"id":3011771,"name":"Empress Bath and Body Oil ","permalink":"antioxident-rich-bath-body-oil","position":12,"price":12.5,"default_price":12.5,"tax":0.0,"url":"/product/antioxident-rich-bath-body-oil","status":"active","on_sale":true,"created_at":"2010-12-11T05:32:15.000Z","description":"Now you can nourish and revitalize your skin with the natural healing properties of cranberry, pomegranate, blueberry, and raspberry mixed with sweet almond oil.  We’ve harnessed the power of these potent natural antioxidants and combined them with moisturizing oils and delicate hibiscus petals to make Empress Bath and Body Oil luxuriously and utterly irresistible.  \r\n\r\nEmpress Bath and Body Oil gives you silken, touchable skin that is glowing with natural good health.  Isn’t that what we all crave?\r\n\r\nDirections: Add 2 tablespoons to a warm bath or apply oil directly to damp skin after bathing.\r\n\r\nIngredients: Prunus amygdalus dulcis (Sweet Almond) Oil, Persea gratissima (Avocado) Seed Oil, Prunus armeniacae (Apricot) Kernel Oil, Silybum Marianum Seed (Milk Thistle Seed) Oil, Simmondsia chinensis (Jojoba) Seed Oil, Cucurbita pepo (Pumpkin) Seed Oil, Vaccinium corymbosum (Blueberry) Seed Oil, Daucus carota sativa (Carrot) Root oil, Brassica oleracea italica (Broccoli) Seed Oil, Vaccinium Macrocarpon (Cranberry) Seed Oil, Limnanthes alba (Meadowfoam) Seed Oil, Caprylic/Capric Triglyceride, Rubus Idaeus (Raspberry) Seed Oil, Calendula officinalis (Calendula) Flower Extract, Punica granatum linn (Pomegranate) Oil, Matricaria recutita (Chamomile) Flower Extract, Rosa (Rose) Flower Extract, Salix alba (White Willow) Bark Extract, Trifolium pretense (Red Clover) Flower Extract, Sambucus nigra (Elder) Flower Extract, Tocopherol (Vitamin E), Rosmarinus officinalis (Rosemary) Leaf Extract, Hibiscus sabdariffa (Hibiscus) Flower, Natural fragrance\r\n\r\n","options":[{"id":10367159,"name":"8 fl oz (237 ml.)","price":12.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48723959/-/Empress_Oil_Rept.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48723959/-/Empress_Oil_Rept.jpg","width":299,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48723951/-/Empress_BO.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48723951/-/Empress_BO.jpg","width":296,"height":448},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/29279851/-/antioxident_1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/29279851/-/antioxident_1.jpg","width":276,"height":183}],"artists":[],"categories":[{"id":1757327,"name":"Skin","permalink":"skin","url":"/category/skin"}]}]