[{"id":4662205,"name":"Love of a Laminex Table","permalink":"love-of-a-laminex-table","position":1,"price":55.0,"default_price":55.0,"tax":0.0,"url":"/product/love-of-a-laminex-table","status":"active","on_sale":true,"created_at":"2011-10-19T03:33:35.000Z","description":"BUY NOW!\r\n<b>Normal RRP $65.90\r\nSpecial online price only <font color=\"red\">$55.00</font></b>\r\nPostage $13.00 (1-2 days)\r\n\r\nA 326 page cookbook and food journey from Kate Shelton of Benedict House.\r\n\r\nWe follow Kate's journey, originating within a large family on an isolated working property in northern New South Wales — largely self-sufficient in meat, dairy and vegetable production in the1960s.\r\n\r\nThe virtues of a simple life, interdependent with nature, animals and a caring community, are deeply engraved and recaptured alongside recipes that hold poignant memories.\r\n\r\nA city education and travel introduced alternative approaches to cuisine. Influences from Jewish cooking in London, simplicity on a Greek island, Italian neighbours, African and Asian friends embellish the practical approach dictated by Australian bush life.\r\n\r\nThe embodiment of the journey is expressed in Kate’s cafe in Benedict House where food is prepared with the same ethos as at <i>Yambulla</i> — a vegetable garden, fruit trees, local seasonal produce, recycling and improvising.\r\n\r\nReaders of the post-war generation will identify with the recollections and the echoes of their own ‘memories’. Young readers will be inspired to embrace simple and sustainable approaches to enhance their busy lives.","options":[{"id":15256741,"name":"Default","price":55.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":13.0,"amount_with_others":4.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/45683211/-/LaminexCoverEE.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/45683211/-/LaminexCoverEE.jpg","width":600,"height":686}],"artists":[],"categories":[{"id":2541681,"name":"Books","permalink":"books","url":"/category/books"}]}]