[{"id":90104,"name":"Folsom Electric MAX","permalink":"folsom-electric-max","position":1,"price":329.0,"default_price":329.0,"tax":0.0,"url":"/product/folsom-electric-max","status":"active","on_sale":false,"created_at":"2008-04-02T07:25:33.000Z","description":"Take Your ElectroSex/Electric Stimulation to a higher level!\n\n\tMade by Folsom Electric Company, the <span class=\"caps\">MAX</span> has dual outputs, but each are completely independent and isolated from each other. Power output is alternated between the two channels so that both channels never have output at exactly the same time. Besides the interesting effect, this feature also allows for safer application under certain conditions.\n\n\tThe Frequency control on the <span class=\"caps\">PSG</span>-MAX is an adjustment of the rate or cycle time. It can be adjusted to provide a very long off cycle time (for a slow pulse rate) to an extremely short off time (producing a very fast rate of pulses).\n\n\tThe <span class=\"caps\">PSG</span>-MAX has a Pulse Grouping function. When the Pulse switch is on, the generator produces a train of &#8220;grouped&#8221; pulses. The Rate Control provides for a very wide range of effect for this function.\n\n\tThe <span class=\"caps\">PSG</span>-MAX also has quick disable buttons which can instantly turn off the output of either channel. A green <span class=\"caps\">LED</span> indicates the on or off state. A red <span class=\"caps\">LED</span> is also provided for each channel to provide a visual indication of the approximate amount of power each channel is producing (the brighter the <span class=\"caps\">LED</span>, the higher the output).\n\n\tThe <span class=\"caps\">PSG</span>-MAX is powered by a ordinary 9 volt transistor radio battery. The design of this signal generator provides for an extremely long battery life. Set comes with two pairs of output leads.\n\n\tNote: Rimba accessories will work with Folsom with the Folsom &#38; Erostek In-Line Adapter. Folsom e-stim products come with a lifetime manufactuer&#8217;s warranty.\n\n","options":[{"id":438771,"name":"Default","price":329.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[],"artists":[],"categories":[]}]