[{"id":15378537,"name":"UK Records 80 Great Hits from the 60s & 70s","permalink":"uk-records-80-great-hits-from-the-60s-70s","position":1,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/uk-records-80-great-hits-from-the-60s-70s","status":"active","on_sale":false,"created_at":"2013-12-06T17:40:18.000Z","description":"UK Records was the most successful seller of singles ever - in the 1970's it had several hits in the United Kingdom Top 5 at the same time, with a staff of 4.\r\n\r\nThose hits were both home made and licensed from abroad. Some had been released and flopped on major labels; released again on the famous blue or silver UK logo, they shot into the charts.\r\n\r\nCombined; the tracks on this compilation sold hundreds of millions around the world. Forget \"artistes\" or \"albums\" - these are, quite simply, hits. Catchy, instant, varied, exciting, huge and, in some cases, very rare; never available on collections before.\r\n\r\nThe ultimate snapshot of the Sixties and Seventies but not the obvious \r\n(and sometimes boring - because you've heard them so often) classics.\r\n If you put  on this collection - over four hours -  we guarantee someone will say \r\n\r\n\"Oh my God, I'd forgotten all about that one\".\r\n\r\n<b>Disc One.</b>\r\n\r\n1) Fattie Bum Bum - Carl Malcolm - UK108 - No8 1975\r\nFabulous reggae track by Carl Malcolm which turned into a massive UK hit in 1975 selling millions of copies around the world.\r\n2) Wall Street Shuffle - 10cc - UK69 - No10 1974\r\nOne of the greatest 10cc tracks from a band who defined the 1970s.\r\n3) Keep On Dancing - The Bay City Rollers - No9 1971\r\nThe original smash hit from 1971 which started the Bay City Rollers careers and features thirteen vocals by JK in the background - and original singer Nobby Clark on lead vocal.\r\n4) Time Warp - Original London Cast 1972 - UK67\r\nFrom the original soundtrack recorded only three days into the very first run of the smash hit show at the Theatre Upstairs at the Royal Court in Sloane Square.\r\n5) Little Bit O'Soul - The Music Explosion - UK/USA9 - No2 USA 1967\r\nJohn Carter wrote this and had a huge US hit with it; it flopped in the UK, even when we rereleased it in 1975, but it's a great track.\r\n6) Everyone's Gone To The Moon - Jonathan King - Decca/UK47 - No4 1965\r\nA superb arrangement and production by the late, great Ken Jones.\r\n7) Beach Baby - The First Class - UK66 - No13UK/No4US 1974\r\nAnother fantastic John Carter song and production which became a massive global hit in 1975.\r\n8) Not Too Little…Not Too Much - Chris Sandford - Decca/No17 1963\r\nOne of the very first soap opera hits, Chris played Walter Potts, managed by Dennis Tanner, in Coronation Street. Another Ken Jones production.\r\n9) Star Trek - Charles Randolph Grean Sounde - UK/USA15 No8 US 1975\r\nCharles was a brilliant writer and producer and was responsible for numerous great hits such as the Dark Shadows theme.\r\n10) Johnny Reggae - The Piglets - UK134 - No3 1971\r\nWhite reggae! Simply a very catchy novelty track which caught the nation's fancy and sold millions in 1972.\r\n11) In The Mood - Sound 9418 - UK121 - No46 1976\r\nA disco version, mixing all different styles of music, of the Glenn Miller classic, originally a hit in 1940.\r\n12) The Silent Sun - Peter Gabriel and Genesis - Decca/UK 1969\r\na superb track recorded by Peter Gabriel and Genesis in 1969 whilst they were still teenage schoolboys.\r\n13) Sugar Sugar - Sakkarin - UK - No12 1971\r\nThe Archies had a No1 with this in 1969 - the Sakkarin version is a spoof rock version with a great high guitar solo sound.\r\n14) Rock and Roll I Gave You... - Kevin Johnson UK84 No23 1974 Australia No4\r\nBrilliant, memorable folk rock song from the talented Australian Kevin Johnson.\r\n15) Una Paloma Blanca - Jonathan King - UK105 - No5 1975\r\nJK's cover of the George Baker Dutch song in 1975 - JK's version reached No4, George's hit No10 in the UK.\r\n16) I'm On My Way - Dean Parrish - UK/USA2 1967/75\r\nOriginally released in 1967 but never a hit; picked up by UK Records in 1975 and a great favourite on the Northern Soul circuit.\r\n17) Abraham Martin and John - Dion - UK/USA7 - No4 USA 1968/75\r\nSuperb treatment of the wonderful song by Dion - one of the greatest singers of all time.\r\n18) Do You Love Me? - The Angelettes - UK26 1972\r\nThis song has been a massive hit - first for The Contours in 1962 on Motown and subsequently for Brian Poole and the Tremeloes in the UK in 1963. Written by Berry Gordy.\r\n19) Is Your Love In Vain? - Eiri Thrasher - UK 1979\r\nIf any Bob Dylan song deserves to be a hit, it's this, from Street-Legal in 1978, and Eiri Thrasher's wonderful rendition shows it in an entirely different light.\r\n\r\n\r\n<b>Disc Two.</b>\r\n\r\n1) Rubber Bullets - 10cc - UK36 - No1 - 1973\r\nHuge smash from 10cc - also sold well in the USA.\r\n2) Disco Matilda - Dame Edna Everage - UK/Charisma  1979\r\nProduced along with Two Little Girls (named Edna and Madge) and Lightning Strikes with the brilliant Barry Humphries.\r\n3) Help Me Make It Through The Night - Jonathan King/Eiri Thrasher UK75 1973\r\nContrasting duet version of the Kris Kristofferson song; a US hit for Sammi Smith and Gladys Knight.\r\n4) I'm Waiting For The Man - Tina Harvey - UK141 1973\r\nTina sings Lou Reed; splendid treatment.\r\n5) Paper Moon - Nemo - UK58 1974\r\nThe 1933 Jazz song given a different rendition; the song became a film in 1973.\r\n6) Donna - 10cc - UK6 No2 1972\r\nTheir first hit and the one that inspired their name; it sold millions around the world.\r\n7) Loop di Love - Shag - UK7 No3 1972\r\nAnother massive UK hit from 1972.\r\n8) I'd Love You To Want Me - Lobo - UK68 No5UK/USA2 1972\r\nOn first release in Britain this flopped, so UK Records acquired the rights and sent it into the Top 5.\r\n9) It Only Takes A Minute - One Hundred Ton and a Feather - UK135 No9 1976\r\nThe biggest UK hit version of the great Tavares song, later covered by Take That.\r\n10) It's Good News Week - Hedgehoppers Anonymous - Decca/UK No5 1965\r\nNot only a 1965 UK hit but revived as the theme for the Australian version of Have I Got News For You, and earning loads more royalties in this century.\r\n11) Let It All Hang Out - Jonathan King - UK No26 1970\r\nAnother smash song which has been featured in a series of TV campaigns.\r\n12) Just One Cornetto - Count Giovanni di Regina - UK/Magnet 1978\r\nFrom the TV commercial again, a full length version of the classic Walls Ice Cream advert from the seventies.\r\n13) My Love My Life - Jonathan King - UK 1976\r\nOne of the greatest yet least known Abba songs.\r\n14) 17 - Simon Turner - UK20 1972\r\nAn early example of \"teen pop\".\r\n15) Learning The Game - One Hundred Ton and a Feather - UK 1976\r\nThe Buddy Holly song given a more modern treatment after the Moog had arrived on the music scene.\r\n16) Leap Up And Down - St Cecilia - UK/Polydor No12 1971\r\nThis sold hundreds of thousands and stuck around for months; only Jimmy Young on Radio One would play it; without blanket airplay it sold huge quantities.\r\n17) Flirt - Jonathan King - UK/Decca - No22 1972\r\nA great French song by Michel Delpech - JK wrote the English lyric and sang it into the UK Top Thirty.\r\n18) People Will Say We're In Love - Bubblerock - UK65 1974\r\nA superb Rodgers and Hammerstein song from the 1943 musical Oklahoma; another totally different treatment.\r\n19) The Last Thing On My Mind - Triban - UK/Decca 1970\r\nThe Tom Paxton folk song recorded by Triban, Eiri Thrasher's first band. Many have done this beautiful song including Joan Baez and The Seekers.\r\n20) Chick-A-Boom - 53rd and 3rd - UK2012 No36 1975\r\nRichard Monda's song originally sung by him as Daddy Dewdrop and a No3 hit in 1971 in America.\r\n21) Stranger On The Shore - Sound 9418 - UK127 \r\nThe Acker Bilk standard - it reached No1 in the US in 1961 by him.\r\n\r\n<b>Disc Three.</b>\r\n\r\n1) Gimme Some - Brendon - UK158 No14 1976/7\r\nGreat cover by Brendon of the KC and the Sunshine Band song; a hit in the US for Jimmy Bo Horne; a huge hit for Brendon in 1976/7.\r\n2) Shotgun Wedding - Roy C - UK19 No8 1972\r\nOriginally in the UK Top Ten on Island in 1966; UK Records acquired the rights and rereleased it back into the ten in 1972.\r\n3) The Sun Has Got His Hat On - Nemo EMI/UK 1971\r\nA 1932 hit written by Noel Gay, JK revived it in 1971 after legendary BBC Producer Bernie Andrews played it to him.\r\n4) It's The Same Old Song - The Weathermen - UK No19 1971\r\nThe Four Tops went into the US Top Five with this in 1965 but it flopped in Britain so JK covered it in 1971 and went into the Top Twenty.\r\n5) You Were On My Mind - The Sun Singers - UK12 1972\r\nWe Five went Top Five in America with this Ian and Sylvia song in 1965; Crispian St Peters covered it for a UK Top Five hit in 1966.\r\n6) Seaside Shuffle - Terry Dactyl and the Dinosaurs - UK5 No2 1972\r\nJohn Lewis later became Jona Lewi but this is his first hit from 1972. John is giggling at the end of the original UK Records master.\r\n7) Share Your Love - Hope Clarke UK/USA12 1975\r\nA beautiful version of this song, also sung (less well) by Aretha Franklin. Al Green's band backs her.\r\n8) I Understand - Freddie and the Dreamers - UK55 1973 No5 1964\r\nFreddie Garrity had a Top Five smash with this reworking of Auld Lang Syne in 1964 and rerecorded it for a UK Records release in 1973.\r\n9) Hooked On A Feeling - Jonathan King - UK No23 1971\r\nAfter BJ Thomas had a small country hit with this great song in the USA, JK came up with the idea of grunted male reggae voices and did this version which became a hit all over Europe and was later covered by a Swedish group.\r\n10) Nowhere To Run - Tina Harvey - UK24 1973\r\nA very unusual version of the Martha and the Vandellas US No8 from 1965.\r\n11) Cherry Cherry - Jonathan King UK/Decca 1970\r\nJK's version of the great Neil Diamond song, a big hit all over Europe.\r\n12) Where The Sour Turns To Sweet - Genesis - UK/Decca 1969\r\nThe original version of the song before strings and brass were added for the finished album.\r\n13) Satisfaction - Bubblerock - UK53 No29 1974\r\nMick Jagger told JK that this was the best version of his song after the Rolling Stones original.\r\n14) Bobby Dazzler - The First Class - UK73 1974\r\nThe wonderful followup to Beach Baby, written and produced by John Carter and sung by Tony Burrows.\r\n15) Desiderata - David - UK115 - 1975\r\nThe DJ Dave Cash narrates his version of the great 1906 words for the Les Crane American No8/UK No7 from 1971.\r\n16) Have You Seen Your Mother… Tina Harvey - UK 1972\r\nA truly different interpretation of the Rolling Stones classic song.\r\n17) To My Daughter - Noele Gordon - UK76 1974\r\nNoele Gordon played Meg Richardson in the ITV soap opera Crossroads; this is her touching song for mothers and daughters everywhere.\r\n18) Old Wild Men - 10cc - UK 1972\r\nA less well known but wonderful 10cc song; we are all Old Wild Men now, boys.\r\n19) Wild World - Jonathan King - UKP001 1987\r\nJK's take on Wild World, a Cat Stevens song and Jimmy Cliff 1970 hit  that he felt may have influenced The Pet Shop Boys when they recorded their No1 UK, It's A Sin.\r\n\r\n\r\n<b>Disc Four.</b>\r\n\r\n1) Lazybones - Jonathan King - UK142 No23 1971\r\nThe fantastic 1933 Hoagy Carmichael song which JK sang in 1971 and which hit No33 on the USA Easy Listening chart.\r\n2) She Was Just A Young Girl - Simon Turner - UK60 1974\r\nAppropriate for all the teen fans of David Cassidy, Donny Osmond and Michael Jackson in the 70s.\r\n3) I Am An Astronaut - Ricky Wilde - UK18  1972\r\nA huge hit for UK Records in Sweden and covered by numerous artistes since like Snow Patrol.\r\n4) Double Barrel - Jenny One Shot - UK/RCA 1971\r\nA bizarre reworking of the reggae smash for Dave and Ansell Collins, a No1 in the UK. Jenny was, in fact, session singer Barbara Kay, who was also lead vocalist with The Piglets on Johnny Reggae.\r\n5) Return of the Red Baron - The Baron's Supporters - UK46 1973\r\nSnoopy vs The Red Baron was a No2 US hit in 1966 for The Royal Guardsmen (No8 in the UK) and this song, the followup, reached No15 in the USA in 1967 (No37 UK).\r\n6) One For You, One For Me - Jonathan King - UK No29 1978\r\nJK prancing about on Top of the Pops in a multi coloured rainbow wig was a recent talking point when the show was rebroadcast by the BBC in 2013.\r\n7) Life In England - Brendon - UK147 1976\r\nOne of Brendon's own songs; this caused him to be signed to UK Records - we made the mistake of getting him to do many covers, and he hit the Top 20 with Gimme Some, but we should have encouraged his writing skills.\r\n8) He's So Fine - Jonathan King - UK132 1976\r\nJK's witty comment on the similarity melodically, of The Chiffons 1963 hit, to George Harrison's My Sweet Lord, with backing vocals chanting the titles of his other songs, was played in court, leading to him losing the plagiarism suit brought by the composers of He's So Fine. George never spoke to JK again.\r\n9) Only Love Can Break Your Heart - Tina Harvey - UK 1972\r\nJK still thinks this is the best intro of any of his productions. A very different performance of the Neil Young song.\r\n10) It's A Tall Order For A Short Guy - Jonathan King UK1 1972\r\nOur very first UK Records single and it flopped - but I think it still sounds good.\r\n11) Harry and the Hulahoops - Pat Codd - UK80 1974\r\nA very obscure UK Records piece of pop fluff yet I've always had a soft spot for it; I think it embodies pop charm.\r\n31) I Can't Get It Out Of My Head - One Hundred Ton and a Feather - UK 1977\r\nOne of the very few covers that, I think, gets closer to the spirit of the lyric than the ELO original did; Jeff Lynne (a huge talent) - do you agree?\r\n12) I Don't Wanna Know - Brendon UK 1978\r\nPerhaps the least known song on Fleetwood Mac's Rumours, it also happens to be my personal favourite.\r\n13) I Will Be There - Gogmagog - UK/FFT 1985\r\nRuss Ballard is a great and under rated writer; he played such a huge part in 60s and 70s pop and rock that I feel entitled to include his song I Will Be There - by some great rockers from the 70s.\r\n14) A Lifetime of Loneliness - Tina Harvey - UK 1972\r\nWow; people tend to forget Jackie de Shannon - the combination of her, Bacharach and David produced some marvellous music; this is my tribute (and Tina's) to all three of them.\r\n15) If You Wanna Be Happy - Sloply Bellywell - UK87 1975\r\nA hilarious, politically non correct lyric; a hit for Jimmy Soul in 1963. \"Never make a pretty woman your wife\". Superb.\r\n16) Miss Wire Waist - Carl Malcolm - UK113 1975\r\nA hit for Carl in Jamaica before Fattie Bum Bum but we released it as his followup.\r\n17) Mississipi - Jonathan King - UK146 1976\r\nJK's treatment of the Pussycat No1 UK hit from 1976 released at the same time and withdrawn to let them have the success they deserved.\r\n18) Gonna Fix You Good - Brendon - UK 1976\r\nAnother old 1966 American song from Little Anthony and the Imperials that never became a hit and warranted a new version in 1976\r\n19) Growing Up - Alvin Stardust - UK/Magnet 1977\r\nBruce Springsteen hadn't really broken when Alvin Stardust did a version of his magnificent song Growin' Up in 1977.\r\n20) Medley - Overture To A Career - Sound 9418 - UK 1976\r\nCombining several Glenn Miller songs like Chattanooga Choo Choo (1941) and Pennsylvania 6-5000 (1940), American Patrol (1942) and St Louis Blues (1943) - this is a splendid medley to liven up the floor at parties. Featuring some of the best session musicians from Great Britain in the 70s and arranged by super talent Johnny Arthey, this session was such fun, all the musicians, arranger, engineers and producer were dancing around the studio whilst it was being recorded and that's the take we went with.\r\n","options":[{"id":50008521,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/128936037/-/80_tracks_art_work_front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/128936037/-/80_tracks_art_work_front.jpg","width":1400,"height":1400}],"artists":[{"id":63054,"name":"Various Artists","permalink":"various-artists","url":"/artist/various-artists"}],"categories":[]},{"id":14793471,"name":"Death Flies, Missing Girls and Brigitte Bardot","permalink":"death-flies-missing-girls-and-brigitte-bardot","position":2,"price":7.99,"default_price":7.99,"tax":0.0,"url":"/product/death-flies-missing-girls-and-brigitte-bardot","status":"active","on_sale":false,"created_at":"2013-11-12T13:50:24.000Z","description":"A terrible car accident in Morocco... missing girls in England... \r\n\r\na family holiday in the South of France...\r\n\r\nthis is a novel looking at numerous scenarios, dramatic and mundane,\r\n\r\nthrough completely different eyes.\r\n\r\nFrom serial killers to flies, all life is here","options":[{"id":47941464,"name":"Default","price":7.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":2.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/127440078/-/deathcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/127440078/-/deathcover.jpg","width":383,"height":575}],"artists":[{"id":2316,"name":"Jonathan King","permalink":"jonathan-king","url":"/artist/jonathan-king"}],"categories":[{"id":537341,"name":"Book","permalink":"book","url":"/category/book"}]},{"id":3698896,"name":"Me Me Me Soundtrack - Double disc set includes the movie on DVD, soundtrack, lyrics and more","permalink":"me-me-me-soundtrack-double-disc-set-including-the-full-90-min-movie-on-dvd-and-the-soundtrack","position":3,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/me-me-me-soundtrack-double-disc-set-including-the-full-90-min-movie-on-dvd-and-the-soundtrack","status":"active","on_sale":false,"created_at":"2011-05-04T12:07:44.000Z","description":"An amazing 2 disc set!  \r\n\r\nDisc 1 is the soundtrack to the movie featuring all 17 smash hits songs from the musical plus the backing tracks so that you can sing along at home or perform the play yourself!  \r\n\r\nThe package includes a glossy booklet featuring colourful images from the film and all the lyrics.  \r\n\r\nThe second disc is a DVD of the movie itself.  \r\n\r\nDisc 1\r\n\r\n1.  Me Me Me Theme - Jake\r\n2.  Don't Let Him Touch You - The Angelettes\r\n3.  It's A Hell Of A Story - Marshal Artes and the Moon Staff\r\n4.  It's Illegal, It's Immoral, It's Unhealthy but It's Fun - Gogmagog\r\n5.  Rub It Hard - biggYbigg\r\n6.  Robbie - Gloria Gorgeous\r\n7.  Penny - Jonathan King\r\n8.  Baby I Gotta Go - Johnny Bambino\r\n9.  He Hit Me Again - Gloria Gorgeous\r\n10.  Let's Not Get Dirty - Johnny Bambino\r\n11.  A Very Very Naughty Girl - Jane Fellowes\r\n12.  Living In A Fucking Time Warp - Gogmagog\r\n13.  Don't Forget Me When You're On Your Island - Johnny Bambino\r\n14.  I Cried - The Angelettes\r\n15.  The Sirens Theme - Sakkarin\r\n16.  Never Let The Bastards Get You Down - Jay and Tabby\r\n17.  Hope Life and Love - The Company \r\n18. It's A Hell Of A Story backing track\r\n19. Robbie backing track\r\n20. Penny backing track\r\n21. Baby I Gotta Go backing track\r\n22. Let's Not Get Dirty backing track\r\n23. A Very Very Naughty Girl backing track\r\n24. I Cried backing track\r\n25. Never Let The Bastards Get You Down backing track\r\n26. Hope Life and Love backing track\r\n\r\nDisc 2\r\n\r\nA DVD of Me Me Me","options":[{"id":12407020,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/36007438/-/B004YWSBKG.MAIN.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/36007438/-/B004YWSBKG.MAIN.jpg","width":1000,"height":1000}],"artists":[{"id":63054,"name":"Various Artists","permalink":"various-artists","url":"/artist/various-artists"}],"categories":[{"id":79892,"name":"CDs","permalink":"cds","url":"/category/cds"},{"id":2077256,"name":"DVD","permalink":"dvd","url":"/category/dvd"}]},{"id":98624,"name":"Vile Pervert The Musical - Double disc set including the full 96 min movie on DVD and the soundtrack","permalink":"vile-pervert-the-musical","position":4,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/vile-pervert-the-musical","status":"active","on_sale":false,"created_at":"2008-04-28T16:09:45.000Z","description":"<b>Double disc set including the full 96 minute movie on DVD and the soundtrack music CD</b> \r\n\r\n<p>This package contains a 32 page glossy booklet featuring exclusive photos of the cast and witty sleeve notes.  <p>A true collectors item.\r\n<br><P>\r\n<B>**Please specify whether you require a PAL (UK) or NTSC (USA) DVD by using the drop down box below.**</B><br><P>\r\n\t<b><u>Track Listing</b></u>\r\n\r\n\t1. Vile Pervert\r\n2. The Silver Stoat\r\n3. Professional Victims\r\n4. Johnny Reggae\r\n5. I Hate Coca Cola\r\n6. Everyone&#8217;s Gone To The Moon\r\n7. It&#8217;s Bigger Than You Think\r\n8. The Plain Friend\r\n9. Plead Guilty\r\n10. What&#8217;s A Girl To Do?\r\n11. The True Story Of Harold Shipman\r\n12. Satan&#8217;s Ultimate Weapon Of Mass Destruction\r\n13. He Stood In The Bath And He Stamped On The Floor\r\n14. The Mad Hatters Tea Party Is Back\r\n15. Wilde About Boys\r\n16. I&#8217;ll Slap Your Face Entertainment <span class=\"caps\">USA</span> Theme\r\n17. It&#8217;s Good News Week\r\n18. The Geldof Principle Do You Really Care?\r\n19. Shami Chakrabarti\r\n20. When Caravaggio Met Michelangelo\r\n21. Mary My Love\r\n","options":[{"id":491842,"name":"PAL","price":10.0,"sold_out":false,"has_custom_price":false},{"id":511635,"name":"NTSC","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":2.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/486801/-/VP4.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/486801/-/VP4.jpg","width":340,"height":340}],"artists":[{"id":2316,"name":"Jonathan King","permalink":"jonathan-king","url":"/artist/jonathan-king"}],"categories":[{"id":79892,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":73189,"name":"Jonathan King - Earth To King","permalink":"10cc-when-the-chips-are-down","position":5,"price":10.0,"default_price":10.0,"tax":0.0,"url":"/product/10cc-when-the-chips-are-down","status":"active","on_sale":false,"created_at":"2008-02-07T00:43:42.000Z","description":"Jonathan King's briliant new collection featuring a plethora of thought provoking new tracks aswell as the smash hits of the 60s and 70s. <p>\r\nCD2 contains 100 6 minute Autobiographical Video Blogs (ranging from 1944 to 2007) - TEN HOURS of JK ramblings - plus many videos for the music tracks on CD1 presented in the Quicktime format.\r\n<P><I>Sleeve notes</I><p>\r\nAt 62, I reckoned my performing days were over. \"Music is a young peoples' thing\", I reckoned. But, as I found myself wrongly incarcerated for several years, I started to revise my opinion. Why wouldn't I write some more songs ? As long as I wasn't pretending to be something I'm not - young, groovy, hip or trendy - what was wrong in making new music and see if anyone liked it? <p>For me, the 7ound of7 (2007) is Sociopop. Pop music - catchy melodies, hooks, presentation - with lyrics of social commentary. We called it PROTEST in the 60's but it really wasn't, and long before most were \"protesting\" I was composing social comment lyrics like Everyone's Gone To The Moon or It's Good News Week and then, later, Johnny Reggae. Simply observing and conveying ideas that might provoke thoughts amongst others. <P>There is so little thought these days. Headline morality, simplistic caricatures. We have no time for deep consideration or anticipation of consequences. Since we really don't care, we accept, nice, basic, catchy soundbites. Whether it's Weapons Of Mass Destruction or Vile Pervert. So I hope anyone prepared to listen will also be ready to consider. You may end up agreeing or disagreeing with my conclusions but at least your mind, heart, soul and ears will have been willing to think. <P>Ultimately, of course, it's whether or not you like it. Music is to be enjoyed. Thoughts and awareness are all very well but music has one purpose - either you enjoy it or you don't. I'm happy to be judged on that basis. And a social message need not always be deadly serious. Mary My Love - I saw a girl and didn't think I stood a chance... Easy Lovin'... Nobody Wants The Plain Friend... A good tune, a catchy sound, the quality of singalong... that's pop. Happy music. If I make people happy that's fine. <P>Jonathan King, London, January 2007<p>\r\n\r\n<b>Track Listing</b><p>\r\n\r\n1. Vile Pervert<br>\r\n2. Who's Been Polishing The Sun?<br>\r\n3. When Caravaggio Met Michelangelo<br>\r\n4. The Silver Stoat<br>\r\n5. Gimme Some 2007<br>\r\n6. Satan's Ultimate Weapon Of Mass Destruction<br>\r\n7. Easy Lovin'<br>\r\n8. The True Story Of Harold Shipman<br>\r\n9. He Stood In The Bath And He Stamped On The Floor<br>\r\n10. Professional Victims<br>\r\n11. Baby Let Me Follow You Down<br>\r\n12. The Geldof Principle (Do You Really Care?)<br>\r\n13. Mary My Love<br>\r\n14. I Hate Coca Cola<br>\r\n15. I Can't Get It Out Of My Head<br>\r\n16. Plead Guilty<br>\r\n17. The Box Of Love<br>\r\n18. Hello I Am Your Heart<br>\r\n19. You Show Me Yours And I'll Show You Mine<br>\r\n20. The Plain Friend<br>\r\n21. Let It All Hang Out<br>\r\n22. It Only Takes A Minute<br>\r\n23. Johnny Reggae<br>\r\n24. Loop di Love<br>\r\n25. Una Paloma Blanca<br>\r\n26. Everyone's Gone To The Moon<br>\r\n27. God Save All Queens <br>\r\n\r\nCD2<P>\r\n\r\n100 x 6 minute Autobiographical Video Blogs<p>\r\nPlus, music videos for some of the tracks on disc 1 in the Quicktime format. \r\n\r\n","options":[{"id":349445,"name":"Default","price":10.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.0,"amount_with_others":0.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":2.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/1390464/-/61JxNEpFYcL._SS500_.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/1390464/-/61JxNEpFYcL._SS500_.jpg","width":500,"height":500}],"artists":[{"id":2316,"name":"Jonathan King","permalink":"jonathan-king","url":"/artist/jonathan-king"}],"categories":[{"id":79892,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]