[{"id":4766817,"name":"Camera Obscura: Modern Primitivism (signed)","permalink":"camera-obscura-modern-primitivism","position":1,"price":9.99,"default_price":9.99,"tax":0.0,"url":"/product/camera-obscura-modern-primitivism","status":"active","on_sale":true,"created_at":"2011-11-03T12:39:40.000Z","description":"Camera Obscura: Modern Primitivism\r\nPhotographs by Darius Kuzmickas.\r\nKuDa Editions, 2005. 34 pp., 16 sepia and color illustrations., 8½x8½\".\r\n\r\nCamera Obscura: Modern Primitivism was published in conjunction with an exhibition at the Nevada Museum of Art in Reno and features a selection of photographs taken using both large-format and digital pinhole cameras . The results are warm, intimate images, focusing primarily on landscapes. And while the images shot using traditional film cameras and toned to deep sepias take on the look of immutable antiquities, the digital work is more like a series of hazy memories, providing an interesting counter-point with its fuzzy coloration and off-kilter composition.\r\n\r\nVery limited quantities are available.","options":[{"id":15582911,"name":"Default","price":9.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46743521/-/DK-NMA-book.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46743521/-/DK-NMA-book.jpg","width":250,"height":250}],"artists":[{"id":94133,"name":"Darius Kuzmickas","permalink":"darius-kuzmickas","url":"/artist/darius-kuzmickas"}],"categories":[{"id":2585327,"name":"Books","permalink":"books","url":"/category/books"}]},{"id":4766841,"name":"Ocean Pinholes (signed)","permalink":"ocean-pinholes","position":2,"price":4.99,"default_price":4.99,"tax":0.0,"url":"/product/ocean-pinholes","status":"active","on_sale":true,"created_at":"2011-11-03T12:45:19.000Z","description":"Ocean Pinholes\r\nPhotographs by Darius Kuzmickas.\r\nISBN 0977895912, Kuda Editions, 2006. 36 pp., 28 color illustrations, 9½x8\".\r\n\r\nA wonderful collection of atmospheric images of ocean coastline produced with a pinhole camera (camera obscura). Using pinhole photography, a practically prehistoric technique in this digital age, the photographer relinquishes control, granting ultimate power to his subject matter, subtly reinforcing the immeasurable influence of our ever-changing horizon line. The results are warm and intimate images.\r\n\r\nFeatures an essay by Kelle Schilaci. ","options":[{"id":15582975,"name":"Default","price":4.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48759703/-/0977895912_sq.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48759703/-/0977895912_sq.jpg","width":418,"height":418}],"artists":[{"id":94133,"name":"Darius Kuzmickas","permalink":"darius-kuzmickas","url":"/artist/darius-kuzmickas"}],"categories":[{"id":2585327,"name":"Books","permalink":"books","url":"/category/books"}]},{"id":4966265,"name":"Warheads","permalink":"warheads","position":3,"price":6.99,"default_price":6.99,"tax":0.0,"url":"/product/warheads","status":"active","on_sale":true,"created_at":"2011-11-29T17:55:04.000Z","description":"Warheads.\r\nPhotographs by Diane Bush.\r\nWith forward by Dr. Anthony Bannon and afterword by Jerry Schefcik.\r\nISBN 0977895904, Kuda Editions, 2006. 60 pp., 26 color illustrations, 9½x8\".\r\n\r\nWARHEADS, published in conjunction with an exhibition at the Burchfield-Penny Arts Center on the campus of Buffalo State College in Buffalo, New York, features a selection of 26 color plates and features a foreword by D. Anthony Bannon, the Director of the George Eastman House, and an afterword by Jerry Schefcik, Director of the Donna Beam Art Gallery, in Las Vegas.\r\n\r\nDiane Bush, a veteran “peacenik”, who fled to the UK with a draft dodger in the late 1960’s, turned her documentarian lens to the TV tube during the Gulf War for all 43 days of the war. Unlike other photographers who shot off the TV set, Diane used a macro lens at weird angles to achieve what many thought were computer- manipulated pictures of fat headed TV anchors (WARHEADS) and newscasters. The resulting commentary on media censorship was titled “Suppose They Gave a War and Nobody Had Cable?” (which became a one person show at the Nevada Institute of Contemporary Art, shown 10 years later) as part of a larger 20 year series called “500 Channels”.\r\n\r\nAs a reaction to the increased violence of the Iraqi war, Diane re-worked her original Gulf War prints by dragging them outside and throwing potassium ferry cyanide (bleach) on the prints and immediately hosing them down.\r\n\r\nThis act of “agit-pop” resulted in fiery red, orange, yellow, and white organic “explosions” on the prints...a visual commentary on how protected those who speak of the war, are in their safe, secure media “control” rooms. Perhaps if these celebrities were really being forced to face the violence that our soldiers face, would we feel differently?\r\n\r\nGratefully, the viewer can either take or leave the artists’ attempt at shocking us into any new perceptions about the current political landscape that the media is leaving out. There is no heavy-handed message, unless you want to dwell it. At the same time that Diane attempts to bring home her anti-war, freedom-of-speech message through the bizarre fantasy juxtaposition of CNN anchors facing fire and mayhem, the images are haunting, scary, funny, and beautiful. ","options":[{"id":16137311,"name":"Default","price":6.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/48759735/-/0977895904_sq.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/48759735/-/0977895904_sq.jpg","width":412,"height":412}],"artists":[{"id":94135,"name":"Diane Bush","permalink":"diane-bush","url":"/artist/diane-bush"}],"categories":[{"id":2585327,"name":"Books","permalink":"books","url":"/category/books"}]}]