[{"id":3447334,"name":"12” x 22” Silverware Oil on Canvas","permalink":"12-x-22-silverware-oil-on-canvas","position":1,"price":100.0,"default_price":100.0,"tax":0.0,"url":"/product/12-x-22-silverware-oil-on-canvas","status":"active","on_sale":false,"created_at":"2011-03-18T09:25:09.000Z","description":"Great for kitchen!  Three oil painted panels in white frame. ","options":[{"id":11614424,"name":"Default","price":100.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/33466268/-/the-trio-original-black-white-oil-paintings-on-6inch-x-8inch-individual-panels1.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/33466268/-/the-trio-original-black-white-oil-paintings-on-6inch-x-8inch-individual-panels1.jpg","width":404,"height":900}],"artists":[],"categories":[]},{"id":3432334,"name":"Adrian Peterson Portrait, NFL, Minnesota Vikings, Running-Back","permalink":"adrian-peterson-portrait-nfl-minnesota-vikings-running-back","position":2,"price":263.0,"default_price":263.0,"tax":0.0,"url":"/product/adrian-peterson-portrait-nfl-minnesota-vikings-running-back","status":"active","on_sale":true,"created_at":"2011-03-15T20:53:43.000Z","description":"Original Acrylics on Canvas Painting.  Finished in navy blue and white top-end wooden frame.  Sure to impress! \r\nCanvas Size: 14.5” x 17.5” with and 11” x 14” without the frame.\r\n\r\nAdrian Peterson is an American football running back for the Minnesota Vikings of the National Football League.  Here are only a few of his accomplishments:\r\n\r\nNFL awards\r\n•\t2007 AP NFL Offensive Rookie of the Year & Diet Pepsi NFL Rookie of the Year; \r\n•\t2008 Pro Bowl, Pro Bowl MVP, Best Breakthrough Athlete ESPY Award, Rushing Title (1760 yards), First-Team All-Pro, and FedEx Ground Player of the Year. \r\n•\t2009 Pro Bowl and First-Team All-Pro \r\n•\t2010 Pro Bowl and First-Team All-Pro \r\nNFL records\r\n•\tMost 200-yard rushing games for a rookie (2) \r\n•\tMost yards rushing in the first eight games (1,036) \r\n•\tMost yards rushing in a single game (296) \r\n•\tSecond rookie ever to win Pro Bowl MVP (Marshall Faulk in 1994) \r\n","options":[{"id":11575086,"name":"Default","price":263.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/33615592/-/adrian_peterson.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/33615592/-/adrian_peterson.jpg","width":800,"height":952}],"artists":[],"categories":[]},{"id":3432096,"name":"Oil on Canvas \"Žemyna, Goddess of Life on Earth\" 48in x 60in","permalink":"oil-on-canvas-zemyna-goddess-of-life-on-earth-48in-x-60in","position":3,"price":5600.0,"default_price":5600.0,"tax":0.0,"url":"/product/oil-on-canvas-zemyna-goddess-of-life-on-earth-48in-x-60in","status":"active","on_sale":true,"created_at":"2011-03-15T20:16:49.000Z","description":"Žemyna is the goddess of Earth in Lithuanian mythology.  She personifies fertility.  The word žemė in Lithuanian means “earth”.  In this image, the Goddess is a life giver and protector; she vivifies soil after drought with pure water extending from her veins. Ordinarily, she is thought of a mother or pregnant female carrying out Lithuanian woman’s features.  Her succulent breasts state she has just given birth to life. Silky winds drape the Goddess’s bare body with garland of spring cherry and apple blossoms creating a unique link to natives’ experience. She is stepping out of the Earth to take care of the new gardens and old forests. Her footprints leave vegetation on her path. On her left, the Sun is coming up over the horizon of Lithuania’s only sea, the Baltic.  In her right hand, she is holding a lantern with the full Moon in it to brighten the night in a cold winter.  The painting is loaded with symbols of this Baltic country that includes the following:\r\n\r\nSand dunes separating the bay from the sea;\r\nA cow lying next to hay stacks in the far distance;\r\nOld village homes, barns, and stone wells;\r\nA family man fishing in a river with the grand moon reflecting into the late night water behind him;\r\nTo the left, there are ice-skating families on a frozen lake enjoying winter’s tricks;\r\nOn the bottom right, the artist imprinted working together neighbors harvesting crops in the late summer;\r\nWomen placing crowns of fresh field flowers with lit candles down the river in honor of St. John’s day;\r\nFour seasons (snow covered forests and fields for winter best enjoyed in the moonlight, lightening strikes for early spring before the sunrise, the Sun bringing warmth into the summer, and autumn at harvest time);\r\n\r\nThere is no other portrait of this kind anywhere else in the world!  This is Lithuanian artist’s masterpiece dreamed and thought of for more than 15 years; not including, a few more additional years dedicated to painting it.  This grand peace cannot be reprinted or repainted again.  \r\n","options":[{"id":11574650,"name":"Default","price":5600.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/33310648/-/13959_1256185599482_1074854961_30782506_726190_n.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/33310648/-/13959_1256185599482_1074854961_30782506_726190_n.jpg","width":464,"height":604}],"artists":[],"categories":[]}]