[{"id":8089194,"name":"WaterWays/Sons of Alpha Centauri/Hotel Wrecking City Traders - Split (12\" Vinyl) (2012)","permalink":"waterways-sons-of-alpha-centauri-hotel-wrecking-city-traders-split-12-vinyl-2012","position":1,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/waterways-sons-of-alpha-centauri-hotel-wrecking-city-traders-split-12-vinyl-2012","status":"active","on_sale":false,"created_at":"2012-11-20T03:29:19.000Z","description":"WaterWays / Sons of Alpha Centauri/ Hotel Wrecking City Traders 12\" vinyl\r\n6 track 12” vinyl – 33.17\r\nreleased: 20.10.2012\r\n\r\nTracklisting:\r\n\r\nSons of Alpha Centauri\r\nA1: 27\r\n\r\nHotel Wrecking City Traders\r\nA2: Pulmo Victus\r\n\r\nWaterWays\r\nAA1: Piece of You\r\nAA2: Queen (of the Passout Riders)\r\nAA3: The Blacksmith\r\nAA4: WaterWays\r\n\r\nArtwork: Alexander von Wieding\r\nMastered: Ranscombe Studios, Rochester, UK\r\nEuropean version: 180 gramme try-colour (1/3 blood red, 1/3 piss yellow, 1/3 sea blue) 12” vinyl in full colour card sleeve. .\r\n\r\nEdition: 500\r\n","options":[{"id":25521525,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":10.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/79518237/-/1348526207_SOACWWVinyl_w450_h400.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/79518237/-/1348526207_SOACWWVinyl_w450_h400.jpg","width":400,"height":400}],"artists":[],"categories":[{"id":278618,"name":"CDs/Vinyl","permalink":"cds-vinyl","url":"/category/cds-vinyl"}]},{"id":8065986,"name":"Spider Goat Canyon/Hotel Wrecking City Traders - Japan Tour Split (CD) (2012)","permalink":"spider-goat-canyon-hotel-wrecking-city-traders-japan-tour-split","position":2,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/spider-goat-canyon-hotel-wrecking-city-traders-japan-tour-split","status":"active","on_sale":false,"created_at":"2012-11-18T23:53:20.000Z","description":"[BroFi008] \r\nSpider Goat Canyon / Hotel Wrecking City Traders ‘Split‘ \r\n(November, 2012) \r\n\r\n1.Brotherhood (Spider Goat Canyon) \r\n2.Batch 18 (Spider Goat Canyon) \r\n3.I draw the line at the clarinet (Spider Goat Canyon) \r\n3. I (Hotel Wrecking City Traders) \r\n4. II (Hotel Wrecking City Traders) \r\n\r\nRecorded by // Sean Jenkins and Steve Brick \r\nMixing & Mastering // Sgt Walrus \r\nArtwork // Joshua Beagley \r\nAll music copyright Spider Goat Canyon/Hotel Wrecking City Traders* \r\n\r\nThis is an audio document of a day spent in a rehearsal room in Melbourne, Australia - 20th May, 2012. \r\n\r\nwww.brofidelity.blogspot.com \r\nwww.facebook.com/brofidelityrecords \r\nwww.facebook.com/hotelwreckingcitytraders \r\nwww.spidergoatcanyon.com\r\n\r\nreleased 01 November 2012\r\n\r\n","options":[{"id":25451775,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":5.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/79289805/-/sgchwctspitfrontcoverbandcamp.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/79289805/-/sgchwctspitfrontcoverbandcamp.jpg","width":350,"height":350}],"artists":[],"categories":[{"id":278618,"name":"CDs/Vinyl","permalink":"cds-vinyl","url":"/category/cds-vinyl"}]},{"id":3372012,"name":"Hotel Wrecking City Traders & Gary Arce (12\" vinyl) (2011)","permalink":"hotel-wrecking-city-traders-gary-arce-lp","position":3,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/hotel-wrecking-city-traders-gary-arce-lp","status":"active","on_sale":false,"created_at":"2011-03-04T05:42:50.000Z","description":"<b><i>\"Continents collide! Oz's Hotel Wrecking City Traders and Gary Arce of Californian desert legends Yawning Man reach across the Pacific to combine noise rock crunch with psych guitar bliss.\" - The Obelisk</i></b>\r\n\r\n<b>A: Coventina's Cascade\r\nB: Traverse of the Oxen\r\n\r\nFull Length LP comes in 180 gram heavyweight colored aqua blue vinyl. LIMITED TO 300 COPIES  ONLY.</b>\r\n\r\n\r\n\r\n\r\n\r\n<u><b>REVIEWS:</u></b>\r\n<b>DOOMMANTIA (www.doommantia.com)</b>\r\nOut in May 2011 via Bro Fidelity Records/Cobraside Distribution, this LP features Gary Arce from Yawning Man fame, and the Hotel Wrecking City Traders have been releasing heavy instrumental rock since 2007. This collaboration works out fine, resulting in two ‘giant’ tracks, each lasting over ten minutes: Coventina's Cascade and Traverse of the Oxen. There’s not a whole lot to say about these two tracks, the main thing is that they are instrumental and they are looong. Overall, I have the feeling something is missing, but I’m not quite sure what. Maybe a hook, or a Memorable Riff? The two tracks sound like spaced out jams, leaning towards soundcapes and probably relying heavily on improv. To a certain degree, I would classify their sound as easy-listening heavy psychedelics, because the tracks tend to get under you radar, and you’ll notice them because they drink in so easily. This is superb homework music, or music to read to. \r\nI do have a problem with the band’s name: I literally had to copy paste Hotel Wrecking City Traders ten times to finally ‘get’ the band’s name. What happened to catchy band names like Alabama Thunderpussy, War Injun & Goatsnake? Ask me again next week, and I have completely forgotten about this band’s name. Not the music, because the music is okay. But is it memorable? Time will tell. In a good rock tradition, the two tracks start in a slow pace, and build up to a climax. After a certain point, the pace drops again, and that keeps you sharp as a listener. Hotel Wrecking City Traders have released an EP (2007), a full-length album called Black Yolk (2008) and a 7” named Somer/Wantok (2010). Gary Arce (The Sort of Quartet, Oddio Gasser, Yawning Sons, Dark Tooth Encounter, Waterways) is of course well-known from Yawning Man, one of the pioneers of the so called desert rock scene. Starting back in ’86, they originally consisted of Gary Arce, Alfredo Hernández, Mario Lalli, and Larry Lalli. They were one of the first bands doing generator parties in the desert, and we all know what came afterwards (Kyuss, Brant Bjork, etc.).So, the album is great, although you have to be a in stoner, psychedelic, jamzy kind of mind to fully appreciate the album I think. The music is easily digestible, and I can imagine you’ll be blown away by their live sound. 7 / 10\r\n\r\n<b>THE OBELISK (www.theobelisk.net)</b>\r\nIt’s a cross-continental collision of sounds, and aside from being into both the Aussie noisemaking brotherly duo Hotel Wrecking City Traders and the work of landmark desert guitarist Gary Arce of Yawning Man, what most drew me in to the idea of their collaborative studio project was how different the two sides are. Hotel Wrecking City Traders, who’ve been releasing music on drummer Ben Matthews’ Bro Fidelity Records since 2007, are a fittingly tight unit. The sounds on their Black Yolk full-length and follow-up Somer/Wantok 12” were rife with intensity and an impatient mathematical feel. By contrast, Gary Arce is considered one of the founding figures of desert rock. His laid back, airy tone and improvisatory will have been a key inspiration for bands literally all over the world, and when it comes to jams, there are few guitarists out there who can add as much personality to a piece of music as he can. It’s not like one’s playing polka and the other death metal (although I hear those go together nowadays too), but it’s a short list of commonalities between Arce and Hotel Wrecking City Traders. Apart from working instrumentally, they seem to be driven by completely different musical ideals. And maybe that’s what makes their joint Hotel Wrecking City Traders and Gary Arce 12” (released on limited 180gram vinyl via Bro Fidelity and Cobraside Distribution, who also put out Yawning Man’s 2010 album, Nomadic Pursuits) so damned interesting. The two-song, 20-minute release combines the disparate elements at work in the total three players involved for a double-guitar brew that’s based as much on improvisational noodling as it is on noisy crunch. It works, too, which is the miracle of the thing. The first track, “Coventina’s Cascade” (10:19) is content to wander in its midsection, Ben providing pulsing bassdrum kicks while his brother Toby Matthews adds to the build on guitar and Arce spaces out for what’s probably the busiest payoff on the release. Hotel Wrecking City Traders showed off some atmospheric tendencies on Somer/Wantok, but Arce takes it to do a different level entirely. One can hear during a break about seven minutes in how the duo constructed the track before sending it to Arce to add his guitar lines, but that’s not at all to discount the flow of what the collective trio come out with as a result. As he does in Hotel Wrecking City Traders proper, Matthews proves capable of holding down a rhythm section, and Toby wisely leaves room to allow for interplay with Arce – who also contributes bass to both cuts, adding further dimensionality to both sides A and B. “Traverse of the Oxen” (10:22) takes much of the same route, offsetting the ambience with heaviness and the heaviness with ambience, and so forth. More even than “Coventina’s Cascade,” “Traverse of the Oxen” demonstrates just how easily Hotel Wrecking City Traders and Gary Arce could have expanded these ideas into a full-length release. The song starts out with Arce’s guitar expanding notes under a Matthews rhythm track before the drum kicks in, and the sound is peaceful but still somehow oceanic. The build, as on “Coventina’s Cascade” is gradual but noticeable, and Arce’s bass does a lot of the work filling out the sound. An almost constant distorted rumble continues from him and Toby as the piece progresses, almost to the point of losing the spacier guitar in the mix when Ben kicks the drums into a faster section before once more slowing down and trading off again in an effectively flowing back and forth, finally culminating in a kind of sonic calamity of a big rock finish before Arce’s bass and guitar close the last three minutes in a wash of soothing ambience. It’s an encompassing sound, made all the more hypnotic by Arce’s work, but Hotel Wrecking City Traders manage to do here what they did on Black Yolk and Somer/Wantok as well, and that’s demand your attention. You can put the Hotel Wrecking City Traders and Gary Arce 12” on and zone out to it, or you can put your ear to the speaker and try to get a direct line into what the trio is doing, and either way, come out of it with a satisfying listen. I don’t know if this is to be an ongoing collaborative project – i.e., if they’ll make an album – but if they decided to keep it going, both sides bring enough to the table here that they have plenty to work from in further development. Fans of Arce will be interested to hear his resonance offset by the Matthews brothers, and those who noticed the hints of pastoral influence on Somer/Wantok will be glad to discover Hotel Wrecking City Traders pushing themselves deeper into new territory. It might be a sleeper in terms of the exposure it gets when it’s released in May, but those who find the 12” and have some sense of what they’re getting are going to be much pleased to hear just how well these two parties mesh. Recommended without reservation.\r\n\r\n<b>CHYBUCCA SOUNDS (www.chybuccasounds.com)</b>\r\nGary Arce, a founding father of the desert rock movement in the late ‘80s, is one of the most hard-working musicians on the planet. A permanent fixture in Yawning Man (as well as the cross-Atlantic collaboration of Yawning Sons), a contributor to Brant Bjork’s Ten East project and a fully-fledged member of Big Scenic Nowhere (not to mention his own solo project Dark Tooth Encounter), Arce is a man in demand. Set for a limited edition release in May via Ben Matthew’s Bro Fidelity label (as well as Cobraside Distribution) this self-titled 12” marks a coming together of contrasting styles. On the one side of the Pacific you have Hotel Wrecking City Traders; two brothers from Melbourne who thrash out noise- inspired psychedelic rock, and up until recently, were asking fans for small financial contributions to help with the making on this and other future projects. On the other side is Gary Arce. It would be unfair to list their accolades side by side; however, together they have created a record that is enhancing and full of scope. ‘Coventina’s Cascade’ juxtaposes melodic intensity, as Arce’s reverb-inducing trance is offset by repetitive rumbles and feedback flowing distortion – a 10-minute atmospheric experience that builds to a calm, yet climatic conclusion. Whereas Arce focuses more on tone and technique, the Melbourne brothers of destruction bring the aggressive; most notably during ‘Traverse of the Oxen’, where their speaker-shattering notion is comprised of Black Sabbath sludge and druggy dream-pop – two contrasting genres that co-exist side by side. Quite rightly, this release is a triumphant for both parties.","options":[{"id":11403586,"name":"LP (Australia/Asia)","price":20.0,"sold_out":false,"has_custom_price":false},{"id":15727781,"name":"LP (Rest of the world)","price":25.0,"sold_out":false,"has_custom_price":true}],"shipping":[{"amount_alone":5.0,"amount_with_others":0.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":7.5,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/35660948/-/hwct_cover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/35660948/-/hwct_cover.jpg","width":626,"height":626}],"artists":[],"categories":[{"id":278618,"name":"CDs/Vinyl","permalink":"cds-vinyl","url":"/category/cds-vinyl"}]},{"id":1430471,"name":"Hotel Wrecking City Traders 'SOMER/WANTOK'(7\" vinyl) (2010)","permalink":"somer-7-hotel-wrecking-city-traders-brofi004","position":4,"price":7.5,"default_price":7.5,"tax":0.0,"url":"/product/somer-7-hotel-wrecking-city-traders-brofi004","status":"active","on_sale":false,"created_at":"2010-02-01T15:07:58.000Z","description":"(BroFi004) HOTEL WRECKING CITY TRADERS - 'Somer/Wantok' 7\" Vinyl. Two brand new songs recorded in December 2009 w/ Jack Farley (Beaches/Spider Vomit). Mastered by Jason Fuller. Packaging features band logo embossed in gold foil. Limited to 300 copies only.\r\n\r\nREVIEWS:\r\n\r\nDeaf Sparrow (USA):\r\nThe people at We Empty Rooms released a pretty cool Fire Witch recording just a few months ago. I expected stoner rock but instead I was treated to that and much much more. Now I hold the sleeve of the Somer/Wantok 7 inch by Hotel Wrecking City Traders in my hand and for a second there, before I deciphered the logo, I thought this was going to be black metal. Instead, this Aussie experimental band jams some half-cooked stew of noise rock on one half and instrumental stoner on the other. The first half (“Somer”, I assume) moves at an odd and disengaging tempo. Bummer. The idea is good. Drums sound like drums and guitars sound like the strings are being strummed by a walrus. “”Wantok” is much better. Groovy bass, relaxed drums. Sounds like surf rock for disturbed surfers.\r\n\r\nStoner Rock.Com (Reviewed by:Janet Willis)\r\nThe newest release from this downtuned duo from down under and definitely a welcome sound. The bands prior releases tended to be a bit more caffeinated then this one, but the heaviosity and fuzzy effects are just as present and awesome. I'm kinda thinking this is sort of similar to Beast in The Field's \"World Ending\", where it took a darker and mellower tempo and managed to keep the volume and intensity high up there. Super Sonic Psyche jams never get old!!!!\"\r\n\r\nCrucial Blast (USA) Reviewed by: Adam\r\nWe've got another Aussie noise rock band that's been kicking our ass lately...The awkwardly-named Hotel Wrecking City Traders features two of the guys from the band Daggers Mid Flight and play a similar brand of super-heavy, sludgy noise rock that we're coming to identify with the bands that orbit the Chairfish and We Empty Rooms labels. A drum and guitar duo, Hotel Wrecking City Traders deliver two songs of instrumental crush on this 7\" that are in the same heavy, ponderous vein as their Black Yolk Cd on Bro Fidelity (which we'll have reviewed in next weeks new arrivals list), and it's earthquake-heavy stuff that fans of early Floor and the old Bovine Records band Thug have been waiting for. \r\nA-side jam \"Somer\" is a brutal down tuned slugfest of sledgehammer ur-riffage and titanic drum bash that sounds a lot like early Floor, droning and loose and heavier than a sack of bricks, but with a bit of an Am Rep vibe to the barbaric, tuneless riffing that this evolves into. Punishing heavy shit, and sounds like they are just barely keeping the beast from falling apart into a big pile, but there's an odd saurian groove going on here. The guitar tone is noxiously sludgy and phlegmy, and as the song progresses, there's this noise from the drum kit that sounds like the guy's cymbals are actually unraveling while they're playing. Goddamn crushing.\r\nThe song \"Wantok\" on the flipside is a little more toned down, but still heavy stuff. It takes a drugged, serpentine Sleep-esque riff, bashes it's brains out and then and drags it across burly slow-motion beats and swathes of phased fx, dishing out a massive, meaty slab of acid-sludge hypnosis that sinks in real fast, like some syrup-dragging krautrock dirge.\r\nThe sleeve is fucking spectacular looking, with embossed metallic gold print on both the front and back and artwork designed by one of the guys from the band Heirs; as usual, this is pretty limited, with only three hundred copies pressed.\r\n\r\nAt War With False Noise (UK):\r\nFor me, these guys really come into their own on the 7\" format, the guitar vs drums attack works beautifully over the shorter format and they chose two songs that just get right down to business without any messing about. Totally great stuff, get this one and if you like it buy the album!\r\n\r\n\r\n\r\n","options":[{"id":5256611,"name":"Default","price":7.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":5.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/14120151/-/hotelwreckers_somerwantok.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/14120151/-/hotelwreckers_somerwantok.jpg","width":510,"height":510}],"artists":[],"categories":[{"id":278618,"name":"CDs/Vinyl","permalink":"cds-vinyl","url":"/category/cds-vinyl"}]},{"id":1430491,"name":"Fire Witch 'LIARS!'  (Deluxe CD) (2009)","permalink":"fire-witch-cd-brofi003","position":5,"price":15.0,"default_price":15.0,"tax":0.0,"url":"/product/fire-witch-cd-brofi003","status":"active","on_sale":false,"created_at":"2010-02-01T15:11:35.000Z","description":"(BroFi003) CD Release of Australian band Fire Witch. Reissue of two extremely-rare EP's originally released on WeEmptyRooms in limited quantaties of 100 (Australia Only). \r\n\r\nThis special one off pressing of this awesome release, features Deluxe cardboard packaking, individually-hand-numbered and screen printed. Artwork by Jace Rogers (Fangs Of...)\r\nLimited to 500 copies only.\r\n\r\nREVIEWS:\r\n\r\nDECIBEL MAGAZINE (Leah Sottille) Nov, 2010\r\nIf getting grabbed by the tits is your thing, skip ahead to the sixth minute of the first track of Fire Witch’s latest, Liars. You’ll get a quick volume hit there. But if you’re patient and listening for more than just noise, the first 5:59 of that track is a slow, waist-high slurry of thick, grimy riffage. At times, it cools down to just a notch above silent. And you’ll be falling asleep right when they decide to blast you right in the kisser. I imagine that’s exactly what this band was intending.\r\n\r\nMelbourne, Australia’s Fire Witch lay four tracks (but just two songs) out here over the course of an hour—an effort they adorably catalog in the liner notes of the record. They admit to the following there: this was their first time in a studio, they weren’t on drugs, it took five years to get this fucker out, someone else paid for it, they hand-made every last copy and they have no intention of making more.\r\n\r\nSo, with only those notes and this record as context for this band, the trio expertly offers a patient, long-way-home instrumental record that is simplistic, but never dull. Tracks three and four are together “Critter/Kritta” (eeee! Australian accents!), a droning slow jog sopping wet in psychedelic guitars and breakneck drums that, by the fourth track, turns downright eerie. Liars is, what I imagine, like watching this band live: there’s feedback and an accidental rimshot here and there. If this is how they always sound, Fire Witch arethe Helvetica of stoner rock bands. Simple, clean. Artful not in what it is, but in the spaces it creates. —Leah Sottile","options":[{"id":5256721,"name":"Default","price":15.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":0.0,"country":{"id":3,"name":"Australia","code":"AU"}},{"amount_alone":5.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/21713471/-/everythingforWeb.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/21713471/-/everythingforWeb.jpg","width":454,"height":447}],"artists":[],"categories":[{"id":278618,"name":"CDs/Vinyl","permalink":"cds-vinyl","url":"/category/cds-vinyl"}]}]