[{"id":2504951,"name":"Parfüm \"Blaues Blut\" ","permalink":"parfüm-blaues-blut","position":1,"price":80.0,"default_price":80.0,"tax":0.0,"url":"/product/parfüm-blaues-blut","status":"sold-out","on_sale":false,"created_at":"2010-04-26T02:27:19.000Z","description":"Der klassische Duft für Damen und Herren nach einem alten traditionellen Parfümrezept der Grafen von Blickensdorf seit dem 19. Jahrhundert unverändert – jetzt wieder frisch aufgelegt. Die Kopfnote ist eine frische Zitrusnote gepaart mit einem erquickend-moosigen Duft als Herznote und die Basis ist der zarte geheimnisvolle, verführerische Duft französischer Rosen – die Aristokraten unter den Blumen. Dazu ein Vanillehauch aus der Blüte des Heliotrops. Lassen Sie sich mit diesem hinreißenden Duft in die Zeit des Biedermeiers entführen. Mit diesem hochwertigen Parfüm riechen Sie nach Adel! Schon Graf Ulrich der Vielgeliebte rief einmal vor Entzücken aus: \"Diesen Duft riechen und dann sterben!\"\r\n \r\n1000 Stück, streng limitierte Auflage. Flasche mit 30 ml Parfüm wird geliefert in einem handgefertigten Karton und dieser steckt noch zusätzlich in einem wertvollen, geheimnisvoll- schimmernden Organza-Beutel. Ein Echtheits-Zertifikat des Grafen von Blickensdorf, durchnummeriert und handsigniert, liegt jeder Lieferung bei.\r\n","options":[{"id":8905931,"name":"Default","price":80.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24127891/-/Blaues_Blut_sehr_klein_quer_2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24127891/-/Blaues_Blut_sehr_klein_quer_2.jpg","width":470,"height":362}],"artists":[],"categories":[{"id":1547642,"name":"Parfüm \"Blaues Blut\" 30 ml","permalink":"parfüm-blaues-blut-30-ml","url":"/category/parfüm-blaues-blut-30-ml"}]},{"id":2582317,"name":"Gräfliche Fahrradklingel","permalink":"gräfliche-fahrradklingel","position":2,"price":22.0,"default_price":22.0,"tax":0.0,"url":"/product/gräfliche-fahrradklingel","status":"sold-out","on_sale":false,"created_at":"2010-05-20T22:57:21.000Z","description":"Gegen diese Fahrradklingel ist der Kölner Dom nur ein müdes Gebimmel. Diese Klingel wird schon in Reiseführern schlicht als »Sound of Charlottenburg« bezeichnet. Denn der Graf von Blickensdorf benutzt sie sogar persönlich an seinem Miele-Fahrrad. Aus diesem Grunde ziert sie eine kleine eingearbeitete Krone. Sie ist laut, und sie muss es auch sein, was jedem klar wird, der einmal vor Ort die Kantstraße oder den Kurfürstendamm in Charlottenburg zu sehen bekommen hat: Die Fahrradklingel ist dort überlebenswichtig und der Graf betätigt sie praktisch auf jedem Meter seines Weges, um im Verkehrsgewühl auf sich aufmerksam zu machen. \r\nDiese formschöne Klingel wird in einer kleinen Klingelfabrik direkt an der holländischen Grenze in einem aufwändigen Arbeitsprozess in kleiner Menge von liebevoller Hand hergestellt. Wir konnten uns noch exklusiv eine kleine Stückzahl für unsere verehrte Kundschaft sichern. Um die Langlebigkeit dieser Fahrradklingel zu garantieren, sollten Sie Ihrem Kammerherrn auftragen, die Mechanik etwa einmal jährlich mit einem Tropfen guten Öls zu versehen.\r\n","options":[{"id":9150495,"name":"Default","price":22.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/24867603/-/Gr_fliche_Fahrradklingel.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/24867603/-/Gr_fliche_Fahrradklingel.jpg","width":430,"height":322}],"artists":[],"categories":[{"id":1547615,"name":"Gräfliche Fahrradklingel","permalink":"gräfliche-fahrradklingel","url":"/category/gräfliche-fahrradklingel"}]}]