[{"id":12255354,"name":"PSD to HTML Web Design Conversion for Static Pages","permalink":"psd-to-html-web-design-conversion-for-static-pages","position":1,"price":150.0,"default_price":150.0,"tax":0.0,"url":"/product/psd-to-html-web-design-conversion-for-static-pages","status":"active","on_sale":false,"created_at":"2013-07-09T02:02:06.000Z","description":"Have some great design for your website but struggling with HTML / CSS codes? I can help you with that.\r\n\r\nI specialized in converting your design into HTML / CSS validated codes that are handcrafted, well structured and semantic friendly. You will get pixel perfect fully functional web pages that's similar to your web design.\r\n\r\nThis package includes coding of static pages for 1 home / front page and 1 inner page. Extra pages at $30 per page. It does not include features such as forms.\r\n\r\nPlease contact me about your requirement to see if I can meet your needs.\r\n\r\nYou are to provide PSD file or high quality image file. My work will be based on your file.\r\n\r\nTakes 1 to 4 weeks to complete, depends how quick you respond and how busy I am.\r\n\r\nI will start working on your project once payment received. All files will be electronically delivered. From then on files are owned by you and you can edit when required. No strings attached.\r\n\r\nWho am I? I am a web developer. While I cannot share corporate websites I work and have worked on, I have over 10 years of experiences creating websites professionally and as a hobby. <b>I specialized in converting your design into html / css validated codes.</b>","options":[{"id":38847561,"name":"Default","price":150.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/120755862/-/product3.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/120755862/-/product3.png","width":400,"height":400}],"artists":[],"categories":[{"id":2355225,"name":"Website","permalink":"website","url":"/category/website"}]},{"id":4247259,"name":"3-Page Website","permalink":"5-page-website-with","position":2,"price":150.0,"default_price":150.0,"tax":0.0,"url":"/product/5-page-website-with","status":"active","on_sale":true,"created_at":"2011-08-12T16:36:45.000Z","description":"A website with up to 3 static pages at affordable price.\r\n\r\nGreat to startup your online presence or redesign your static website.\r\n\r\nYou must provide text (up to 3 pages) and essential graphics (including logos and photos). I will do a simple and basic design based on the graphics provided.\r\n\r\nStatic pages only and all pages have the same layout. Extra pages at $30 per page.\r\n\r\nThis does not include: graphic / logo designs, slide shows, domain name registration and hosting, nor any features such forms (eg contact form), blogs, forums and galleries.\r\n\r\nPlease contact me about your requirement to see if I can meet your needs.\r\n\r\nI will start working on your project once payment received. I will work with you through out the process and until you're satisfied. Once approved, all files will be electronically delivered or uploaded to your host. From then on files are owned by you and you can edit contents when required. No strings attached.\r\n\r\nTakes 2 to 8 weeks to complete, depends how quick you respond and how busy I am.\r\n\r\nThis is at a special affordable rate because I'm working to build my personal portfolio.\r\n\r\nWho am I? I am a web developer. While I cannot share corporate websites I work and have worked on, I have over 10 years of experiences creating websites professionally and as a hobby. <b>I specialized in converting your design into html / css validated codes.</b>","options":[{"id":14009047,"name":"Default","price":150.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/120742695/-/product.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/120742695/-/product.png","width":400,"height":400}],"artists":[],"categories":[{"id":2355225,"name":"Website","permalink":"website","url":"/category/website"}]},{"id":4251907,"name":"Install and Setup Website","permalink":"install-and-setup-website","position":3,"price":90.0,"default_price":90.0,"tax":0.0,"url":"/product/install-and-setup-website","status":"active","on_sale":false,"created_at":"2011-08-13T12:04:27.000Z","description":"Want to setup your self hosted website (eg blog or forum) but don't have the technical skill to do it?\r\n\r\nI can help you to install and setup the software to kickstart your business or personal website.\r\n\r\nI have worked on a number of websites using open source softwares. If you need a blog I can help you to install Wordpress or b2evolutions or any blogging softwares. If you need a forum I can help you to install simple machine forum, phpbb, mybb or any forum softwares. For any other products, please contact me to see if I can help you with that.\r\n\r\nThis service includes ONE software installation and basic setup to kickstart your website. Depends on the product I can also install essential plugins and / or premade themes and skins of your choice. Premium plugins and themes will incur additional cost.\r\n\r\nThis does NOT include any theme / skin customization, content transfer, design, domain name registration and hosting.\r\n\r\nPlease contact me first about your requirement - including the software you're going to use, to see if I can meet your needs.\r\n\r\nI will start installing and setup once payment received. You must provide me your hosting information so I can install and setup the software. Basic training on how to use the software will also be provided. From then on you can start adding contents yourself. No strings attached.\r\n\r\nWho am I? I am a web developer. While I cannot share corporate websites I work and have worked on, I have over 10 years of experiences creating websites professionally and as a hobby. I specialized in converting your design into html / css validated codes.","options":[{"id":14009175,"name":"Default","price":90.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41567839/-/product2.gif","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41567839/-/product2.gif","width":400,"height":400}],"artists":[],"categories":[{"id":2355225,"name":"Website","permalink":"website","url":"/category/website"}]}]