[{"id":3202233,"name":"Wool Felt Rhino Plush Toy ","permalink":"meet-riley-a-hand-crafted-wool-felt-rhino","position":1,"price":68.0,"default_price":68.0,"tax":0.0,"url":"/product/meet-riley-a-hand-crafted-wool-felt-rhino","status":"active","on_sale":false,"created_at":"2011-01-29T02:05:04.000Z","description":"An adventurous rhino, Riley always seems to be getting into something or other. He often has his nose buried in a jar of blackberry jam. He mischieviously digs up his neighbor Ms. Giraffe's flower bed looking for gold rocks. Spending his afternoons building the tallest sky-scraper out of pop-sicle sticks are what keep him busy most days. \r\n\r\nThrough all of his many adventures, he never forgets to act like the gentleman his mother taught him to be. He demonstrates his good manners by carrying the little birdies on his horns across the stream when their wings get tired. Such a good rhino.\r\n\r\nI designed Riley completely by hand one cold, wintry afternoon, but he has a warm heart and would love to go home with you. He is made of 100 percent wool felt, which means he resists fuzzies very well and is all natural. \r\n\r\nI hand stitched him with hand-dyed, pearl cotton Valdani thread. His underbelly is made of a multi-colored, blue polka-dot, cotton fabric and his tail is hand braided. Navy blue french knots make up his eyes as well as his charming smile, (He gets it from his dad).\r\n\r\nRiley measures approximately 8.5\" inches long, 4.25\" inches tall by 3.25\" inches wide. A machined stitched safety bag of rice sits inside his belly to give him weight,(also on reserve for when he gets hungry on his many adventures) and all natural cotton fibers are what make him lovable and huggable. Perfect for your little ones' hands.\r\n\r\nNote: Because Riley has a small bag of rice in his center, please supervise children while at play. He is made with the highest safety precautions, and although the rice bag is securely stitched closed, this toy may not be suitable for children ages 3 years and under.","options":[{"id":10912503,"name":"Riley in Vintage Blue","price":68.0,"sold_out":false,"has_custom_price":false},{"id":13153205,"name":"Regina in Apricot","price":68.0,"sold_out":false,"has_custom_price":false},{"id":13153207,"name":"Lula in Lilac/Purple","price":68.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41228199/-/_MG_6187.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41228199/-/_MG_6187.jpg","width":800,"height":533}],"artists":[],"categories":[{"id":2194775,"name":"ANIMALS","permalink":"animals","url":"/category/animals"},{"id":1819593,"name":"BABY","permalink":"baby","url":"/category/baby"}]},{"id":3852978,"name":"Earth Friendly Toy Elephant / Vintage Baby Blue  ","permalink":"earth-friendly-plush-baby-elephant-in-vintage-blue","position":2,"price":42.0,"default_price":42.0,"tax":0.0,"url":"/product/earth-friendly-plush-baby-elephant-in-vintage-blue","status":"active","on_sale":false,"created_at":"2011-06-02T17:37:17.000Z","description":"A soft and cuddly baby plush elephant with a surprise burst of of beautiful print fabric on its belly and ears. Just the right amount of stuffing makes it the perfect toy to hug. This beautiful baby elephant would look wonderful in your child's room or make a heartfelt gift for a newborn.\r\n\r\nI made this precious baby elephant out of a lovely shot cotton blend of vintage blue fabric with faint cream undertones. It's contrasting fabric is made from Liberty of London fabric. It is a graphic, geometrical print with a cream background and soft orange, yellow and blue color blocks line the underbelly and the back of its ears. Both fabrics are high quality cotton that is machine washable. This elephant measures approximately 10 inches wide by 8.5 inches tall.\r\n\r\nI stuffed this baby elephant with earth friendly bamboo that has been spun into rayon fibers that are totally a renewal resource.\r\n\r\nNOTE: Bamboo plants absorb 2/3 more carbon dioxide and give off 2/3 more oxygen than any other plant on earth. They perfectly balance humidity which may lead to a positive impact on global warming.\r\n","options":[{"id":12857026,"name":"Default","price":42.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/60838919/-/_MG_6816_800px.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/60838919/-/_MG_6816_800px.jpg","width":800,"height":647}],"artists":[],"categories":[{"id":2194775,"name":"ANIMALS","permalink":"animals","url":"/category/animals"},{"id":1819593,"name":"BABY","permalink":"baby","url":"/category/baby"}]},{"id":3832434,"name":"Baby Owl Rattles / Wool Felt","permalink":"earth-friendly-wool-felt-baby-owl-rattles","position":3,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/earth-friendly-wool-felt-baby-owl-rattles","status":"active","on_sale":false,"created_at":"2011-05-29T20:29:00.000Z","description":"I’m sure you’ve seen many owls peeping about, but this one is definitely one of a kind. I know, you couldn’t get enough of that cute face! As adorable as any baby owl could be. Perfect for little (and big) hands.\r\n\r\nI made this rattle out of 100% wool felt ans stuffed it with 100% organic cotton fibers. There is a safety rattle insert in the center of its tummy that makes a pleasant sound to keep baby's interest. I hand cut and embroidered the details with hand-dyed cotton embroidery thread and secured both sides together with a snuggly blanket stitch.\r\n\r\nThis is an adorable earth-friendly item to pair along with a baby gift and excellent decor to add to your child's nursery.\r\n\r\nPlease make sure to choose your color option when adding to cart.\r\n\r\nNote: Also available as a plush only, without the rattle insert. Please contact us using the \"CONTACT\" button on the lower right hand of the page.","options":[{"id":12796792,"name":"Vintage Blue","price":18.0,"sold_out":false,"has_custom_price":false},{"id":12796796,"name":"Hot Pink","price":18.0,"sold_out":false,"has_custom_price":false},{"id":12796794,"name":"Mustard and  Brown","price":18.0,"sold_out":false,"has_custom_price":false},{"id":12796798,"name":"Lilac","price":18.0,"sold_out":false,"has_custom_price":false},{"id":12796800,"name":"Apricot","price":18.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40242122/-/_MG_6646_800px.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40242122/-/_MG_6646_800px.jpg","width":800,"height":533}],"artists":[],"categories":[{"id":2194775,"name":"ANIMALS","permalink":"animals","url":"/category/animals"},{"id":1819593,"name":"BABY","permalink":"baby","url":"/category/baby"}]},{"id":3281393,"name":"Plush Toy Pillow / Golden Yellow + Chocolate Brown","permalink":"the-honey-pie-tree-plush-toy-pillow","position":4,"price":48.0,"default_price":48.0,"tax":0.0,"url":"/product/the-honey-pie-tree-plush-toy-pillow","status":"active","on_sale":false,"created_at":"2011-02-14T00:26:40.000Z","description":"Fluffy, golden-yellow clouds of honey are what this tree feels like. A touch of heaven on a trunk! Your little one will love to carry this comfort toy around on many occasions. Doubles as a pillow for quick naps.\r\n\r\nI made this tree from 100% high-quality wool felt and quilt quality chocolate brown fabric. The tree \"leaves\" are hand embroidered with a snug blanket-stitch and the trunk is machine sewn with hand-embroidered appliqued leaves. The HoneyPie Tree measures approximately 15 inches tall by 9 inches wide. I used only natural cotton stuffing to make it nice and fluffy and put a little door on the front, because well, it just felt like home. The door measures approximately 3 inches tall by 2.25 inches wide.\r\n\r\nThe little door is made from 100% chocolate brown wool felt, has a linen backing and opens and stays closed with a velcro closure. I hand cut an assortment of small leaves and hand-embroidered each one on to the door with a beautiful blanket-stitch applique. The \"doorknob\" is made of cotton twill-tape with a mint green, vintage button securely stitched with hand-dyed embroidery thread. \r\n\r\nThe door opens to reveal a tiny little bluebird made of 100% wool felt. She calls The HoneyPie Tree her home, but you can put whatever tiny treasure you wish inside this secret pocket.\r\n\r\nNote: Listing includes one tree only. Other items are sold separately. May not be suitable for children ages 3yrs and under due to small parts (button). If you would like the tree made without the button, please indicate so in notes to seller at checkout.\r\n\r\nThanks!\r\n\r\nView more toys here: http://thehoneypietree.bigcartel.com/category/toys\r\n\r\n","options":[{"id":11147287,"name":"Default","price":48.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/46529131/-/_MG_6361.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/46529131/-/_MG_6361.jpg","width":800,"height":533}],"artists":[],"categories":[{"id":1590520,"name":"HOME DECOR","permalink":"home-decor","url":"/category/home-decor"}]},{"id":3136705,"name":"Plush Baby Turtle / Jewels","permalink":"plush-wool-felt-baby-turtle","position":5,"price":28.0,"default_price":28.0,"tax":0.0,"url":"/product/plush-wool-felt-baby-turtle","status":"active","on_sale":false,"created_at":"2011-01-14T20:19:49.000Z","description":"Named after the famous baby turtle in our household. Jewels is just that, a jewel. She does a wonderful job of keeping my daughter and I company in our cozy little apartment here in Brooklyn. Turtles are very intriguing animals that have a lot more energy than most would believe.\r\n\r\nBesides spending at least three hours a day getting her exercise (she's always trying to climb out of her tank), Jewels is in to various other activities.\r\n\r\nShe loves to somersault over her rocks and plays hide and seek under her sea shells. We always find her, but it's fun nonetheless.\r\n\r\nYou can have your very own Jewels made from the finest imported wool felt. Only the best materials are used for such a talented and beloved turtle!\r\n\r\nJewels measures approximately 7\"in long by 5.5\"in wide. Two little french knots are hand embroidered so she can see where she's somersaulting. She is stuffed with 100% organic cotton fibers and has a rice filled pouch in her very center. The rice pouch gives her just enough weight to keep her tiny body from flying away.\r\n\r\nNote: The rice is securely sewn in a separate safety pouch and is surrounded by cotton fibers. All edges are machine stitched closed. Although this is super safe, this item may not be suitable for children ages 3yrs and under. Please use supervision and adult discretion to ensure the highest safety measures. ","options":[{"id":10724547,"name":"Default","price":28.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/39657583/-/IMG_5917_800px.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/39657583/-/IMG_5917_800px.jpg","width":800,"height":533}],"artists":[],"categories":[{"id":2194775,"name":"ANIMALS","permalink":"animals","url":"/category/animals"}]}]