[{"id":10938978,"name":"Print","permalink":"print-isela-la-calavera-catrina","position":1,"price":22.0,"default_price":22.0,"tax":0.0,"url":"/product/print-isela-la-calavera-catrina","status":"active","on_sale":false,"created_at":"2013-05-03T22:33:15.000Z","description":"\"Isela, la Calavera Catrina\", Open edition print.\r\n\r\nThis is an original photograph taken by me of one of my handmade art dolls (inspired by the \"la Calavera Catrina\" of Mexico).\r\n\r\n\r\nThe image is approx 7.25\" by 4.75\"  and is printed onto 8½\" x 11\" Hahnemühle Museum Quality paper, which has a beautiful & smooth watercolor paper like texture and is specifically made for fine art digital prints (giclée). It is slightly off white in color,100% cotton rag and it has a permanence rating of over one hundred years. A special coating allows for deep saturation, vibrant colors and wide range of tones.\r\n\r\nArchival Inks were used in the printing and they have a permanence rating of over one hundred years as well. All images will be printed in a matte finish and will arrive signed, titled and dated, in pencil just below the image.\r\n\r\nEach print will arrive in an acid free cello bag in a sturdy stay- flat mailer and sent out USPS First Class.\r\n(Unlike my dolls, prints will not be sent out with insurance unless requested).\r\n\r\n\r\n˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º˚º\r\n\r\nPlease note the following:\r\n\r\n**Image is printed at a high resolution\r\n\r\n\r\n* Due to the variances in monitor screens, images may appear slightly different online than they do printed. That being said, I never send out anything but my best work and as a photographer (and creator of these dolls), I've paid special attention to getting the colors just right. Because I usually shoot using a shallow depth of field, images may be both blurred and sharp in some areas~both are intentional.\r\n\r\n\r\n*Print does not arrive framed or matted nor will it have a watermark on it.\r\n\r\n\r\n*The actual doll was sold and is no longer available\r\n\r\n\r\nALL SALES ARE FINAL.\r\nOnce item has shipped, there are No refunds or exchanges. I will refund any difference in shipping costs if it equals one dollar or more.\r\n\r\nT H A N K Y O U !\r\n\r\n~Christine :) \r\n","options":[{"id":34391310,"name":"Default","price":22.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":6.5,"amount_with_others":4.0,"country":{"id":28,"name":"Mexico","code":"MX"}},{"amount_alone":3.5,"amount_with_others":1.5,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":12.75,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/107587281/-/print.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/107587281/-/print.jpg","width":900,"height":633}],"artists":[],"categories":[]}]