[{"id":11183004,"name":"Mosbeau Body Fit","permalink":"mosbeau-body-fit","position":1,"price":50.0,"default_price":50.0,"tax":0.0,"url":"/product/mosbeau-body-fit","status":"active","on_sale":false,"created_at":"2013-05-16T02:34:54.000Z","description":"Benefits:\r\nContains Salasia and Chitosan that helps dissolve fat.\r\nWith Kiwi Extract, Magnesium Oxide and Astibe thunbergii Extract Powder for good digestion and removes fat while cleansing the colon.\r\nInfused with Kaempferia Parviflora and Gymnema Powder to lower blood sugar.\r\nRemoves bulges or unwanted fats.\r\nImproves stamina and vitality to avoid fatigue.\r\n\r\nHow To Use:\r\nTake 3 capsules a day. Intake maybe on or before meal.","options":[{"id":35189118,"name":"Default","price":50.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":6.95,"amount_with_others":3.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/109985409/-/Bodyfit-Single-600x600.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/109985409/-/Bodyfit-Single-600x600.png","width":320,"height":320}],"artists":[],"categories":[{"id":1628769,"name":"Supplement","permalink":"supplement","url":"/category/supplement"}]},{"id":6399785,"name":"Mosbeau Placenta White Advanced Supplement","permalink":"mosbeau-placenta-white-advanced-supplement","position":2,"price":87.0,"default_price":87.0,"tax":0.0,"url":"/product/mosbeau-placenta-white-advanced-supplement","status":"active","on_sale":false,"created_at":"2012-06-08T17:18:32.000Z","description":"The breakthrough whitening, anti-aging and skin cell renewal supplement that boost with innovative and latest ingredient Horse and Marine Placental Protein that is very famous in Japan. Be at your most beautiful in just 14 days! \r\n\r\nContent: 650 mg | 120 tablets \r\n\r\nBENEFITS:\r\nDouble up whitening, anti-aging and moisturizing effects.\r\nGet effective whitening, anti-aging and skin renewing benefits from Horse Placental Protein and Japan Patented No. 3899116, 3946238 & 3946239 Marine Placental Protein.\r\nPromotes good blood circulation that gives better sleep through Carrot Extract.\r\nPotent anti-allergic effect with Rose Petal Extract.\r\nRid skin imperfections with Silk Powder that has 18 kinds of amino acids that revitalizes the skin.\r\nAchieve firmer, softer and younger skin with Elastin and Collagen.\r\nNo need to take in other vitamins or supplements for skin-whitening or anti-aging to take effect.\r\nPromotes healthy and renewed cells that make a whiter skin.\r\n\r\nINGREDIENTS:\r\n17 ADVANCED INGREDIENTS\r\n\r\nPlacenta is a rich source of natural and potent amino acid that is essential for the production of beautiful and healthy skin. Mosbeau uses Horse Placental Protein, harness from Japanese healthy horses. It is known that horse placenta contains 300 more amino acids compared to other animal placenta extracts. Mosbeau’s Horse Placental Protein is clinically proven more effective skin-whitening and skin nourishing ingredient with exemplary cell renewing and anti-aging properties.\r\n\r\nWhile Marine Placental Protein is from fresh Japanese Salmon egg that is licensed and certified as natural, effective ingredient in skin-whitening, anti-aging and skin renewal.\r\n\r\nPLACENTAL PROTEIN MAIN BENEFITS:\r\n\r\nSKIN-WHITENING\r\n\r\nActively hampers tyrosinase activity, a component of melanin that is responsible for skin’s complexion.\r\nANTI-AGING\r\n\r\nFights & reverses the skin-aging process. It visibly reduces wrinkles and fine lines.\r\nSKIN CELL RENEWAL\r\n\r\nStimulates skin cell renewal to revitalize the skin. This helps to improve cellular functions and protects the skin from degeneration.\r\nOTHER INGREDIENTS\r\n\r\nCOLLAGEN\r\nReverses skin aging and visibly removes wrinkles, fine lines and other unsightly signs of skin aging.\r\n\r\nSOY ISOFLAVONE\r\nHelps in promoting hormonal balance.\r\n\r\nVITAMIN C\r\nAids in skin-whitening, anti-aging and protecting the skin from free radicals that causes skin damage.\r\n\r\nACEROLA\r\nIs a potent antioxidant and rich with vitamin C.\r\n\r\nROSE PETAL EXTRACT\r\nHas anti-allergic effects and anti-atopic properties.\r\n\r\nELASTIN\r\nIs a protein found in the skin and tissue of the body. It helps keep skin flexible but firm, and smooth.\r\n\r\nHYDRAULIC ACID\r\nA natural substance that can be found in the body. It is great for skin care as it has the ability of retaining water. It is this unique characteristic that makes skin hydrated, moist and soft thereby maintaining a youthful appearance.\r\n\r\nSILK POWDER\r\nA component that helps revitalized the skin and rid skin imperfections like wrinkles, acnes etc.\r\n\r\nGLYCINE\r\nProvide moisture retention capabilities and improves skin’s firmness.\r\n\r\nADLAY\r\nPromotes good skin conditioning and moisturizing.\r\n\r\nL-CYSTEINE\r\nIs an amino acid that is very beneficial to the hair and skin.\r\n\r\nHESPERETIN\r\nIs an enhancer that boost the effects of Glutathione.\r\n\r\nß CRYTOXANTHIN\r\nProtects the cells from the damaging effects of free radicals.\r\n\r\nCARROT EXTRACT\r\nPromotes good blood circulation and active oxygen that helps make the skin look younger and fresh.\r\n\r\nGLUTATHIONE\r\nMaster anti-oxidant that helps fight free radicals that causes skin damages. It also contributes to good liver function.\r\n\r\nDIRECTIONS:\r\nTake 4 tablets a day.","options":[{"id":20383549,"name":"Default","price":87.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":6.95,"amount_with_others":3.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/62851093/-/placentaadvanced.gif","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/62851093/-/placentaadvanced.gif","width":288,"height":360}],"artists":[],"categories":[{"id":1628770,"name":"Facial Care","permalink":"facial-care","url":"/category/facial-care"},{"id":1628769,"name":"Supplement","permalink":"supplement","url":"/category/supplement"}]},{"id":6472991,"name":"PLACENTA WHITE ALL-IN-ONE FACIAL CREAM","permalink":"placenta-white-all-in-one-facial-cream","position":3,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/placenta-white-all-in-one-facial-cream","status":"active","on_sale":false,"created_at":"2012-06-17T15:19:35.000Z","description":"NO NEED FOR OTHER BEAUTY PRODUCTS\r\n\r\nMoisturize and more with the All-in-One Facial Cream with its combined effects of facial lotion, beauty essence, moisturizer and sun block. You’ll never run out of reason to be at your most beautiful. \r\n\r\nContent: 55 g\r\n\r\nBENEFITS:\r\nGet the benefits of skin-whitening, anti-aging, moisturizing and UV protection.\r\nLet your skin be nourished and rejuvenated with Dipotassium Glycyrrhizate and Ubiquinone that serves as potent antioxidant properties. Look younger with great moisturizing ingredients like Hydrolyzed Collagen and Hydrolyzed Elastin. With Butyl Methoxydibenzoylmethane and Sericin for UV protection.\r\nBe young, radiant and fair with Horse Placental Protein an effective skin-whitening, anti-aging and skin-nourishing ingredient.\r\nImprove your skin problems by controlling your skin allergies with Glycyrrhizinate 2K.\r\nIts gel type based texture is developed to achieve a lighter and smoother consistency that is easily absorbed by the skin. It is non-sticky or moist unlike before, and effective for all skin types.\r\nThe make up blends easily and smoothly to your skin, so you’ll get a matte finish for a shine-free instant make up base.\r\n\r\nINGREDIENTS:\r\nHORSE & MARINE PLACENTAL PROTEIN\r\nPlacental Protein is a popular skin-whitening agent in Japan. Recognized as an exemplary ingredient that visibly whitens skin, removes wrinkles and fine lines, detoxifies the body and speeds up skin cell renewal. Horse Placental Protein is a more effective skin-whitening and skin-nourishing ingredient than Pig Placental protein. While, Marine Placental Protein is patented by Japan government as an effective ingredient in skin-whitening, anti-aging and skin renewal.\r\n\r\nCO-Q10\r\nA component that cells use to produce energy your body needs for cell growth and maintenance.\r\n\r\nHYDRAULIZED COLLAGEN\r\nIt forms a film on the surface of the skin making it smoother and softer.\r\n\r\nSERICIN\r\nCreates a protective film on the skin to block pollution and harmful UV rays.\r\n\r\nDIRECTIONS:\r\nAfter washing face, lightly pat dry face leaving the skin still a bit damp. Get an ample amount of cream and massage all over your face and neck using an upward, circular motion.\r\n\r\n","options":[{"id":20594625,"name":"Default","price":60.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/63564637/-/AllinOneCream.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/63564637/-/AllinOneCream.jpg","width":360,"height":504}],"artists":[],"categories":[{"id":1628770,"name":"Facial Care","permalink":"facial-care","url":"/category/facial-care"}]},{"id":6473153,"name":"PLACENTA WHITE UNDERARM & INNER THIGH CREAM","permalink":"placenta-white-underarm-inner-thigh-cream","position":4,"price":60.0,"default_price":60.0,"tax":0.0,"url":"/product/placenta-white-underarm-inner-thigh-cream","status":"active","on_sale":false,"created_at":"2012-06-17T16:34:10.000Z","description":"White Underarms in just 14 Days!\r\n\r\nGet the best selling underarm cream that is proven to lighten up dark areas in just 14 days. Let your skin sparkle with beauty with the Mosbeau Placenta White Underarm & Inner Thigh Cream. Formulated to fight the dryness while still making your skin lighter. Standout fairness, achieved! \r\n\r\nContent: 50 g \r\n\r\nBENEFITS:\r\nInfused with Bellis Perennis (Daisy) Flower Extract that provides even pigmentation against age spots, pigmentation disorders and freckles, as well as general skin-lightening activity.\r\nGet evenly fairer skin with Horse Placental Protein for whitening.\r\nWith more potent ingredients and enhanced formulation like Alpha-Arbutin, Fulvic Acid and many more.\r\nConfidence all over because it effectively whitens underarms, inner thighs, knees, elbows, areolas and other dark spots.\r\nProvides long-lasting evenly fairer skin.\r\n\r\nINGREDIENTS:\r\nPLACENTAL PROTEIN\r\nClinically proven effective skin-whitening agent in Japan with exemplary cell renewing and anti-aging properties.\r\n\r\nBELLIS PERENNIS EXTRACT\r\nLatest skin-whitening ingredient in Japan that actively influences all stages of melanin production to provide long-lasting whitening effect on skin.\r\n\r\nALPHA-ARBUTIN\r\nRecognized skin-whitening agent in Asia that naturally and visibly whitens skin.\r\n\r\nFULVIC ACID\r\nIs the finest electrolyte known to man. Its electrolytes are able to restore vitality and have superior anti-aging components.\r\n\r\nARTEMIA EXTRACT\r\nProtects the skin from UV damage.\r\n\r\nDIRECTIONS:\r\nGet an ample amount of cream and apply on desired area. Do not apply on broken and irritated skin. For underarm use, refrain from applying the cream together with a deodorant.","options":[{"id":20594937,"name":"Default","price":60.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":6.95,"amount_with_others":3.0,"country":{"id":3,"name":"Australia","code":"AU"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/63566485/-/underarm.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/63566485/-/underarm.jpg","width":360,"height":504}],"artists":[],"categories":[{"id":3351343,"name":"Body Care","permalink":"body-care","url":"/category/body-care"}]},{"id":6486039,"name":"PLACENTA WHITE ALL-IN-ONE BODY SOAP","permalink":"placenta-white-all-in-one-body-soap","position":5,"price":29.0,"default_price":29.0,"tax":0.0,"url":"/product/placenta-white-all-in-one-body-soap","status":"active","on_sale":false,"created_at":"2012-06-19T05:30:05.000Z","description":"Radiantly, stunning body. Don’t get left behind get all the beauty benefits that your body needs through whitening, anti-Aging, moisturizing, anti-Cellulite, uv protection and peeling. Flaunt that fairer body envied by many. \r\n\r\nContent: 120 g \r\n\r\nBENEFITS:\r\nExfoliate and look fresh with Lactic, Malic and Citric Acid that is good for peeling.\r\nProtect your skin from harmful UV rays with Sericin, a potent UV Protection ingredient a multi-layer of sun shield.\r\nImprove your skin’s smoothness and softness with moisture-rich ingredients like Glucose and Squalane.\r\nAll you need is All-in-One Body Soap to improve skin conditions like spots, freckles and wrinkles. Enhance skin elasticity for fairer, younger looking body.\r\n\r\nINGREDIENTS:\r\nPLACENTAL PROTEIN\r\nIt is clinically proven more effective skin-whitening and skin-nourishing ingredient with exemplary cell renewing and anti-aging properties than Pig Placenta Protein.\r\n\r\nALGAE EXTRACT\r\nNormalizes the skin’s moisture content and provides suppleness to the epidermis.\r\n\r\nSERICIN\r\nCreates a protective film on the skin to block pollution and harmful UV rays.\r\n\r\nCITRIC ACID\r\nGood for mild peeling to treat such skin conditions like fine lines and wrinkles, hyper- and depigmentation, spots and excessively dry skin.\r\n\r\nSQUALANE\r\nAn effective moisturizer that will make your skin feel supple, look plumper and wrinkles will be less apparent.\r\n\r\nHYDROLYZED COLLAGEN\r\nIt forms a film on the surface of the skin making it smoother and softer.\r\n\r\nDIPOTASSIUM GLYCYRRHIZATE\r\nIs an anti-irritant and anti-inflammatory component with skin-soothing properties. Clinical tests point to this ingredient as an effective treatment for atopic dermatitis because of its ability to reduce redness and irritation.\r\n\r\nDIRECTIONS:\r\nWork into rich lather and massage lightly on skin to remove deep-seated dirt from your pores. Use as a regular body soap. For best results, use daily.","options":[{"id":20631693,"name":"Default","price":29.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/63695461/-/AllinOneBodySoap.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/63695461/-/AllinOneBodySoap.jpg","width":360,"height":504}],"artists":[],"categories":[{"id":1628770,"name":"Facial Care","permalink":"facial-care","url":"/category/facial-care"},{"id":3351343,"name":"Body Care","permalink":"body-care","url":"/category/body-care"}]}]