[{"id":10580506,"name":"Dupe Eliminator for iTunes","permalink":"dupe-eliminator-for-itunes","position":1,"price":34.99,"default_price":34.99,"tax":0.0,"url":"/product/dupe-eliminator-for-itunes","status":"active","on_sale":false,"created_at":"2013-04-16T17:17:29.000Z","description":"<b>Dupe Eliminator</b> is an intuitive tool to Clean iTunes fom unwanted duplicates and missing tracks.   Easy to use yet full-featured Windows Maintenance and Cleaning solution to clean iTunes.   Reclaim space for your iTunes Music Library!  \r\n\r\nIt's easy to accumulate hundreds or thousands of tracks on iTunes but not easy to organize them once you do.  It takes a lot of time to painstakingly go through each and every song, podcast, movie, TV show and audiobook and delete every dead or duplicate file.  Dead tracks or dead links are music library entries who file is corrupted or no longer exists.\r\n \r\nWith <b>Dupe Eliminator</b>, you'll never again have to manually slog through thousands of files looking for the tracks that play over and over again, or that maddening dead link to your favorite song that never works. \r\n\r\n<b>Dupe Eliminator</b> makes it simple to distinguish between a duplicate file and the original.    Anyone who has amassed an extensive music collection knows how difficult it is to organize all those files by hand. Who has the patience to painstakingly go through their iTunes library and remove one by one every duplicate and dead file?\r\n\r\n If you don't like the default settings that determine what is a duplicate, <b>Dupe Eliminator</b> provides many \"<b><i>duplicate scan criteria</i></b>\"  settings which let you decide what is a duplicate.  e.g. \"Song Name/Album, Song Name/Album/Artist, Song Name/Time, Song Name/Size/Bitrate are the same and many, many more settings.\r\n\r\n \r\n<b>AutoClean Mode</b>  This automatically finds and removes duplicate files and dead links\r\n\r\n<b>Smart Search</b>  This setting makes eliminating files risk-free.  Set your own criteria for finding duplicates so that you never risk deleting files that you want.\r\n\r\n<b>Scheduled Search</b>  Don't let your listening get\r\n interrupted.    Set Dupe Eliminator to run overnight or while you\r\n sleep.\r\n\r\n<b>Dead Tracks Eliminator</b>  This removes tracks that won't \r\n  play and phantom tracks that do not link to an existing file.\r\n\r\n<b>UnDelete</b>  Erase something by mistake?  UnDelete can rescue the lost track and restore it to iTunes\r\n\r\n<b>Audio book Support</b>  Organize your audiobooks and delete duplicates there, as well.\r\n\r\n<b>You choose which track to keep</b> that has the highest bitrate, or size.   ","options":[{"id":33151693,"name":"Default","price":34.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/104022280/-/dupeeliminator_screenshot_1_.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/104022280/-/dupeeliminator_screenshot_1_.png","width":681,"height":1000}],"artists":[],"categories":[]}]