[{"id":5566455,"name":"Muse","permalink":"muse","position":1,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/muse","status":"active","on_sale":false,"created_at":"2012-02-28T00:45:27.000Z","description":"I don't want to be ordinary. I don't want be just another Mummy. Just another blogger. I want to be the bestest, most fabulous version of me that I am capable of being. She who knows who she is and wears no disguise. She who dreams big dreams and take baby-steps towards a more spectacular way of life daily. She who lives her dream in every aspect of her being.\r\n\r\nI don't want to be ordinary. I want to be an own work of art. I want to meet my inner muse, and dance the polka through rooms that thrill both of us: to feed her imagination with literature and art, design and poetry, to find out what makes her laugh till she cry's. To see how she looks with tears trickling down her cheeks.\r\n\r\nI want to know if my muse wears vintage fur or saucy underwear. If she feels at her most beautiful in painters overalls or a fifties frock. If she prefers a golden tan or the alabaster porcelain skin that is naturally hers. I want to offer her a bedroom that thrills her heart. To pile upon her bedside, books that awaken something deep inside her, and to decorate her dressing table with trinkets and lovelies that tell me her story.  I want to listen carefully as she whispers her truths and gets brave enough to live them...\r\n\r\nYes. I want to get to know my inner muse and through her I want to get to know myself, so I can BE myself: truly, madly, deeply ME.\r\n\r\nThere are women on this planet who manage it you know: women in our sphere who are nothing but themselves, day in, day out. Hell I could name twenty women from my Twitter stream who inspire me daily with their total, complete and absolute commitment to their own authenticity. Women who, from their head to their toes aren't pretending. Think Rachel Ashwell from Shabby Chic and Robin Brown from Magnolia Pearl.  Women who are the walking embodiment of their chosen aesthetic. Think Dita Von Teese and Martha Stewart. Audrey Tatou and Helena Bonham Carter. We don't have to respect their style to know that each and every one of these woman is in touch with her inner muse and channels her daily. And yes Dita's muse is ever so slightly more flamboyant than Martha's but in each woman we find commitment to who they are. Who they have come to know they are and  how from that have forged utterly scrumptious careers...\r\n\r\nBut tell me this? How are we going to get brave enough to channel our own muse? What if she turns out to be a little bonkers? What if we alienate our friends and children and easily appalled Aunties and little dogs with who we want to be? What then I ask you? What then??\r\n\r\nTo that I say only this: we will never know until we meet her. Until we court her and huddle in libraries and vintage dress shops with her. Until we say phooey to being ordinary and embrace the possibility that our very own brand of eccentricity might just be a good thing...\r\n\r\nKnowing ourselves inside out is key to a fabulous life.\r\n\r\nEverything from what level of dirt and dust makes us feel twitchy, to how our hormones dictate the way we look at any given time in the month. There are forces inside us you see to which we are beholden and our inner muse is already working with them. Already able to tell us why resistance is futile when it comes to lilac tea-cups and why it is utterly pointless embracing a new housekeeping regime in the third week of the month, cos it just ain't gonna wash with the part of us that want's to snuggle under blankies for those seven days...\r\n\r\nWe have to get to know ourselves. To find our tribe and identify our very own vintage muse. To immerse ourselves in the kind of culture that floats our happy little boats and reject all that feels uncomfortable or worse, fake about the lives that we are currently leading, We have to get crazy comfortable with who we are, or else my Sweets, this is it, this is all there is: a life unfulfilled. A life where we never really gave ourselves opportunity to be who we truly wanted to be...\r\n\r\nI can do this. We can do this. We can find our inner muse's and we can take them ballroom dancing. So wanna come along for the ride? Off course you do! You want to feel alive don't you..?\r\n\r\nAnd so my gorgeous ones, welcome to my latest project: MUSE. A six month long, 12 download journey to a meeting with your inner muse, ... taking in Anais Nin, The Wizard of Oz and Anne of Green Gables along the way!","options":[{"id":17919263,"name":"Default","price":40.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/54644939/-/muse21.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/54644939/-/muse21.jpg","width":550,"height":681}],"artists":[],"categories":[{"id":1893617,"name":"Part Works","permalink":"part-works","url":"/category/part-works"}]},{"id":5036969,"name":"The Art of Homemaking","permalink":"the-art-of-homemaking","position":2,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/the-art-of-homemaking","status":"active","on_sale":false,"created_at":"2011-12-08T15:24:30.000Z","description":"I have been writing about housekeeping for eight years now and here on Brocantehome there is a vast amount of information to be gathered for the new housekeeper or indeed for she who wants to kick-start her domestic life all over again and turn over a scrumptiously fresh new leaf. And so with this in mind I have in the past few months been quietly working towards pulling all my domestic wisdom together into a thirty day plan you can use to subtly (or dramatically!) shift your way of life and finally embrace the routines, rituals and seasonal celebrations I have long been advocating.\r\n\r\nFrom going organic, to creating a weekly and daily routine, choosing a creative path and making space for your very personal sense of spirituality, this precious download will provide a map directing you to the heart of your home: a place where you can be yourself without drowning under a relentless pile of laundry. A place my gorgeous housekeepers where rituals will shape your days and puttery treats will sprinkle a little glitter over them. A place you will want to come home to because it encapsulates all that you are today and everything you intend to be tomorrow.\r\n\r\nWhat I have created is a step by step guide to re-inventing your housekeeping existence. A guide to making friends with your house so that it will hug you instead of kicking you in the teeth day after day and remind you, through the voices of housewives gone by, that the urge, or perhaps more significantly the need to keep house is neither anti-feminist, nor futile but is in fact exactly what we must do if we are to nourish our hearts and souls daily and in the long run create a beautiful museum of all that we were: women in control of our own environments and ultimately our destinies, because home is where we begin…","options":[{"id":16359251,"name":"Default","price":25.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/49450155/-/arthomemaking2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/49450155/-/arthomemaking2.jpg","width":530,"height":731}],"artists":[],"categories":[{"id":1893619,"name":"Downloads","permalink":"downloads","url":"/category/downloads"}]},{"id":3291137,"name":"The Bloggers Planner","permalink":"the-bloggers-planner","position":3,"price":40.0,"default_price":40.0,"tax":0.0,"url":"/product/the-bloggers-planner","status":"active","on_sale":true,"created_at":"2011-02-15T23:04:04.000Z","description":"Sixty Five pages of pretty planning tools, trackers and charts to help you create the blog of your dreams.\r\n\r\nBlogging For Girls – The Rules!\r\nBloggers Mission Statement\r\nBlog Plans 2011-2012\r\nMy Target Audience\r\nBlog Information Sheet\r\nBlog Page Map\r\nBlog Category Map\r\nBlog Vision Board\r\nEditorial Calendar (April 2011-April 2012)\r\nDaily Work Planner\r\nWeekly Blog Overview\r\nWeekly Blog Planner\r\nDaily Theme and Meme Tracker\r\nAdvertising Planner\r\nSite Advertising Planner\r\nMonthly Advertising Bookings\r\nPillar Post Promotions Planner\r\nPost Series Planner\r\nNewsletter Record\r\nMy Guest Posts\r\nGuest Posts On My Blog\r\nBlogging Statistics\r\nSocial Networking Statistics\r\nMembership Subscription Record\r\nMembership Payment Record\r\nSales Record\r\nPaypal Payment Transfer Record\r\nMonthly Income Sheet\r\nIncome and Expenditure Sheet\r\nBlog Related Off-Line Purchases\r\nAffiliate Membership Program Tracker\r\nAffiliate Payment Receipt Log\r\nProfessional Learning Log\r\nMy Blog Affiliates\r\nQuarterly Affiliate Payment Trackers\r\nGorgeous Reader Record\r\nProfessional Contacts Record\r\nGive-Away/Competition Record\r\nCompetition Winners Record\r\nSupporting Applications Map\r\nSupporting Applications Log In Details\r\nBlog Plug-In Tracker\r\nLovely Blog Comparison Chart\r\nCurrent Theme Details\r\nTheme Change Record\r\nProfessional Plug-In and Theme Purchase Record\r\nBloggers Goodbye Plans\r\nCover sheet and Back Page\r\n\r\nBuy it now and get it at the discounted price of just $40.00...\r\n","options":[{"id":11170613,"name":"Default","price":40.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31934073/-/bloggers.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31934073/-/bloggers.jpg","width":500,"height":500},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/34113676/-/bloggingplanner2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/34113676/-/bloggingplanner2.jpg","width":420,"height":599},{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/34113812/-/bloggingplanner3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/34113812/-/bloggingplanner3.jpg","width":388,"height":568}],"artists":[],"categories":[{"id":1893711,"name":"Planners","permalink":"planners","url":"/category/planners"}]},{"id":3290677,"name":"Trash It or Treasure It!","permalink":"trash-it-or-treasure-it","position":4,"price":35.0,"default_price":35.0,"tax":0.0,"url":"/product/trash-it-or-treasure-it","status":"active","on_sale":false,"created_at":"2011-02-15T21:46:03.000Z","description":"So it is finally here! For everybody who wants to spend 2011 creating a life truly worth treasuring, my most successful subscription program is complete and available in a 25 part download to all!\r\n\r\nI say successful because Trash and Treasure was fully subscribed and I received so much feedback worth celebrating from women who told me that my entirely original take on getting rid of your junk was slowly but surely changing their life! That by taking it as slowly as we did they were able to discover the underlying truths about the whyfores of their preposition to stashing nonsense and ultimatley come to terms with it enough to start binning the surplus…\r\n\r\nSo want to know what was included in the 25 week programme? In more than 250 pretty pages full of soothing words and fiesty inspiration?\r\n\r\n* The Trashy Oath.\r\n* An introduction to the giddy theory behind the program (!)\r\n*  The Seven Habits of Highly Effective Housekeepers.\r\n*  Putting you first.\r\n* Starting at the beginning.\r\n*  Getting organised on-line.\r\n* Creating Housekeepers Central on-line.\r\n*  Your domestic heroine.\r\n* The four types of clutter.\r\n* Getting to grips with Poverty Clutter.\r\n* Understanding Hey-Dey Clutter.\r\n*  Identifying Rainy Day Clutter.\r\n*  Letting go of Heartbreak Clutter.\r\n*  The four questions you need to answer.\r\n* Habit, routine and ritual.\r\n* Extreme self-care.\r\n* The problem with perfection.\r\n* The Trashy Mission Lists\r\n* Function before form.\r\n* Clearing the entrance into your home.\r\n* Making space to really live.\r\n* The heart of the home.\r\n* The inner sanctum.\r\n* Personal sanctuary.\r\n* Dealing with other people’s chaos.\r\n* Tackling the internal war!\r\n* Getting shut of emotional baggage.\r\n* And eight final thoughts and actions…\r\n\r\nI truly do not believe you will have read anything like this before. Alongside each essay there are seven action points, a worksheet, and a writing or collage prompt so that you can document your journey towards a life worth treasuring as you work through the program.","options":[{"id":11169603,"name":"Default","price":35.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31929765/-/trash_it.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31929765/-/trash_it.jpg","width":367,"height":512}],"artists":[],"categories":[{"id":1893619,"name":"Downloads","permalink":"downloads","url":"/category/downloads"}]},{"id":3290917,"name":"The Christmas Planner","permalink":"the-christmas-planner","position":5,"price":18.0,"default_price":18.0,"tax":0.0,"url":"/product/the-christmas-planner","status":"active","on_sale":false,"created_at":"2011-02-15T22:28:31.000Z","description":"It’s here at last: the surefire route to festive heaven. Christmas bliss in 30 gorgeous pages of planners and charts that will I hope make all the difference to a season full of cinnamon scented madness and mayhem….\r\n\r\nNever again will you go crackers (excuse the pun) and spend next years food budget on plastic junk the kids barely touch let alone play with. Never again will you buy Auntie Mabel two reindeer twinsets and forget to buy poor old Uncle Harold a sausage. Christmas will be a breeze! Well kinda. I mean lets face it there’s nothing I can do about inebriated sisters and kids high on Quality Street. The shops will still be hell and your significant other, will, I promise, moan about everything from fiddly Christmas tree lights to turkey that doesn’t taste like his Mothers. Because it is his job and Christmas wouldn’t be Christmas if your cast didn’t play their roles to predictable perfection now would it? (Just for the record I’m the grumpy, tired one on Christmas Day!)\r\n\r\nNevertheless, with a little organization, life could, in the run up to Christmas be easier couldn’t it? And so my Darling’s I hereby present the very first BrocanteHome Christmas Planner, a collections of charts and forms and lists that will help you organise everything from Christmas cards to the very essence of your own family Christmas….\r\n\r\nWhats Included?\r\n\r\nChristmas Planner Front Page.\r\nThe Brocante Home Festive Creed.\r\nFestive Puttery Treats.\r\nFestive Traditions.\r\nFestive Grace Notes.\r\nDcember Calender.\r\nBrocante December CountDown.\r\nYour December Coutdown.\r\nDecorating Planner.\r\nXmas Budget.\r\nFestive To-Do’s.\r\nChristmas Card List.\r\nCards Received List.\r\nScrumptious Sites.\r\nOrder Tracker.\r\nGift Buying List.\r\nV.I.P. Gift Planner.\r\nChristmas Thank-You’s.\r\nKids Thank You’s.\r\nChristmas Grocery List.\r\nScrumptious Recipe Sources.\r\nChristmas Recipe Cards.\r\nXmas Meal Planner.\r\nChristmas Dinner Planner.\r\nChristmas Chores.\r\nFestive Scrub.\r\nPlanner Back.\r\n\r\nIn short all the things that have made Brocante Christmas’s lovely in the past, but all in one place… and available to download easily by PDF..","options":[{"id":11170275,"name":"Default","price":18.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31932049/-/pl.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31932049/-/pl.jpg","width":500,"height":500}],"artists":[],"categories":[{"id":1893711,"name":"Planners","permalink":"planners","url":"/category/planners"}]}]