[{"id":64746,"name":"PDF Crochet Pattern - Pizza","permalink":"pdf-crochet-pattern-pizza","position":1,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/pdf-crochet-pattern-pizza","status":"active","on_sale":true,"created_at":"2008-01-07T11:51:56.000Z","description":"<ul>\n\t<li><span class=\"caps\">PATTERN ONLY</span> <b><strong>*</b><b></strong><strong></b></strong></li>\n\t</ul>\n\n\n\tPizza, anyone ??? Do you want to have a slice of the super thin crust Pizza with lots and lots of delicious toppings &#8211; pepperoni, green pepper, onion, pineapple, olive, fresh mushrooms, melted cheese and a good sprinkling of chilli flakes. One bite and you will be coming back for more :)\n\n\tThe diameter of the whole pizza is 5.8 inches (<sub>14.7 cm). The pizza slice measures 3 inches (</sub>7.6 cm) longest.\n\n<hr />\n\n\n\tThis <span class=\"caps\">PATTERN</span> is for those who already know basic crocheting skills like slip stitch, single crochet, half-double crochet, double crochet, working in rounds, working in rows,etc.\n\n\tFor sale is one <span class=\"caps\">PATTERN</span> in <span class=\"caps\">PDF</span> format of Thin Crust Pizza (whole and slice). This pattern consists of 9 pages. It comes with many pictures detailing the different stages of crocheting.\n\n\tThe acrylic yarn I used is 18 wraps per inch and hence is categorised under &#8216;fine&#8217; yarn. Wraps per inch (or <span class=\"caps\">WPI</span>) is a measure of the grist or the thickness of a yarn. Please google or search the internet for more information about <span class=\"caps\">WPI</span> and yarn type.\n\n\tIf you are interested in purchasing the <span class=\"caps\">PATTERN</span>, you can pay via Paypal. I will send the pattern to your email address as soon as I receive your payment.\n\n\tPlease feel free to contact me at amy_lim60@hotmail.com if you have any questions. I will be most happy to answer any questions through  email should you encounter any problems during crocheting.\n\n\t<span class=\"caps\">PLEASE NOTE</span>:\n\n\tSelling of the finished item is allowed.\n\n\t<span class=\"caps\">DO NOT</span> redistribute, resell, and/or translate pattern into another language for reselling.\n\n\tThere will be <span class=\"caps\">NO REFUND</span> of money for all <span class=\"caps\">PDF</span> Patterns purchased.\n\n\tThank you!\n\n","options":[{"id":315953,"name":"Please give me your email address so that I can send the PDF file to you.","price":4.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/132096/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/132096/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[{"id":71723,"name":"PDF Crochet Patterns","permalink":"pdf-crochet-patterns","url":"/category/pdf-crochet-patterns"}]}]