[{"id":2760714,"name":"Hand Carved Rubber Stamps Tutorial","permalink":"hand-carved-rubber-stamps-tutorial","position":1,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/hand-carved-rubber-stamps-tutorial","status":"active","on_sale":false,"created_at":"2010-09-21T01:36:02.000Z","description":"Learn how easy is to make hand carved rubber stamps with this ebook!\r\n\r\nThis tutorial has 35 pages and it is formed by two parts. In the first part I list all the tools you need and all the steps that will lead you to be able to create your hand-carved rubber stamps. In the second part I drew a lot of cute templates inspired to my world and to the things that I love, which you can use as ideas for your hand-carved rubber stamps. Here you will find so much as 28 pages stuffed with drawings divided into various themes, from the monuments of Paris (the town where I live and that I love), to its food and its particularities... but you will also find pictures of everything that I find pretty as mushrooms, hedgehog, butterflies, bunnies and much more ... all represented through a simple and basic style suitable for becoming a good pattern on which to create fantastic stamps. I am sure that these drawings will be useful both to those who relate to this technique for the first time as a basis on which to practice and to learn, and to those more experienced as a source of original ideas to create truly unique stamps. \r\n\r\nFurthermore, I will rest at your disposition if something will apear you not clear, just sending me an email.\r\n\r\nNO SHIPPING FEES, it is an e-book! ***PLEASE*** Provide me a capacious email adress able to receive the pdf file, which has a big size (yahoo and gmail always work).\r\n\r\nYou will receive this PDF file to your e-mail within 24 hours after payment. You will need Acrobat reader in order to view this file. Please provide me an email adress that can accept a big size file.\r\n\r\nNOTE: This tutorial is only for personal purposes and is protected under copyright laws and cannot be sold, distributed or reproduced in any form.","options":[{"id":9679868,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/26673457/-/il_430xN.168128840.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/26673457/-/il_430xN.168128840.jpg","width":430,"height":608}],"artists":[],"categories":[{"id":1638116,"name":"Tutorials","permalink":"tutorials","url":"/category/tutorials"}]}]