[{"id":6005911,"name":"QVR Pendant #7 - Septarian + Ajoite (Free Shipping)","permalink":"qvr-pendant-7-septarian-ajoite-free-shipping","position":1,"price":33.95,"default_price":33.95,"tax":0.0,"url":"/product/qvr-pendant-7-septarian-ajoite-free-shipping","status":"active","on_sale":true,"created_at":"2012-04-23T06:25:31.000Z","description":"QVR Liquid crystal Pendant #7 works intellectually and emotionally to assist with your soul purpose, which for everyone is to express love and speak your truth while following your passions. Working on this plane and multidimensionally, pendant 7 transmutes restriction and toxins and infuses into the cells pure universal love.\r\n\r\n\r\nSeptarian\r\nSeptarian supports you while you incubate ideas and assists in bringing them to fruition. If you are someone who always has ideas but never puts them into practice, Septarian will help ground your creativity. Septarian helps with NLP in repatterning and reprogramming while harmonizing emotions and intellect with the higher mind. Septarian helps with communication within a group or public speaking on a bigger stage. Septarian is extremely helpful in focusing the body’s own healing ability.\r\n\r\nAjoite\r\nAjoite wraps the soul in Universal Love. If your vibrations are in harmony with this stone it brings about a profound spiritual revelation and serenity. Ajoite creates emotional and environmental calm, gently drawing out and transmuting toxic emotions and old grief. Ajoite helps with harmonizing health and resolving conflict with forgiveness and compassion. It draws out karmic wounds or implants from the body and with unconditional love and then reframes your cellular memory.\r\n","options":[{"id":19211467,"name":"Default","price":33.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/58963947/-/pendant7.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/58963947/-/pendant7.png","width":261,"height":608}],"artists":[],"categories":[{"id":3144737,"name":"Vibration Remedies - pendants","permalink":"vibration-remedies-pendants","url":"/category/vibration-remedies-pendants"}]},{"id":6005895,"name":"QVR Pendant #6 - Smokey elestial + Lazulite + White Spirit Quartz + Bustamite (Free Shipping)","permalink":"qvr-pendant-6-smokey-elestial-lazulite-white-spirit-quartz-bustamite-free-shipping","position":2,"price":33.95,"default_price":33.95,"tax":0.0,"url":"/product/qvr-pendant-6-smokey-elestial-lazulite-white-spirit-quartz-bustamite-free-shipping","status":"active","on_sale":true,"created_at":"2012-04-23T10:23:07.000Z","description":"QVR Pendant #6 contains the vibrational signature frequencies of these 4 powerful crystals:\r\n\r\nSmokey elestial\r\nSmokey elestial helps guard and guide you while travelling the multidimensional planes of existence. Protective, grounding and energetically cleansing, this intense stone takes you into past lives to reclaim your power, purify negativity and offers release from anyone who has enslaved you. Assists in the release in karmic programs and in past life healing.\r\n\r\nLazulite\r\nOften called the Stone of Heaven. Lazulite draws in pure universal energy and opens intuition, bringing about profound states of meditative bliss. Lazulite creates a calm and serene self, anchored in the divine.\r\n\r\nWhite Spirit Quartz\r\nA master healer stone and powerful energy amplifier. Radiating high-vibration energy out in all directions, the core crystal tightly focuses healing and reprogram’s cellular memory. Great for past life healing and releasing karmic patterns and connections.\r\n\r\nBustamite\r\nA powerful energy worker, provides deep connection to the Earth and facilitates earth healing working with the earth’s meridian lines. Assists in realigning our own meridian lines, relieving physical pain and harmonizing the emotional energy system and healing cellular memory. Bustamite enhances dreaming, intuition, channelling and access to the angelic realms. Allows you to remove yourself emotionally from situations enabling you to see events from the perspective of the observer.\r\n\r\n-------------------------------------------------------------\r\nThis pendant is shipped free of charge!\r\n-------------------------------------------------------------\r\n\r\nAbout Liquid Crystal Pendants - As for all the QiGrow Vibration Remedies range, no physical materials are used to imprint information into the water in the creation our products. Vibrational frequencies (information) are encoded into water with the assistance of Nature Intelligence, Crystal Activators, Sacred Geometry and the Sun. \r\n\r\nThis ensures a pure, uncontaminated and very high frequency product is maintained in a dynamic liquid state.\r\nWearing these pendants is beneficial to assist your energy body to release and cleanse frequencies that are no longer needed. The information contained within the pendant is then transfered to your energetic system and down to the cellular level to assist the next phase of your soul journey. \r\n\r\nWear these QVR Pendants around your neck with the pendant hanging level with your nipple line.\r\n ","options":[{"id":19211447,"name":"Default","price":33.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/58963763/-/pendant6.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/58963763/-/pendant6.png","width":291,"height":628}],"artists":[],"categories":[{"id":3144737,"name":"Vibration Remedies - pendants","permalink":"vibration-remedies-pendants","url":"/category/vibration-remedies-pendants"}]},{"id":6005817,"name":"QVR Pendant #5 - Moldavite + Wulfenite (Free Shipping)","permalink":"qvr-pendant-5-moldavite-wulfenite","position":3,"price":33.95,"default_price":33.95,"tax":0.0,"url":"/product/qvr-pendant-5-moldavite-wulfenite","status":"active","on_sale":true,"created_at":"2012-04-23T10:09:40.000Z","description":"QVR Liquid crystal Pendant #5 is good for balancing any aspect of your electrical/energetic system including the Kundalini Chakras. It is also a bit of a butt kicker as it will make you get on with it! \r\nIf you have been procrastinating or being lazy, this pendant will assist with focus and determination to achieve your goals. \r\nWith the inclusion of Wulfenite, this pendant also works on the emotional aspects of self allowing subtle information to enter from the heavens allowing us to experience more of who we truly are.\r\n\r\nMoldavite\r\nMoldavites are rare stones and are among the most powerful gemstone tools for spiritual development and expansion of consciousness. They seem to engender an acceleration of one's inner growth and evolution. Hundreds of times people have described rapid transformation of their lives which has come soon after they acquired Moldavite. \r\nJobs, relationships, life styles or possessions which did not serve their highest paths were rapidly released, and the new, evolutionary forms of these same things appeared, drawn as if by magnetism. Stories of visionary experience, chakra activation, energy cleansings and the discovery of personal destiny, all associated with the entrance of Moldavite in to one's life. \r\n\r\nIt is interesting to note that Moldavite has been associated with the legendary Stone of the Holy Grail, an \"emerald\" said to have fallen from the sky, and a talisman for the healing of the Earth. In the legends, exposure to this Stone was said to set the beholder upon the spiritual road to self discovery and enlightenment. The same could be said of the celestial green gemstone Moldavite. \r\nMoldavite is capable of activating any and all of the chakras, though it most commonly resonates with the heart, third eye and crown chakras. Moldavite's energy tends first to move wherever it is most needed in the physical and etheric bodies, and then to center in the heart.\r\n\r\nWulfenite\r\nInvigorates and harmonizes emotions, passions and appetite. Warms and grounds. Helps us get in touch with feelings. Used for healing and warming reproductive organs (especially women's). Spleen and solar plexus chakra balance, and digestion/nutrition assimilation. Cleanses and uplifts emotions, muddiness, stuck ness or imbalance in spleen. Teaches us to be stewards and caretakers of all the wild and beautiful pieces of nature. Encourages us to get outdoors and enjoy nature. Fosters creativity and devotion.\r\n\r\nWulfenite allows one to accomplish the transition, from the physical plane to the psychic and astral planes, with expedience.  The time which is usually required to alter ones state is dramatically decreased.\r\n\r\nIt creates a strong connection between basis structures and higher dimensions, allowing for the channelling of vibrations to the Earth, and for the attunement to higher dimensions.  It is quite useful for connecting to the higher self.  It stimulates a bonding between souls who are on the Earth plane and have agreed to meet again during this lifetime.\r\nWulfenite can be used for preservation and rejuvenation on all levels.\r\n\r\n-------------------------------------------------------------\r\nThis pendant is shipped free of charge!\r\n-------------------------------------------------------------\r\n\r\nAbout Liquid Crystal Pendants - As for all the QiGrow Vibration Remedies range, no physical materials are used to imprint information into the water in the creation our products. Vibrational frequencies (information) are encoded into water with the assistance of Nature Intelligence, Crystal Activators, Sacred Geometry and the Sun. \r\n\r\nThis ensures a pure, uncontaminated and very high frequency product is maintained in a dynamic liquid state.\r\nWearing these pendants is beneficial to assist your energy body to release and cleanse frequencies that are no longer needed. The information contained within the pendant is then transfered to your energetic system and down to the cellular level to assist the next phase of your soul journey. \r\n\r\nWear these QVR Pendants around your neck with the pendant hanging level with your nipple line.\r\n ","options":[{"id":19211281,"name":"Default","price":33.95,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/58962707/-/pendant5.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/58962707/-/pendant5.png","width":266,"height":610}],"artists":[],"categories":[{"id":3144737,"name":"Vibration Remedies - pendants","permalink":"vibration-remedies-pendants","url":"/category/vibration-remedies-pendants"}]}]