[{"id":2795043,"name":"Pacific Rims: Beermen Ballin' In Flip-Flops And The Philippines' Unlikely Love Affair with Basketbal","permalink":"pacific-rims-beermen-ballin-in-flip-flops-and-the-philippines-unlikely-love-affairwith-basketball","position":1,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/pacific-rims-beermen-ballin-in-flip-flops-and-the-philippines-unlikely-love-affairwith-basketball","status":"active","on_sale":false,"created_at":"2010-10-11T14:55:47.000Z","description":"Hoops dreams in the Philippines-a fresh and unforgettable basketball diary of one man's journey and one nation's passion. Welcome to the Philippines, where the men are 5'4,\" the everyman's Air Jordans are a pair of flip-flops, and the rhythm of life is punctuated by the bouncing of a basketball... Allured by the idea of an island nation full of people who love the game as irrationally as he does, American journalist Rafe Bartholomew arrived in Manila to unlock the riddle of basketball's grip on the Philippines. On his unforgettable journey, Bartholomew spends a season inside the locker room of a Philippine professional team, dines with politicians who exploit hoops for electoral success, travels with a troupe of midgets and transsexuals who play exhibition games at rural fiestas, and even acts in a local soap opera. Sweating his way through hard-fought games of 3-on-3, played with homemade hoops for 50-cent wagers, Bartholomew uses a mix of journalistic knowhow and the hard- court ethics he learned from his dad to get in the paint and behind the scenes of Filipinos' against-all-odds devotion to the sport.","options":[{"id":9790344,"name":"Default","price":25.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":10.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27033862/-/pacific-rims-beermen-ballin-in-flip-flops-and-the-philippines-unlikely-love-affairwith-basketball.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27033862/-/pacific-rims-beermen-ballin-in-flip-flops-and-the-philippines-unlikely-love-affairwith-basketball.jpg","width":400,"height":617}],"artists":[],"categories":[]},{"id":2795050,"name":"Ilustrado ","permalink":"ilustrado","position":2,"price":26.0,"default_price":26.0,"tax":0.0,"url":"/product/ilustrado","status":"active","on_sale":false,"created_at":"2010-10-11T15:06:46.000Z","description":"Garnering international prizes and acclaim before its publication, Ilustrado has been called \"brilliantly conceived and stylishly executed . . . It is also ceaselessly entertaining, frequently raunchy, and effervescent with humor\" (2008 Man Asian Literary Prize panel of judges). It begins with a body. On a clear day in winter, the battered corpse of Crispin Salvador is pulled from the Hudson River -- taken from the world is the controversial lion of Philippine literature. Gone, too, is the only manuscript of his final book, a work meant to rescue him from obscurity by exposing the crimes of the Filipino ruling families. Miguel, his student and only remaining friend, sets out for Manila to investigate. To understand the death, Miguel scours the life, piecing together Salvador's story through his poetry, interviews, novels, polemics, and memoirs. The result is a rich and dramatic family saga of four generations, tracing 150 years of Philippine history forged under the Spanish, the Americans, and the Filipinos themselves. Finally, we are surprised to learn that this story belongs to young Miguel as much as to his lost mentor, and we are treated to an unhindered view of a society caught between reckless decay and hopeful progress. Exuberant and wise, wildly funny and deeply moving, Ilustrado explores the hidden truths that haunt every family. It is a daring and inventive debut by a new writer of astonishing talent.","options":[{"id":9790360,"name":"Default","price":26.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":10.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27033886/-/ilustrado.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27033886/-/ilustrado.jpg","width":434,"height":648}],"artists":[],"categories":[]},{"id":2795061,"name":"A History of the Philippines: From Indios Bravos to Filipinos ","permalink":"a-history-of-the-philippines-from-indios-bravos-to-filipinos","position":3,"price":35.0,"default_price":35.0,"tax":0.0,"url":"/product/a-history-of-the-philippines-from-indios-bravos-to-filipinos","status":"active","on_sale":false,"created_at":"2010-10-11T15:18:45.000Z","description":"Who were the Indios Bravos? Brilliant nineteenth-century polymath, doctor, bon vivant, and writer Jos Rizal and his friends gave themselves the name, half in jest and half in all seriousness, after having watched a Wild West show in Paris in 1889. Indio, of course, was the disparaging term the Spanish used for the indigenous populations in their colonies. Rizal and these other expatriate ilustrados, \"enlightened ones,\" as they were referred to, admired both the excellent horsemanship and the dignity of the Native American performers-and recognized in them kindred spirits. They were indeed brave Indians, their peculiar status in the world mirroring somewhat that of the Filipinos themselves, who were highly critical of the Spanish colonial regime in Manila and who in Madrid and Barcelona advocated far-reaching reforms at the same time that they professed loyalty to Mother Spain. By appropriating the term meant to put them in their place, Los Indios Bravos were signaling the Spanish their intent to take charge of their destiny. It was a highly symbolic act, representing a paradigmatic shift in the burgeoning nationalist consciousness.","options":[{"id":9790408,"name":"Default","price":35.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":3.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":10.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/27033958/-/A_History_of_the_Philippines.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/27033958/-/A_History_of_the_Philippines.jpg","width":640,"height":1000}],"artists":[],"categories":[]}]