[{"id":13092036,"name":"IDOL Magazine Issue 6; THE DREAMERS ISSUE","permalink":"idol-magazine-issue-6-the-dreamers-issue","position":1,"price":6.5,"default_price":6.5,"tax":0.0,"url":"/product/idol-magazine-issue-6-the-dreamers-issue","status":"active","on_sale":true,"created_at":"2013-08-21T17:13:17.000Z","description":"PUBLISHER:  IDOL Magazine\r\n\r\nCOVERS: Models MARLI @ Premier, JAKE @ Select Models, Photographer SIMON THISELTON, Stylist JUSTIN HAMILTON,\r\nMake Up THOM WALKER using MAC Cosmetics, Hair Stylist ROXANE ATTARD @Beach London using Bumble & Bumble. \r\n\r\nPRINT RELEASE  SEPTEMBER 2013\r\n\r\nSIZE:  A4, 184 pages\r\n\r\nDELIVERY TIME:  WITHIN 10 DAYS AT YOUR DOORSTEP  (wherever you are)\r\n\r\nTHE DREAMERS ISSUE\r\n\r\nThey say that DREAMERS are out of touch with reality; impractical idealists with their heads in the clouds.\r\n\r\nBut if reality is everything that is or has been, how can there ever be progression? DREAMERS look past boundaries and limitations and believe that we can create a reality from even our wildest, most theatrical dreams. After all, every great creation started with an idea and a vision.\r\n\r\nIn this issue, we celebrate THE DREAMERS – those visionaries who think beyond practicalities. Those not willing to take no for an answer. Those who work hard, survive adversity and make their dreams reality.\r\n\r\nOur fashion features include an interview with top casting director Angus Munro, who tells us how important it is to stay one step ahead of the game. International fashion photographer Kristian Schuller shares his work and thoughts on being a dreamer. \r\n\r\nWe hear the ins and outs of the music business from Cortez Bryant and Al Branch of The Blueprint Music Group. Ssion’s headman Cody Critcheloe expresses his love for visual art and tells us about being more than a musician.\r\n\r\nSet designer Rhea Thierstein describes how she found her calling in art and design through an internship. Photographer Anton Kusters explains the benefits of being emotionally connected to his projects, and what it was like documenting one of the world’s most dangerous families.\r\n\r\nDREAMERS from all walks of life have one thing in common: the ability to look past the impossible to create new realities.\r\n\r\n'It always seems impossible until it's done' – Nelson Mandela.","options":[{"id":41789511,"name":"Default","price":6.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":10.0,"amount_with_others":10.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/123103452/-/IDOLissue6-3Dcover.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/123103452/-/IDOLissue6-3Dcover.jpg","width":1933,"height":2667}],"artists":[],"categories":[{"id":2405099,"name":"Magazine","permalink":"magazine","url":"/category/magazine"}]},{"id":9537727,"name":"IDOL Magazine Issue 5; THE POWER ISSUE","permalink":"idol-magazine-issue-5-the-power-issue","position":2,"price":6.5,"default_price":6.5,"tax":0.0,"url":"/product/idol-magazine-issue-5-the-power-issue","status":"active","on_sale":true,"created_at":"2013-02-18T11:36:30.000Z","description":"PUBLISHER:  IDOL Magazine\r\n\r\nCOVERS: Ben Allen @ Select, Yana P @ FM, Photographer Michael Furlonger, Stylist Laura Jane, Make Up Artists Bunnice Allen & Thom Walker, Hair Stylists Leigh Keates & Stefano Mazzoleni, Props/Set Designer Lorna Kelly.\r\n\r\nPRINT RELEASE  FEBRUARY 2013\r\n\r\nSIZE:  A4, 184 pages\r\n\r\nDELIVERY TIME:  WITHIN 10 DAYS AT YOUR DOORSTEP  (wherever you are)\r\n\r\nTHE POWER ISSUE\r\n\r\nPower is having the confidence to be yourself and the freedom to create. Being brave enough to push boundaries, seek and seize opportunities and go beyond the expected. Mastering the skill of being persistent but patient and remaining optimistic when things don’t go to plan. Having the ability to express individuality or shared beliefs and ideals between people. Acquiring the power of impact and influence on others, captivating and inspiring.\r\n\r\nIn this issue we sought out individuals who in some way depict the above. \r\n\r\nOur fashion features include talks with sought-after director Johan Renck about his career, influences and what makes a powerful subject. The Webster’s Laure Hériard Dubreuil shares her journey and thoughts on being patient, grounded and staying true to you along the way.\r\n\r\nThe once faceless band, The Neighbourhood, tell us why doing what they want for a living empowers them; and we discuss power in the music industry with dubstep producers Rudimental.\r\n\r\nSheng Qi talks to us about the power of freedom of expression in his art; and Stuart Semple tells us why ideas don’t necessarily need big platforms.\r\n\r\nFilm director Sacha Gervasi tells us about landing the highly anticipated flick ‘Hitchcock’ and Gael Garcia Bernal talks about “doing things properly.”\r\n\r\nCreative minds are beautiful but busy. And since they tend to wander, I chose a well-known quote to guide us back each time we wandered too far;\r\n\r\n“The greatness of a man is not in how much wealth he acquires, but his integrity and his ability to affect those around him positively.”\r\n- Bob Marley\r\n","options":[{"id":29833707,"name":"Default","price":6.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":5.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":10.0,"amount_with_others":10.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/93730101/-/ISSUE5_3DCover_Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/93730101/-/ISSUE5_3DCover_Front.jpg","width":760,"height":1000}],"artists":[],"categories":[{"id":2405099,"name":"Magazine","permalink":"magazine","url":"/category/magazine"}]},{"id":7059077,"name":"IDOL Magazine Issue 4; THE KITSCH ISSUE","permalink":"idol-magazine-issue-4-the-kitsch-issue","position":3,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/idol-magazine-issue-4-the-kitsch-issue","status":"active","on_sale":false,"created_at":"2012-08-25T16:40:50.000Z","description":"PUBLISHER:  IDOL Magazine\r\n\r\nCOVERS: Toby Leonard @Select, Flo @Select, Photographer Michael Furlonger, Stylist Christina Daly, Make Up Artist Claire Mulleady, Hair Stylist Sarah Jo Palmer, Props/Set Designer Lorna Kelly, Nail Artist Chelsea Dager.\r\n\r\nPRINT RELEASE  SEPTEMBER 2012\r\n\r\nSIZE:  A4, 188 pages\r\n\r\nDELIVERY TIME:  WITHIN 10 DAYS AT YOUR DOORSTEP  (wherever you are)\r\n\r\nTHE KITSCH ISSUE\r\n\r\nHeading into Issue 4, all I could think about were trashy trends we all hate to love and love to hate. The team decided there could be no better title for this issue than ‘Kitsch’ - we listed our takes on the word. One that stuck with me throughout was: “It’s literally “in your face” or nothing!”\r\n\r\nFrom the 1940s when women smoked, drew stocking seams and wore the same lipstick as their favourite movie stars to the 1990s when bad wallpaper became cool again and we saw the evolution of retro fashion – ‘Kitsch Culture’ always had undeniable appeal. What was once crass middle-class taste became an ironic trend that constantly re-invented itself. \r\n\r\nWho said kitsch was bad?\r\n\r\nIt was certainly a great influence and inspiration on this issue’s editorials, which came to include titles like ‘Little Tart’, ‘Lick It’, ‘Almost Famous’, ‘Young Ready Legal’ and ‘Mami’. Not to mention our cover shoot ‘Plastix’ – what I imagine would happen if Andy Warhol met Ken and Barbie.\r\n\r\nFrom the outspoken media darling that is Sharon Needles and Vice\r\nsweetheart Karley ‘Slutever’ Sciortino to the ‘Fabulous Fabergés’ and new Bond recruit Ben Whishaw - this issue has celebrated everything kitsch, fabulous and fun.\r\n\r\nWe spoke to designer duo Leutton Postle, eccentric hat maker David\r\nShilling and the menswear designer with a great sense of humour and an even better sense of style Marlon Gobel.\r\n\r\nIn our Music section, we chatted to Jake Shears and Babydaddy from\r\nglam-disco band Scissor Sisters, pop duo BIGKids, multi-talented singers and producers Ghostpoet and Grimes, and Stockholm’s latest spawn of talent Elliphant.\r\n\r\nWe looked at kitsch in Art & Culture with toy collector Selim Varol, Colette creative director Sarah Lerfel and ‘practitioner of the absurd’ Andrew Logan.\r\n\r\nWe created film features with photographer turned film-maker Lauren\r\nGreenfield and model turned actress Agyness Deyn. In a new addition to the Film section entitled ‘Coming Soon’, we researched a rundown of the most exciting films to be released this season.\r\n\r\nAnd finally, we have chosen to dedicate this issue to Mr. Gianni Versace. Fifteen years on from Gianni’s death, and he never left. He gave the world kitsch like never before and for prices never imagined. His influence reached far beyond his family and the mosaic-encrusted house in which he was killed. This man firmly stamped a neo-classical Medusa on the 80s and 90s and pretty much everything since.\r\n\r\nPapi of Print, King of Kitsch – Gianni, we salute you.\r\n","options":[{"id":22348453,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":3.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":6.0,"amount_with_others":6.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/69340627/-/Cover_Illustration_Front.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/69340627/-/Cover_Illustration_Front.jpg","width":760,"height":1000}],"artists":[],"categories":[{"id":2405099,"name":"Magazine","permalink":"magazine","url":"/category/magazine"}]},{"id":5368435,"name":"IDOL Magazine Issue 3; THE INSIDERS ISSUE","permalink":"idol-magazine-issue-3-the-insiders-issue","position":4,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/idol-magazine-issue-3-the-insiders-issue","status":"active","on_sale":true,"created_at":"2012-01-31T19:12:48.000Z","description":"PUBLISHER:  IDOL Magazine\r\n\r\nCOVERS: Josh Tuckley @ Select, Sophie Yall @ IMG Models London\r\nPhotography Mark Cant, Styling Gabrielle Stival, Hair Liam Curran @ Balcony Jump using Bumble & Bumble, Make Up (Josh) Claudine Blythman @ Balcony Jump using MAC, Make Up (Sophie) Yuka Hirata using MAC Pro, Styling Assistants Luke Taylor, Chloe Edwards, Hair Assistant Karen Fenton.\r\n\r\nInside Cover Artwork Achraf Amiri & Domenico Cordua\r\n\r\nPRINT RELEASE  February 2012\r\n\r\nSIZE:  A4, 188 pages\r\n\r\nDELIVERY TIME:  WITHIN 10 DAYS AT YOUR DOORSTEP  (wherever you are)\r\n\r\nTHE INSIDERS ISSUE\r\n\r\nWhen strolling in the city mid-Fashion Week as the members of the fashion world hover in their six-inch wedges, press passes swinging from their necks and their cameras close to hand, it can be easy to feel a world away from that dream. When browsing through style websites, admiring the selection of fabulous designs worn by A-List stars, it can seem so glamorous, so easy for them. And when you’re at a concert, shouting a singer’s name, it can appear that they just made it overnight. It can seem like those lucky ones belong to a limited circle of a limited number of people and there is limited access to them.\r\n\r\nIDOL begs to differ.\r\n\r\nWe are certain many of you know this already, but let me assure you: they didn’t just make it, they didn’t fall into it. And even if there are a few lucky ones who did, they still work bloody hard to keep it up. If insiders have any special advantages or influences it is because they have created them through hard work, passion and determination. An ‘insider’ has firsthand knowledge through experience.\r\n\r\nIn our third issue, we break down the industry walls. We explore the worlds of fashion, art and entertainment with features on producer Labrinth, editor Hilary Alexander, director Vashtie, instrumentalist Skylar Grey and actor Aneurin Barnard. We go further than the studios and the red carpet and explore insider stories from overseas, such as those of individuals who risk their lives to document the scenes of worldwide war and disaster in ‘Behind the Firing Line’ . Ana Finel Honigman also joins us as contributing editor, reporting from Berlin’s scene.\r\n\r\nWhatever fields you aspire to get into, there is an insider you can turn to for words of wisdom, advice and guidance. In this issue, we show you where they came from, where they are now and exactly how they made it.\r\n\r\nAfterall, every ‘insider’ was once an ‘outsider.\r\n\r\n\r\n","options":[{"id":17346963,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":3.0,"amount_with_others":3.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":6.0,"amount_with_others":6.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/52717665/-/boy-cover.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/52717665/-/boy-cover.png","width":362,"height":405}],"artists":[],"categories":[{"id":2405099,"name":"Magazine","permalink":"magazine","url":"/category/magazine"}]},{"id":4347455,"name":"IDOL Magazine Issue 2; THE FUTURE ISSUE","permalink":"idol-magazine-issue-2-the-future-issue","position":5,"price":6.0,"default_price":6.0,"tax":0.0,"url":"/product/idol-magazine-issue-2-the-future-issue","status":"active","on_sale":true,"created_at":"2011-08-30T21:45:38.000Z","description":"PUBLISHER:  IDOL Magazine\r\n\r\nCOVERS:  Jonas Kloch @ Elite London & Ruby Slate Balthazar @ Nevs, Photography by Jessica Klingelfuss, Creative Director Rebecca Moore, Stylist Gabrielle Stival, Makeup by Michelle Web, Hair by Liam Curran\r\n\r\nPRINT RELEASE  September 2011\r\n\r\nSIZE:  A4, 188 pages\r\n\r\nDELIVERY TIME:  WITHIN 10 DAYS AT YOUR DOORSTEP  (wherever you are)\r\n\r\nTHE FUTURE ISSUE\r\n\r\nIn one sense the future has never been brighter. Yet to some the future is less about belonging to the fearless and more about living in fear of it. But where there is future there is always hope. The future brings change and with change there is opportunity. We have been given the tools and resources to create and sculpt the bright future we desire and we must implement that into our present. \r\nWe are a complicated and often destructive species but we are also a beautiful one with limitless potential. Our past has seen us progress spiritually, intellectually and physically and we will continue to do so. This issue explores the hopes and fears for the future, the array of perspectives and the ever changing debates as we pave our paths ahead. \r\nThe future is an indefinite time that should not only be thought to be ten years or even a thousand years on. It is today, it is tomorrow and it is even that one moment right ahead of us.   \r\n\r\nThe Future Is Now.\r\n\r\nOur second issue looks at different perceptions of the future with features interviews from recent chart topper Wretch32, inspiring fashion designer David Koma, pioneer and innovator Yayoyi Kusama plus many more amazing individuals, articles and editorials. \r\n","options":[{"id":14294849,"name":"Default","price":6.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":2.5,"amount_with_others":2.5,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":5.0,"amount_with_others":5.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42607473/-/Idol_cover_issue2Spine_DEF.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42607473/-/Idol_cover_issue2Spine_DEF.png","width":540,"height":603}],"artists":[],"categories":[{"id":2405099,"name":"Magazine","permalink":"magazine","url":"/category/magazine"}]}]