[{"id":13493298,"name":"Dancer - \"My Car Drives Fast\" 7\" EP","permalink":"dancer-my-car-drives-fast-7","position":1,"price":5.0,"default_price":5.0,"tax":0.0,"url":"/product/dancer-my-car-drives-fast-7","status":"active","on_sale":false,"created_at":"2013-09-11T07:57:54.000Z","description":"<b>A Side</b>\r\n<a href=\"http://www.youtube.com/watch?v=-cQHABXxjQU\">My Car Drives Fast</a>\r\n\r\n<b>B Side</b>\r\n<a href=\"https://www.youtube.com/watch?v=kIBWv1JFnTw\">Jodi</a>\r\n<a href=\"https://www.youtube.com/watch?v=nprgkwfpb6s\">Do Ya Blame Me</a>\r\n\r\nDancer is Rock 'n' Roll! Inspired by power pop, glam, punk, pub stompers and bad attitudes, these boys want you! With two originals and one cover of <b>J.D. Buhl and The Believers</b> “Do Ya Blame Me”, Dancer will have you ready to get down! Follow-up to their debut <b>Daggerman</b> 45.\r\n\r\n<i>\"Power pop is often about pop, but sometimes, as in the case of certain Ramones Dolls, and other Bowery bad boys, it's about power. And not in the sense of walls of sounds or raging rock, but in the sense of fearing that these singers of sweet somethings would just as soon kill you as kiss you. Dancer reminds me of Chicago's great Mickey, in that all the amazing hooks and sugar are laced with a sense of crazy/wildcard/unsettlingness. Have I mentioned yet that this record IS AWESOME!\"</i> - <b>Roctober</b>\r\n\r\n<i>\"Dancer has the relentless melody of West Coast power pop in mind, but lets the urban stain more akin to Johnny Thunders & the Heartbreakers distinguish the hooks.\" </i> - <b>Sam Lefebvre, SF Weekly</b>\r\n\r\nDavey - guitar\r\nDee Dee-guitar/vocals\r\nRay Ray-bass/vocals/organ\r\nOmie-drums/vocals\r\nAndy-vocals/Recording\r\n\r\nRecorded by Andy Human (Lenz, The Cuts, The Time Flys, Buzzer). \r\n\r\n<i><b>500 Pressed. 45rpm. Black vinyl</b></i>\r\n\r\nStream or download <a href=\"http://guitarsandbongos.bandcamp.com/album/my-car-drives-fast-7\">here</a>","options":[{"id":43231917,"name":"Default","price":5.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":8.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":13.0,"amount_with_others":2.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126794850/-/dancer-new-cover-1400x1400.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126794850/-/dancer-new-cover-1400x1400.jpg","width":1400,"height":1400}],"artists":[{"id":232380,"name":"Dancer","permalink":"dancer","url":"/artist/dancer"}],"categories":[{"id":6190836,"name":"7\" records","permalink":"7-records","url":"/category/7-records"}]},{"id":13493142,"name":"Greg Ashley - \"Death of a Ladies' Man\" LP","permalink":"greg-ashley-death-of-a-ladies-man-lp","position":2,"price":14.0,"default_price":14.0,"tax":0.0,"url":"/product/greg-ashley-death-of-a-ladies-man-lp","status":"active","on_sale":false,"created_at":"2013-09-11T07:45:10.000Z","description":"<i>\"HOO BABY we're stoked beyond belief to see another Greg Ashley solo record comin' our way! Gris Gris were (and remain) one of our faves o'er at the shop and Greg's one talented mofo! Ashley throws another curveball at us with this fairly reverent cover of Leonard Cohen's album \"Death Of A Ladies' Man\"! \r\n\r\nCover albums are a tricky business and can go horribly wrong in a heartbeat, but Ashley is so-well acquainted with Cohen's work and his world that this could conceivably be mistaken for an Ashley record on it's own! Seriously, SO MUCH new life is breathed into these tunes, we MIGHT actually prefer it over Cohen's original! Much of the pathos and pain glossed over by the smoke and (cocaine) mirrors of Phil Spector's production is brought to the forefront by Ashley's own sensitive, no-nonsense recording technique. Ashley plays much of the record himself, assisted by a host of able-bodied West Coast guest-players from both the R'n'R/Garage rock and Jazz worlds (including The Wrong Words' Josh Miller and Kimberly Morrison a.k.a. \"The Duchess\" from The Duchess and The Duke!) A killer tribute to a killer album and an appetizing teaser to tide us over until Ashley's next solo album next year on Trouble In Mind! Is this worth it? YOU BET IT IS. Grab a snifter of cognac, unbutton the top three buttons of your shirt and throw this one on to ease away the pain of existence! RECOMMENDED!\"</i> <b>-Permanent Records </b>\r\n\r\n<i>\"Greg Ashley’s 4th album under his own name, his first since 2009’s Requiem Mass (<b>Birdman</b>), signals yet another change in direction for this multi-instrumentalist/producer/ arranger/singer/songwriter/bandleader. Death of a Ladies' Man is a reverential song-for-song treatment of <b>Leonard Cohen</b>’s least “reverential” album: the 1977 <b>Phil Spector</b>-produced album of the same name.\r\n\r\nGreg’s cover photo replaces actual women with two mannequins, but in almost every other way Greg’s stripped down arrangements with a basic bar band lineup give the original animal more human warmth, making the album more accessible than it’s ever been behind that bloated fortress Phil built. Ultimately, Ashley’s Death of a Ladies' Man pays tribute to the songwriting team of Cohen/Spector. \r\n\r\nGreg’s rock and roll background informs his Death of a Ladies' Man, but the tenderness, and the mid-life crisis evident in Cohen’s lyrics is highlighted, and conveys the meaning of the songs in ways even Cohen might appreciate. Greg also brings the sensibility he honed in the Oakland bar circuit, and his country-tinged “One Thin Heroine/ Misery Again” single (<b>Mexican Summer</b>), to make “Fingerprints” a much more convincing country rocker than it does in Spector’s version.\"</i> - <b>Chris Stroffolino</b> (from the liner notes)\r\n\r\n<i><b>First pressing - 500 pressed. The LP comes with a collectible download card. Gorgeous offset printed jacket and insert.</b></i>\r\n\r\n<b>Side 1</b>\r\n<a href=\"http://www.youtube.com/watch?v=_DenFf6ImxY\">True Love Leaves No Traces</a>\r\n<a href=\"https://soundcloud.com/guitarsandbongos/greg-ashley-iodine\">Iodine</a>\r\nPaper-Thin Hotel\r\nMemories\r\n\r\n<b>Side 2</b>\r\n<a href=\"http://www.youtube.com/watch?v=es3cJ-_fMuU\">I Left a Woman Waiting</a>\r\nDon't Go Home With Your Hard-On\r\nFingerprints\r\nDeath of a Ladies' Man","options":[{"id":43231545,"name":"Default","price":14.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":13.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":5.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":21.0,"amount_with_others":6.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/126703098/-/DOLM-1400x1400-new.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/126703098/-/DOLM-1400x1400-new.jpg","width":1400,"height":1400}],"artists":[{"id":232377,"name":"Greg Ashley","permalink":"greg-ashley","url":"/artist/greg-ashley"}],"categories":[{"id":2442609,"name":"LPs","permalink":"lps","url":"/category/lps"}]},{"id":4435721,"name":"Charlie Megira & The Modern Dance Club - \"Love Police\" 2xLP","permalink":"charlie-megira-the-modern-dance-club-love-police-2xlp","position":3,"price":16.0,"default_price":16.0,"tax":0.0,"url":"/product/charlie-megira-the-modern-dance-club-love-police-2xlp","status":"active","on_sale":false,"created_at":"2011-09-14T02:15:24.000Z","description":"Recorded and mixed in Jaffa, Israel, by Charlie Megira.\r\nMastered in Oakland, CA by Greg Ashley (Gris Gris)\r\nDeluxe gatefold Double-LP. 100% virgin vinyl.\r\nDigital download card included.\r\nFirst pressing - 525 copies.\r\n\r\nSample tracks on <a href=\"http://soundcloud.com/guitarsandbongos\" target=\"_new\">SoundCloud</a> and <a href=\"http://www.youtube.com/user/guitarsandbongos\" target=\"_new\">YouTube</a>.\r\n\r\n<i>\"<b>Whoahhhh!</b> Don’t know exactly what just hit me. The photos of the band on the inside gatefold look like they were shot by Jim Jarmusch’s grandfather for an early 1950s road trip home movie that ended up being used as evidence in a homicide trial. The press material claims the band is Israeli, but the only evidence of that here is the Old Testament whoopass they put on musical convention. And the music? It’s hard to begin: I guess there doesn’t have to be any separation between garage rock, art noise, 1950s rock, 2050s roll, shoegaze, experimental experiments against nature, inside out jazz, soundtrack music, ambient strangeness, punk, and the guitar parts on the manliest Smiths records, but until now there always has been. And the guitar playing? What the hell? To be that good at all this stuff is kinda weird in itself, but to be willing to weird out when you could clearly be heralded as a virtuoso in any one genre pigeonhole makes Charlie the free-est, most odd flight pattern flying pigeon this side of the Wailing Wall.\"</i> - <b>Roctober</b>\r\n\r\n<i>\"Wow what a doozy of a package! From Jaffa-Tel Aviv via Oakland label Guitars & Bongos comes an astounding double gatefold vinyl LP recorded and mixed by guitar player and vocalist CHARLIE MEGIRA. It is a totally unexpected joy to be listening to this. And I mean all of this, 4 sides! There’s blasts of crazy punk and acid rock in small doses. Then, plate of shrimp, for no reason other than to experiment against nature, periods of weird, ambient noise. A reoccurring element on Love Police is some seriously dead cool 1960s LINK WRAY inspired instrumentals. The pace never dulls for a fucking second! Everything blindsided me, I had no idea what to expect, but I feel adequately defiled by Love Police.\"</i> - <b>Mongrel Zine</b>\r\n\r\n<i>\"If you pick up just one record, though, do yourself a favor and grab “Love Police” by Charlie Megira & the Modern Dance Club ... The record sounds like Tommy Iommi and Link Wray wrote songs that Warsaw discovered and recorded. So there’re a lot of different kinds of guitar work, but Megira’s skill and sincerity unifies the album. The gatefold photos look like the band is blazing a trail through the American South, but they’re actually posed in front of the Elvis American Diner in Jerusalem. Global rock n’ roll worship that’s better than most stuff coming out of America.\"</i> - <b>Apop Records</b>\r\n\r\n<i>\"Early nineties Sonic Youth, new wave, shoegaze, cowboy folk, 60′s R&B jams? They are all here and I love every minute of them. Of the astounding 31 tracks on the album that Oakland’s Guitars and Bongos put out, there is a wall of sound that maybe is best described as a enormous wave of surf rock filled with extra distortion and punk energy that finally comes crashing down in some crazy Israeli’s garage in Tel-Aviv...Every note in every one of the songs below seems to say two words over and over again. Get Fucked. And that’s a good thing.\"</i> - <b>Unpiano Music</b>\r\n\r\n<i>\"Recorded in Jaffa, Israel, Love Police oozes such derelict slime and Manson Family-esque psychosis, it might as well have been taped in CBGB's bathrooms. If the screw-loose Link Wray I saw at Village Underground in 2002 was hit with a bad case of the DTs and screamed like the hallucinating alkies in the detox ward of The Lost Weekend, backed by The Didjits or Pagans, you'd get Love Police. It's sure a calamitous, lo-fi mess of a marvel, and there's no escape!\"</i> - <b>Jack Rabid, The Big Takeover</b>\r\n\r\n<i>\"<b>4.666/5 Pies</b> ... Charlie Megira plays the madman to the Modern Dance Club’s varicose alley enforcers on this crash course in subversive rock history ... by far the most interesting record of the year\"</i> - <b>Lo-Pie</b>\r\n\r\n<i>\"This record is at the top for a reason: it seems familiar, and yet is unlike anything I’ve ever heard ... It’s as if Megira is a Nostradamus of trash culture, channeling it into a coherent, irresistible medium for scrying ... In the same way Pasolini,Tarkovsky, and Bergman approach film, Megira’s Love Police is an audio study of a particular place and time, and the eternity outside of it.\"</i> - <b>Weird Missoula, Best of 2012</b>\r\n\r\n<b>SIDE A</b>\r\n1. THE RETURN OF THE RUSSIAN FROGMEN THAT DIED AND CAME BACK TO LIFE AS STRANGE LOOKING RADIOACTIVE CREATURES\r\n2.  <a href=\"http://soundcloud.com/guitarsandbongos\">SABABA ONE</a>\r\n3. <a href=\"http://soundcloud.com/guitarsandbongos\">RHYTHM OF HATE</a>\r\n4. AT THE ELVIS INN\r\n5. NO WAVE EXERCISE\r\n6. EXISTENCE\r\n7. THE WALL OF DEATH\r\n8. U.S.F\r\n\r\n<b>SIDE B</b>\r\n1. AND NOW I WANNA DROWN IN YOUR DARK DREAMY EYES\r\n2. BOO\r\n3. <a href=\"http://soundcloud.com/guitarsandbongos\">BEACH BUMS MUST DIE</a>\r\n4. THE STRANGE AND BIZARRE TALE OF THE BOY WHO HAD ONE TESTICLE TOO MANY\r\n5. 333\r\n6.  <a href=\"http://soundcloud.com/guitarsandbongos\">(USED TO BE...) PSYCHIC YOUTH</a>\r\n7.  <a href=\"http://soundcloud.com/guitarsandbongos\">ELVIS IS NOT DEAD</a>\r\n8. SMACK DAB\r\n\r\n<b>SIDE C</b>\r\n1. <a href=\"http://soundcloud.com/guitarsandbongos\">BENEATH THE UNDERGROUND</a>\r\n2. <a href=\"http://soundcloud.com/guitarsandbongos\">THE VALLEY OF TEARS</a>\r\n3. MAO/MAO\r\n4. HERE COMES YOUR MAMA\r\n5. ODE TO A COCKSUCKER\r\n6. HOMELESS BODY\r\n7. SABABA?\r\n\r\n<b>SIDE D</b>\r\n1. <a href=\"http://soundcloud.com/guitarsandbongos\">FREAK JUNIOR</a>\r\n2. PSYCHIC YOUTH-2\r\n3. ANOTHER NO WAVE EXERCISE\r\n4. STREET MACHINE\r\n5. DA HOMOGREASER STOMP\r\n6. ALL TUNED UP AND READY TO GO\r\n7. JE NE PARLE PAS FRANCAIS \r\n8. DEAD GIRL BLUES","options":[{"id":14545747,"name":"Default","price":16.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":5.0,"amount_with_others":1.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":22.0,"amount_with_others":8.0},{"amount_alone":13.0,"amount_with_others":2.0,"country":{"id":7,"name":"Canada","code":"CA"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/71743783/-/love_police.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/71743783/-/love_police.jpg","width":1000,"height":1000}],"artists":[{"id":81779,"name":"Charlie Megira & The Modern Dance Club","permalink":"charlie-megira-the-modern-dance-club","url":"/artist/charlie-megira-the-modern-dance-club"}],"categories":[{"id":4546547,"name":"2xLP","permalink":"2xlp","url":"/category/2xlp"}]}]