[{"id":4154990,"name":"Nilla Island","permalink":"nilla-island-kilee-bee-s-tuptake","position":1,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/nilla-island-kilee-bee-s-tuptake","status":"active","on_sale":false,"created_at":"2011-07-27T00:07:45.000Z","description":"This wonderfully scented glycerin soap will leave the skin feeling incredibly soft and moist. Your skin will love the upgrade from commercial brand soaps to natural homemade soaps. This soap is scented with Vanilla, Coconut and a hint of Honey. The scent will envelop your skin and linger long after you've finished pampering yourself. \r\n\r\nIngredients: Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Honey, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), soy bean protein (conditioner), Vanilla essential oil, Coconut essential oil, Colorant, Cosmetic grade glitter. ","options":[{"id":13723456,"name":"Default","price":4.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40584742/-/nilla_island.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40584742/-/nilla_island.jpg","width":1000,"height":747}],"artists":[],"categories":[{"id":2268248,"name":"Kilee Bee's Tuptakes","permalink":"kilee-bee-s-tuptakes","url":"/category/kilee-bee-s-tuptakes"}]},{"id":4179997,"name":"Key Lime Goodness ","permalink":"key-lime-goodness-kilee-bee-s-tuptake","position":2,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/key-lime-goodness-kilee-bee-s-tuptake","status":"active","on_sale":false,"created_at":"2011-07-31T19:07:17.000Z","description":"Kilee Bee's Key Lime Goodness Tuptake...OMG! If you love key lime pie then, you will be a big, BIG fan of this lime scented glycerin based soap. This soap is homemade, and made from great quality glycerin soap. It will leave your skin incredibly soft and moisturized. The Tuptake is so cute you may be tempted to take a bite (remember its soap)! The scent lingers on your skin, which may cause others to crave some of what you just had!\r\n\r\nThis wonderful little soap was made from quality natural ingredients. Your skin will thank you after you've made the switch from commercial to homemade soap.\r\n\r\nIngredients: Low Sweat Clear Glycerin: Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), Soy bean protein (conditioner) \r\n\r\nShea Glycerin:Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Shea Butter (refined naturally crushed), Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), Soy bean protein (conditioner), Titanium Dioxide (mineral whitener used in opaque soaps)\r\nLime Fragrance oil, Green Colorant, Green sugar topping, Cosmetic grade glitter","options":[{"id":13796165,"name":"Default","price":4.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40842509/-/5152011_087.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40842509/-/5152011_087.jpg","width":648,"height":484}],"artists":[],"categories":[{"id":2268248,"name":"Kilee Bee's Tuptakes","permalink":"kilee-bee-s-tuptakes","url":"/category/kilee-bee-s-tuptakes"}]},{"id":4180061,"name":"Choconut Delight","permalink":"choconut-delight","position":3,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/choconut-delight","status":"active","on_sale":false,"created_at":"2011-07-31T19:49:17.000Z","description":"Choconut Delight is a fan favorite of chocolate lovers. This skin loving glycerin soap is scented with coconut, chocolate and cocoa powder (think Mounds candy bar). Not only will your skin feel amazing after its use, but the chocolate aroma will make you feel amazing as well. \r\nThis adoarable little tuptake will capture your heart and your senses!\r\n\r\nIngredients: Shea Glycerin: Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Shea Butter (refined naturally crushed), Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), Soy bean protein (conditioner), Titanium Dioxide (mineral whitener used in opaque soaps)\r\n\r\nWhite Low Sweat Glycerin:  Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), Soy bean protein (conditioner) , Titanium Dioxide (mineral whitener used in opaque soaps)\r\nCocoa powder, Coconut FO, Chocolate FO, Glitter (cosmetic grade)","options":[{"id":13796081,"name":"Default","price":4.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40843069/-/5152011_089.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40843069/-/5152011_089.jpg","width":648,"height":484}],"artists":[],"categories":[{"id":2268248,"name":"Kilee Bee's Tuptakes","permalink":"kilee-bee-s-tuptakes","url":"/category/kilee-bee-s-tuptakes"}]},{"id":4180089,"name":"Razzle Dazzle","permalink":"razzle-dazzle","position":4,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/razzle-dazzle","status":"active","on_sale":false,"created_at":"2011-07-31T20:01:55.000Z","description":"Looking for a soap that will Razzle and Dazzle your senses, then you will love this sweet smelling glycerin soap. This soap is handmade from quality skin adoring ingredients. This adorable little Tuptake soap is lightly scented with black raspberry fragrance oil. This is the ultimate girlie girl soap. Girlie girls of all ages will truly enjoy this lil' cutie. For extra cuteness the top of this Tuptake has been sprinkled with yellow sugar crystals and glitter for that added Razzle Dazzle!\r\n\r\nIngredients: Clear Low Sweat Glycerin: Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), Soy bean protein (conditioner) \r\n\r\nWhite Low Swear Glycerin: Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), Soy bean protein (conditioner) , Titanium Dioxide (mineral whitener used in opaque soaps)\r\nBlack raspberry FO, Fuschia colorant, Yellow sugar crystals, Glitter (cosmetic grade)","options":[{"id":13796157,"name":"Default","price":4.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40843297/-/5152011_091.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40843297/-/5152011_091.jpg","width":648,"height":484}],"artists":[],"categories":[{"id":2268248,"name":"Kilee Bee's Tuptakes","permalink":"kilee-bee-s-tuptakes","url":"/category/kilee-bee-s-tuptakes"}]},{"id":4180155,"name":"Melanie","permalink":"melanie","position":5,"price":4.5,"default_price":4.5,"tax":0.0,"url":"/product/melanie","status":"active","on_sale":false,"created_at":"2011-07-31T20:30:18.000Z","description":"Introducing Melanie to the KBT family. Melanie is a sweet and simple kind of girl. She enjoys summer afternoons. Her favorite summer activity is sitting under a shade tree enjoying a sweet melon. This adorable little Tuptake will remind you of those summer afternoons when you were a kid. This fabulous honey glycerin soap is not only skin loving, but also light and sweetly scented with melon fragrance oil. An instant favorite to the KBT family.\r\n\r\nIngredients: Honey Glycerin: Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Honey, Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), soy bean protein (conditioner)\r\n\r\nClear Low Sweat Glycerin:Coconut Oil, Palm Oil, Safflower Oil, Glycerin (kosher, of vegetable origin), Purified Water, Sodium Hydroxide (saponifying agent), Sorbitol (moisturizer), Sorbitan oleate (emulsifier), Soy bean protein (conditioner) \r\nOrange colorant, Green colorant, Melon FO, Green sugar crystals, Glitter (cosmetic grade)","options":[{"id":13797187,"name":"Default","price":4.5,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40844133/-/5152011_093.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40844133/-/5152011_093.jpg","width":648,"height":484}],"artists":[],"categories":[{"id":2268248,"name":"Kilee Bee's Tuptakes","permalink":"kilee-bee-s-tuptakes","url":"/category/kilee-bee-s-tuptakes"}]}]