[{"id":4843039,"name":"Oliver Mouse","permalink":"oliver-mouse","position":1,"price":39.0,"default_price":39.0,"tax":0.0,"url":"/product/oliver-mouse","status":"active","on_sale":false,"created_at":"2011-11-14T06:55:06.000Z","description":"Oliver likes to practice accordion after breakfast. He says he's been playing for about two and a half years, so he's getting pretty good. Now that Ella Toad is learning the recorder, they want to play duets together. They're practicing \"The Eensy Weensy Spider,\" which they hope to play at Emma Rabbit's next tea party. It still needs some work.\r\n\r\nOliver is made of gray organic cotton jersey. He's about 14\" tall. His eyes, nose, and whiskers are hand stitched with cotton thread. He is stuffed with polyfill, so you can hand wash him and he will air dry, no worse for the wear. \r\n\r\nOliver's lucky hat is made from green organic cotton fleece. As you can see it has spaces for his ears, and a spiffy red and yellow tassel on top. His scarf is made of striped organic cotton jersey. Both of those things are removable so the animals can share and trade, but Oliver says for the record, he doesn't share his lucky hat with just anyone. \r\n\r\nHe's a pretty nice guy though, don't get the wrong idea. Oliver will come your way in a reusable cotton bag. He doesn't come with an accordion, but he does come with his lucky hat and scarf, and a delightful lavender and mint sachet. ","options":[{"id":15795465,"name":"No Monogram","price":39.0,"sold_out":false,"has_custom_price":false},{"id":17201041,"name":"Monogram ($5)","price":44.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/91724162/-/2042_oliver.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/91724162/-/2042_oliver.png","width":966,"height":1000}],"artists":[],"categories":[{"id":1601816,"name":"Animals","permalink":"animals","url":"/category/animals"}]},{"id":5736215,"name":"Emma Rabbit","permalink":"emma-rabbit","position":2,"price":39.0,"default_price":39.0,"tax":0.0,"url":"/product/emma-rabbit","status":"active","on_sale":false,"created_at":"2012-03-20T07:11:36.000Z","description":"Emma Rabbit's favorite holiday is definitely May Day. She has been collecting Maypole ribbons all year. And every Wednesday afternoon at Village Dancing Practice, she teaches special May Day dances to the other animals. She says she learns them from various sources but also invents new ones. \r\n\r\nEmma is made from ivory-colored organic cotton velour. She measures 15\" tall. Her ears are lined with pink striped cotton, and her face is hand embroidered with cotton embroidery floss. She is safe for babies because there are no parts they could rip off and eat. Emma is stuffed with washable polyfill, so if she gets dirty you can hand wash her in warm water. \r\n\r\nEmma's dress is sure to delight anyone who loves pink and purple. It closes with a snap in back. It is removable so the animals can share and trade. \r\n\r\nEmma will come to you in a reusable cotton bag, perfumed with a lavender and mint sachet.","options":[{"id":18415327,"name":"No Monogram","price":39.0,"sold_out":false,"has_custom_price":false},{"id":18415329,"name":"Monogram ($5)","price":44.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/56311343/-/emma_contrast_web.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/56311343/-/emma_contrast_web.jpg","width":1000,"height":1000}],"artists":[],"categories":[{"id":1601816,"name":"Animals","permalink":"animals","url":"/category/animals"}]},{"id":4843351,"name":"Gwendolyn Raccoon","permalink":"gwendolyn-raccoon","position":3,"price":39.0,"default_price":39.0,"tax":0.0,"url":"/product/gwendolyn-raccoon","status":"active","on_sale":false,"created_at":"2011-11-14T07:53:54.000Z","description":"Sometimes Gwendolyn hides in a special lair by the path, where she can see if any cats pass by. She really loves cats. She thinks they are so cute, and also scary even though they leave her alone. Her favorite toy is a tiny stuffed cat, which was a birthday present from Penelope Rabbit.\r\n\r\nGwendolyn is 14\" tall. She is made of gray organic cotton with a brushed flannel texture, with black mask and tail stripes and a white snout.  Her ears are lined with cotton shirting. Her eyes and nose are hand-stitched with cotton thread. She is stuffed with washable polyfill, so she can be hand washed in warm water and air dried.\r\n\r\nGwendolyn's dress is of white cotton with tiny blue, yellow and green flowers on it. It has a snap closure in back. It is removable so she can change clothes. \r\n\r\nGwendolyn and her dress will come to you in a reusable cotton bag, perfumed with a lavender and mint sachet.\r\n","options":[{"id":15796391,"name":"No Monogram","price":39.0,"sold_out":false,"has_custom_price":false},{"id":17201061,"name":"Monogram ($5)","price":44.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/90156470/-/1112_gwendolyn.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/90156470/-/1112_gwendolyn.png","width":1000,"height":1000}],"artists":[],"categories":[{"id":1601816,"name":"Animals","permalink":"animals","url":"/category/animals"}]},{"id":2744579,"name":"Catalina Mouse","permalink":"catalina-mouse","position":4,"price":39.0,"default_price":39.0,"tax":0.0,"url":"/product/catalina-mouse","status":"active","on_sale":false,"created_at":"2010-09-10T23:25:53.000Z","description":"Sometimes the other animals ask Catalina, doesn't that bonnet constrict your ears? She says, thank you for asking but in fact no, it is cozy and it stretches. Plus, when she finds nice acorns she can use her bonnet as a bag.\r\n\r\nCatalina is made of gray organic cotton jersey, and stuffed with washable polyfill. Her ears are lined with cotton oxford shirting. Her eyes and nose are hand-stitched with cotton embroidery floss. She measures 13.5 inches, not counting her ears and tail. You can hand-wash her in warm water, and she will air dry.\r\n\r\nCatalina's elastic-waist skirt is made of floral printed cotton. Her bonnet is red organic cotton. Like all Hazel Village animal clothes, Catalina's skirt and bonnet are removable so the animals can share and trade.\r\n\r\nCatalina will travel to you in a reusable cotton bag, with a lavender and mint sachet tucked inside. She is excited for the journey because in general she likes burrows, and she fits in the shipping carton perfectly.","options":[{"id":9632942,"name":"No Monogram","price":39.0,"sold_out":false,"has_custom_price":false},{"id":17201075,"name":"Monogram ($5)","price":44.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/91724054/-/2041_catalina.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/91724054/-/2041_catalina.png","width":1000,"height":1000}],"artists":[],"categories":[{"id":1601816,"name":"Animals","permalink":"animals","url":"/category/animals"}]},{"id":2967799,"name":"Flora Fox","permalink":"flora-fox","position":5,"price":39.0,"default_price":39.0,"tax":0.0,"url":"/product/flora-fox","status":"active","on_sale":false,"created_at":"2010-12-02T23:06:04.000Z","description":"Miss Flora Fox likes ballet and working on whittling projects. Recently she finished carving a salad bowl.\r\n\r\nShe is made of orange organic cotton with a brushed flannel texture, and stuffed with washable polyfill. Her nose and the tip of her tail are white, and her ears are lined with striped pink cotton. She is 15\" from ear to toe. Her eyes and nose are hand-embroidered with cotton thread. If necessary, you can hand-wash Flora.\r\n\r\nFlora's dress is made of white cotton with tiny pink and green flowers on it. It opens and closes with a snap in the back. Like all Hazel Village clothes, Flora's dress is removable so the animals can share and trade.\r\n\r\nFlora will travel to you in a reusable cotton bag with a lavender and mint sachet tucked inside. She will NOT come with a whittling knife, much to her dismay. I told her that when she arrives at her new home, maybe you can work something out. ","options":[{"id":10251551,"name":"No Monogram","price":39.0,"sold_out":false,"has_custom_price":false},{"id":17201255,"name":"Monogram ($5)","price":44.0,"sold_out":false,"has_custom_price":true}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/89272778/-/FloraFox.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/89272778/-/FloraFox.png","width":894,"height":894}],"artists":[],"categories":[{"id":1601816,"name":"Animals","permalink":"animals","url":"/category/animals"}]}]