[{"id":5619981,"name":"Pure Baltic Amber Teething Bracelets","permalink":"pure-baltic-amber-teething-bracelets","position":1,"price":14.0,"default_price":14.0,"tax":0.0,"url":"/product/pure-baltic-amber-teething-bracelets","status":"active","on_sale":true,"created_at":"2012-03-05T16:49:43.000Z","description":"Pure Baltic Amber Teething Bracelets are not to be chewed but to be worn. As the Baltic Amber has natural analgesic and anti-inflammatory properties it will help calm and soothe a baby without the need for drugs.\r\nIt helps to reduce inflamed cheeks and gums as well as stimulate the thyroid glands to help reduce drooling.\r\n\r\nWhen amber is worn on the skin, the skin's warmth releases minuscule amounts of healing oils from the amber which are then absorbed via the skin into the bloodstream. Pure Baltic Amber Teething Bracelets may be placed in the sun to warm to enhance their analgesic effect (always check the temperature of the necklace before placing it on your child). \r\n\r\nOnly 100% authentic Natural Baltic Amber sourced directly from Lithuania, on the banks of the Baltic Sea, is used to make our Pure Baltic Amber Teething Bracelets.\r\n\r\nFor safety each amber bead is individually knotted so in the event that the bracelet should break beads are not scattered causing a choking hazard. The bracelet is fastened with a plastic clasp so it may release if it becomes caught. \r\nWe recommend that children are supervised at all times whilst wearing our Pure Baltic Amber Teething Bracelets. Discouraging your child from tugging, chewing or sucking on the necklace is also very important.\r\nWe also recommend removing the Pure Baltic Amber Teething Bracelet when bathing or swimming to prolong the life of the necklace. Only a damp cloth should be used to clean the bracelet.\r\nAlthough we have put safety measures in place to avoid any mishaps from the use of these bracelets, we will not take any responsibility for injury that may occur from wearing this product. \r\n","options":[{"id":18078241,"name":"Honey","price":14.0,"sold_out":false,"has_custom_price":false},{"id":18078243,"name":"Cognac","price":14.0,"sold_out":false,"has_custom_price":false},{"id":18078245,"name":"Cherry","price":14.0,"sold_out":false,"has_custom_price":false},{"id":18078247,"name":"Mixed","price":14.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[],"artists":[],"categories":[{"id":2970761,"name":"Jewellery","permalink":"jewellery","url":"/category/jewellery"},{"id":2970763,"name":"Baby","permalink":"baby","url":"/category/baby"}]},{"id":5619915,"name":"Pure Baltic Amber Teething Necklaces","permalink":"pure-baltic-amber-teething-necklaces","position":2,"price":25.0,"default_price":25.0,"tax":0.0,"url":"/product/pure-baltic-amber-teething-necklaces","status":"active","on_sale":true,"created_at":"2012-03-05T16:28:29.000Z","description":"Pure Baltic Amber Teething Necklaces are not to be chewed but to be worn. As the Baltic Amber has natural analgesic and anti-inflammatory properties it will help calm and soothe a baby without the need for drugs.\r\nIt helps to reduce inflamed cheeks and gums as well as stimulate the thyroid glands to help reduce drooling.\r\nWhen amber is worn on the skin, the skin's warmth releases minuscule amounts of healing oils from the amber which are then absorbed via the skin into the bloodstream. Pure Baltic Amber Teething Necklaces may be placed in the sun to warm to enhance their analgesic effect (always check the temperature of the necklace before placing it on your child). \r\n\r\nFor safety each amber bead is individually knotted so in the event that the necklace should break beads are not scattered causing a choking hazard. The necklace is fastened with a plastic clasp so it may release if it becomes caught. \r\n\r\nWe recommend that children are supervised at all times whilst wearing our Pure Baltic Amber Teething Necklaces. We also recommend they are removed from the neck whilst your child is sleeping. For your child to continue to receive the benefits of the amber during this time you may like to place the necklace around their ankle. Discouraging your child from tugging, chewing or sucking on the necklace is also very important.\r\n\r\nWe also recommend removing the Pure Baltic Amber Teething Necklace when bathing or swimming to prolong the life of the necklace. Only a damp cloth should be used to clean the necklace.\r\nAlthough we have put safety measures in place to avoid any mishaps from the use of these necklaces, we will not take any responsibility for injury that may occur from wearing this product. \r\n","options":[{"id":18078089,"name":"Honey","price":25.0,"sold_out":false,"has_custom_price":false},{"id":18078091,"name":"Cognac","price":25.0,"sold_out":false,"has_custom_price":false},{"id":18078093,"name":"Cherry","price":25.0,"sold_out":false,"has_custom_price":false},{"id":18078095,"name":"Mixed","price":25.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0}],"images":[],"artists":[],"categories":[{"id":2970761,"name":"Jewellery","permalink":"jewellery","url":"/category/jewellery"},{"id":2970763,"name":"Baby","permalink":"baby","url":"/category/baby"}]},{"id":5619881,"name":"Poppet Pants Modern Cloth Nappies","permalink":"poppet-pants-modern-cloth-nappies","position":3,"price":27.0,"default_price":27.0,"tax":0.0,"url":"/product/poppet-pants-modern-cloth-nappies","status":"active","on_sale":true,"created_at":"2012-03-05T16:20:19.000Z","description":"Poppet Pants All In Two One Size Fits Most Modern Cloth Nappy/ Diaper \r\nFeatures:\r\n>Suitable from Birth through to approximately 18kg\r\n>Waterproof yet breathable PUL outer cover lined with soft sude cloth\r\n>Includes 2 Bamboo/Organic Cotton/Coolplus blend snap in inserts for great absorbance and shorter drying time \r\n> Available in 5 fabulous colours: Amparo Blue, Aurora Yellow, Natural White, Spring Bouquet Green and Honeysuckle Pink","options":[{"id":18078003,"name":"Amparo Blue","price":27.0,"sold_out":false,"has_custom_price":false}],"images":[],"artists":[],"categories":[]}]