[{"id":1815881,"name":"Wonderland","permalink":"wonderland-pre-order","position":1,"price":99.0,"default_price":99.0,"tax":0.0,"url":"/product/wonderland-pre-order","status":"active","on_sale":false,"created_at":"2010-03-03T17:05:51.000Z","description":"Wonderland is a collection of ten alternative folk songs that are distinct and unique. Original and individualistic Wonderland brakes away from music trends and instead embraces and nurtures its differences, bringing to life a sound that is authentic and one of its kind. \r\n\r\nStorytelling takes the forefront through out the album with poetic and tragic tales of characters in contemplation, exile and love. Pandora’s box, Alice in Wonderland and Jack the ripper are just a few of the stories told through out the album. Witty and playful lyrics are sung alongside warm musical arrangements.\r\n\r\nWonderland is a subtle and understated low-fi record that demonstrates Andreas Constantinou’s song writing at its most intimate to date and displays his authentic and original approach towards music.  Catchy and radio friendly with a quirky style and unusual lyricism make this a record that is well worth the listen.\r\n ","options":[{"id":6600961,"name":"Default","price":99.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":0.0,"amount_with_others":0.0},{"amount_alone":0.0,"amount_with_others":0.0,"country":{"id":11,"name":"Denmark","code":"DK"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/17369541/-/cover_mini.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/17369541/-/cover_mini.jpg","width":280,"height":280}],"artists":[],"categories":[{"id":1122461,"name":"CDs","permalink":"cds","url":"/category/cds"}]},{"id":1815841,"name":"Fistful","permalink":"fistful","position":2,"price":49.0,"default_price":49.0,"tax":0.0,"url":"/product/fistful","status":"active","on_sale":true,"created_at":"2010-03-03T16:52:46.000Z","description":"Fistful is the debut album by the artist Andreas Constantinou. The album comprises of twelve songs that have been recorded in Reykjavik, Iceland and is co produced by Rágnar Ólafsson and mastered by Flex at Irak studio, Syrland. The album features performances from Haffsteinn Þoralfsson, Rágnar Ólafsson, Garðar Borgþorsson and Elvar Atli Ævarson.\r\n\r\nFistful is a collection of songs that are best described as raw, energetic, moody and sparse. Rhythmic guitars, simplistic percussion, energetic vocal performances and abrasive lyrics are the driving force through the album. The songs depict subjects such as deceit, sex, anger and heartache and create a body of work that is best described as a blend of alternative punk.\r\n\r\nAndreas Constantinou brings his sense of theatre and satire to the album with vocal performances that witness him whispering, moaning, shouting and singing of bitter affairs, sour times and sexual promiscuity.  The albums bare and visceral sound is carried through in to the artist’s lyrics that are immediate and direct statements of love, lust and turmoil.","options":[{"id":6600721,"name":"Default","price":49.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":1.5,"amount_with_others":1.0,"country":{"id":42,"name":"United Kingdom","code":"GB"}},{"amount_alone":1.5,"amount_with_others":1.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/17369221/-/fistful.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/17369221/-/fistful.jpg","width":280,"height":280}],"artists":[],"categories":[{"id":1122461,"name":"CDs","permalink":"cds","url":"/category/cds"}]}]