[{"id":5142647,"name":"Pore Tonic - Face Serum","permalink":"pore-tonic-face-serum","position":1,"price":23.0,"default_price":23.0,"tax":0.0,"url":"/product/pore-tonic-face-serum","status":"active","on_sale":false,"created_at":"2011-12-27T18:35:24.000Z","description":"100 Percent Natural Pore Tonic Facial Serum - infused herbs of hibiscus, calendula, borage, marshmallow, and comfrey. Pore Tonic Facial Serum is blended perfectly with tea tree, lavender, organic geranium, frankincense and myrrh. I wanted to infuse every essential herb and oil into one small bottle I could to achieve the PERFECT Pore Tonic Face Serum. Great for men and women with all skin types.\r\n\r\nVitamins and Anti-oxidants are packed tight into this small 2 oz bottle (bottle now clear, not amber as pictured). This product is enough to last the twice-daily user many, many months.\r\n\r\nWhy use chemically laden facial moisturizer, when you can get the absolute best ingredients, right from nature?\r\n\r\n*** Due to the rules and regulations set forth by the FDA, bath and body shops are not permitted, by law, to make any claims about cosmetics (anti-aging, wrinkle reducing, pore reducing, acne/clarifying, etc..). Please do your own research as per ingredients and decide if this product is for you. ***\r\n\r\n~~~ If pregnant or nursing (as with any product containing herbs and essential oils), please consult your doctor before use. ~~~","options":[{"id":16697579,"name":"Default","price":23.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50497515/-/PoreTonic.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50497515/-/PoreTonic.jpg","width":883,"height":871}],"artists":[],"categories":[]},{"id":5142539,"name":"Candy Cane Natural Peppermint Soap","permalink":"candy-cane-natural-peppermint-soap","position":2,"price":6.5,"default_price":6.5,"tax":0.0,"url":"/product/candy-cane-natural-peppermint-soap","status":"active","on_sale":false,"created_at":"2011-12-27T17:35:14.000Z","description":"LIMITED EDITION SOAP !!\r\n\r\nCandy Cane Natural Soap: This is a limited edition soap - VERY limited supply. Once it's gone, it won't be back in stock until next Christmas!  Super minty peppermint essential oil is blended into our unique soap formulation. Iron oxides are added to make that classic peppermint red swirl. The soaps are 5 oz and are made with vegan ingredients -including soybean, coconut, olive, and cottonseed oil. This soap lathers fabulously, and makes your skin feel super fresh and minty.","options":[{"id":16697281,"name":"Default","price":6.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50496411/-/CandyCane.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50496411/-/CandyCane.jpg","width":446,"height":321}],"artists":[],"categories":[]},{"id":5142535,"name":"Lavender Shea Oatmeal Natural Soap","permalink":"lavender-shea-oatmeal-natural-soap","position":3,"price":6.75,"default_price":6.75,"tax":0.0,"url":"/product/lavender-shea-oatmeal-natural-soap","status":"active","on_sale":false,"created_at":"2011-12-27T17:33:43.000Z","description":"This natural lavender soap bar not only looks beautiful with it's gorgeous violet hue, and oatmeal speckles throughout, but smells phenomenal. You will be blown away by how long it lasts - keep dry between uses to extend usage. Relax, and allow the lovely lavender scent to carry your mind and body away from the stresses of your daily life. The skin-loving shea butter has been added as a \"super-fatting\" (adding extra moisture without turning it into soap) ingredient to sooth your extra-dry skin.\r\n\r\nThis listing is for the 5 oz size (about 1.5 times the size of a commercial bar)\r\n\r\nYour new Shea and Oatmeal Lavender Soap bar contains the following saponified (turning oils into soap) ingredients:Olive Oil, Coconut Oil, Soybean Oil, Shea Butter, Cottonseed Oil,Lavender Essential Oil, Ground Oatmeal, Violet Mineral Oxide (for color).\r\n\r\nAs always, Krug's Eco-Logic takes great strides in reducing our carbon footprint - from - reusing shipping/packaging materials to using only 100% recycled paper and easily recyclable  lotion bottles, and all vegan/natural ingredients. All of our products are paraben-free and contain only the highest quality oils and butters.Feel GOOD about your purchase!\r\n","options":[{"id":16697275,"name":"Default","price":6.75,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50496403/-/LavenderSoapLabelPic.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50496403/-/LavenderSoapLabelPic.jpg","width":300,"height":225}],"artists":[],"categories":[]},{"id":3278607,"name":"Pale Ale Beer Soap - Cedarwood","permalink":"pale-ale-beer-soap-cedarwood","position":4,"price":6.5,"default_price":6.5,"tax":0.0,"url":"/product/pale-ale-beer-soap-cedarwood","status":"active","on_sale":false,"created_at":"2011-02-13T07:31:33.000Z","description":"The Best Men's soap !! Ordering something for yourself today? Don't forget your man! Add this natural beer soap along with your order and surprise him with a handmade treat! It has a very masculine scent made with a locally made beer (instead of plain old water) and natural cedarwood essential oil. This listing is for the smaller version of our MEGA large bars. \r\n\r\nNatural Cedar Wood Pale Ale Hand Made Soap is also made with saponified oils of Coconut, Olive, Cottonseed, and Soybean. The coconut oil gives the soap a fantastic fluffy, yet creamy lather and allows it to stand up to all that extra man-hair!\r\n\r\nThis soap is approximately 5 oz ( a bit larger than a commercial bar of soap), and is just perfect as a gift or surprise for the man (or... men) in your life!\r\n\r\nFull Ingredient List:\r\n\r\nGlycine Soja (soybean oil), Yeungling Lager Beer, Cocos Nucifera (Coconut) Oil, Gossypium Herbaceum (cotton) Seed Oil, Sodium Hydroxide (saponifying agent), water (aqua), Juniperus virginiana (cedarwood) Oil\r\nAs always, Krug's Eco-Logic soap/products are made with only high quality vegetable oils (never any animal products or animal testing involved), and continues to strive to be as eco-friendly as possible. We reuse all shipping/packing materials and only purchase recycled paper for labels.\r\n\r\nThanks for helping to keep our earth and your home eco-friendly!\r\n\r\n*** This soap will not smell like beer - it smells like musky & woody, ced","options":[{"id":11140721,"name":"Default","price":6.5,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":4.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":10.0,"amount_with_others":7.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31814459/-/PaleAleAWESOME.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31814459/-/PaleAleAWESOME.jpg","width":1000,"height":750}],"artists":[],"categories":[]},{"id":3278589,"name":"Yoga Meditation Aromatherapy Blend","permalink":"yoga-meditation-aromatherapy-blend","position":5,"price":20.0,"default_price":20.0,"tax":0.0,"url":"/product/yoga-meditation-aromatherapy-blend","status":"active","on_sale":false,"created_at":"2011-02-13T07:25:15.000Z","description":"Who doesn't love yoga? This natural essential oil product is the perfect addition to your routine. Blended with a proprietary blend of sandalwood, frankincense, amongst other grounding oils, you'll slip into a deeper, more relaxed state of mind.\r\n\r\nPlease check out our Yoga Meditation Blend Giveaway: http://krugsecologic.blogspot.com/2011/02/love-yoga-win-this.html\r\n\r\nThis natural Eco-Logic™ product is diluted with a bit of jojoba oil ( a very thin liquid wax that will easily absorb into the skin ) in order for it to be skin-safe.\r\n\r\nI like to put a dab of it on my chest, and wrists so that I smell it from sun salutations through the workout, to meditation. This comes in a 7 mL roll on tube.","options":[{"id":11140663,"name":"Default","price":20.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":7.0,"amount_with_others":4.0,"country":{"id":7,"name":"Canada","code":"CA"}},{"amount_alone":4.0,"amount_with_others":2.0,"country":{"id":43,"name":"United States","code":"US"}},{"amount_alone":10.0,"amount_with_others":6.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/31814395/-/YogaBlendGood.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/31814395/-/YogaBlendGood.jpg","width":640,"height":480}],"artists":[],"categories":[]}]