[{"id":21050,"name":"Mona-vie Original 1 bottle","permalink":"mona-vie-original-1-bottle","position":1,"price":39.99,"default_price":39.99,"tax":0.0,"url":"/product/mona-vie-original-1-bottle","status":"active","on_sale":true,"created_at":"2007-05-04T22:44:08.000Z","description":"Experience this exquisite health enhancing drink made from the powerful Acai Berry and 18 other fruits from the four corners of the world. MonaVie ™ seeks to define what genuine nutrients are meant to do: help the body perform at an optimum level.\n\n\tMonaVie ™ is a product with a purpose, and that purpose extends much further than the wellness of its consumers. MonaVie&#8217;s roots are entrenched in the Amazon. This region is home to one-third of the world&#8217;s species of animal and plant life. The health and well-being of the Brazilian rainforest directly impacts the quality and power of MonaVie™.\n\n\tMonaVie ™ is a product with a purpose, and that purpose extends much further than the wellness of its consumers. MonaVie&#8217;s roots are entrenched in the Amazon. This region is home to one-third of the world&#8217;s species of animal and plant life. The health and well-being of the Brazilian rainforest directly impacts the quality and power of MonaVie ™.\n\n\tConsuming 4 ounces of MonaVie daily is equivalent to 5 servings of fruits and vegetables needed to maintain a proper supply of food derived antioxidants for your body.\n\n\t1 gram of MonaVie&#8217;s freeze dried powder has an <span class=\"caps\">ORAC</span> value of 1027, which is higher than any other company. When looking and comparing <span class=\"caps\">ORAC</span> scores please look at how they are measuring them. MonaVie uses a gram to gram scale where other companies use 100 gram per gram scale.\n\n\tMonaVie is the first to use freeze dried acai in a juice form and freeze dried acai is the form of acai that we have filed for patent protection, not only in the U.S. but 10 international countries.\n\n\tThe acai and bilberry are now certified organic. All MonaVie fruits are tested for levels of herbicides, insecticides, pesticides, etc.  MonaVie only uses fruit that <span class=\"caps\">DO NOT</span> have any levels of the aforementioned.\n\n\tAll fruits are picked and processed as quickly as possible to ensure quality and nutritional content.\n\n\tThe acai berry makes up 15%-20% of the MonaVie blend.  The rest of the blend is made up of the other 18 fruits. MonaVie chose the 19 fruits that would best contribute to your health and give you the variety of fruits your body needs on a daily basis\n\n\tMonaVie uses the whole fruit of the Acai berry (skin, pulp, and a layer of the seed).\n\n\tMonaVie uses the juice concentrates of most of the other fruits.  A few of the fruits you can not use a juice concentrate but rather a fruit puree such as banana and prune.\n\n\tMonaVie sources and approves each ingredient in our formula.  Each batch is tested to ensure that the potency of our formula does not change.  Random samples are drawn and those samples are tested at a third party independent laboratory.\n\n\tThe acai, acerola, and camu camu come from Brazil.  The lychee and wolfberry come from China.  The other fruits come from various places which are Vietnam, South America, New Zealand and North America.\n\n\tMonaVie is currently having its formula tested for the exact amount of vitamins and minerals.  If MonaVie decides to use a Supplement Facts panel rather than a Nutritional Facts panel then this information can be made available.  Please remember that it is the phytonutrients that are what makes the MonaVie juice so valuable.  Phytonutrients are nutrients concentrated in the skins of many vegetables and fruits, and are responsible for their color, hue, scent, and flavor.  To a lesser extent, they are also found in grains and seeds.\n\n\tPeople sometimes mistakenly believe they are vitamins and/or minerals.  In fact, they are pigments, or more precisely, the biologically active constituents of pigments.  How can they benefit you?  In the last few years, phytonutrients have been getting greater attention, as more and more research uncovers just how powerful these nutrients are for our health.  They are potent antioxidants that can neutralize free radical damage.  Free radicals are highly reactive chemical substances that, if left unchecked, can lead to premature aging and disease.\n\n\tClinical trials are now revealing that phytonutrients can enhance the strength of the immune system, and may play a role in preventing certain cancers.  Other studies have shown that the phytonutrients in blueberries and bilberries slow brain aging and maintain healthy vision in rats.\n\n\tIt has long been known that plant-based nutrients are among the most beneficial of foods to consume a great deal of and phytonutrients may hold the key to explaining why this is so.\n\n","options":[{"id":149351,"name":"Default","price":39.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42473/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42473/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[]},{"id":21054,"name":"Mona-vie Active 1 bottle","permalink":"mona-vie-active-1-bottle","position":2,"price":44.99,"default_price":44.99,"tax":0.0,"url":"/product/mona-vie-active-1-bottle","status":"active","on_sale":true,"created_at":"2007-05-04T23:32:07.000Z","description":"MonaVie ™ <span class=\"caps\">ACTIVE</span> also includes Esterified Fatty Acids and Gluscosamine which help with inflammatory problems, flexibility, mobility, joint pain, muscle pain rebuilding cartilage and much more. Each fruit and each portion were selected for their specific and known benefits.\n\n","options":[{"id":149352,"name":"Default","price":44.99,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":4.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41230/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41230/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[]},{"id":21057,"name":"Mona-vie Original 1 case","permalink":"mona-vie-original-1-case","position":3,"price":149.0,"default_price":149.0,"tax":0.0,"url":"/product/mona-vie-original-1-case","status":"active","on_sale":true,"created_at":"2007-05-05T00:18:25.000Z","description":"Mona-vie Original case includes 4 bottles.\n\n","options":[{"id":149361,"name":"Default","price":149.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":13.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/42481/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/42481/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[]},{"id":21058,"name":"Mona-vie Active 1 case","permalink":"mona-vie-active-1-case","position":4,"price":159.0,"default_price":159.0,"tax":0.0,"url":"/product/mona-vie-active-1-case","status":"active","on_sale":true,"created_at":"2007-05-05T00:21:13.000Z","description":"Mona-vie Active 1 case includes 4 bottles\n\n","options":[{"id":149374,"name":"Default","price":159.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":13.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41229/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41229/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[]},{"id":21060,"name":"Mona-vie Gel Pack 1 box (28 packs)","permalink":"mona-vie-gel-pack-1-box-28-packs","position":5,"price":90.0,"default_price":90.0,"tax":0.0,"url":"/product/mona-vie-gel-pack-1-box-28-packs","status":"active","on_sale":false,"created_at":"2007-05-05T00:30:26.000Z","description":"Although MonaVie is a tasty pleasure to drink&#8230; it isn&#8217;t always convenient to carry a chilled bottle with you. For all those times when you want to treat your body to an energy lift and all the other benefits of MonaVie&#8230; just keep a few of our MonaVie Packs in your pocket or purse! No fuss, no water needed!\n\n\tJust squeeze and swallow&#8212;and all the zesty, phytonutrient and antioxidant power of MonaVie is instantly on the way to supporting your body! As a nutritional drink or as a gel, there&#8217;s simply nothing else that compares.\n\n\tFind out for yourself why people around the world are raving about the way they look and feel after choosing a daily regimen of MonaVie.\n\n\tWith MonaVie ™ Gel, you can enjoy all the antioxidants, phytonutrients, and other health benefits of MonaVie ™ Original in a convenient, single-dose pack. So when life won&#8217;t let you slow down, keep on the move with MonaVie ™ Gel by treating your body to the experience of MonaVie ™.\n\n","options":[{"id":149375,"name":"Default","price":90.0,"sold_out":false,"has_custom_price":false}],"shipping":[{"amount_alone":10.0,"amount_with_others":0.0}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/41058/-/300.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/41058/-/300.jpg","width":300,"height":300}],"artists":[],"categories":[]}]