[{"id":1508641,"name":"Watts Clever Standby Control Socket inc remote","permalink":"watts-clever-standby-control-socket-inc-remote","position":1,"price":9.95,"default_price":9.95,"tax":0.0,"url":"/product/watts-clever-standby-control-socket-inc-remote","status":"active","on_sale":false,"created_at":"2010-02-08T01:41:53.000Z","description":"this simple device saves energy, money and prolongs the life of your expensive equipment by shutting off power to the outlets, everyone knows that when a computer/monitor/printer/scanner/etc/etc/etc are on standby they still draw power, and cost you money.\r\n\r\nthis simply isolates the power completely and the remote turns it all back on again, we usually use these with a 4 way extension to isolate the entire pc/monitor/printer/speakers.\r\n\r\nthese are truly affordable energy saving gadgets that are so simple they just work. \r\n\r\nbelow is what the manufacturer says.\r\n\r\nKey Features:\r\n\r\n\r\nSaves energy and money\r\n\r\n\r\nEasy simple set up with learning function\r\n\r\nCan control multiple sockets together or independently\r\n\r\nWill work through walls\r\n\r\nMakes equipment connected to hard to get to wall sockets easy to switch off\r\n\r\nPower rating 13A, 250v\r\n\r\n3,000 watts maximum load\r\n\r\nTransmission frequency 433.92 Mhz\r\n\r\n12V DC battery in transmitter (Included)\r\n\r\nManual on/off button\r\n\r\nPower on indicator light\r\n\r\n20 Metre range between the transmitter and the reciever in a straight line\r\n\r\nMulti channel assignment for each socket\r\n\r\nLess than 0.25w power consumption for the socket control socket when turned off\r\n\r\nMore Information\r\n\r\nEach year we have more and more computers, TV?s, Hi Fi equipment, table lamps, and other equipment around the home and office. All this is great, but it pushes our energy costs up and up. The more of these types of products we have the more we have to remember to turn them all off.\r\n\r\nThe electricity used whilst in standby mode can add up to significant amounts across weeks, months, and years. Often we just leave our items switched on or in standby mode, this is costing us a lot of money and needlessly using energy. In addition to this, leaving our equipment turned on shortens the life of the product, and also increases the fire risks etc.\r\n\r\nThe Watts Clever range of Standby Control products helps people and companies to ensure that they turn all relevent equipment fully off. Our products ensure that this becomes a simple operation and something that will be done automatically, or with the minimum of thought.\r\n\r\nThe standby control socket allows you to turn the power to your appliances and equipment on and off by remote control. Each socket learns the code from the button/channel on the remote control transmitter that you assign to that socket. This is very simple to do and can be changed at any time. \r\n\r\nOnce this is done you can then turn the power supply to any equipment connected to the socket on or off from a distance, just by pressing a button. This makes it very simple to turn many pieces of equipment off from a single remote control unit. No more excuses for not turning off the TV, Hi Fi, lamps etc.\r\n\r\nOnce turned off they will use no electricity, so no more standby energy is been wasted. You can add additional sockets later and use then with the same remote control unit. You can control more than 1 socket with the same buttons. Also there are 3 channels on the remote control so you have complete flexibility.\r\n\r\nIt will work through walls and ceilings up to a certain distance. Additionally you can connect any standard power strip to the socket.\r\n\r\nManufacturer's Website: www.wattsclever.com \r\n\r\nAll orders from our online store are delivered to your door in mainland UK, free of charge, for orders outside mainland UK, please call 08444 142 412 .","options":[{"id":5560981,"name":"Default","price":9.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/14323791/-/wcremote2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/14323791/-/wcremote2.jpg","width":480,"height":464}],"artists":[],"categories":[{"id":940861,"name":"Power Svaing Device","permalink":"power-svaing-device","url":"/category/power-svaing-device"}]},{"id":1508671,"name":"Watts Clever Standby Control Socket inc footswitch","permalink":"watts-clever-standby-control-socket-inc-footswitch","position":2,"price":10.99,"default_price":10.99,"tax":0.0,"url":"/product/watts-clever-standby-control-socket-inc-footswitch","status":"active","on_sale":false,"created_at":"2010-02-08T01:44:39.000Z","description":"this simple device saves energy, money and prolongs the life of your expensive equipment by shutting off power to the outlets, everyone knows that when a computer/monitor/printer/scanner/etc/etc/etc are on standby they still draw power, and cost you money.\r\n\r\nthis simply isolates the power completely and the foot switch turns it all back on again, we usually use these with a 4 way extension to isolate the entire pc/monitor/printer/speakers.\r\n\r\nthese are truly affordable energy saving gadgets that are so simple they just work. \r\n\r\nbelow is what the manufacturer says.\r\n\r\nKey Features:\r\n\r\nFully turns off the power to all connected appliances and equipment\r\n\r\nAllows for easy access to turn off equipment\r\n\r\nNo more reaching behind cabinets or under tables\r\n\r\nSaves wasted energy and money\r\n\r\nEasy press footswitch\r\n\r\nCan also be used as a deskswitch\r\n\r\nCan be used with any standard power block\r\n\r\nPower rating 13A, 250v\r\n\r\n3,000 watts maximum load\r\n\r\n3 metre footswitch cable\r\n\r\nZero power consumption when off\r\n\r\nPower on/off indicator light\r\n\r\nMore Information\r\n\r\nEach year we have more and more computers, TV?s, Hi Fi equipment, table lamps and other equipment around the home and office. All this is great, but it pushes our energy costs up and up. The more of these types of products we have the more we leave equipment in standby mode.\r\n\r\nThe electricity used whilst in standby mode can add up to significant amounts across weeks, months, and years. Often we just leave our items switched on or in standby mode, this is costing us a lot of money and needlessly using energy.In addition to this, leaving our equipment turned on shortens the life of the product, and also increases the fire risks etc.\r\n\r\nThe Watts Clever range of Standby Control products helps people and companies to ensure that they turn all relevent equipment fully off. Our products ensure that this becomes a simple operation and something that will be done automatically, or with the minimum of thought.\r\n\r\nThe standby control socket with footswitch is very simple to use, yet very effective in helping you cut your energy costs. Additionally this is a great product to make access easy to sockets that are hidden behind cabinets, under tables etc. No more excuses for not turning them off. Just plug the socket into any normal electricity socket. If you wish to connect more than one appliance then connect any standard 2, 3, or socket power extension block to the standby control socket. Place the footswitch in a convenient position so that you can access it easily. There is a 3 metre cable to make this easy. To turn off the power to all the connected equipment simply press the footswitch. The power will be turned off completely. Press the footswitch again to restore power. \r\n\r\nManufacturer's Website: www.wattsclever.com \r\n\r\nAll orders from our online store are delivered to your door in mainland UK, free of charge, for orders outside mainland UK, please call 08444 142 412 .","options":[{"id":5561091,"name":"Default","price":10.99,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/14324031/-/wcfootswitch2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/14324031/-/wcfootswitch2.jpg","width":400,"height":400}],"artists":[],"categories":[{"id":940861,"name":"Power Svaing Device","permalink":"power-svaing-device","url":"/category/power-svaing-device"}]},{"id":1508691,"name":"Watts Clever Auto off energy saving surge protect","permalink":"watts-clever-auto-off-energy-saving-surge-protect","position":3,"price":16.95,"default_price":16.95,"tax":0.0,"url":"/product/watts-clever-auto-off-energy-saving-surge-protect","status":"active","on_sale":false,"created_at":"2010-02-08T01:46:52.000Z","description":"This is a clever device that will save you money on your electricity bill whilst protecting your devices with surge protection.\r\n\r\nin a recent review by PC Pro it won the prestigious PC Pro Recommended award!\r\n\r\nit is very simple to use, you plug your PC into the control plug (the one with the blue square around it) then any peripherals such as speakers, storage drives, printers, scanners, table lamp, etc etc (4 plugs and one can be used with another 4 way adapter of your choice) and then when you shut down your computer the power to everything plugged in to the watts clever device gets switched off so even if they are shutdown or in standby you will not be using the energy that is drawn from these devices, to turn them on simply press the button supplied and everything is back with full power.\r\n\r\nit also has built in protection to help against power surges and brownouts, meaning this device not only saves money and energy it will also protect your expensive equipment from power surges.\r\n\r\nas we have been using these for a while now we decided to offer them here on ebay too and now we only supply these to our business customers instead of standard power surge protectors as these cost the same price but do more by saving energy too.\r\n\r\nbelow is what the manufacturer says.\r\n\r\nKey Features:\r\n\r\nVery simple set up and operation\r\n\r\nTurns the power off completely to your PC\r\n\r\nEnsures your printer etc is completely turned off\r\n\r\nSaves energy and money\r\n\r\n250v/ 50Hz\r\n\r\nCurrent 13 Amps/ 3000 watts\r\n\r\n1.3m control switch cable\r\n\r\nPower cable 1.5m\r\n\r\nPower on indicator light\r\n\r\n3 Automatic sockets for peripheral equipment\r\n\r\n1 Control socket for the main computer\r\n\r\nPower cut off level is 30w\r\n\r\n175 Joules surge protection built in\r\n\r\nLess than 0.25w power used when turned off\r\n\r\nMore Information\r\n\r\nEach year we have more and more computers, TV?s, Hi Fi equipment, and other equipment around the home and office.All this is great, but it pushes our energy costs up and up. The more of these types of products we have the more we leave equipment in standby mode.\r\n\r\nThe electricity used whilst in standby mode can add up to significant amounts across weeks, months, and years. Often we just leave our items switched on or in standby mode, this is costing us a lot of money and needlessly using energy.In addition to this, leaving our equipment turned on shortens the life of the product, and also increases the fire risks etc.\r\n\r\nThe Watts Clever range of Standby Control products helps people and companies to ensure that they turn all relevant equipment fully off. Our products ensure that this becomes a simple operation and something that will be done automatically, or with the minimum of thought.\r\n\r\nThe PC standby control unit will automatically cut off the electricity to your computer and all your connected peripheral equipment. This would be your scanner, printer, speakers, table lamp etc. Also it is possible to add further equipment by adding an extension socket to one of the sockets on the unit.\r\n\r\nThe main control PC/ laptop is plugged into the control socket, your peripheral equipment is connected to the auto ON/OFF sockets. Place the control switch in a convenient position next to your PC. There is an adhesive patch on the bottom of the control switch to secure it if required.\r\n\r\nWhen the PC is turned off the unit senses the drop in power levels and will automatically cut the power to the PC and the auto sockets for the peripheral equipment.\r\n\r\nTo restore power press the control switch, power will then be restored to the PC and your peripheral equipment. You can then operate your PC in the normal way. It is as simple as that to save money, save energy, and to protect your equipment. \r\n\r\nManufacturer's Website:  www.wattsclever.com \r\n\r\nAll orders from our online store are delivered to your door in mainland UK, free of charge, for orders outside mainland UK, please call 08444 142 412 .","options":[{"id":5561191,"name":"Default","price":16.95,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/14324271/-/auto_stanby_shut_off3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/14324271/-/auto_stanby_shut_off3.jpg","width":400,"height":400}],"artists":[],"categories":[{"id":940861,"name":"Power Svaing Device","permalink":"power-svaing-device","url":"/category/power-svaing-device"}]},{"id":1508731,"name":"Watts Clever Solar battery charger 13in1 power pack for ipods/mobile phones/blackberry/camera/etc","permalink":"watts-clever-solar-battery-charger-13in1-power-pack-for-ipods-mobile-phones-blackberry-camera-etc","position":4,"price":15.45,"default_price":15.45,"tax":0.0,"url":"/product/watts-clever-solar-battery-charger-13in1-power-pack-for-ipods-mobile-phones-blackberry-camera-etc","status":"active","on_sale":false,"created_at":"2010-02-08T01:51:24.000Z","description":"Here we have a clever little gadget that will power almost any hand held gadget!\r\n\r\nit is basically a self charging battery pack that has a solar panel on one side and you can charge it by USB or by the sun, perfect for those out and about.\r\n\r\nit will charge most phones, cameras, PDA’s, IPOD’s sat nav devices, a whole bag full of connectors is included in the box ready to give your device a boost of power or to charg ethe battery in your camera/phone/pda/etc/etc/etc\r\n\r\nwe have been using one for a couple of weeks and love it, leave it on the dash of the car and its there ready when you need it, so once again here we are offering them to you Great gadgets at great prices.\r\n\r\ngreen clean well built (solid shiny metal back case) pocket sized comes with a tiday watts clever bag and a large selection of 13 connectors for almost all devices.\r\n\r\nRRP 17.99\r\n\r\nbelow is what the manufacturer says.\r\n\r\nSOLAR POWER Multi Device Charger WHITE \r\n\r\nKey Features:\r\n\r\nColour: White\r\n\r\nSolar panel: 5.5V/80mA\r\n\r\nPC USB charging: 5V/500mA\r\n\r\nLi-ion rechargeable battery: 3.7V/1000mA\r\n\r\nOutput voltage/current: 5.5V/500mA\r\n\r\nSuper long standby time, current consumption <150uA\r\n\r\n2-3 hours to charge mobile phones\r\n\r\n11-13 hours for self-charging through solar panel\r\n3-4 hours for self-charging through USB port\r\n\r\nWith charging and discharging indication lights\r\n\r\nReverse current protection circuit integrated to prevent batteries from being discharged\r\n\r\nConstant volts: 4.2 Volts\r\n\r\nSize: 42mm x 95mm x 10.8 mm\r\n\r\nWeight: 62g\r\n\r\nCompatible to mobile phones/MP3/MP4/PDA/Digital camera/IPOD/PSP etc\r\n\r\nMore Information\r\n\r\nWe have all had the situation where our mobile phone has gone dead, the music has stopped, or we missed the last photo of the sunset. Well that should now be a thing of the past. Solar mobile chargers are great for always having some backup power to hand when your mobile phone, MP3 player, or PDA etc runs low on power.\r\n\r\nThe units have a built in lithium ion battery that stores the power from the solar panel. So whenever the unit is left in the sunshine the battery is being charged. Also the internal battery can be charged from the USB port of a computer, simply connect the supplied cable to the charger and then plug it into the USB port on your computer and it will charge whilst you are working on your computer. \r\n\r\nTo charge your equipment simply connect the supplied cable to the charger and then connect the adaptor for your type of mobile phone, MP3 player, PDA, etc. Each solar charger is supplied with 13 adaptors, these will fit with the majority of mobile phones, MP3 players, IPOD, PDA, compact digital camera, plus standard connections. A soft storage bag is provided to make it easy to take your charger and your required connectors with you, and keep everything together. \r\n\r\nManufacturer's Website:  www.wattsclever.com \r\n\r\nAll orders from our online store are delivered to your door in mainland UK, free of charge, for orders outside mainland UK, please call 08444 142 412 .","options":[{"id":5561351,"name":"White","price":15.45,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/14324471/-/white_solar2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/14324471/-/white_solar2.jpg","width":400,"height":395}],"artists":[],"categories":[{"id":940871,"name":"Solar Charger","permalink":"solar-charger","url":"/category/solar-charger"}]},{"id":1508771,"name":"3G Pay As You Go MIFI WIFI mobile broadband router mobile hotspot!","permalink":"3g-pay-as-you-go-mifi-wifi-mobile-broadband-router-mobile-hotspot","position":5,"price":49.9,"default_price":49.9,"tax":0.0,"url":"/product/3g-pay-as-you-go-mifi-wifi-mobile-broadband-router-mobile-hotspot","status":"active","on_sale":false,"created_at":"2010-02-08T01:55:41.000Z","description":"Mobile broadband wifi router meaning you can share your mobile broadband connection between up to 5 devices!\r\n\r\nalso means you don't have a awkward USB dongle sticking out of your laptop as it connects to this wirelessly meaning it is  elegantly simple to use without long protruding USB dongles getting in your way.\r\n\r\nand whats more it has a micro SD slot that will allow you to share documents across all wifi devices, how cool is that!\r\n\r\ncompatible with ALL wifi devices (802.11) Windows PC, Apple Mac OSX, sony playstation portable, Wii, PS3, Nintendo DS, Xbox360, PDA, etc etc etc\r\n\r\nI have one in my car and it is great, thats why we are reccomending them here!\r\n\r\n\r\n\r\nBid in confidence, we are a respected and limited technology company that has over 15 years experience in advising some of Europes leading IT companies, we do cool things with technology, you could too.\r\n\r\nKey Features:\r\n\r\n# Form Factor - Wireless modem\r\n# Size/Weight - 86 x 46.5 x 10.5mm / 90g\r\n# HSDPA-HSUPA - Yes/Yes (7.2MBPS/5.76MBPS)\r\n# Memory - No internal Memory, memory card supported, micro SD 32GB\r\n# Radio - HSDPA-2100, GSM, EDGE/850/900/1800/1900\r\n# WiFI - 802.11 B/G\r\n# Dashboard - Huawei with 3 settings\r\n# RX Diversity - Yes\r\n# Battery - Up to 5 hours usage\r\n\r\n\r\nThese are all brand new unopened stock with full UK warranty, item will be delivered within 3 working days of payment clearing into our account.\r\n\r\nItem is brand new in sealed box with all contents, comes with power supply battery and USB charging cable (can charge from your laptop) we are a 3 reseller and as such the device comes with full 12 month UK warranty direct with three.co.uk \r\n\r\nFrequently asked questions -\r\n\r\nQ: What is this?\r\nA: its a mobile wifi hotspot, that uses 3G technology to provide internet to up to 5 devices\r\n\r\nQ: Can I use my current 3G dongle Sim Card?\r\nA: Yes but there is also a pay as you go Sim included if you need one, just pop in the Sim card you want to use and you are away.\r\n\r\nQ: will it work with my PSP ?\r\nA: yes, it will work with ANY wifi enabled device, from laptops to xboxes Nintendo Wii and more.\r\n\r\nAll orders from our online store are delivered to your door in mainland UK, free of charge, for orders outside mainland UK, please call 08444 142 412 .","options":[{"id":5561431,"name":"Default","price":49.9,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/14324751/-/mifi_wireless_internet2.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/14324751/-/mifi_wireless_internet2.jpg","width":263,"height":232}],"artists":[],"categories":[{"id":940881,"name":"Mobile Wifi","permalink":"mobile-wifi","url":"/category/mobile-wifi"}]}]