[{"id":4650699,"name":"Access to Katie's Private Travel Blog","permalink":"access-to-katie-s-private-travel-blog","position":1,"price":100.0,"default_price":100.0,"tax":0.0,"url":"/product/access-to-katie-s-private-travel-blog","status":"sold-out","on_sale":false,"created_at":"2011-10-17T19:30:51.000Z","description":"Here's how it works.  The subscription is $100 per year, and Katie will give you one entry per week throughout that year, for a minimum of 52 entries.  So, for about .5 the cost of a Starbucks per week, you can gain unlimited access to Katie's 2013 travel diary which includes photos and videos.\r\n\r\nCome January 1st, you will get access to the secret location and password for Katie's blog.  Each week a minimum of one entry will be posted, and you will retain access to all 2013 entries throughout the course of the entire year.  Older posts are archived on the left of the home page for easy reference.  All subscriptions will end at the end of December 2013.  \r\n\r\nEntries differ from week to week.  Sometimes they are stories of her travels, sometimes they are photos that she doesn't post elsewhere, that you are welcome to print out and use as postcards.  The 2012 chapter of \"From Sea to Shining Sea\" was a relatively new experience, and the 2013 chapter proves to be even better and more exciting. \r\n\r\nHere's a snippet from a recent post about logistics:\r\n\r\n\"As promised, I have provided you with at least 52 blog entries, meaning that there has been, on average, one post per week for the duration of the year.  All posts over the number of 52 are bonus posts.  Yay for bonuses!\r\n\r\nNo matter when you subscribed throughout the course of the year, the blog subscription will end at the end of December, as you have had unrestricted access to each of the posts I've written since January.  Old posts are archived and accessible on the left side of the home page.  If you have not yet read them and would like to do so, please know that your access to them is unlimited until the end of December, at which point, all subscribers' access to this year's blog will terminate.\r\n\r\nI hope you have enjoyed your journey with me so far.  This year has been kind of crazy, and, though I have not yet played in each of the 50 states as I had hoped to have accomplished by now, I have traveled to something like 38 or 40 of them just trying to figure out my life.  I strive to be honest with you here, and present to you not just the glamorous parts of my life as a songwriter and musician, but also a real examination of the self-doubts and challenges I face every day.\r\n\r\nI have experimented with writing styles in an attempt to find my voice and figure out how best to make my words resonate with you.  I have shared with you my photographs, and my anecdotes.  I hope that you have enjoyed this year's chapter of \"From Sea to Shining Sea\" as I have.\r\n\r\nI would also like to take this moment to express the gratitude for you I feel in my heart.  I have been a musician and a traveler for years.  But it was only when I began this blog that I forced myself to regularly upload my photographs, and jot down at least some notes about the experiences and adventures I was having.  All of that was because I felt accountable to you.  And, as a result, I can now look back at a disciplined journal for the year 2012.  Sadly, all of the previous years have not been so well documented, and the things I swore I'd do someday have fallen by the wayside since now those old cell phones are broken and the photographs contained therein are forever lost.\r\n\r\nSo thank you for a beautiful year.  And, though I may wax nostalgic and sound cliched, you have made me feel less alone on this journey of mine.  And that has meant a lot to me.\"\r\n  \r\nJust a warning: a limited number of subscribers are allowed to access her blog, and once all of the subscriptions are sold, you're out of luck for at least a year.  Existing subscribers will be given priority with the option to renew once all of the spots are sold.  If some opt not to renew, subscriptions will be sold on a first come, first served basis.\r\n\r\nHappy reading!","options":[{"id":15219345,"name":"Default","price":100.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/50213861/-/FromSeaToShiningSea1.png","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/50213861/-/FromSeaToShiningSea1.png","width":1000,"height":140}],"artists":[],"categories":[{"id":1941730,"name":"Road Diary Secret Access","permalink":"road-diary-secret-access","url":"/category/road-diary-secret-access"}]},{"id":4173831,"name":"Gift","permalink":"gift","position":2,"price":200.0,"default_price":200.0,"tax":0.0,"url":"/product/gift","status":"active","on_sale":false,"created_at":"2011-07-30T03:03:02.000Z","description":"Though Katie had incredible success with her Kickstarter campaign, she is still not financially able to purchase an RV and embark on her tour.  The money she earned through her Kickstarter campaign covered the costs of recording, mixing, mastering, pressing, and ordering all of the cool reward packages for her Kickstarter backers. Now it's time to start saving for that RV!\r\n\r\nTo get herself closer, she has started a record label, Red-Winged Blackbird Records, and is hoping to get work in her field that will allow her to begin saving for the RV.  She offers consulting and other services to musicians.  But while her business gets off the ground, you are welcome to get her closer to her goal by giving her a gift.  Thank you so much! ","options":[{"id":13774669,"name":"Default","price":200.0,"sold_out":false,"has_custom_price":false}],"images":[{"url":"http://images.cdn.bigcartel.com/bigcartel/product_images/40777301/-/KatiePowderlyTourPosterColorYellow-3.jpg","secure_url":"https://d1j5c7u4mzbpxw.cloudfront.net/bigcartel/product_images/40777301/-/KatiePowderlyTourPosterColorYellow-3.jpg","width":863,"height":642}],"artists":[],"categories":[{"id":1624147,"name":"Donation","permalink":"donation","url":"/category/donation"}]}]